[
  {
    "symbol": "A",
    "price": 116.37,
    "beta": 1.044014,
    "volAvg": 1997690,
    "mktCap": 34372905120,
    "lastDiv": 0.9,
    "range": "113.02-160.26",
    "changes": -0.67,
    "companyName": "Agilent Technologies, Inc.",
    "currency": "USD",
    "cik": "0001090872",
    "isin": "US00846U1016",
    "cusip": "00846U101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Diagnostics & Research",
    "website": "https://www.agilent.com",
    "description": "Agilent Technologies, Inc. provides application focused solutions to the life sciences, diagnostics, and applied chemical markets worldwide. The Life Sciences and Applied Markets segment offers liquid chromatography systems and components; liquid chromatography mass spectrometry systems; gas chromatography systems and components; gas chromatography mass spectrometry systems; inductively coupled plasma mass spectrometry instruments; atomic absorption instruments; microwave plasma-atomic emission spectrometry instruments; inductively coupled plasma optical emission spectrometry instruments; raman spectroscopy; cell analysis plate based assays; flow cytometer; real-time cell analyzer; cell imaging systems; microplate reader; laboratory software; information management and analytics; laboratory automation and robotic systems; dissolution testing; vacuum pumps, and measurement technologies. The Diagnostics and Genomics segment provides arrays for DNA mutation detection, genotyping, gene copy number determination, identification of gene rearrangements, DNA methylation profiling, gene expression profiling, next generation sequencing, target enrichment and genetic data management, and interpretation support software; and produces synthesized oligonucleotide. It also offers immunohistochemistry in situ hybridization, and hematoxylin and eosin staining and special staining; consumables, and software for quality control analysis of nucleic acid samples; and reagents for use in turbidimetry and flow cytometry, as well as develops liquid-based pharmacodiagnostics. The Agilent CrossLab segment provides GC and LC columns, sample preparation products, custom chemistries, and laboratory instrument supplies; and startup, operational, training, compliance support, software as a service, asset management, and consultation services. The company markets its products through direct sales, distributors, resellers, manufacturer's representatives, and electronic commerce. Agilent Technologies, Inc. was incorporated in 1999 and is headquartered in Santa Clara, California.",
    "ceo": "Mr. Michael R. McMullen",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "18400",
    "phone": "800 227 9770",
    "address": "5301 Stevens Creek Boulevard",
    "city": "Santa Clara",
    "state": "CA",
    "zip": "95051",
    "dcfDiff": 5.71612,
    "dcf": 149.974,
    "image": "https://financialmodelingprep.com/image-stock/A.png",
    "ipoDate": "1999-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]