[
  {
    "symbol": "AA",
    "price": 33.66,
    "beta": 2.44507,
    "volAvg": 4445919,
    "mktCap": 6004977391,
    "lastDiv": 0.4,
    "range": "31.14-58.235",
    "changes": -0.77,
    "companyName": "Alcoa Corporation",
    "currency": "USD",
    "cik": "0001675149",
    "isin": "US0138721065",
    "cusip": "013872106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aluminum",
    "website": "https://www.alcoa.com",
    "description": "Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through three segments: Bauxite, Alumina, and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1888 and is headquartered in Pittsburgh, Pennsylvania.",
    "ceo": "Mr. Roy C. Harvey",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "13100",
    "phone": "412 315 2900",
    "address": "201 Isabella Street",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15212-5858",
    "dcfDiff": 3.63919,
    "dcf": 56.3892,
    "image": "https://financialmodelingprep.com/image-stock/AA.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]