[
  {
    "symbol": "AACAY",
    "price": 2.29,
    "beta": 1.321455,
    "volAvg": 8341,
    "mktCap": 2744564927,
    "lastDiv": 0.02,
    "range": "1.3-2.82",
    "changes": 0.065,
    "companyName": "AAC Technologies Holdings Inc.",
    "currency": "USD",
    "cik": null,
    "isin": "US0003041052",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Communication Equipment",
    "website": "https://www.aactechnologies.com",
    "description": "AAC Technologies Holdings Inc., an investment holding company, provides solutions for smart devices in Mainland China, Hong Kong Special Administrative Region of the People's Republic of China, Taiwan, other Asian countries, the United States, and Europe. It operates through Acoustics Product, Electromagnetic Drives and Precision Mechanics, Optics Products, and Micro Electro-Mechanical System (MEMS) Components segments. The Acoustics Product segment provides acoustics products for smartphone and automotive, as well as wearables, tablets, and notebook markets. The Electromagnetic Drives and Precision Mechanics segment manufactures and sells haptic motors that are used in smartphones, smart watches, tablets, intelligent automobiles, smart glasses, game controllers, virtual reality/augmented reality (AR) controllers, and bone conduction headphones. This segment also offers precision mechanics comprising metal casing, bottom and parts for tablets, wearables, and notebooks products. The Optics Products segment provides plastic, front-view, surround-view, and occupant monitoring system and driver monitoring system vehicle lenses; camera modules; and voice coil motor and optical image stabilizer solutions. The MEMS Business segment offers MEMS microphone products for true wireless stereo earphones, smart speakers, tablets, and automotive markets. The company also offers research and development services; manufactures and sells tooling and precision components, electronic components, and related accessories; and provides electroplating services. AAC Technologies Holdings Inc. has a strategic partnership with Dispelix for providing AR and mixed reality solutions. The company was formerly known as AAC Acoustic Technologies Holdings Inc. and changed its name to AAC Technologies Holdings Inc. in May 2011. AAC Technologies Holdings Inc. was founded in 1993 and is headquartered in Shenzhen, the People's Republic of China.",
    "ceo": "Mr. Zhengmin  Pan",
    "sector": "Technology",
    "country": "CN",
    "fullTimeEmployees": "27798",
    "phone": "86 755 3397 2018",
    "address": "Nanjing University Research Center",
    "city": "Shenzhen",
    "state": null,
    "zip": "518057",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AACAY.png",
    "ipoDate": "2011-04-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]