[
  {
    "symbol": "ABBV",
    "price": 132.51,
    "beta": 0.554225,
    "volAvg": 5603585,
    "mktCap": 233786074260,
    "lastDiv": 5.92,
    "range": "130.9601-168.11",
    "changes": -0.09,
    "companyName": "AbbVie Inc.",
    "currency": "USD",
    "cik": "0001551152",
    "isin": "US00287Y1091",
    "cusip": "00287Y109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.abbvie.com",
    "description": "AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals in the worldwide. The company offers HUMIRA, a therapy administered as an injection for autoimmune and intestinal Behçet's diseases; SKYRIZI to treat moderate to severe plaque psoriasis in adults; RINVOQ, a JAK inhibitor for the treatment of moderate to severe active rheumatoid arthritis in adult patients; IMBRUVICA to treat adult patients with chronic lymphocytic leukemia (CLL), small lymphocytic lymphoma (SLL), and VENCLEXTA, a BCL-2 inhibitor used to treat adults with CLL or SLL; and MAVYRET to treat patients with chronic HCV genotype 1-6 infection. It also provides CREON, a pancreatic enzyme therapy for exocrine pancreatic insufficiency; Synthroid used in the treatment of hypothyroidism; Linzess/Constella to treat irritable bowel syndrome with constipation and chronic idiopathic constipation; Lupron for the palliative treatment of advanced prostate cancer, endometriosis and central precocious puberty, and patients with anemia caused by uterine fibroids; and Botox therapeutic. In addition, the company offers ORILISSA, a nonpeptide small molecule gonadotropin-releasing hormone antagonist for women with moderate to severe endometriosis pain; Duopa and Duodopa, a levodopa-carbidopa intestinal gel to treat Parkinson's disease; Lumigan/Ganfort, a bimatoprost ophthalmic solution for the reduction of elevated intraocular pressure (IOP) in patients with open angle glaucoma (OAG) or ocular hypertension; Ubrelvy to treat migraine with or without aura in adults; Alphagan/ Combigan, an alpha-adrenergic receptor agonist for the reduction of IOP in patients with OAG; and Restasis, a calcineurin inhibitor immunosuppressant to increase tear production, as well as other eye care products. AbbVie Inc. has a research collaboration with Dragonfly Therapeutics, Inc. The company was incorporated in 2012 and is headquartered in North Chicago, Illinois.",
    "ceo": "Mr. Richard A. Gonzalez",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "50000",
    "phone": "847 932 7900",
    "address": "1 North Waukegan Road",
    "city": "North Chicago",
    "state": "IL",
    "zip": "60064-6400",
    "dcfDiff": 16.3514,
    "dcf": 162.631,
    "image": "https://financialmodelingprep.com/image-stock/ABBV.png",
    "ipoDate": "2013-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]