[
  {
    "symbol": "ABCB",
    "price": 34.05,
    "beta": 1.094366,
    "volAvg": 470712,
    "mktCap": 2362181431,
    "lastDiv": 0.6,
    "range": "28.33-54.24",
    "changes": -0.31,
    "companyName": "Ameris Bancorp",
    "currency": "USD",
    "cik": "0000351569",
    "isin": "US03076K1088",
    "cusip": "03076K108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.amerisbank.com",
    "description": "Ameris Bancorp operates as the bank holding company for Ameris Bank that provides range of banking services to retail and commercial customers primarily in Georgia, Alabama, Florida, North Carolina, and South Carolina. The company operates through five segments: Banking Division, Retail Mortgage Division, Warehouse Lending Division, SBA Division, and Premium Finance Division. It offers commercial and retail checking, regular interest-bearing savings, money market, individual retirement, and certificates of deposit accounts. The company also provides commercial real estate, residential real estate mortgage, agricultural, and commercial and industrial loans; consumer loans, including motor vehicle, home improvement, and home equity loans, as well as loans secured by savings accounts and small unsecured personal credit lines. In addition, it originates, administers, and services commercial insurance premium loans and small business administration loans. The company operates 165 full service domestic banking offices and 35 mortgage and loan production offices. Ameris Bancorp was founded in 1971 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. H. Palmer Proctor Jr.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2848",
    "phone": "404 639 6500",
    "address": "3490 Piedmont Road NE",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30305",
    "dcfDiff": 9.71422,
    "dcf": 56.1742,
    "image": "https://financialmodelingprep.com/image-stock/ABCB.png",
    "ipoDate": "1994-05-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]