[
  {
    "symbol": "ABEV",
    "price": 3.1,
    "beta": 0.653082,
    "volAvg": 14920188,
    "mktCap": 48817250099,
    "lastDiv": 0.14,
    "range": "2.4-3.24",
    "changes": -0.09,
    "companyName": "Ambev S.A.",
    "currency": "USD",
    "cik": "0001565025",
    "isin": "US02319V1035",
    "cusip": "02319V103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Beverages—Brewers",
    "website": "https://www.ambev.com.br",
    "description": "Ambev S.A., through its subsidiaries, produces, distributes, and sells beer, draft beer, carbonated soft drinks, other non-alcoholic beverages, malt, and food products in the Americas. The company operates through four segments: Brazil; Central America and the Caribbean; Latin America South; and Canada. It offers beer primarily under the Skol, Brahma, Antarctica, Brahva, Brahva Gold, Extra, Bud Light, Beck, Leffe and Hoegaarden, Bucanero, Cristal, Mayabe, Cacique, Presidente, Brahma Light, Presidente Light, Presidente Golden Light, Bohemia, The One, Corona, Modelo Especial, Stella Artois, and Budweiser, Quilmes Clásica, Paceña, Taquiña, Huari, Becker, Cusqueña, Michelob Ultra, Busch, Pilsen, Ouro Fino, Banks, Deputy, Patricia, Labatt Blue, Alexander Keith's, and Kokanee brands. The company also provides bottled water, isotonic beverages, energy drinks, coconut water, powdered and natural juices, and ready-to-drink teas under the Guaraná Antarctica, Gatorade, H2OH!, Lipton Iced Tea, Fusion, Do Bem, Pepsi, Canada Dry, Squirt, Red Rock, Pepsi-Cola, Seven Up, Nutrl, Bud Light Seltzer, Palm Bay, and Mike's brands. It offers its products through a network of third-party distributors and a direct distribution system. The company was founded in 1885 and is headquartered in São Paulo, Brazil. Ambev S.A. is a subsidiary of Interbrew International B.V.",
    "ceo": "Mr. Jean Jereissati Neto",
    "sector": "Consumer Defensive",
    "country": "BR",
    "fullTimeEmployees": "52000",
    "phone": "55 11 2122 1414",
    "address": "Rua Dr. Renato Paes de Barros, 1017",
    "city": "São Paulo",
    "state": "SP",
    "zip": "04530-001",
    "dcfDiff": 1.31858,
    "dcf": 3.96858,
    "image": "https://financialmodelingprep.com/image-stock/ABEV.png",
    "ipoDate": "1997-03-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]