[
  {
    "symbol": "ABR",
    "price": 14.39,
    "beta": 1.91338,
    "volAvg": 4903298,
    "mktCap": 2606906675,
    "lastDiv": 1.68,
    "range": "10.1-16.77",
    "changes": 0.09,
    "companyName": "Arbor Realty Trust, Inc.",
    "currency": "USD",
    "cik": "0001253986",
    "isin": "US0389231087",
    "cusip": "038923108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "REIT—Mortgage",
    "website": "https://arbor.com",
    "description": "Arbor Realty Trust, Inc. invests in a diversified portfolio of structured finance assets in the multifamily, single-family rental, and commercial real estate markets in the United States. The company operates in two segments, Structured Business and Agency Business. It primarily invests in bridge and mezzanine loans, including junior participating interests in first mortgages, and preferred and direct equity, as well as real estate-related joint ventures, real estate-related notes, and various mortgage-related securities. The company offers bridge financing products to borrowers who seek short-term capital to be used in an acquisition of property; financing by making preferred equity investments in entities that directly or indirectly own real property; mezzanine financing in the form of loans that are subordinate to a conventional first mortgage loan and senior to the borrower's equity in a transaction; junior participation financing in the form of a junior participating interest in the senior debt; and financing products to borrowers who are looking to acquire conventional, workforce, and affordable single-family housing. Further, it underwrites, originates, sells, and services multifamily mortgage loans through conduit/commercial mortgage-backed securities programs. The company qualifies as a real estate investment trust for federal income tax purposes. It generally would not be subject to federal corporate income taxes if it distributes at least 90% of its taxable income to its stockholders. Arbor Realty Trust, Inc. was incorporated in 2003 and is headquartered in Uniondale, New York.",
    "ceo": "Mr. Ivan Paul Kaufman",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "630",
    "phone": "516 506 4200",
    "address": "333 Earle Ovington Boulevard",
    "city": "Uniondale",
    "state": "NY",
    "zip": "11553",
    "dcfDiff": 2.60995,
    "dcf": 17.4999,
    "image": "https://financialmodelingprep.com/image-stock/ABR.png",
    "ipoDate": "2004-04-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]