[
  {
    "symbol": "ABT",
    "price": 107.61,
    "beta": 0.663028,
    "volAvg": 5142670,
    "mktCap": 187128411222,
    "lastDiv": 2.04,
    "range": "93.25-115.69",
    "changes": -0.18,
    "companyName": "Abbott Laboratories",
    "currency": "USD",
    "cik": "0000001800",
    "isin": "US0028241000",
    "cusip": "002824100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.abbott.com",
    "description": "Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The Established Pharmaceutical Products segment provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. The Diagnostic Products segment offers laboratory systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, as well as detect and measure infectious agents; point of care systems; cartridges for testing blood; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for use in laboratories. The Nutritional Products segment provides pediatric and adult nutritional products. The Medical Devices segment offers rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; and diabetes care products, as well as neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.",
    "ceo": "Mr. Robert B. Ford",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "115000",
    "phone": "224 667 6100",
    "address": "100 Abbott Park Road",
    "city": "North Chicago",
    "state": "IL",
    "zip": "60064-6400",
    "dcfDiff": 0.583438,
    "dcf": 109.367,
    "image": "https://financialmodelingprep.com/image-stock/ABT.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]