[
  {
    "symbol": "ACA",
    "price": 74.15,
    "beta": 0.551433,
    "volAvg": 235604,
    "mktCap": 3591596135,
    "lastDiv": 0.2,
    "range": "43.52-76.29",
    "changes": -0.03,
    "companyName": "Arcosa, Inc.",
    "currency": "USD",
    "cik": "0001739445",
    "isin": "US0396531008",
    "cusip": "039653100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Infrastructure Operations",
    "website": "https://www.arcosa.com",
    "description": "Arcosa, Inc., together with its subsidiaries, provides infrastructure-related products and solutions for the construction, energy, and transportation markets in North America. It operates through three segments: Construction Products, Engineered Structures, and Transportation Products. The Construction Products segment offers natural and recycled aggregates; specialty materials; and trench shields and shoring products for residential and non-residential construction, agriculture, specialty building products, as well as for infrastructure related projects. The Engineered Structures segment provides utility structures, wind towers, traffic and lighting structures, telecommunication structures, storage and distribution tanks for electricity transmission and distribution, wind power generation, highway road construction, and wireless communication markets, as well as for gas and liquids storage and transportation for residential, commercial, energy, agriculture, and industrial markets. The Transportation Products segment offers inland barges; fiberglass barge covers, winches, and other components; cast components for industrial and mining sectors; and axles, circular forgings, coupling devices for freight, tank, locomotive, and passenger rail transportation equipment, as well as other industrial uses. Arcosa, Inc. was incorporated in 2018 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Antonio  Carrillo",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5230",
    "phone": "972 942 6500",
    "address": "500 North Akard Street",
    "city": "Dallas",
    "state": "TX",
    "zip": "75201",
    "dcfDiff": 3.48309,
    "dcf": 61.8231,
    "image": "https://financialmodelingprep.com/image-stock/ACA.png",
    "ipoDate": "2018-11-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]