[
  {
    "symbol": "ACDVF",
    "price": 18.6,
    "beta": 2.317941,
    "volAvg": 17740,
    "mktCap": 6666704851,
    "lastDiv": 0,
    "range": "11.86-18.6",
    "changes": 0.5599,
    "companyName": "Air Canada",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Airlines",
    "website": "https://www.aircanada.com",
    "description": "Air Canada provides domestic, U.S. transborder, and international airline services. It offers scheduled passenger services under the Air Canada Vacations and Air Canada Rouge brand name in the Canadian market, the Canada-U.S. transborder market, and in the international market to and from Canada, as well as through capacity purchase agreements on other regional carriers. As of December 31, 2021, the company operated a fleet of 175 aircraft under the Air Canada mainline brand name comprising 97 Boeing and Airbus narrow-body aircraft, and 78 Boeing and Airbus wide-body aircraft; 123 aircraft under the Air Canada Express brand name, including 50 Mitsubishi regional jets, 48 De Havilland Dash-8 turboprop aircraft and 25 Embraer 175 aircraft; and 39 aircraft under the Air Canada Rouge brand name consisting of 14 Airbus A321 aircraft, 5 Airbus A320 aircraft, and 20 Airbus A319 aircraft. It also provides air cargo services in domestic and U.S. transborder routes, as well as on international routes between Canada and markets in Europe, Asia, South America, and Australia. In addition, the company operates, develops, markets, and distributes vacation travel packages in the Caribbean, Mexico, the United States, Europe, Central and South America, South Pacific, Australia, and Asia; offers cruise packages in North America, Europe, and the Caribbean; and provides travel loyalty programs. Air Canada was founded in 1937 and is headquartered in Saint-Laurent, Canada.",
    "ceo": "Mr. Michael Stewart Rousseau",
    "sector": "Industrials",
    "country": "CA",
    "fullTimeEmployees": "34500",
    "phone": null,
    "address": "7373 COte Vertu Boulevard West",
    "city": "Saint-Laurent",
    "state": "QC",
    "zip": "H4S 1Z3",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ACDVF.png",
    "ipoDate": "2014-11-11",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]