[
  {
    "symbol": "ACGBY",
    "price": 9.6575,
    "beta": 0.436015,
    "volAvg": 10109,
    "mktCap": 170175777451,
    "lastDiv": 0.81,
    "range": "7.04-10.41",
    "changes": -0.0125,
    "companyName": "Agricultural Bank of China Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Diversified",
    "website": "https://www.abchina.com",
    "description": "Agricultural Bank of China Limited provides corporate and retail banking products and services. The company operates through Corporate Banking, Personal Banking, and Treasury Operations segments. It offers demand, personal call, foreign currency time, foreign currency call, time or demand optional, foreign exchange demand, foreign exchange call, foreign exchange time, certificates of deposit, savings, agreed-term, and negotiated deposits; and loans comprise housing, consumer, business, fixed asset, working capital, real estate, and entrusted syndicated loans, as well as trade finances, guarantees and commitments, and loans with custody of export rebates accounts. The company also provides credit card, debit card, payment and settlement, private banking, cash management, investment banking, custody, financial market, and financial institution services, as well as trading and wealth management services; and personal fund collection and automatic transfer services. In addition, it offers agro-related personal and corporate banking products and services; personal and online, telephone, mobile, self-service, television, and SMS banking services; financial leasing services; fund management services; assets custodian services; debt-to-equity swap and related services; and life, health, and accident insurance, as well as reinsurance products. As of December 31, 2021, the company had 22,807 domestic branches, including three specialized institutions, 4 training institutes, 37 tier-1 branches, 402 tier-2 branches, 3,348 tier-1 sub-branches, 18,961 foundation-level branch outlets and 50 other establishments; and 13 overseas branches in Hong Kong, Singapore, Seoul, New York, Dubai International Financial Centre, Tokyo, Frankfurt, Sydney, Luxemburg, Dubai, London, Macao, and Hanoi; and four overseas representative offices in Vancouver, Taipei, Sao Paulo, and Dushanbe. Agricultural Bank of China Limited was founded in 1951 and is based in Beijing, the People's Republic of China.",
    "ceo": "Mr. Shu  Gu",
    "sector": "Financial Services",
    "country": "CN",
    "fullTimeEmployees": "452258",
    "phone": "86 10 8510 9619",
    "address": "No. 69, Jianguomen Nei Avenue",
    "city": "Beijing",
    "state": null,
    "zip": "100005",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ACGBY.png",
    "ipoDate": "2011-04-06",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]