[
  {
    "symbol": "ACGL",
    "price": 71.68,
    "beta": 0.730633,
    "volAvg": 1894001,
    "mktCap": 26695281213,
    "lastDiv": 0,
    "range": "41.05-78.3",
    "changes": 0.54,
    "companyName": "Arch Capital Group Ltd.",
    "currency": "USD",
    "cik": "0000947484",
    "isin": "BMG0450A1053",
    "cusip": "G0450A105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Insurance—Diversified",
    "website": "https://www.archgroup.com",
    "description": "Arch Capital Group Ltd., together with its subsidiaries, provides insurance, reinsurance, and mortgage insurance products worldwide. The company's Insurance segment offers primary and excess casualty coverages; loss sensitive primary casualty insurance programs; collateral protection, debt cancellation, and service contract reimbursement products; directors' and officers' liability, errors and omissions liability, employment practices and fiduciary liability, crime, professional indemnity, and other financial related coverages; medical professional and general liability insurance coverages; and workers' compensation and umbrella liability, as well as commercial automobile and inland marine products. It also provides property, energy, marine, and aviation insurance; travel insurance; accident, disability, and medical plan insurance coverages; captive insurance programs; employer's liability; and contract and commercial surety coverages. This segment markets its products through a group of licensed independent retail and wholesale brokers. Its Reinsurance segment provides casualty reinsurance for third party liability and workers' compensation exposures; marine and aviation; surety, accident and health, workers' compensation catastrophe, agriculture, trade credit, and political risk products; reinsurance protection for catastrophic losses, and personal lines and commercial property exposures; life reinsurance; casualty clash; and risk management solutions. This segment markets its reinsurance products through brokers. The company's Mortgage segment offers direct mortgage insurance and mortgage reinsurance. The company was incorporated in 1995 and is based in Pembroke, Bermuda.",
    "ceo": "Mr. Marc  Grandisson",
    "sector": "Financial Services",
    "country": "BM",
    "fullTimeEmployees": "5800",
    "phone": "4412789250",
    "address": "Waterloo House",
    "city": "Pembroke",
    "state": null,
    "zip": "HM 08",
    "dcfDiff": 4.80701,
    "dcf": 59.253,
    "image": "https://financialmodelingprep.com/image-stock/ACGL.png",
    "ipoDate": "1995-09-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]