[
  {
    "symbol": "ACIW",
    "price": 22.45,
    "beta": 1.111971,
    "volAvg": 663659,
    "mktCap": 2431828900,
    "lastDiv": 0,
    "range": "19.68-29.35",
    "changes": 0.49,
    "companyName": "ACI Worldwide, Inc.",
    "currency": "USD",
    "cik": "0000935036",
    "isin": "US0044981019",
    "cusip": "004498101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.aciworldwide.com",
    "description": "ACI Worldwide, Inc., a software company, develops, markets, installs, and supports a range of software products and solutions for facilitating digital payments to banks, merchants, and billers worldwide. The company offers ACI Acquiring, a merchant management system to deliver digital innovation, improve fraud prevention, and reduce interchange fees; ACI Issuing, a digital payments issuing solution; and ACI Enterprise Payments Platform that provides payment processing and orchestration capabilities for digital payments. It also provides ACI Low Value Real-Time Payments, a platform for processing real-time payments; and ACI High Value Real-Time Payments, a payments engine that offers multi-bank, multi-currency, 24x7 payment processing, and SWIFT messaging. In addition, the company offers ACI Omni Commerce, a scalable, omni-channel payment processing platform; ACI Secure eCommerce solution; ACI Fraud Management, a real-time approach to fraud management; ACI Digital Business Banking, a cloud-based digital banking platform; and ACI Speedpay, an integrated suite of digital billing, payment, disbursement, and communication services. The company offers electronic bill presentment and payment services to consumer finance, insurance, healthcare, higher education, utility, government, and mortgage sectors; implementation services, including product installations and configurations, and custom software modifications; and business and technical consultancy, on-site support, product education, and testing services, as well as distributes or acts as a sales agent for software developed by third parties. It markets its products under the ACI Worldwide brand. The company was formerly known as Transaction Systems Architects, Inc. and changed its name to ACI Worldwide, Inc. in July 2007. The company was founded in 1975 and is based in Coral Gables, Florida.",
    "ceo": "Mr. Thomas Woodrow Warsop III",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3349",
    "phone": "305 894 2200",
    "address": "2811 Ponce de Leon Blvd",
    "city": "Coral Gables",
    "state": "FL",
    "zip": "33134",
    "dcfDiff": 6.51629,
    "dcf": 21.3437,
    "image": "https://financialmodelingprep.com/image-stock/ACIW.png",
    "ipoDate": "1995-02-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]