[
  {
    "symbol": "ACN",
    "price": 301.72,
    "beta": 1.23838,
    "volAvg": 2694466,
    "mktCap": 190323469814,
    "lastDiv": 4.48,
    "range": "242.8-327.93",
    "changes": 0.91,
    "companyName": "Accenture plc",
    "currency": "USD",
    "cik": "0001467373",
    "isin": "IE00B4BNMY34",
    "cusip": "G1151C101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.accenture.com",
    "description": "Accenture plc, a professional services company, provides strategy and consulting, interactive, and technology and operations services worldwide. The company offers application services, including agile transformation, DevOps, application modernization, enterprise architecture, software and quality engineering, data management, intelligent automation comprises robotic process automation, natural language processing, and virtual agents, and liquid application management services, as well as program, project, and service management services; strategy consulting services; critical data elements, data management and governance, data platform and architecture, product-based organization and skills, business adoption, and value realization services; engineering, and research and development digitization; smart connected product design and development; product platform engineering and modernization; product as-a-service enablement; products related to production and operations; autonomous robotics systems; the digital transformation of capital projects; and digital industrial workforce solutions. It also provides data-enabled operating models; technology consulting and artificial intelligence services; services related to talent and organization/human potential; digital commerce; infrastructure services, such as hybrid cloud, network, digital workplace and collaboration, service and experience management, infrastructure as code, and managed edge and IoT devices; cyber defense, applied cybersecurity, managed security, OT security, security strategy and risk, and industry security products; services related to technology innovation; and intelligent automation services. In addition, the company offers cloud, ecosystem, marketing, supply chain management, zero-based budgeting, customer experience, finance consulting, mergers and acquisitions, and sustainability services. Accenture plc was founded in 1951 and is based in Dublin, Ireland.",
    "ceo": "Ms. Julie T. Spellman Sweet",
    "sector": "Technology",
    "country": "IE",
    "fullTimeEmployees": "732000",
    "phone": "353 1 646 2000",
    "address": "1 Grand Canal Square",
    "city": "Dublin",
    "state": null,
    "zip": "2",
    "dcfDiff": 22.396,
    "dcf": 299.666,
    "image": "https://financialmodelingprep.com/image-stock/ACN.png",
    "ipoDate": "2001-07-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]