[
  {
    "symbol": "ADBE",
    "price": 482.43,
    "beta": 1.295774,
    "volAvg": 3766575,
    "mktCap": 221290641000,
    "lastDiv": 0.3561249999999999,
    "range": "274.73-518.74",
    "changes": -6.84,
    "companyName": "Adobe Inc.",
    "currency": "USD",
    "cik": "0000796343",
    "isin": "US00724F1012",
    "cusip": "00724F101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.adobe.com",
    "description": "Adobe Inc. operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, workers, marketers, educators, enthusiasts, communicators, and consumers. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through a network of distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.",
    "ceo": "Mr. Shantanu  Narayen",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "29239",
    "phone": "408 536 6000",
    "address": "345 Park Avenue",
    "city": "San Jose",
    "state": "CA",
    "zip": "95110-2704",
    "dcfDiff": 41.2283,
    "dcf": 329.482,
    "image": "https://financialmodelingprep.com/image-stock/ADBE.png",
    "ipoDate": "1986-08-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]