[
  {
    "symbol": "ADI",
    "price": 189.9,
    "beta": 1.144366,
    "volAvg": 3479214,
    "mktCap": 95219275162,
    "lastDiv": 3.44,
    "range": "133.48-198.25",
    "changes": -2.48,
    "companyName": "Analog Devices, Inc.",
    "currency": "USD",
    "cik": "0000006281",
    "isin": "US0326541051",
    "cusip": "032654105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.analog.com",
    "description": "Analog Devices, Inc. designs, manufactures, tests, and markets integrated circuits (ICs), software, and subsystems that leverage analog, mixed-signal, and digital signal processing technologies. The company provides data converter products, which translate real-world analog signals into digital data, as well as translates digital data into analog signals; power management and reference products for power conversion, driver monitoring, sequencing, and energy management applications in the automotive, communications, industrial, and high-end consumer markets; and power ICs include performance, integration, and software design simulation tools for accurate power supply designs. It also offers high-performance amplifiers to condition analog signals; and radio frequency and microwave ICs to support cellular infrastructure; and microelectromechanical systems technology solutions, including accelerometers used to sense acceleration, gyroscopes for sense rotation, inertial measurement units to sense multiple degrees of freedom, and broadband switches for radio and instrument systems, as well as isolators. In addition, the company offers digital signal processing and system products for high-speed numeric calculations. It serves clients in the industrial, automotive, consumer, instrumentation, aerospace, and communications markets through a direct sales force, third-party distributors, and independent sales representatives in the United States, the rest of North and South America, Europe, Japan, China, and rest of Asia, as well as through its Website. Analog Devices, Inc. was incorporated in 1965 and is headquartered in Wilmington, Massachusetts.",
    "ceo": "Mr. Vincent T. Roche",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "24450",
    "phone": "781 935 5565",
    "address": "One Analog Way",
    "city": "Wilmington",
    "state": "MA",
    "zip": "01887",
    "dcfDiff": 6.66096,
    "dcf": 164.169,
    "image": "https://financialmodelingprep.com/image-stock/ADI.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]