[
  {
    "symbol": "ADRZY",
    "price": 10.41,
    "beta": 1.103065,
    "volAvg": 354,
    "mktCap": 5334270839,
    "lastDiv": 0.46,
    "range": "7.548-14.13",
    "changes": 0.045,
    "companyName": "Andritz AG",
    "currency": "USD",
    "cik": "0001436467",
    "isin": "US0345221024",
    "cusip": "034522102",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Industrial Distribution",
    "website": "https://www.andritz.com",
    "description": "Andritz AG provides plants, equipment, and services for pulp and paper industry, metalworking and steel industries, hydropower stations, and solid/liquid separation in the municipal and industrial sectors. It operates through four segments: Pulp & Paper, Metals, Hydro, and Separation. The Pulp & Paper segment supplies technology, automation, and service solutions to produce pulp, paper, board, and tissue; boilers for power generation; flue gas cleaning systems; plants to produce nonwovens and panelboards; and recycling and shredding solutions for various waste materials. The Metals segment provides technologies, plants, and digital solutions, including automation and software solutions, and process know-how and services; and solutions for the production and processing of flat products and welding systems, as well as services for the metals processing industry. The Hydro segment supplies electromechanical equipment and services for hydropower plants; and pumps for irrigation, water supply, and flood control, as well as offers turbo generators. The Separation segment offers mechanical and thermal technologies, as well as services and related automation solutions for solid/liquid separation to serve chemical, environmental, food, mining, and minerals industries; and technologies and services for the production of animal feed and biomass pellets. In addition, it serves to carbon steel, stainless steel, aluminum, and solution for automotive industries. It operates primarily in Europe, North America, South America, and China and rest of Asia. The company was founded in 1852 and is headquartered in Graz, Austria.",
    "ceo": "Mr. Joachim  Schönbeck",
    "sector": "Industrials",
    "country": "AT",
    "fullTimeEmployees": "29670",
    "phone": "43 316 6902 0",
    "address": "Stattegger Strasse 18",
    "city": "Graz",
    "state": null,
    "zip": "8045",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ADRZY.png",
    "ipoDate": "2010-09-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]