[
  {
    "symbol": "ADSK",
    "price": 206.3,
    "beta": 1.530281,
    "volAvg": 1443124,
    "mktCap": 44091673800,
    "lastDiv": 0.8922500000000005,
    "range": "166.94-235.01",
    "changes": -0.55,
    "companyName": "Autodesk, Inc.",
    "currency": "USD",
    "cik": "0000769397",
    "isin": "US0527691069",
    "cusip": "052769106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.autodesk.com",
    "description": "Autodesk, Inc. provides 3D design, engineering, and entertainment software and services worldwide. The company offers AutoCAD Civil 3D, a surveying, design, analysis, and documentation solution for civil engineering, including land development, transportation, and environmental projects; BIM 360, a construction management cloud-based software; AutoCAD, a software for professional design, drafting, detailing, and visualization; AutoCAD LT, a drafting and detailing software; computer-aided manufacturing (CAM) software for computer numeric control machining, inspection, and modelling for manufacturing; Fusion 360, a 3D CAD, CAM, and computer-aided engineering tool; and Industry Collections tools for professionals in architecture, engineering and construction, product design and manufacturing, and media and entertainment collection industries. It also provides Inventor tools for 3D mechanical design, simulation, analysis, tooling, visualization, and documentation; Vault, a data management software to manage data in one central location, accelerate design processes, and streamline internal/external collaboration; Maya and 3ds Max software products that offer 3D modeling, animation, effects, rendering, and compositing solutions; and ShotGrid, a cloud-based software for review and production tracking in the media and entertainment industry. It sells its products and services to customers directly, as well as through a network of resellers and distributors. Autodesk, Inc. was incorporated in 1982 and is headquartered in San Rafael, California.",
    "ceo": "Dr. Andrew  Anagnost",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "13700",
    "phone": "415 507 5000",
    "address": "111 McInnis Parkway",
    "city": "San Rafael",
    "state": "CA",
    "zip": "94903",
    "dcfDiff": 2.50469,
    "dcf": 213.385,
    "image": "https://financialmodelingprep.com/image-stock/ADSK.png",
    "ipoDate": "1985-06-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]