[
  {
    "symbol": "ADT",
    "price": 5.88,
    "beta": 1.713732,
    "volAvg": 3463583,
    "mktCap": 5418913949,
    "lastDiv": 0.14,
    "range": "4.89-10.095",
    "changes": -0.01,
    "companyName": "ADT Inc.",
    "currency": "USD",
    "cik": "0001703056",
    "isin": "US00090Q1031",
    "cusip": "00090Q103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Security & Protection Services",
    "website": "https://www.adt.com",
    "description": "ADT Inc. provides security, automation, and smart home solutions to consumer and business customers in the United States. It provides a range of fire detection, fire suppression, video surveillance, and access control systems to residential, commercial, and multi-site customers. The company primarily offers monitored security and automation solutions, including the installation and monitoring of security and premises automation systems designed to detect intrusion, control access, sense movement, smoke, fire, carbon monoxide, flooding, temperature, and other environmental conditions and hazards; and address personal emergencies, such as injuries, medical emergencies, or incapacitation. It also provides interactive and smart home solutions that allow customers to use their smart phones, tablets, and laptops to arm and disarm their security systems, adjust lighting or thermostat levels, and view real-time video of their premises; and creates customized and automated schedules for managing lights, thermostats, appliances, garage doors, cameras, and other connected devices, as well as offers monitoring and maintenance services. The company offers its products under the ADT, ADT Pulse, Protection 1, ADT Commercial, and Blue by ADT names. It operates through a network of approximately 250 sales and service offices, as well as three regional distribution centers, which are supported by 17 multi-use sales, customer, and field support locations housing its nine UL-listed monitoring centers and four national sales centers. The company was formerly known as Prime Security Services Parent, Inc. and changed its name to ADT Inc. in September 2017. ADT Inc. was founded in 1874 and is headquartered in Boca Raton, Florida.",
    "ceo": "Mr. James David DeVries",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "22000",
    "phone": "561 988 3600",
    "address": "1501 Yamato Road",
    "city": "Boca Raton",
    "state": "FL",
    "zip": "33431",
    "dcfDiff": 0.390849,
    "dcf": 8.99085,
    "image": "https://financialmodelingprep.com/image-stock/ADT.png",
    "ipoDate": "2018-01-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]