[
  {
    "symbol": "AEIS",
    "price": 109,
    "beta": 1.546478,
    "volAvg": 190229,
    "mktCap": 4091173300,
    "lastDiv": 0.4,
    "range": "67.55-109.2625",
    "changes": 0.43,
    "companyName": "Advanced Energy Industries, Inc.",
    "currency": "USD",
    "cik": "0000927003",
    "isin": "US0079731008",
    "cusip": "007973100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Electrical Equipment & Parts",
    "website": "https://www.advancedenergy.com",
    "description": "Advanced Energy Industries, Inc. designs, manufactures, sells, and supports precision power conversion, measurement, and control solutions worldwide. It offers plasma power solutions, including direct current (DC), pulsed DC, low frequency alternating current, high voltage, and radio frequency (RF) power supplies, as well as RF power supplies, RF matching networks, and RF instrumentation products; and remote plasma sources for reactive gas applications. The company also provides power control modules and thermal instrumentation products for rapid thermal processing, chemical vapor deposition, epitaxy, crystal growing, and chemical processing, as well as metal, carbon fiber, and glass manufacturing and other industrial power applications; high voltage DC-DC products for semiconductor wafer processing and metrology, electrostatic clamping of substrates, scientific instrumentation, mass spectrometry, and X-ray systems for industrial and analytical applications; and low voltage DC-DC board mounted solutions for use in healthcare, telecommunications, test and measurement, instrumentation, and industrial equipment applications, as well as distributed power in server and storage systems. In addition, it offers gas sensing and monitoring products for the energy market, air quality monitoring, and automobile emission monitoring and testing; and embedded power products for medical equipment or IEC 60950-1 for information technology equipment. Further, it offers conversions, upgrades, and refurbishments and used equipment to companies, as well as repair services. The company provides its products through a direct sales force, independent sales representatives, channel partners, and distributors. Advanced Energy Industries, Inc. was incorporated in 1981 and is headquartered in Denver, Colorado.",
    "ceo": "Mr. Stephen D. Kelley",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "12000",
    "phone": "970 407 4670",
    "address": "1595 Wynkoop Street",
    "city": "Denver",
    "state": "CO",
    "zip": "80202",
    "dcfDiff": 10.243,
    "dcf": 103.683,
    "image": "https://financialmodelingprep.com/image-stock/AEIS.png",
    "ipoDate": "1995-11-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]