[
  {
    "symbol": "AER",
    "price": 62.06,
    "beta": 1.993309,
    "volAvg": 1024891,
    "mktCap": 14786167360,
    "lastDiv": 0,
    "range": "37.87-66.85",
    "changes": -0.32,
    "companyName": "AerCap Holdings N.V.",
    "currency": "USD",
    "cik": "0001378789",
    "isin": "NL0000687663",
    "cusip": "N00985106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Rental & Leasing Services",
    "website": "https://www.aercap.com",
    "description": "AerCap Holdings N.V. engages in the lease, financing, sale, and management of commercial flight equipment in China, Hong Kong, Macau, the United States, Ireland, and internationally. The company offers aircraft asset management services, such as remarketing aircraft and engines; collecting rental and maintenance rent payments, monitoring aircraft maintenance, monitoring and enforcing contract compliance, and accepting delivery and redelivery of aircraft and engines; and conducting ongoing lessee financial performance reviews. Its aircraft asset management services also include periodically inspecting the leased aircraft; coordinating technical modifications to aircraft to meet new lessee requirements; conducting restructuring negotiations in connection with lease defaults; repossessing aircraft and engines; arranging and monitoring insurance coverage; registering and de-registering aircraft; arranging for aircraft and engine valuations; and providing market research services. The company also provides cash management services, including treasury services, such as the financing, refinancing, hedging, and ongoing cash management of vehicles; and administrative services comprising accounting and corporate secretarial services consisting of the preparation of budgets and financial statements. In addition, it offers airframe and engine parts and supply chain solutions to airlines; maintenance, repair, and overhaul service providers; and aircraft parts distributors. As of December 31, 2021, the company had a portfolio of 2,369 owned, managed, or on order aircraft. AerCap Holdings N.V. was founded in 1995 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Aengus  Kelly",
    "sector": "Industrials",
    "country": "IE",
    "fullTimeEmployees": "640",
    "phone": "353 1 819 2010",
    "address": "AerCap House",
    "city": "Dublin",
    "state": null,
    "zip": "D02 YX20",
    "dcfDiff": 10.0022,
    "dcf": 73.9422,
    "image": "https://financialmodelingprep.com/image-stock/AER.png",
    "ipoDate": "2006-11-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]