[
  {
    "symbol": "AES",
    "price": 20.2,
    "beta": 0.936267,
    "volAvg": 6148133,
    "mktCap": 13520587200,
    "lastDiv": 0.66,
    "range": "18.9-29.89",
    "changes": -0.71,
    "companyName": "The AES Corporation",
    "currency": "USD",
    "cik": "0000874761",
    "isin": "US00130H1059",
    "cusip": "00130H105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Diversified",
    "website": "https://www.aes.com",
    "description": "The AES Corporation operates as a diversified power generation and utility company. It owns and/or operates power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries. The company also owns and/or operates utilities to generate or purchase, distribute, transmit, and sell electricity to end-user customers in the residential, commercial, industrial, and governmental sectors; and generates and sells electricity on the wholesale market. It uses a range of fuels and technologies to generate electricity, including coal, gas, hydro, wind, solar, and biomass; and renewables, such as energy storage and landfill gas. The company owns and/or operates a generation portfolio of approximately 31,459 megawatts. It has operations in the United States, Puerto Rico, El Salvador, Chile, Colombia, Argentina, Brazil, Mexico, Central America, the Caribbean, Europe, and Asia. The company was formerly known as Applied Energy Services, Inc. and changed its name to The AES Corporation in April 2000. The AES Corporation was incorporated in 1981 and is headquartered in Arlington, Virginia.",
    "ceo": "Mr. Andres Ricardo  Gluski Weilert",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "9100",
    "phone": "703 522 1315",
    "address": "4300 Wilson Boulevard",
    "city": "Arlington",
    "state": "VA",
    "zip": "22203",
    "dcfDiff": 2.51168,
    "dcf": 29.4817,
    "image": "https://financialmodelingprep.com/image-stock/AES.png",
    "ipoDate": "1991-06-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]