[
  {
    "symbol": "AGO",
    "price": 54.5,
    "beta": 1.106338,
    "volAvg": 245582,
    "mktCap": 3234089950,
    "lastDiv": 1.12,
    "range": "45.21-67.13",
    "changes": 0.5,
    "companyName": "Assured Guaranty Ltd.",
    "currency": "USD",
    "cik": "0001273813",
    "isin": "BMG0585R1060",
    "cusip": "G0585R106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Specialty",
    "website": "https://www.assuredguaranty.com",
    "description": "Assured Guaranty Ltd., through its subsidiaries, provides credit protection products to public finance, infrastructure, and structured finance markets in the United States and internationally. The company operates in two segments, Insurance and Asset Management. It offers financial guaranty insurance that protects holders of debt instruments and other monetary obligations from defaults in scheduled payments. The company insures and reinsures various debt obligations, including bonds issued by the United States state governmental authorities; and notes issued to finance infrastructure projects. It also insures and reinsures various the U.S. public finance obligations, such as general obligation, tax-backed, municipal utility, transportation, healthcare, higher education, infrastructure, housing revenue, investor-owned utility, renewable energy, and other public finance bonds. Further, it is involved in insuring and reinsuring of non-U.S. public finance obligations comprising regulated utilities, infrastructure finance, sovereign and sub-sovereign, renewable energy bonds, pooled infrastructure, and other public finance obligations; and the U.S. and non-U.S. Structured finance obligations, including residential mortgage-backed securities, life insurance transactions, consumer receivables securities, pooled corporate obligations, financial products, and other structured finance securities. Additionally, the company offers specialty insurance and reinsurance that include life and aircraft residual value insurance transactions; and asset management services comprising investment advisory services, including management of collateralized loan obligations, and opportunity and liquid strategy funds. It markets its financial guaranty insurance directly to issuers and underwriters of public finance and structured finance securities, as well as to investors in such obligations. Assured Guaranty Ltd. was incorporated in 2003 and is headquartered in Hamilton, Bermuda.",
    "ceo": "Mr. Dominic John Frederico",
    "sector": "Financial Services",
    "country": "BM",
    "fullTimeEmployees": "411",
    "phone": "4412795700",
    "address": "30 Woodbourne Avenue",
    "city": "Hamilton",
    "state": null,
    "zip": "HM 08",
    "dcfDiff": 0.40211,
    "dcf": 62.6121,
    "image": "https://financialmodelingprep.com/image-stock/AGO.png",
    "ipoDate": "2004-04-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]