[
  {
    "symbol": "AGR",
    "price": 37.26,
    "beta": 0.436619,
    "volAvg": 608406,
    "mktCap": 14410267442,
    "lastDiv": 1.76,
    "range": "36.81-51.71",
    "changes": -0.82,
    "companyName": "Avangrid, Inc.",
    "currency": "USD",
    "cik": "0001634997",
    "isin": "US05351W1036",
    "cusip": "05351W103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.avangrid.com",
    "description": "Avangrid, Inc., an energy services holding company, engages in the regulated energy transmission and distribution, and renewable energy generation businesses in the United States. The company operates through Networks and Renewables segments. It is involved in the generation, transmission, and distribution of electricity; and distribution, transportation, and sale of natural gas. The company also operates renewable energy generation facilities primarily using onshore wind power, as well as solar, biomass, and thermal power. It delivers natural gas and electricity to residential, commercial, and institutional customers through its regulated utilities in New York, Maine, Connecticut, and Massachusetts; and sells its output to investor-owned utilities, public utilities, and other credit-worthy entities. In addition, the company generates and provides power and other services to federal and state agencies, as well as institutional retail and joint action agencies; and delivers thermal output to wholesale customers in the Western United States. It owns eight electric and natural gas utilities, serving 3.3 million customers in New York and New England, as well as owns and operates 8.8 gigawatts of electricity capacity primarily through wind power in 22 states. The company was incorporated in 1997 and is headquartered in Orange, Connecticut. Avangrid, Inc. is a subsidiary of Iberdrola, S.A.",
    "ceo": "Mr. Pedro Azagra  Blazquez",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "7600",
    "phone": "207 629 1190",
    "address": "180 Marsh Hill Road",
    "city": "Orange",
    "state": "CT",
    "zip": "06477",
    "dcfDiff": 4.00098,
    "dcf": 46.161,
    "image": "https://financialmodelingprep.com/image-stock/AGR.png",
    "ipoDate": "2015-12-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]