[
  {
    "symbol": "AGTI",
    "price": 16.56,
    "beta": 1.056338,
    "volAvg": 200295,
    "mktCap": 2226657600,
    "lastDiv": 0,
    "range": "14.151-22.525",
    "changes": 0.25,
    "companyName": "Agiliti, Inc.",
    "currency": "USD",
    "cik": "0001749704",
    "isin": "US00848J1043",
    "cusip": "00848J104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Health Information Services",
    "website": "https://www.agilitihealth.com",
    "description": "Agiliti, Inc., together with its subsidiaries, provides healthcare technology management and service solutions to the healthcare industry in the United States. It offers onsite managed services that are comprehensive programs for the management, reprocessing, and logistics of medical equipment at individual facilities and integrated delivery networks to monitor and adjust equipment quantities and availability to address fluctuations in patient census and acuity. The company also provides clinical engineering services comprising maintenance, repair, and remediation solutions for various types of medical equipment, including general biomedical equipment, diagnostic imaging equipment, and surgical equipment through supplemental and outsourced offerings. In addition, it offers equipment solutions, which primarily provide supplemental, peak need, and per-case rental of general biomedical, specialty, and surgical equipment to acute care hospitals and alternate site providers, including premier healthcare institutions and integrated delivery networks. The company serves acute care hospitals, health systems and integrated delivery networks and alternate site providers Agiliti, Inc. was founded in 1939 and is headquartered in Eden Prairie, Minnesota.",
    "ceo": "Mr. Thomas W. Boehning",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "6000",
    "phone": "952-893-3200",
    "address": "11095 Viking Drive",
    "city": "Eden Prairie",
    "state": "MN",
    "zip": "55344",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AGTI.png",
    "ipoDate": "2021-04-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]