[
  {
    "symbol": "AHKSY",
    "price": 13.485,
    "beta": 0.844061,
    "volAvg": 143972,
    "mktCap": 9353816526,
    "lastDiv": 0.52,
    "range": "12.24-16.54",
    "changes": 0.105,
    "companyName": "Asahi Kasei Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US0434001006",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Chemicals",
    "website": "https://www.asahi-kasei.com",
    "description": "Asahi Kasei Corporation manufactures, processes, and sells chemical products in Japan and internationally. The company operates through three segments: Material, Homes, and Health Care. It provides caustic soda, chemical fertilizers, nitric acid, ammonia, acrylonitrile, methyl methacrylate, styrene, adipic acid, hexamethylene diamine, AH salt, propionitrile, sodium cyanide, acetonitrile, methacrylonitrile, cyclohexyl methacrylate, cyclohexanol, cyclohexane, and cyclohexene; polymers; chemical intermediates; additives; membranes and systems; clads and anchors; optical and printing materials; electronic materials; and lithium-ion battery and lead-acid battery separators. The company offers cupro fiber, lining fabric, stretch fiber, spunbond nonwovens, cupro nonwoven fabric, microfiber suede, oil-water separator, multifunctional nonwoven, deodorizing nonwoven, heat-press formable thermoplastic nonwoven, noise suppression sheet, nylon filaments, flame-resistant fiber, honeycomb fabric, cellulose nanobead, ecorise, biocradle, and bemliese products, as well as polymers; synthetic rubber; elastomers; kitchen and household products; cleaners; and packaging products. In addition, the company provides electronic devices; and autoclaved aerated concrete, foundation systems, insulation materials, and structural systems and components. Further, it involved in the construction of homes and apartments; management of rental units and condominiums; brokerage of used homes; remodeling; and mortgage financing, asset management services, and insurance products. Additionally, the company provides pharmaceuticals and diagnostic reagents; dialyzers; therapeutic apheresis; biotherapeutics and plasma derivative filters and equipment, and virus removal filters; leukocyte reduction filters; defibrillators, temperature management systems, and data solutions; and UVC LED products. Asahi Kasei Corporation was founded in 1922 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Koshiro  Kudo",
    "sector": "Basic Materials",
    "country": "JP",
    "fullTimeEmployees": "46751",
    "phone": "81 3 6699 3000",
    "address": "Hibiya Mitsui Tower",
    "city": "Tokyo",
    "state": null,
    "zip": "100-0006",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AHKSY.png",
    "ipoDate": "2007-10-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]