[
  {
    "symbol": "AIQUY",
    "price": 35.45,
    "beta": 0.639463,
    "volAvg": 140724,
    "mktCap": 92505001933,
    "lastDiv": 0.64,
    "range": "22.09-36.34",
    "changes": 0.2,
    "companyName": "L'Air Liquide S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US0091262024",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Chemicals",
    "website": "https://www.airliquide.com",
    "description": "L'Air Liquide S.A. provides gases, technologies, and services for the industrial and health sectors in Europe, the Americas, the Asia Pacific, the Middle East, and Africa. The company's Gas & Services segment offers oxygen, nitrogen, argon, hydrogen, and carbon monoxide to the metals, chemicals, refining, and energy sectors; and gases, application equipment, and associated services to the materials and energy, automotive and manufacturing, food and pharmaceuticals, technology and research, and craftsmen and retail sectors. It also supplies medical gases, hygiene products, equipment, and services to hospitals, as well as to patients in their homes; and produces and distributes healthcare specialty ingredients for the cosmetics, pharmaceutical, and vaccine markets. In addition, this segment supplies gases, materials, and services for use in the production of semi-conductors, as well as flat screens and photovoltaic panels. Its Engineering & Construction segment designs, develops, and builds industrial gas production plants for third parties; and designs and manufactures plants in the traditional, renewable, and alternative energy sectors. The company's Global Markets & Technologies segment delivers technological solutions, such as molecules, equipment, and services to support the markets of energy transition, primarily in transport, energy, and waste valorization, as well as related to deep tech in the space exploration, aerospace, and big science. This segment also invests in biomethane production units, as well as develops stations for distributing natural bio-gas for vehicles and hydrogen to support clean mobility; operates biomethane production units for use in the maritime industry; and supplies gases for the offshore oil and gas platforms, offshore wind turbines, and cryogenic transportation by sea. L'Air Liquide S.A. was incorporated in 1902 and is headquartered in Paris, France.",
    "ceo": "Mr. Francois  Jackow",
    "sector": "Basic Materials",
    "country": "FR",
    "fullTimeEmployees": "67109",
    "phone": "33 1 40 62 55 55",
    "address": "75 quai d'Orsay",
    "city": "Paris",
    "state": null,
    "zip": "75321",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AIQUY.png",
    "ipoDate": "2007-06-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]