[
  {
    "symbol": "AIT",
    "price": 142.14,
    "beta": 1.187676,
    "volAvg": 184872,
    "mktCap": 5494293774,
    "lastDiv": 1.4,
    "range": "88.09-149.42",
    "changes": -0.43,
    "companyName": "Applied Industrial Technologies, Inc.",
    "currency": "USD",
    "cik": "0000109563",
    "isin": "US03820C1053",
    "cusip": "03820C105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Industrial Distribution",
    "website": "https://www.applied.com",
    "description": "Applied Industrial Technologies, Inc. distributes industrial motion, power, control, and automation technology solutions in North America, Australia, New Zealand, and Singapore. It operates through two segments, Service Center Based Distribution, and Fluid Power & Flow Control. The company distributes bearings, power transmission products, engineered fluid power components and systems, specialty flow control solutions, advanced automation products, industrial rubber products, linear motion components, automation solutions, tools, safety products, oilfield supplies, and other industrial and maintenance supplies; and motors, belting, drives, couplings, pumps, hydraulic and pneumatic components, filtration supplies, valves, fittings, process instrumentation, actuators, and hoses, filtration supplies, as well as other related supplies for general operational needs of customers' machinery and equipment. It also operates fabricated rubber shops and service field crews that install, modify, and repair conveyor belts and rubber linings, as well as offer hose assemblies. In addition, the company provides equipment repair and technical support services. It distributes industrial products through a network of service centers. The company serves various industries, including agriculture and food processing, cement, chemicals and petrochemicals, fabricated metals, forest products, industrial machinery and equipment, life sciences, mining, oil and gas, primary metals, technology, transportation, and utilities, as well as government entities. The company was formerly known as Bearings, Inc. and changed its to name to Applied Industrial Technologies, Inc. in 1997. The company was founded in 1923 and is headquartered in Cleveland, Ohio.",
    "ceo": "Mr. Neil A. Schrimsher",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "6184",
    "phone": "216 426 4000",
    "address": "1 Applied Plaza",
    "city": "Cleveland",
    "state": "OH",
    "zip": "44115",
    "dcfDiff": 3.67093,
    "dcf": 136.639,
    "image": "https://financialmodelingprep.com/image-stock/AIT.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]