[
  {
    "symbol": "AIZ",
    "price": 124.15,
    "beta": 0.541549,
    "volAvg": 419720,
    "mktCap": 6598771140,
    "lastDiv": 2.8,
    "range": "104.49-178.76",
    "changes": -0.83,
    "companyName": "Assurant, Inc.",
    "currency": "USD",
    "cik": "0001267238",
    "isin": "US04621X1081",
    "cusip": "04621X108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Specialty",
    "website": "https://www.assurant.com",
    "description": "Assurant, Inc., together with its subsidiaries, provides lifestyle and housing solutions that support, protect, and connect consumer purchases in North America, Latin America, Europe, and the Asia Pacific. The company operates through two segments: Global Lifestyle and Global Housing. The Global Lifestyle segment offers mobile device solutions, and extended service products and related services for mobile devices, consumer electronics, and appliances; vehicle protection and related services; and credit protection and other insurance products. The Global Housing segment provides lender-placed homeowners insurance, manufactured housing, and flood insurance; and renters insurance and related products, as well as voluntary manufactured housing insurance, voluntary homeowners insurance, and other specialty products. The company was formerly known as Fortis, Inc. and changed its name to Assurant, Inc. in February 2004. Assurant, Inc. was founded in 1892 and is headquartered in New York, New York.",
    "ceo": "Mr. Keith Warner Demmings",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "13700",
    "phone": "212 859 7000",
    "address": "55 Broadway",
    "city": "New York",
    "state": "NY",
    "zip": "10006",
    "dcfDiff": 28.4514,
    "dcf": 158.801,
    "image": "https://financialmodelingprep.com/image-stock/AIZ.png",
    "ipoDate": "2004-02-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]