[
  {
    "symbol": "AJG",
    "price": 210.89,
    "beta": 0.709154,
    "volAvg": 913672,
    "mktCap": 45182338940,
    "lastDiv": 2.2,
    "range": "160.6-219.23",
    "changes": -1.26,
    "companyName": "Arthur J. Gallagher & Co.",
    "currency": "USD",
    "cik": "0000354190",
    "isin": "US3635761097",
    "cusip": "363576109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance Brokers",
    "website": "https://www.ajg.com",
    "description": "Arthur J. Gallagher & Co., together with its subsidiaries, provides insurance brokerage, consulting, third-party claims settlement, and administration services in the United States, Australia, Bermuda, Canada, the Caribbean, New Zealand, India, and the United Kingdom. It operates through Brokerage and Risk Management segments. The Brokerage segment consists of retail and wholesale insurance brokerage operations; assists retail brokers and other non-affiliated brokers in the placement of specialized and hard-to-place insurance; acts as a brokerage wholesaler, managing general agent, and managing general underwriter for distributing specialized insurance coverage's to underwriting enterprises. This segment also performs activities, including marketing, underwriting, issuing policies, collecting premiums, appointing and supervising other agents, paying claims, and negotiating reinsurance; and offers brokerage and consulting services to businesses and organizations, including commercial, not-for-profit, and public entities, as well as individuals in the areas of insurance placement, risk of loss management, and management of employer sponsored benefit programs. The Risk Management segment provides contract claim settlement and administration services to enterprises and public entities; and claims management, loss control consulting, and insurance property appraisal services. The company offers its services through a network of correspondent insurance brokers and consultants. It serves commercial, industrial, public, religious, and not-for-profit entities. The company was incorporated in 1927 and is headquartered in Rolling Meadows, Illinois.",
    "ceo": "Mr. J. Patrick Gallagher Jr.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "45112",
    "phone": "630 773 3800",
    "address": "2850 Golf Road",
    "city": "Rolling Meadows",
    "state": "IL",
    "zip": "60008-4050",
    "dcfDiff": 4.0041,
    "dcf": 197.814,
    "image": "https://financialmodelingprep.com/image-stock/AJG.png",
    "ipoDate": "1984-06-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]