[
  {
    "symbol": "AJINY",
    "price": 39.7895,
    "beta": -0.005363,
    "volAvg": 7004,
    "mktCap": 21300512398,
    "lastDiv": 0.44,
    "range": "23.33-42.21",
    "changes": 0.2095,
    "companyName": "Ajinomoto Co., Inc.",
    "currency": "USD",
    "cik": null,
    "isin": "US0097071007",
    "cusip": "009707100",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Packaged Foods",
    "website": "https://www.ajinomoto.co.jp",
    "description": "Ajinomoto Co., Inc. engages in the seasonings and foods, frozen foods, and healthcare and other businesses in Japan and internationally. Its Seasonings and Foods segment offers sauces and seasonings products under the AJI-NO-MOTO, HON-DASHI, Cook Do, Ajinomoto KK Consommé, Pure Select Mayonnaise, Ros Dee, Masako, Aji-ngon, Sazón, Sajiku, and CRISPY FRY names; and solutions and ingredients to consumer foods and food service industries. This segment also provides instant noodles under the Knorr Cup Soup, and YumYum names; coffee under the Birdy and Blendy brands; powdered drink under the Birdy 3in1 name; MAXIM products; Chyotto Zeitakuna Kohiten products; and gift sets and office supplies comprising coffee vending machines, tea server, etc. The Frozen Foods segment offers Chinese dumplings, cooked rice, noodles, desserts, shumai, processed chicken, and other products. The Healthcare and Other segment provides amino acids to various industries, such as pharmaceuticals, foods, and cosmetics; sports nutrition products; personal care ingredients; and sterile products, as well as engages in the provision of contract manufacturing services for pharmaceutical intermediates and active ingredients. This segment also offers Ajinomoto Build-up Film, an interlayer insulating material for semiconductor packages. Ajinomoto Co., Inc. was founded in 1909 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Taro  Fujie",
    "sector": "Consumer Defensive",
    "country": "JP",
    "fullTimeEmployees": "34198",
    "phone": "81 3 5250 8111",
    "address": "15-1, Kyobashi 1-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "104-8315",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AJINY.png",
    "ipoDate": "2010-02-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]