[
  {
    "symbol": "AJRD",
    "price": 55.1,
    "beta": 0.551408,
    "volAvg": 834541,
    "mktCap": 4449815170,
    "lastDiv": 9.486689000000004,
    "range": "38.48-56.8",
    "changes": 0.06,
    "companyName": "Aerojet Rocketdyne Holdings, Inc.",
    "currency": "USD",
    "cik": "0000040888",
    "isin": "US0078001056",
    "cusip": "007800105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.aerojetrocketdyne.com",
    "description": "Aerojet Rocketdyne Holdings, Inc. designs, develops, manufactures, and sells aerospace and defense products and systems in the United States. It operates in two segments, Aerospace and Defense, and Real Estate. The Aerospace and Defense segment offers aerospace and defense products and systems for the United States government, including the Department of Defense, the National Aeronautics and Space Administration, and aerospace and defense prime contractors. This segment provides liquid and solid rocket propulsion systems, air-breathing hypersonic engines, and electric power and propulsion systems for space, defense, civil, and commercial applications; and armament systems. The Real Estate segment engages in the re-zoning, entitlement, sale, and leasing of the company's excess real estate assets. It owns 11,277 acres of land adjacent to the United States Highway 50 between Rancho Cordova and Folsom, California east of Sacramento. The company was formerly known as GenCorp Inc. and changed its name to Aerojet Rocketdyne Holdings, Inc. in April 2015. Aerojet Rocketdyne Holdings, Inc. was incorporated in 1915 and is headquartered in El Segundo, California.",
    "ceo": "Ms. Eileen P. Drake",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5283",
    "phone": "310 252 8100",
    "address": "222 North Pacific Coast Highway",
    "city": "El Segundo",
    "state": "CA",
    "zip": "90245",
    "dcfDiff": 3.94189,
    "dcf": 59.7019,
    "image": "https://financialmodelingprep.com/image-stock/AJRD.png",
    "ipoDate": "1981-02-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]