[
  {
    "symbol": "AKAM",
    "price": 89.05,
    "beta": 0.802464,
    "volAvg": 1456661,
    "mktCap": 13553588100,
    "lastDiv": 0,
    "range": "70.65-98.81",
    "changes": -0.3,
    "companyName": "Akamai Technologies, Inc.",
    "currency": "USD",
    "cik": "0001086222",
    "isin": "US00971T1016",
    "cusip": "00971T101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.akamai.com",
    "description": "Akamai Technologies, Inc. provides cloud services for securing, delivering, and optimizing content and business applications over the internet in the United States and internationally. The company offers cloud solutions to keep infrastructure, websites, applications, application programming interfaces, and users safe from various cyberattacks and online threats while enhancing performance. It also provides web and mobile performance solutions to enable dynamic websites and applications; media delivery solutions, including video streaming and video player services, game and software delivery, broadcast operations, authoritative domain name system, resolution, and data and analytics; and edge compute solutions to enable developers to deploy and distribute code at the edge. In addition, the company offers carrier offerings, including cybersecurity protection, parental controls, DNS infrastructure and content delivery solutions; and an array of service and support to assist customers with integrating, configuring, optimizing, and managing its offerings. It sells its solutions through direct sales and service organizations, as well as through various channel partners. Akamai Technologies, Inc. was incorporated in 1998 and is headquartered in Cambridge, Massachusetts.",
    "ceo": "Dr. F. Thomson Leighton",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "9960",
    "phone": "617 444 3000",
    "address": "145 Broadway",
    "city": "Cambridge",
    "state": "MA",
    "zip": "02142",
    "dcfDiff": 6.74869,
    "dcf": 94.1687,
    "image": "https://financialmodelingprep.com/image-stock/AKAM.png",
    "ipoDate": "1999-10-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]