[
  {
    "symbol": "ALC",
    "price": 80.52,
    "beta": 0.687065,
    "volAvg": 1070625,
    "mktCap": 39599736000,
    "lastDiv": 0.23,
    "range": "55.21-82.08",
    "changes": 0.15,
    "companyName": "Alcon Inc.",
    "currency": "USD",
    "cik": "0001167379",
    "isin": "CH0432492467",
    "cusip": "H01301128",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.alcon.com",
    "description": "Alcon Inc., an eye care company, researches, develops, manufactures, distributes, and sells eye care products for eye care professionals and their patients worldwide. The company's Surgical segment offers equipment, instrumentation and diagnostics, intraocular lenses (IOLs), and other implantables; and consumables, including viscoelastics, surgical solutions, incisional instruments, surgical custom packs, and other products for use in surgical procedures. Its cataract products include centurion vision system, LenSx femtosecond laser, LuxOR surgical ophthalmic microscope, NGENUITY 3D visualization system, and ORA system for intra-operative measurements; custom pak surgical procedure packs; vitreoretinal products comprising constellation vision systems, procedure packs, lasers and hand-held microsurgical instruments, and grieshaber and MIVS instruments, as well as scissors, forceps and micro-instruments, medical grade vitreous tamponades, and Hypervit vitrectomy probes; refractive surgery products, including WaveLight lasers and Contoura Vision used for LASIK treatment; EX-PRESS glaucoma filtration device; and implantables products, including AcrySof IQ IOLs products include monofocal IOLs and advanced technology IOLs under the PanOptix and ReSTOR brands for the correction of presbyopia and astigmatism at the time of cataract surgery. Its Vision Care segment provides daily disposable, reusable, and color-enhancing contact lenses; ocular health products, such as dry eye, glaucoma, contact lens care, and ocular allergies; and ocular vitamins and redness relievers under the TOTAL, PRECISION, DAILIES AquaComfort PLUS, Air Optix, Opti-Free, Clear Care, Tears Naturale, Genteal, ICAPS, and Vitalux brands. The company was formerly known as Alcon Universal S.A. and changed the name to Alcon Inc. in December 2001. Alcon Inc. was founded in 1945 and is headquartered in Geneva, Switzerland.",
    "ceo": "Mr. David J. Endicott",
    "sector": "Healthcare",
    "country": "CH",
    "fullTimeEmployees": "25000",
    "phone": "41 58 911 20 00",
    "address": "Chemin de Blandonnet 8",
    "city": "Geneva",
    "state": null,
    "zip": "1214",
    "dcfDiff": 5.63914,
    "dcf": 69.1609,
    "image": "https://financialmodelingprep.com/image-stock/ALC.png",
    "ipoDate": "2019-04-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]