[
  {
    "symbol": "ALFVY",
    "price": 35.216,
    "beta": 1.204214,
    "volAvg": 10266,
    "mktCap": 14555688979,
    "lastDiv": 0.58,
    "range": "22.73-37.95",
    "changes": -0.114,
    "companyName": "Alfa Laval AB (publ)",
    "currency": "USD",
    "cik": null,
    "isin": "US0153931011",
    "cusip": "015393101",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.alfalaval.com",
    "description": "Alfa Laval AB (publ) provides heat transfer, separation, and fluid handling products and solutions worldwide. The company operates in three divisions: Energy, Food & Water, and Marine. It offers oil/gas-fired steam and composite steam boilers, exhaust gas economizer, and ballast water treatment systems, and exhaust gas cleaning products. The company also provides sensing and control, cleaning validation, condition monitoring, agitators, tank, powder mixers, fittings, and tubes, as well as wall mounted cleaning nozzles, rotary jet and heads; and tank accessories and covers. In addition, the company offers centrifugal, rotary lobe, three screw, twin screw, and circumferential piston pumps. Further, the company provides butterfly, control/check, double seal, diaphragm, double seat, regulating, safety, sampling, shutter, single seat, and ball valves. Additionally, the company offers heat exchanger, tube-in-tube heat exchangers, and process shell-and-tube heat exchangers. Furthermore, the company provides finned tube air heat, scraped surface heat exchangers, and various plate heat exchangers, wet surface, and HYAC hybrid air coolers. It also offers decanters and separator related products. The company serves energy, utilities, home, personal care, food, dairy, beverage, marine, transportation, pharma, biotech, water, and wastewater industries. Alfa Laval AB (publ) was founded in 1883 and is headquartered in Lund, Sweden.",
    "ceo": "Mr. Tom  Erixon LL.B, MBA",
    "sector": "Industrials",
    "country": "SE",
    "fullTimeEmployees": "20448",
    "phone": "46 46 36 65 00",
    "address": "Rudeboksvägen 1",
    "city": "Lund",
    "state": null,
    "zip": "226 55",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ALFVY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]