[
  {
    "symbol": "ALG",
    "price": 181.78,
    "beta": 0.99014,
    "volAvg": 56124,
    "mktCap": 2181541780,
    "lastDiv": 0.88,
    "range": "110.98-186.76",
    "changes": -1.01,
    "companyName": "Alamo Group Inc.",
    "currency": "USD",
    "cik": "0000897077",
    "isin": "US0113111076",
    "cusip": "011311107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Farm & Heavy Construction Machinery",
    "website": "https://www.alamo-group.com",
    "description": "Alamo Group Inc. designs, manufactures, distributes, and services vegetation management and infrastructure maintenance equipment for governmental, industrial, and agricultural uses worldwide. Its Vegetation Management Division segment offers hydraulically-powered and tractor-mounted mowers, other cutters and replacement parts for heavy-duty and intensive uses and heavy duty applications, tractor- and truck-mounted mowing and vegetation maintenance equipment, and replacement parts. This segment also provides rotary and finishing mowers, flail and disc mowers, front-end loaders, backhoes, rotary tillers, posthole diggers, scraper blades and replacement parts, zero turn radius mowers, cutting parts, plain and hard-faced replacement tillage tools, disc blades, and fertilizer application components; aftermarket agricultural parts, heavy-duty mechanical rotary mowers, snow blowers, rock removal equipment, replacement parts, tractor attachments, agricultural implements, hydraulic and boom-mounted hedge and grass cutters, tractor attachments and implements, hedgerow cutters, industrial grass mowers, agricultural seedbed preparation cultivators, self-propelled sprayers and multi-drive load-carrying vehicles, cutting blades, and hydraulic and mechanical boom mowers. The company's Industrial Equipment Division segment offers truck-mounted air vacuum, mechanical broom, and regenerative air sweepers, pothole patchers, leaf collection equipment and replacement brooms, parking lot and street sweepers, excavators, catch basin cleaners, and roadway debris vacuum systems, as well as truck-mounted vacuum machines, combination sewer cleaners, and hydro excavators. This segment also offers ice control products, snowplows and heavy duty snow removal equipment, hitches, attachments, and graders; and public works and runway maintenance products, parts, and services, and high pressure cleaning systems and trenchers. The company was founded in 1955 and is headquartered in Seguin, Texas.",
    "ceo": "Mr. Jeffery A. Leonard",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "4200",
    "phone": "830 379 1480",
    "address": "1627 East Walnut Street",
    "city": "Seguin",
    "state": "TX",
    "zip": "78155",
    "dcfDiff": 1.1555,
    "dcf": 155.236,
    "image": "https://financialmodelingprep.com/image-stock/ALG.png",
    "ipoDate": "1993-03-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]