[
  {
    "symbol": "ALGT",
    "price": 127.13,
    "beta": 1.612323,
    "volAvg": 200293,
    "mktCap": 2342878770,
    "lastDiv": 21.75,
    "range": "62.94-127.635",
    "changes": 2.2,
    "companyName": "Allegiant Travel Company",
    "currency": "USD",
    "cik": "0001362468",
    "isin": "US01748X1028",
    "cusip": "01748X102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Airlines",
    "website": "https://www.allegiantair.com",
    "description": "Allegiant Travel Company, a leisure travel company, provides travel services and products to residents of under-served cities in the United States. The company offers scheduled air transportation on limited-frequency, nonstop flights between under-served cities and leisure destinations. As of February 14, 2022, it operated a fleet of 110 Airbus A320 series aircraft. The company also provides air-related services and products in conjunction with air transportation, including baggage fees, advance seat assignments, travel protection products, priority boarding, a customer convenience fee, food and beverage purchases on board, and other air-related services, as well as use of its call center for purchases. In addition, it offers third party travel products, such as hotel rooms and ground transportation, such as rental cars and hotel shuttle products; and air transportation services through fixed fee agreements and charter service on a year-round and ad-hoc basis. Further, the company operates a golf course. Allegiant Travel Company was founded in 1997 and is based in Las Vegas, Nevada.",
    "ceo": "Mr. John T. Redmond",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5318",
    "phone": "702 851 7300",
    "address": "1201 North Town Center Drive",
    "city": "Las Vegas",
    "state": "NV",
    "zip": "89144",
    "dcfDiff": 16.1213,
    "dcf": 102.331,
    "image": "https://financialmodelingprep.com/image-stock/ALGT.png",
    "ipoDate": "2006-12-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]