[
  {
    "symbol": "ALIZY",
    "price": 23.04,
    "beta": 1.13908,
    "volAvg": 123404,
    "mktCap": 92526103757,
    "lastDiv": 1.25,
    "range": "15.22-25.13",
    "changes": -0.09,
    "companyName": "Allianz SE",
    "currency": "USD",
    "cik": null,
    "isin": "US0188201000",
    "cusip": "018820100",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Insurance—Diversified",
    "website": "https://www.allianz.com",
    "description": "Allianz SE, together with its subsidiaries, provides property-casualty insurance, life/health insurance, and asset management products and services worldwide. The company's Property-Casualty segment offers various insurance products, including motor liability and own damage, accident, general liability, fire and property, legal expense, credit, and travel to private and corporate customers. Its Life/Health segment provides a range of life and health insurance products on an individual and a group basis, such as annuities, endowment and term insurance, and unit-linked and investment-oriented products, as well as private and supplemental health, and long-term care insurance products. The company's Asset Management segment offers institutional and retail asset management products and services to third-party investors comprising equity and fixed income funds, and multi-assets; and alternative investment products comprising infrastructure debt/equity, real assets, liquid alternatives, and solutions. Its Corporate and Other segment provides banking services for retail clients, as well as digital investment services. Allianz SE was founded in 1890 and is headquartered in Munich, Germany.",
    "ceo": "Mr. Oliver  Bate",
    "sector": "Financial Services",
    "country": "DE",
    "fullTimeEmployees": "159253",
    "phone": "49 89 3800 0",
    "address": "KOeniginstrasse 28",
    "city": "Munich",
    "state": null,
    "zip": "80802",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ALIZY.png",
    "ipoDate": "2000-11-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]