[
  {
    "symbol": "ALKS",
    "price": 32.66,
    "beta": 0.605281,
    "volAvg": 1356764,
    "mktCap": 5425511599,
    "lastDiv": 0,
    "range": "21.75-33.71",
    "changes": -0.34,
    "companyName": "Alkermes plc",
    "currency": "USD",
    "cik": "0001520262",
    "isin": "IE00B56GVS15",
    "cusip": "G01767105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.alkermes.com",
    "description": "Alkermes plc, a biopharmaceutical company, researches, develops, and commercializes pharmaceutical products to address unmet medical needs of patients in various therapeutic areas in the United States, Ireland, and internationally. Its marketed products include ARISTADA, an intramuscular injectable suspension for the treatment of schizophrenia; VIVITROL for the treatment of alcohol and prevention of opioid dependence; RISPERDAL CONSTA for the treatment of schizophrenia and bipolar I disorder; INVEGA SUSTENNA for the treatment of schizophrenia and schizoaffective disorder; XEPLION, INVEGA TRINZA, and TREVICTA to treat schizophrenia and schizoaffective; and VUMERITY for the treatment of relapsing forms of multiple sclerosis in adults, including clinically isolated syndrome, relapsing-remitting and active secondary progressive diseases. The company is also developing LYBALVI, an oral atypical antipsychotic drug candidate for the treatment of adults with schizophrenia and bipolar I disorder; and nemvaleukin alfa, an engineered fusion protein to expand tumor-killing immune cells and to avoid the activation of immunosuppressive cells. It has collaboration agreements primarily with Janssen Pharmaceutica N.V., Janssen Pharmaceutica Inc, and Janssen Pharmaceutica International. Alkermes plc was founded in 1987 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Richard F. Pops",
    "sector": "Healthcare",
    "country": "IE",
    "fullTimeEmployees": "2280",
    "phone": "353 1 772 8000",
    "address": "Connaught House",
    "city": "Dublin",
    "state": null,
    "zip": "4",
    "dcfDiff": 3.15445,
    "dcf": 25.8656,
    "image": "https://financialmodelingprep.com/image-stock/ALKS.png",
    "ipoDate": "1991-07-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]