[
  {
    "symbol": "ALL",
    "price": 108.86,
    "beta": 0.58345,
    "volAvg": 1919466,
    "mktCap": 28614068720,
    "lastDiv": 3.56,
    "range": "103.2-142.15",
    "changes": 0.22,
    "companyName": "The Allstate Corporation",
    "currency": "USD",
    "cik": "0000899051",
    "isin": "US0200021014",
    "cusip": "020002101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.allstate.com",
    "description": "The Allstate Corporation, together with its subsidiaries, provides property and casualty, and other insurance products in the United States and Canada. The company operates through Allstate Protection; Protection Services; Allstate Health and Benefits; and Run-off Property-Liability segments. The Allstate Protection segment offers private passenger auto and homeowners insurance; specialty auto products, including motorcycle, trailer, motor home, and off-road vehicle insurance; other personal lines products, such as renter, condominium, landlord, boat, umbrella, and manufactured home and stand-alone scheduled personal property; and commercial lines products under the Allstate and Encompass brand names. The Protection Services segment provides consumer product protection plans and related technical support for mobile phones, consumer electronics, furniture, and appliances; finance and insurance products, including vehicle service contracts, guaranteed asset protection waivers, road hazard tire and wheel, and paint and fabric protection; roadside assistance; device and mobile data collection services; data and analytic solutions using automotive telematics information; and identity protection services. This segment offers its products under various brands including Allstate Protection Plans, Allstate Dealer Services, Allstate Roadside Services, Arity, and Allstate Identity Protection. The Allstate Health and Benefits provides life, accident, critical illness, short-term disability, and other health insurance products. The Run-off Property-Liability offers property and casualty insurance. It sells its products through call centers, agencies, financial specialists, independent agents, brokers, wholesale partners, and affinity groups, as well as through online and mobile applications. The Allstate Corporation was founded in 1931 and is based in Northbrook, Illinois.",
    "ceo": "Mr. Thomas Joseph Wilson II",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "54000",
    "phone": "847 402 5000",
    "address": "2775 Sanders Road",
    "city": "Northbrook",
    "state": "IL",
    "zip": "60062",
    "dcfDiff": 8.84839,
    "dcf": 136.678,
    "image": "https://financialmodelingprep.com/image-stock/ALL.png",
    "ipoDate": "1993-06-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]