[
  {
    "symbol": "ALLE",
    "price": 118.16,
    "beta": 1.10176,
    "volAvg": 811103,
    "mktCap": 10391782545,
    "lastDiv": 1.8,
    "range": "87.33-123.46",
    "changes": -0.83,
    "companyName": "Allegion plc",
    "currency": "USD",
    "cik": "0001579241",
    "isin": "IE00BFRT3W74",
    "cusip": "G0176J109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Security & Protection Services",
    "website": "https://www.allegion.com",
    "description": "Allegion plc manufactures and sells mechanical and electronic security products and solutions worldwide. The company offers door closers, controls, and exit devices; locks, locksets, portable locks, and key systems and services; electronic security products and access control systems; time, attendance, and workforce productivity systems; doors and door systems; and other accessories. The company sells its products and solutions to end-users in commercial, institutional, and residential facilities, including education, healthcare, government, hospitality, commercial office, and single and multi-family residential markets under the CISA, Interflex, LCN, Schlage, SimonsVoss, and Von Duprin brands. It sells its products and solutions through distribution and retail channels, such as specialty distribution, e-commerce, and wholesalers, as well as through various retail channels comprising do-it-yourself home improvement centers, on-line and e-commerce platforms, and small specialty showroom outlets. Allegion plc was incorporated in 2013 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. John H. Stone",
    "sector": "Industrials",
    "country": "IE",
    "fullTimeEmployees": "12300",
    "phone": "353 1 254 6200",
    "address": "Iveagh Court",
    "city": "Dublin",
    "state": null,
    "zip": "D02 VH94",
    "dcfDiff": 2.66772,
    "dcf": 116.948,
    "image": "https://financialmodelingprep.com/image-stock/ALLE.png",
    "ipoDate": "2013-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]