[
  {
    "symbol": "ALNY",
    "price": 196.56,
    "beta": 0.478521,
    "volAvg": 668487,
    "mktCap": 24476830560,
    "lastDiv": 0,
    "range": "135.46-242.97",
    "changes": 7.76,
    "companyName": "Alnylam Pharmaceuticals, Inc.",
    "currency": "USD",
    "cik": "0001178670",
    "isin": "US02043Q1076",
    "cusip": "02043Q107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.alnylam.com",
    "description": "Alnylam Pharmaceuticals, Inc., a biopharmaceutical company, focuses on discovering, developing, and commercializing novel therapeutics based on ribonucleic acid interference. The company's pipeline of investigational RNAi therapeutics focuses on genetic medicines, cardio-metabolic diseases, hepatic infectious diseases, and central nervous system (CNS)/ocular diseases. Its marketed products include ONPATTRO (patisiran), a lipid complex injection for the treatment of the polyneuropathy of hereditary transthyretin-mediated amyloidosis in adults; GIVLAARI for the treatment of adults with acute hepatic porphyria (AHP); and OXLUMO (lumasiran) for the treatment of primary hyperoxaluria type 1 (PH1). In addition, the company is developing givosiran for the treatment of adolescent patients with AHP; patisiran for the treatment of transthyretin amyloidosis, or ATTR amyloidosis, with cardiomyopathy; cemdisiran to treat complement-mediated diseases; ALN-AAT02 for the treatment of AAT deficiency-associated liver disease; ALN-HBV02 to treat chronic HBV infection; Zilebesiran to treat hypertension; and ALN-HSD to treat NASH. Further, it offers Fitusiran for the treatment of hemophilia and rare bleeding disorders, Inclisiran to treat hypercholesterolemia, lumasiran for the treatment of advanced PH1 and recurrent renal stones, and vutrisiran for the treatment of ATTR amyloidosis, which is in phase 3 clinical trial. Alnylam Pharmaceuticals, Inc. has strategic collaborations with Regeneron Pharmaceuticals, Inc. to discover, develop, and commercialize RNAi therapeutics for a range of diseases by addressing therapeutic targets expressed in the eye and CNS; and Sanofi Genzyme to discover, develop, and commercialize RNAi therapeutics. It also has license and collaboration agreements with Novartis AG; Vir Biotechnology, Inc.; Dicerna Pharmaceuticals, Inc.; Ionis Pharmaceuticals, Inc.; and PeptiDream, Inc. The company was founded in 2002 and is headquartered in Cambridge, Massachusetts.",
    "ceo": "Dr. Yvonne L. Greenstreet M.B.A., MBA, MBChB",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "2002",
    "phone": "617 551 8200",
    "address": "675 West Kendall Street",
    "city": "Cambridge",
    "state": "MA",
    "zip": "02142",
    "dcfDiff": 17.5889,
    "dcf": 213.781,
    "image": "https://financialmodelingprep.com/image-stock/ALNY.png",
    "ipoDate": "2004-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]