[
  {
    "symbol": "ALPMY",
    "price": 15.17,
    "beta": 0.537164,
    "volAvg": 56391,
    "mktCap": 27256850171,
    "lastDiv": 0.44,
    "range": "12.82-16.91",
    "changes": 0.15,
    "companyName": "Astellas Pharma Inc.",
    "currency": "USD",
    "cik": null,
    "isin": "US04623U1025",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.astellas.com",
    "description": "Astellas Pharma Inc. engages in the manufacture, marketing, import, and export of pharmaceuticals worldwide. It provides XTANDI, an androgen receptor signaling inhibitor for prostate cancer; XOSPATA, a FLT3 inhibitor for adult patients with relapsed or refractory acute myeloid leukemia with a FLT3 mutation-positive; PADCEV, a treatment solution for adult patients with locally advanced or metastatic urothelial cancer; Betanis/Myrbetriq/BETMIGA, a beta-3 adrenergic receptor agonist for the treatment of urgency, urinary frequency, and urge urinary incontinence; Evrenzo, an oral treatment for anemia associated with chronic kidney disease; and Prograf and Advagraf/Graceptor/ASTAGRAF, which are immunosuppressants used to suppress organ rejection following a transplant. The company also offers mirabegron for the treatment of neurogenic detrusor overactivity in pediatric patients; Vesicare for OAB treatment; Eligard to treat prostate cancer; Harnal/Omnic for benign prostatic hyperplasia treatment; and Funguard/MYCAMINE, an antifungal agent. The company has a clinical trial collaboration with Merck & Co., Inc.; CytomX Therapeutics, Inc.; and an agreement with BANDAI NAMCO Entertainment Inc. for the development of smartphone exercise support application. It also has strategic research alliance with Harvard University for the research and development of therapeutics and technologies of mutual interest; research collaboration with Actinium Pharmaceuticals, Inc. to develop targeted radiotherapies using its Antibody Warhead Enabling technology platform, as well as agreement with Zenith Epigenetics Ltd. to evaluate ZEN-3694; and collaboration agreement with Cytokinetics, Incorporated. The company has a strategic collaboration and license agreement with Minovia Therapeutics Ltd. for the research, development, and commercialization of cell therapy programs for diseases caused by mitochondrial dysfunction. Astellas Pharma Inc. was founded in 1923 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Naoki  Okamura BSc",
    "sector": "Healthcare",
    "country": "JP",
    "fullTimeEmployees": "14522",
    "phone": "81 3 3244 3000",
    "address": "2-5-1, Nihonbashi-Honcho",
    "city": "Tokyo",
    "state": null,
    "zip": "103-8411",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ALPMY.png",
    "ipoDate": "2009-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]