[
  {
    "symbol": "ALRM",
    "price": 49.09,
    "beta": 1.019718,
    "volAvg": 242743,
    "mktCap": 2446616146,
    "lastDiv": 0,
    "range": "44.92-78.99",
    "changes": 0.02,
    "companyName": "Alarm.com Holdings, Inc.",
    "currency": "USD",
    "cik": "0001459200",
    "isin": "US0116421050",
    "cusip": "011642105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.alarm.com",
    "description": "Alarm.com Holdings, Inc. provides cloud-based solutions for smart residential and commercial properties in the United States and internationally. It operates in two segments, Alarm.com and Other. The company provides interactive security solutions to control and monitor their security systems, as well as connected security devices, including door locks, motion sensors, door locks, garage doors, Internet of Things, thermostats, and video cameras; and video monitoring solutions, such as video analytics, live streaming, video doorbell, video clips, video alerts, continuous high definition recording, and commercial video surveillance solutions. It also offers intelligent automation and energy management solutions comprising scenes button; smart thermostat schedules; responsive savings; precision comfort; energy usage monitoring; heating, ventilation, and air conditioning monitoring services; whole home water safety solutions; geo-services; and demand response programs. In addition, the company provides commercial solutions, such as daily safeguards, commercial grade video, energy savings, protection for valuables and inventory, temperature monitoring, multi-site management and access control, early identification, simple to use, professionally supported, and easy to maintain. Further, it offers service provider solutions, including a permission-based online portal that offers account management, sales, marketing, training, and support tools; sales, marketing, and training services; and home builder programs, as well as wellness solutions. The company serves residential and commercial subscribers. Alarm.com Holdings, Inc. was founded in 2000 and is based in Tysons, Virginia.",
    "ceo": "Mr. Stephen S. Trundle",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1858",
    "phone": "877 389 4033",
    "address": "8281 Greensboro Drive",
    "city": "Tysons",
    "state": "VA",
    "zip": "22102",
    "dcfDiff": 10.6838,
    "dcf": 63.4838,
    "image": "https://financialmodelingprep.com/image-stock/ALRM.png",
    "ipoDate": "2015-06-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]