[
  {
    "symbol": "ALSMY",
    "price": 2.98,
    "beta": 1.01954,
    "volAvg": 156156,
    "mktCap": 11355737334,
    "lastDiv": 0.02,
    "range": "1.5-3.05",
    "changes": 0.05,
    "companyName": "Alstom SA",
    "currency": "USD",
    "cik": "0001062066",
    "isin": "US0212442075",
    "cusip": "021244207",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Railroads",
    "website": "https://www.alstom.com",
    "description": "Alstom SA offers solutions for rail transport industry in Europe, the Americas, Asia and Pacific, the Middle East, and Africa. The company offers rolling stock solutions for people movers and monorails, light rails, metros, commuter trains, regional and intercity trains, high-speed trains, and locomotives; asset optimization, connectivity, digital passenger, and security and city mobility solutions; and signaling products, such as urban, mainline, and freight and mining signaling. It also provides tram, metro, and main line systems; and tracklaying and track solutions, catenary free and ground feeding solutions, electrification solutions, and electromechanical equipment. In addition, the company provides maintenance, modernization, parts and repair, and support services. Further, it offers various components, including bogies, motors and generators, switchgears, auxiliary converters, traction transformers, brake friction, components propulsion, train control and information systems, and dispen dampers. The company was incorporated in 1992 and is based in Saint-Ouen, France.",
    "ceo": "Mr. Henri  Poupart-Lafarge",
    "sector": "Industrials",
    "country": "FR",
    "fullTimeEmployees": "74513",
    "phone": "33 1 57 06 90 00",
    "address": "48, rue Albert Dhalenne",
    "city": "St Ouen",
    "state": null,
    "zip": "93400",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ALSMY.png",
    "ipoDate": "2010-04-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]