[
  {
    "symbol": "ALSN",
    "price": 55.58,
    "beta": 0.979929,
    "volAvg": 813922,
    "mktCap": 5060848016,
    "lastDiv": 0.92,
    "range": "32.63-56.19",
    "changes": -0.06,
    "companyName": "Allison Transmission Holdings, Inc.",
    "currency": "USD",
    "cik": "0001411207",
    "isin": "US01973R1014",
    "cusip": "01973R101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Auto Parts",
    "website": "https://www.allisontransmission.com",
    "description": "Allison Transmission Holdings, Inc., together with its subsidiaries, designs, manufactures, and sells commercial and defense fully-automatic transmissions for medium-and heavy-duty commercial vehicles, and medium-and heavy-tactical U.S. defense vehicles worldwide. It offers transmissions for various applications, including distribution, refuse, construction, fire, and emergency on-highway trucks; school and transit buses; motor homes; energy, mining, and construction off-highway vehicles and equipment; and wheeled and tracked defense vehicles. The company markets its transmissions under the Allison Transmission brand name; and remanufactured transmissions under the ReTran brand name. It also sells branded replacement parts, support equipment, aluminum die cast components, and other products necessary to service the installed base of vehicles utilizing its transmissions, as well as defense kits, engineering services, and extended transmission coverage services to various original equipment manufacturers, distributors, and the U.S. government. The company serves customers through an independent network of approximately 1,400 independent distributor and dealer locations. The company was formerly known as Clutch Holdings, Inc. Allison Transmission Holdings, Inc. was founded in 1915 and is headquartered in Indianapolis, Indiana.",
    "ceo": "Mr. David S. Graziosi",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "3500",
    "phone": "317 242 5000",
    "address": "One Allison Way",
    "city": "Indianapolis",
    "state": "IN",
    "zip": "46222-3271",
    "dcfDiff": 0.0671574,
    "dcf": 44.3628,
    "image": "https://financialmodelingprep.com/image-stock/ALSN.png",
    "ipoDate": "2012-03-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]