[
  {
    "symbol": "ALTR",
    "price": 74.41,
    "beta": 1.488732,
    "volAvg": 301058,
    "mktCap": 6005541436,
    "lastDiv": 1.8799999999999997,
    "range": "43.17-78.49",
    "changes": 0.82,
    "companyName": "Altair Engineering Inc.",
    "currency": "USD",
    "cik": "0001701732",
    "isin": "US0213691035",
    "cusip": "021369103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.altair.com",
    "description": "Altair Engineering Inc., together with its subsidiaries, provides software and cloud solutions in the areas of simulation, high-performance computing, data analytics, and artificial intelligence worldwide. The company operates in two segments, Software and Client Engineering Services. The Software segment includes solvers and optimization technology products, high-performance computing software applications and hardware products, modeling and visualization tools, data analytics and analysis products, and Internet of Things platform and analytics tools, as well as support and the complementary software products. This segment also offers software technologies in the areas of computational fluid dynamics and fatigue, manufacturing process simulation, and cost estimation for the applications in marine, motorcycle, aerospace, chemical, and architecture industries; and software-related services, such as consulting, implementation, and training services that focuses on the product design and development expertise and analysis from the component level up to complete product engineering at various stage of the lifecycle. The Client Engineering Services segment provides client engineering services. In addition, the company is involved in the development and sale of solid state lighting technology along with communication and control protocols based on its intellectual property for the direct replacement of fluorescent light tubes with LED lamps. Its integrated suite of software optimizes design performance across various disciplines, including structures, motion, fluids, thermal management, electromagnetics, system modeling, and embedded systems. The company's customers include universities, government agencies, manufacturers, pharmaceutical firms, banking, financial services, and insurance, weather prediction agencies, and electronics design companies. Altair Engineering Inc. was incorporated in 1985 and is headquartered in Troy, Michigan.",
    "ceo": "Mr. James R. Scapa",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3200",
    "phone": "248 614 2400",
    "address": "1820 East Big Beaver Road",
    "city": "Troy",
    "state": "MI",
    "zip": "48083",
    "dcfDiff": 1.81094,
    "dcf": 51.4491,
    "image": "https://financialmodelingprep.com/image-stock/ALTR.png",
    "ipoDate": "2017-11-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]