[
  {
    "symbol": "AMD",
    "price": 110.17,
    "beta": 1.911971,
    "volAvg": 67618391,
    "mktCap": 177413368251,
    "lastDiv": 0.005,
    "range": "54.57-132.83",
    "changes": -0.22,
    "companyName": "Advanced Micro Devices, Inc.",
    "currency": "USD",
    "cik": "0000002488",
    "isin": "US0079031078",
    "cusip": "007903107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.amd.com",
    "description": "Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides processors for desktop and notebook personal computers under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, AMD FX, AMD A-Series, and AMD PRO A-Series processors brands; discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics, AMD Embedded Radeon graphics brands; and professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands. It also offers Radeon Instinct, Radeon PRO V-series, and AMD Instinct accelerators for servers; chipsets under the AMD trademark; microprocessors for servers under the AMD EPYC; embedded processor solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment manufacturers, public cloud service providers, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. The company was incorporated in 1969 and is headquartered in Santa Clara, California.",
    "ceo": "Dr. Lisa T. Su Ph.D.",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "25000",
    "phone": "408 749 4000",
    "address": "2485 Augustine Drive",
    "city": "Santa Clara",
    "state": "CA",
    "zip": "95054",
    "dcfDiff": 0.839751,
    "dcf": 74.5602,
    "image": "https://financialmodelingprep.com/image-stock/AMD.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]