[
  {
    "symbol": "AMG",
    "price": 145.26,
    "beta": 1.342957,
    "volAvg": 226408,
    "mktCap": 5244161994,
    "lastDiv": 0.04,
    "range": "108.12-180.63",
    "changes": -0.92,
    "companyName": "Affiliated Managers Group, Inc.",
    "currency": "USD",
    "cik": "0001004434",
    "isin": "US0082521081",
    "cusip": "008252108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.amg.com",
    "description": "Affiliated Managers Group, Inc., through its affiliates, operates as an asset management company providing investment management services to mutual funds, institutional clients, and high net worth individuals in the United States. It provides advisory or subadvisory services to mutual funds. These funds are distributed to retail and institutional clients directly and through intermediaries, including independent investment advisors, retirement plan sponsors, broker-dealers, major fund marketplaces, and bank trust departments. The company also offers investment products in various investment styles in the institutional distribution channel, including small, small/mid, mid, and large capitalization value and growth equity, and emerging markets. In addition, it offers quantitative, alternative, and fixed income products, and manages assets for foundations and endowments, defined benefit, and defined contribution plans for corporations and municipalities. Affiliated Managers Group provides investment management or customized investment counseling and fiduciary services. Affiliated Managers Group, Inc. was formed in 1993 and is based in West Palm Beach, Florida with additional offices in Prides Crossing, Massachusetts; Stamford, Connecticut; London, United Kingdom; Dubai, United Arab Emirates; Sydney, Australia; Hong Kong; Tokyo, Japan, Zurich, Switzerland and Delaware.",
    "ceo": "Mr. Jay C. Horgen",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3950",
    "phone": "800-345-1100",
    "address": "777 South Flagler Drive",
    "city": "West Palm Beach",
    "state": "FL",
    "zip": "33401",
    "dcfDiff": 7.07396,
    "dcf": 174.884,
    "image": "https://financialmodelingprep.com/image-stock/AMG.png",
    "ipoDate": "1997-11-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]