[
  {
    "symbol": "AMGN",
    "price": 221.31,
    "beta": 0.642957,
    "volAvg": 2379012,
    "mktCap": 118251910140,
    "lastDiv": 8.52,
    "range": "211.71-296.67",
    "changes": -1.3,
    "companyName": "Amgen Inc.",
    "currency": "USD",
    "cik": "0000318154",
    "isin": "US0311621009",
    "cusip": "031162100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.amgen.com",
    "description": "Amgen Inc. discovers, develops, manufactures, and delivers human therapeutics worldwide. It focuses on inflammation, oncology/hematology, bone health, cardiovascular disease, nephrology, and neuroscience areas. The company's products include Enbrel to treat plaque psoriasis, rheumatoid arthritis, and psoriatic arthritis; Neulasta that reduces the chance of infection due a low white blood cell count in patients cancer; Prolia to treat postmenopausal women with osteoporosis; Xgeva for skeletal-related events prevention; Otezla for the treatment of adult patients with plaque psoriasis, psoriatic arthritis, and oral ulcers associated with Behçet's disease; Aranesp to treat a lower-than-normal number of red blood cells and anemia; KYPROLIS to treat patients with relapsed or refractory multiple myeloma; and Repatha, which reduces the risks of myocardial infarction, stroke, and coronary revascularization. It also markets Nplate, Vectibix, MVASI, Parsabiv, EPOGEN, KANJINTI, BLINCYTO, Aimovig, EVENITY, AMGEVITATM, Sensipar/Mimpara, NEUPOGEN, IMLYGIC, Corlanor, and AVSOLA. Amgen Inc. serves healthcare providers, including physicians or their clinics, dialysis centers, hospitals, and pharmacies. It distributes its products through pharmaceutical wholesale distributors, as well as direct-to-consumer channels. It has collaboration agreements with Novartis Pharma AG; UCB; Bayer HealthCare LLC; BeiGene, Ltd.; Eli Lilly and Company; Datos Health; and Verastem, Inc. to evaluate VS-6766 in combination with lumakrastm (Sotorasib) in patients with KRAS G12C-mutant non-small cell lung cancer. It has an agreement with Kyowa Kirin Co., Ltd. to jointly develop and commercialize KHK4083, a Phase 3-ready anti-OX40 fully human monoclonal antibody for the treatment of atopic dermatitis and other autoimmune diseases; and research and development collaboration with Neumora Therapeutics, Inc. and Plexium, Inc. Amgen Inc. was incorporated in 1980 and is headquartered in Thousand Oaks, California.",
    "ceo": "Mr. Robert A. Bradway",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "25200",
    "phone": "805 447 1000",
    "address": "One Amgen Center Drive",
    "city": "Thousand Oaks",
    "state": "CA",
    "zip": "91320-1799",
    "dcfDiff": 48.0507,
    "dcf": 301.701,
    "image": "https://financialmodelingprep.com/image-stock/AMGN.png",
    "ipoDate": "1983-06-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]