[
  {
    "symbol": "AMK",
    "price": 28.88,
    "beta": 1.034829,
    "volAvg": 142195,
    "mktCap": 2134930896,
    "lastDiv": 0,
    "range": "16.88-33.0",
    "changes": 0.69,
    "companyName": "AssetMark Financial Holdings, Inc.",
    "currency": "USD",
    "cik": "0001591587",
    "isin": "US04546L1061",
    "cusip": "04546L106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.assetmark.com",
    "description": "AssetMark Financial Holdings, Inc. provides wealth management and technology solutions in the United States. It offers an open-architecture product platform, as well as client advice, asset allocation options, practice management, support services, and technology to the financial adviser channel. The company provides integrated technology platform for advisers for accessing a range of automated processes, including new account opening, portfolio construction, streamlined financial planning, customer billing, investor reporting, progress to goal analysis, and client activity tracking; advisory services; and curated investment platform. It also offers SaaS-based financial planning, wellness, and client digital engagement solutions. The company also offers mutual funds; custodial recordkeeping services primarily to investor clients of registered investment advisers; and wealth management services for individual investors. It serves independent advisers who provide wealth management advice to the U.S. investors and advisers. The company was founded in 1996 and is headquartered in Concord, California. AssetMark Financial Holdings, Inc. operates as a subsidiary of Huatai International Investment Holdings Limited.",
    "ceo": "Ms. Natalie Grace Wolfsen",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "980",
    "phone": "925 521 2200",
    "address": "1655 Grant Street",
    "city": "Concord",
    "state": "CA",
    "zip": "94520",
    "dcfDiff": 1.30127,
    "dcf": 25.1787,
    "image": "https://financialmodelingprep.com/image-stock/AMK.png",
    "ipoDate": "2019-07-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]