[
  {
    "symbol": "AMKBY",
    "price": 8.77,
    "beta": 1.293103,
    "volAvg": 244530,
    "mktCap": 27314428521,
    "lastDiv": 3.14,
    "range": "8.01-15.31",
    "changes": 0.01,
    "companyName": "A.P. Møller - Mærsk A/S",
    "currency": "USD",
    "cik": null,
    "isin": "US00202F1021",
    "cusip": "00202F102",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Marine Shipping",
    "website": "https://www.maersk.com",
    "description": "A.P. Møller - Mærsk A/S operates as an integrated transport and logistics company worldwide. The company's Ocean segment engages in container shipping activities, including demurrage and detention, terminal handling, documentation and container services, and container storage, as well as transshipment services under Maersk Line, Safmarine, Sealand  A Maersk Company, Hamburg Süd, and APM Terminal brands; and sale of bunker oil. Its Logistics & Services segment offers sea and air freight forwarding, supply chain management, cold chain logistics, and custom services, services. The company's Terminals & Towage segment is involved in Gateway terminal activities, and offshore towage, salvage and related marine activities under APM Terminals brand. Its Manufacturing & Others segment engages in the production of reefer containers; anchor handling tug supply vessels and subsea support vessels, and training services to the maritime, oil and gas, offshore wind, and crane industries. The company was founded in 1904 and is based in Copenhagen, Denmark.",
    "ceo": "Mr. Vincent  Clerc",
    "sector": "Industrials",
    "country": "DK",
    "fullTimeEmployees": "110000",
    "phone": "45 33 63 33 63",
    "address": "Esplanaden 50",
    "city": "Copenhagen",
    "state": null,
    "zip": "1098",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AMKBY.png",
    "ipoDate": "2012-03-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]