[
  {
    "symbol": "AMKR",
    "price": 29.36,
    "beta": 1.744718,
    "volAvg": 908501,
    "mktCap": 7212019525,
    "lastDiv": 0.3,
    "range": "14.89-31.38",
    "changes": -0.01,
    "companyName": "Amkor Technology, Inc.",
    "currency": "USD",
    "cik": "0001047127",
    "isin": "US0316521006",
    "cusip": "031652100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://amkor.com",
    "description": "Amkor Technology, Inc. provides outsourced semiconductor packaging and test services in the United States, Japan, Europe, the Middle East, Africa, and the rest of the Asia Pacific. It offers turnkey packaging and test services, including semiconductor wafer bump, wafer probe, wafer back-grind, package design, packaging, and test and drop shipment services. The company also provides flip chip-scale package products for use in smartphones, tablets, and other mobile consumer electronic devices; flip-chip stacked chip-scale packages that are used to stack memory on top of digital baseband, and as applications processors in mobile devices; and flip-chip ball grid array packages for various networking, storage, computing, and consumer applications. In addition, it offers wafer-level CSP packages that are used in power management, transceivers, sensors, wireless charging, codecs, radar, and specialty silicon; wafer-level fan-out packages for use in ICs; and silicon wafer integrated fan-out technology, which replaces a laminate substrate with a thinner structure. Further, the company provides lead frame packages that are used in electronic devices for low to medium pin count analog and mixed-signal applications; substrate-based wirebond packages, which are used to connect a die to a substrate; micro-electro-mechanical systems (MEMS) packages that are miniaturized mechanical and electromechanical devices; and advanced system-in-package modules, which are used in radio frequency and front end modules, basebands, connectivity, fingerprint sensors, display and touch screen drivers, sensors and MEMS, and NAND memory and solid-state drives. It primarily serves integrated device manufacturers, fabless semiconductor companies, original equipment manufacturers, and contract foundries. Amkor Technology, Inc. was founded in 1968 and is headquartered in Tempe, Arizona.",
    "ceo": "Mr. Giel  Rutten",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "31300",
    "phone": "480 821 5000",
    "address": "2045 East Innovation Circle",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85284",
    "dcfDiff": 0.9828,
    "dcf": 30.6828,
    "image": "https://financialmodelingprep.com/image-stock/AMKR.png",
    "ipoDate": "1998-05-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]