[
  {
    "symbol": "AMN",
    "price": 107.58,
    "beta": 0.342605,
    "volAvg": 715412,
    "mktCap": 4265041374,
    "lastDiv": 0,
    "range": "81.15-129.04",
    "changes": 2.16,
    "companyName": "AMN Healthcare Services, Inc.",
    "currency": "USD",
    "cik": "0001142750",
    "isin": "US0017441017",
    "cusip": "001744101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Care Facilities",
    "website": "https://www.amnhealthcare.com",
    "description": "AMN Healthcare Services, Inc. provides healthcare workforce solutions and staffing services to hospitals and healthcare facilities in the United States. It operates through three segments: Nurse and Allied Solutions, Physician and Leadership Solutions, and Technology and Workforce Solutions. The Nurse and Allied Solutions segment offers travel nurse staffing, rapid response nurse staffing and labor disruption, allied staffing, local staffing, and revenue cycle solutions. The Physician and Leadership Solutions segment provides locum tenens staffing, healthcare interim leadership staffing, executive search, and physician permanent placement solutions. The Technology and Workforce Solutions segment offers language services, vendor management systems, workforce optimization, telehealth, credentialing, and outsourced solutions. The company also provides allied health professionals, such as physical therapists, respiratory therapists, occupational therapists, medical and radiology technologists, lab technicians, speech pathologists, rehabilitation assistants, and pharmacists. It offers its services under the brands, including American Mobile, Nursefinders, NurseChoice, HealthSource Global Staffing, Onward Healthcare, O'Grady Peyton International, Med Travelers, Club Staffing, Staff Care, B.E. Smith, and Merritt Hawkins, as well as AMN Revenue Cycle Solutions and AMN Language Services. The company was founded in 1985 and is based in Dallas, Texas.",
    "ceo": "Ms. Caroline Sullivan Grace",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "4230",
    "phone": "866 871 8519",
    "address": "8840 Cypress Waters Boulevard",
    "city": "Dallas",
    "state": "TX",
    "zip": "75019",
    "dcfDiff": 28.3238,
    "dcf": 124.644,
    "image": "https://financialmodelingprep.com/image-stock/AMN.png",
    "ipoDate": "2001-11-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]