[
  {
    "symbol": "AMP",
    "price": 325.39,
    "beta": 1.459507,
    "volAvg": 584182,
    "mktCap": 34256733810,
    "lastDiv": 5.4,
    "range": "219.99-357.46",
    "changes": -0.72,
    "companyName": "Ameriprise Financial, Inc.",
    "currency": "USD",
    "cik": "0000820027",
    "isin": "US03076C1062",
    "cusip": "03076C106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.ameriprise.com",
    "description": "Ameriprise Financial, Inc., through its subsidiaries, provides various financial products and services to individual and institutional clients in the United States and internationally. It operates through four segments: Advice & Wealth Management, Asset Management, Retirement & Protection Solutions, and Corporate & Other. The Advice & Wealth Management segment provides financial planning and advice; brokerage products and services for retail and institutional clients; discretionary and non-discretionary investment advisory accounts; mutual funds; insurance and annuities products; cash management and banking products; and face-amount certificates. The Asset Management segment offers investment management and advice, and investment products to retail, high net worth, and institutional clients through unaffiliated third-party financial institutions and institutional sales force. This segment products also include U.S. mutual funds and their non-U.S. equivalents, exchange-traded funds, variable product funds underlying insurance, and annuity separate accounts; and institutional asset management products, such as traditional asset classes, separately managed accounts, individually managed accounts, collateralized loan obligations, hedge funds, collective funds, and property and infrastructure funds. The Retirement & Protection Solutions segment provides variable annuity products to individual clients, as well as life and DI insurance products to retail clients. The company was formerly known as American Express Financial Corporation and changed its name to Ameriprise Financial, Inc. in September 2005. Ameriprise Financial, Inc. was founded in 1894 and is headquartered in Minneapolis, Minnesota.",
    "ceo": "Mr. James M. Cracchiolo",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "13500",
    "phone": "612 671 2052",
    "address": "55 Ameriprise Financial Center",
    "city": "Minneapolis",
    "state": "MN",
    "zip": "55474",
    "dcfDiff": 42.8627,
    "dcf": 387.313,
    "image": "https://financialmodelingprep.com/image-stock/AMP.png",
    "ipoDate": "2005-09-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]