[
  {
    "symbol": "AMPH",
    "price": 55.62,
    "beta": 0.76514,
    "volAvg": 445875,
    "mktCap": 2684999880,
    "lastDiv": 0,
    "range": "26.76-58.7",
    "changes": -0.52,
    "companyName": "Amphastar Pharmaceuticals, Inc.",
    "currency": "USD",
    "cik": "0001297184",
    "isin": "US03209R1032",
    "cusip": "03209R103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.amphastar.com",
    "description": "Amphastar Pharmaceuticals, Inc., a bio-pharmaceutical company, develops, manufactures, markets, and sells generic and proprietary injectable, inhalation, and intranasal products in the United States, China, and France. The company operates through two segments, Finished Pharmaceutical Products and API. It offers Primatene Mist, an over-the-counter epinephrine inhalation product for the temporary relief of mild symptoms of intermittent asthma; Enoxaparin, a low molecular weight heparin to prevent and treat deep vein thrombosis; Naloxone for opioid overdose; Glucagon for injection emergency kit; and Cortrosyn, a lyophilized powder for use as a diagnostic agent in the screening of patients with adrenocortical insufficiency. The company also provides Amphadase, a bovine-sourced hyaluronidase injection to absorb and disperse other injected drugs; Epinephrine injection for the emergency treatment of allergic reactions; lidocaine jelly, an anesthetic product for urological procedures; lidocaine topical solution for various procedures; phytonadione injection, a vitamin K1 injection for newborn babies; emergency syringe products for emergency use in hospital settings; morphine injection for use with patient controlled analgesia pumps; and lorazepam injection for surgery and medical procedures. In addition, it offers neostigmine methylsulfate injection to treat myasthenia gravis and to reverse the effects of muscle relaxants; and Isoproterenol hydrochloride injection for mild or transient episodes of heart block. Further, the company distributes recombinant human insulin active pharmaceutical ingredients (API) and porcine insulin API. It serves hospitals, care facilities, alternate care sites, clinics, and doctors' offices. The company was founded in 1996 and is headquartered in Rancho Cucamonga, California.",
    "ceo": "Dr. Yongfeng  Zhang Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "1615",
    "phone": "909 980 9484",
    "address": "11570 6th Street",
    "city": "Rancho Cucamonga",
    "state": "CA",
    "zip": "91730",
    "dcfDiff": 0.402124,
    "dcf": 30.9721,
    "image": "https://financialmodelingprep.com/image-stock/AMPH.png",
    "ipoDate": "2014-06-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]