[
  {
    "symbol": "AN",
    "price": 164.08,
    "beta": 1.092605,
    "volAvg": 608332,
    "mktCap": 7483426272,
    "lastDiv": 0.937,
    "range": "94.92-164.17",
    "changes": 4.61,
    "companyName": "AutoNation, Inc.",
    "currency": "USD",
    "cik": "0000350698",
    "isin": "US05329W1027",
    "cusip": "05329W102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Auto & Truck Dealerships",
    "website": "https://www.autonation.com",
    "description": "AutoNation, Inc., through its subsidiaries, operates as an automotive retailer in the United States. The company operates through three segments: Domestic, Import, and Premium Luxury. It offers a range of automotive products and services, including new and used vehicles; and parts and services, such as automotive repair and maintenance, and wholesale parts and collision services. The company also provides automotive finance and insurance products comprising vehicle services and other protection products, as well as arranges finance for vehicle purchases through third-party finance sources. As of December 31, 2021, it owned and operated 339 new vehicle franchises from 247 stores located primarily in metropolitan markets in the Sunbelt region. The company also owned and operated 57 AutoNation-branded collision centers, 9 AutoNation USA used vehicle stores, 4 AutoNation-branded automotive auction operations, and 3 parts distribution centers. AutoNation, Inc. was founded in 1991 and is headquartered in Fort Lauderdale, Florida.",
    "ceo": "Mr. Michael M. Manley",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "23600",
    "phone": "954 769 6000",
    "address": "200 SW 1st Avenue",
    "city": "Fort Lauderdale",
    "state": "FL",
    "zip": "33301",
    "dcfDiff": 2.35939,
    "dcf": 119.021,
    "image": "https://financialmodelingprep.com/image-stock/AN.png",
    "ipoDate": "1990-05-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]