[
  {
    "symbol": "ANET",
    "price": 155.86,
    "beta": 1.266901,
    "volAvg": 3394775,
    "mktCap": 47754725947,
    "lastDiv": 0,
    "range": "91.31-178.36",
    "changes": -0.27,
    "companyName": "Arista Networks, Inc.",
    "currency": "USD",
    "cik": "0001596532",
    "isin": "US0404131064",
    "cusip": "040413106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Computer Hardware",
    "website": "https://www.arista.com",
    "description": "Arista Networks, Inc. develops, markets, and sells cloud networking solutions in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. The company's cloud networking solutions consist of extensible operating systems, a set of network applications, as well as gigabit Ethernet switching and routing platforms. It also provides post contract customer support services, such as technical support, hardware repair and parts replacement beyond standard warranty, bug fix, patch, and upgrade services. The company serves a range of industries comprising internet companies, service providers, financial services organizations, government agencies, media and entertainment companies, and others. It markets and sells its products through distributors, system integrators, value-added resellers, and original equipment manufacturer partners, as well as through its direct sales force. The company was formerly known as Arastra, Inc. and changed its name to Arista Networks, Inc. in October 2008. Arista Networks, Inc. was incorporated in 2004 and is headquartered in Santa Clara, California.",
    "ceo": "Ms. Jayshree V. Ullal",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3612",
    "phone": "408 547 5500",
    "address": "5453 Great America Parkway",
    "city": "Santa Clara",
    "state": "CA",
    "zip": "95054",
    "dcfDiff": 10.5031,
    "dcf": 136.563,
    "image": "https://financialmodelingprep.com/image-stock/ANET.png",
    "ipoDate": "2014-06-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]