[
  {
    "symbol": "ANPDF",
    "price": 10.3,
    "beta": 0.940229,
    "volAvg": 6072,
    "mktCap": 29175986330,
    "lastDiv": 0.17,
    "range": "0.0-15.67",
    "changes": -0.21,
    "companyName": "ANTA Sports Products Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Leisure",
    "website": "https://www.anta.com",
    "description": "ANTA Sports Products Limited, together with its subsidiaries, designs, develops, manufactures, and markets sporting footwear, apparel, and accessories worldwide. The company offers sportswear, including running, cross-training, basketball, soccer, boxing, winter sports, boxing, taekwondo, gymnastics, weightlifting, wrestling, outdoor sports, women's fitness, and skiing products, as well as sports fashion clothing, kid's sports fashion clothing and sportswear, and leisure footwear products under the FILA, FILA KIDS, FILA FUSION, KINGKOW, KOLON SPORT, SPRANDI, FILA FUSION, ANTA, DESCENTE, and ANTA KIDS brands. It also provides management, product design, logistics, and information technology services; manufactures shoe soles; holds trademarks; and develops and manages properties. As of December 31, 2021, it operated 9,403 ANTA stores; 2,054 FILA stores; 182 DESCENTE stores; and 152 KOLON SPORT stores. It also exports and imports sporting shoes. The company was founded in 1991 and is headquartered in Jinjiang, the People's Republic of China. ANTA Sports Products Limited is a subsidiary of Anta International Group Holdings Limited.",
    "ceo": "Mr. Yonghua  Wu",
    "sector": "Consumer Cyclical",
    "country": "CN",
    "fullTimeEmployees": "59000",
    "phone": "86 595 8592 6666",
    "address": "Dongshan Industrial Zone",
    "city": "Jinjiang",
    "state": null,
    "zip": "362212",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ANPDF.png",
    "ipoDate": "2012-08-03",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]