[
  {
    "symbol": "ANSS",
    "price": 324.31,
    "beta": 1.244366,
    "volAvg": 458451,
    "mktCap": 28105124906,
    "lastDiv": 0,
    "range": "194.23-339.55",
    "changes": 0.99,
    "companyName": "ANSYS, Inc.",
    "currency": "USD",
    "cik": "0001013462",
    "isin": "US03662Q1058",
    "cusip": "03662Q105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.ansys.com",
    "description": "ANSYS, Inc. develops and markets engineering simulation software and services worldwide. It offers ANSYS Workbench, a framework upon which its multiphysics engineering simulation technologies are built and enables engineers to simulate the interactions between structures, heat transfer, fluids, electronics, and optical elements in a unified engineering simulation environment; high-performance computing product suite; power analysis and optimization software suite that manages the power budget, power delivery integrity, and power-induced noise in an electronic design; and structural analysis product suite that provides simulation tools for product design and optimization. The company also provides electronics product suite that offers field simulation software for designing electronic and electromechanical products; SCADE product suite, a solution for embedded software simulation, code production, and automated certification; fluids product suite that enables modeling of fluid flow and other related physical phenomena; Ansys Granta products to give access to material intelligence; photonic design and simulation tools; and optical sensor and closed-loop, and real-time simulation, as well as safety-certified embedded software solutions. In addition, the company provides Discovery product family for use in the simulation of product design; and academic product suite used in research and teaching settings, which allows students to become familiar with its simulation software. It serves engineers, designers, researchers, and students in the aerospace and defense, automotive transportation and mobility, construction, consumer products, energy, healthcare, high-tech, industrial equipment, materials and chemical processing, and sports industries. The company was founded in 1970 and is headquartered in Canonsburg, Pennsylvania.",
    "ceo": "Dr. Ajei S. Gopal Ph.D.",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "5900",
    "phone": "844 462 6797",
    "address": "2600 ANSYS Drive",
    "city": "Canonsburg",
    "state": "PA",
    "zip": "15317",
    "dcfDiff": 17.741,
    "dcf": 248.929,
    "image": "https://financialmodelingprep.com/image-stock/ANSS.png",
    "ipoDate": "1996-06-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]