[
  {
    "symbol": "AON",
    "price": 333.59,
    "beta": 0.895774,
    "volAvg": 831683,
    "mktCap": 68134423140,
    "lastDiv": 2.46,
    "range": "262.42-338.27",
    "changes": -0.05,
    "companyName": "Aon plc",
    "currency": "USD",
    "cik": "0000315293",
    "isin": "IE00BLP1HW54",
    "cusip": "G0403H108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance Brokers",
    "website": "https://www.aon.com",
    "description": "Aon plc, a professional services firm, provides advice and solutions to clients focused on risk, retirement, and health worldwide. It offers commercial risk solutions, including retail brokerage, cyber, and global risk consulting solutions, as well as acts as a captives management; and health solutions, such as health and benefits brokerages, and health care exchanges. The company also provides treaty and facultative reinsurance, as well as insurance-linked securities, capital raising, strategic advice, restructuring, and mergers and acquisitions services; and corporate finance advisory services and capital markets solutions products. In addition, it offers strategic design consulting services on their retirement programs, actuarial services, and risk management services; advice services on developing and maintaining investment programs across a range of plan types, including defined benefit plans, defined contribution plans, endowments, and foundations for public and private companies, and other institutions; and advice and solutions that help clients in risk, health, and wealth through commercial risk, reinsurance, health, and wealth solutions. Further, the company offers CoverWallet; Affinity; Aon Inpoint; CoverWallet; and ReView services. Aon plc was founded in 1919 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Gregory Clarence Case",
    "sector": "Financial Services",
    "country": "IE",
    "fullTimeEmployees": "50000",
    "phone": "353 1 266 6000",
    "address": "Metropolitan Building",
    "city": "Dublin",
    "state": null,
    "zip": "D01 K0Y8",
    "dcfDiff": 15.2662,
    "dcf": 304.034,
    "image": "https://financialmodelingprep.com/image-stock/AON.png",
    "ipoDate": "1980-06-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]