[
  {
    "symbol": "AOS",
    "price": 72.13,
    "beta": 1.264788,
    "volAvg": 1064890,
    "mktCap": 10851380955,
    "lastDiv": 1.2,
    "range": "46.58-72.69",
    "changes": -0.14,
    "companyName": "A. O. Smith Corporation",
    "currency": "USD",
    "cik": "0000091142",
    "isin": "US8318652091",
    "cusip": "831865209",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.aosmith.com",
    "description": "A. O. Smith Corporation manufactures and markets residential and commercial gas, heat pump and electric water heaters, boilers, tanks, and water treatment products in North America, China, Europe, and India. It operates through two segments, North America and Rest of World. The company offers water heaters for residences, restaurants, hotels and motels, office buildings, laundries, car washes, and small businesses; commercial boilers for hospitals, schools, hotels, and other large commercial buildings, as well as residential boilers for homes, apartments, and condominiums; and water treatment products comprising point-of-entry water softeners, well water solutions, and whole-home water filtration products, on-the-go filtration bottles, point-of-use carbon, and reverse osmosis products for residences, restaurants, hotels, and offices. It also provides food and beverage filtration products; expansion tanks, commercial solar water heating systems, swimming pool and spa heaters, and related products and parts; and heat pumps, electric wall-hung, gas tankless, combi-boiler, heat pump and solar water heaters. The company offers its products primarily under the A. O. Smith, State, Lochinvar, and water softener brands. It distributes its products through independent wholesale plumbing distributors, as well as through retail channels consisting of hardware and home center chains, and manufacturer representative firms; and offers Aquasana branded products directly to consumers through e-commerce, as well as other online retailers. A. O. Smith Corporation was founded in 1874 and is headquartered in Milwaukee, Wisconsin.",
    "ceo": "Mr. Kevin J. Wheeler",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "12000",
    "phone": "414 359 4000",
    "address": "11270 West Park Place",
    "city": "Milwaukee",
    "state": "WI",
    "zip": "53224-9508",
    "dcfDiff": 3.76626,
    "dcf": 64.1263,
    "image": "https://financialmodelingprep.com/image-stock/AOS.png",
    "ipoDate": "1983-09-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]