[
  {
    "symbol": "APD",
    "price": 291.32,
    "beta": 0.860563,
    "volAvg": 826295,
    "mktCap": 64708874691,
    "lastDiv": 7,
    "range": "218.88-328.56",
    "changes": -0.09,
    "companyName": "Air Products and Chemicals, Inc.",
    "currency": "USD",
    "cik": "0000002969",
    "isin": "US0091581068",
    "cusip": "009158106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.airproducts.com",
    "description": "Air Products and Chemicals, Inc. provides atmospheric gases, process and specialty gases, equipment, and services worldwide. The company produces atmospheric gases, including oxygen, nitrogen, and argon; process gases, such as hydrogen, helium, carbon dioxide, carbon monoxide, syngas; specialty gases; and equipment for the production or processing of gases comprising air separation units and non-cryogenic generators for customers in various industries, including refining, chemical, gasification, metals, manufacturing, food and beverage, electronics, magnetic resonance imaging, energy production and refining, and metals. It also designs and manufactures equipment for air separation, hydrocarbon recovery and purification, natural gas liquefaction, and liquid helium and liquid hydrogen transport and storage. Air Products and Chemicals, Inc. has a strategic collaboration with Baker Hughes Company to develop hydrogen compression systems. The company was founded in 1940 and is headquartered in Allentown, Pennsylvania.",
    "ceo": "Mr. Seifollah  Ghasemi",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "19710",
    "phone": "610 481 4911",
    "address": "1940 Air Products Boulevard",
    "city": "Allentown",
    "state": "PA",
    "zip": "18106-5500",
    "dcfDiff": 2.34493,
    "dcf": 316.495,
    "image": "https://financialmodelingprep.com/image-stock/APD.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]