[
  {
    "symbol": "APEMY",
    "price": 33.92,
    "beta": 2.008045,
    "volAvg": 274,
    "mktCap": 2448470968,
    "lastDiv": 2.14,
    "range": "24.2-40.99",
    "changes": 0.18,
    "companyName": "Aperam S.A.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Steel",
    "website": "https://www.aperam.com",
    "description": "Aperam S.A., together with its subsidiaries, engages in the production and sale of stainless and specialty steel products worldwide. It operates through three segments: Stainless & Electrical Steel; Services & Solutions; and Alloys & Specialties. The company offers range of stainless steel products, including grain oriented and non-grain oriented electrical steel products, and specialty alloys. It is also involved in the distribution of its products; and the provision of transformation services that include value added and customized steel solutions. In addition, the company designs, produces, and transforms various specialty alloys and other specific stainless steels in forms, such as bars, semis, cold-rolled strips, wire and wire rods, and plates in a range on grades. It serves customers in aerospace, automotive, catering, construction, household appliances, electrical engineering, industrial processes, medical, and oil and gas industries. The company distributes its products through a network of service centers, transformation facilities, and sales offices. Aperam S.A. was incorporated in 2010 and is headquartered in Luxembourg City, Luxembourg.",
    "ceo": "Mr. Frederic  Mattei",
    "sector": "Basic Materials",
    "country": "LU",
    "fullTimeEmployees": "10700",
    "phone": "352 27 36 27 00",
    "address": "24-26 Boulevard d’Avranches",
    "city": "Luxembourg City",
    "state": null,
    "zip": "1160",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/APEMY.png",
    "ipoDate": "2011-01-31",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]