[
  {
    "symbol": "APG",
    "price": 26.62,
    "beta": 1.492253,
    "volAvg": 1031890,
    "mktCap": 6261369847,
    "lastDiv": 0,
    "range": "13.09-26.8",
    "changes": 0.35,
    "companyName": "APi Group Corporation",
    "currency": "USD",
    "cik": "0001796209",
    "isin": "US00187Y1001",
    "cusip": "00187Y100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Engineering & Construction",
    "website": "https://www.apigroupinc.com",
    "description": "APi Group Corporation provides safety, specialty, and industrial services in North America, Europe, Australia, and the Asian-Pacific. It operates through three segments: Safety Services, Specialty Services, and Industrial Services. The Safety Services segment offers safety solutions focusing on end-to-end integrated occupancy systems, such as fire protection solutions; heating, ventilation, and air conditioning solutions; and entry systems, which include the design, installation, inspection, monitoring, and service of these integrated systems. The Specialty Services segment provides infrastructure and specialized industrial plant services, including maintenance and repair of underground electric, gas, water, sewer, and telecommunications infrastructure. This segment also offers engineering and design, fabrication, installation, and retrofitting and upgrading services. The Industrial Services segment provides various services and solutions comprising pipeline infrastructure, access and road construction, supporting facilities, and integrity management and maintenance to the energy industry focused on transmission and distribution. It serves customers in the public and private sectors, including commercial, industrial, fulfillment centers, distribution, manufacturing, education, healthcare, telecom, transmission, utilities, high tech, entertainment, retail, financial services, and governmental markets. The company was formerly known as J2 Acquisition Limited and changed its name to APi Group Corporation in October 2019. APi Group Corporation was founded in 1926 and is headquartered in New Brighton, Minnesota.",
    "ceo": "Mr. Russell A. Becker",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "26000",
    "phone": "651 636 4320",
    "address": "1100 Old Highway 8 NW",
    "city": "New Brighton",
    "state": "MN",
    "zip": "55112",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/APG.png",
    "ipoDate": "2020-04-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]