[
  {
    "symbol": "APH",
    "price": 82.52,
    "beta": 1.238028,
    "volAvg": 2936404,
    "mktCap": 49125721900,
    "lastDiv": 0.84,
    "range": "61.78-82.86",
    "changes": 0.28,
    "companyName": "Amphenol Corporation",
    "currency": "USD",
    "cik": "0000820313",
    "isin": "US0320951017",
    "cusip": "032095101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electronic Components",
    "website": "https://www.amphenol.com",
    "description": "Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.",
    "ceo": "Mr. Richard Adam Norwitt",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "91000",
    "phone": "203 265 8900",
    "address": "358 Hall Avenue",
    "city": "Wallingford",
    "state": "CT",
    "zip": "06492",
    "dcfDiff": 2.87284,
    "dcf": 81.5228,
    "image": "https://financialmodelingprep.com/image-stock/APH.png",
    "ipoDate": "1991-11-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]