[
  {
    "symbol": "APLS",
    "price": 92.32,
    "beta": 1.245422,
    "volAvg": 1737054,
    "mktCap": 10751310240,
    "lastDiv": 0,
    "range": "42.15-94.75",
    "changes": 5.9,
    "companyName": "Apellis Pharmaceuticals, Inc.",
    "currency": "USD",
    "cik": "0001492422",
    "isin": "US03753U1060",
    "cusip": "03753U106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.apellis.com",
    "description": "Apellis Pharmaceuticals, Inc., a commercial-stage biopharmaceutical company, focuses on the discovery, development, and commercialization of therapeutic compounds through the inhibition of the complement system for autoimmune and inflammatory diseases. The company's lead product candidate is pegcetacoplan that is in Phase III clinical trials for the treatment of geographic atrophy (GA) in age-related macular degeneration and paroxysmal nocturnal hemoglobinuria (PNH) diseases. It also develops EMPAVELI (systemic pegcetacoplan) for the treatment of cold agglutinin disease (CAD), and hematopoietic stem cell transplantation-associated thrombotic microangiopathy (HSCT-TMA) in hematology; C3 glomerulopathy (C3G), and immune complex membranoproliferative glomerulonephritis (IC-MPGN) in nephrology; and amyotrophic lateral sclerosis (ALS) in neurology. In addition, the company develops APL-2006, a bispecific C3 and VEGF inhibitor for treating complement-mediated disorders; APL-1030, a C3 inhibitor for the treatment of multiple neurodegenerative diseases; and the combination of EMPAVELI and a small interfering RNA, or siRNA for reducing the production of C3 proteins by the liver. It has a collaboration and license agreement with Swedish Orphan Biovitrum AB (publ) to co-develop pegcetacoplan; and a research collaboration with Beam Therapeutics Inc. focused on the use of Beam's base editing technology to discover new treatments for complement-driven diseases. Apellis Pharmaceuticals, Inc. was incorporated in 2009 and is based in Waltham, Massachusetts.",
    "ceo": "Dr. Cedric  Francois M.D., Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "767",
    "phone": "617 977 5700",
    "address": "100 Fifth Avenue",
    "city": "Waltham",
    "state": "MA",
    "zip": "02451",
    "dcfDiff": 3.97738,
    "dcf": 56.7474,
    "image": "https://financialmodelingprep.com/image-stock/APLS.png",
    "ipoDate": "2017-11-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]