[
  {
    "symbol": "APPF",
    "price": 169.41,
    "beta": 0.955633,
    "volAvg": 115895,
    "mktCap": 6011649209,
    "lastDiv": 0,
    "range": "86.72-178.1",
    "changes": 2.37,
    "companyName": "AppFolio, Inc.",
    "currency": "USD",
    "cik": "0001433195",
    "isin": "US03783C1009",
    "cusip": "03783C100",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.appfolioinc.com",
    "description": "AppFolio, Inc., together with its subsidiaries, provides cloud business management solutions for the real estate industry. The company offers AppFolio Property Manager, a platform to leverage process automation, easy to use interface, and the optimization of common workflows for property management companies, as well as completes and records critical transactions in the system and give its customers access to the data they need to run their business; AppFolio Property Manager Plus, which offers customizable workflows that allow customers to digitize their existing processes, performance insights, intelligent revenue management, and integrations through selected partners and dedicated strategic account managers; and AppFolio Investment Management, a solution that is designed to enable real estate investment management organizations to manage investor relationships through enhancing transparency and streamlining certain business processes. It also provides value added services that are designed to enhance, automate, and streamline processes and workflows for property management businesses, such as electronic payment, tenant screening, and insurance services. AppFolio, Inc. was incorporated in 2006 and is headquartered in Santa Barbara, California.",
    "ceo": "Mr. Shane  Trigg",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1785",
    "phone": "805 364 6093",
    "address": "50 Castilian Drive",
    "city": "Santa Barbara",
    "state": "CA",
    "zip": "93117",
    "dcfDiff": 10.8498,
    "dcf": 116.86,
    "image": "https://financialmodelingprep.com/image-stock/APPF.png",
    "ipoDate": "2015-06-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]