[
  {
    "symbol": "APTV",
    "price": 101.17,
    "beta": 2.016901,
    "volAvg": 2117556,
    "mktCap": 27367090401,
    "lastDiv": 5.731119999999999,
    "range": "77.96-124.88",
    "changes": 0.63,
    "companyName": "Aptiv PLC",
    "currency": "USD",
    "cik": "0001521332",
    "isin": "JE00B783TY65",
    "cusip": "G6095L109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Auto Parts",
    "website": "https://www.aptiv.com",
    "description": "Aptiv PLC designs, manufacturers, and sells vehicle components worldwide. The company provides electrical, electronic, and safety technology solutions to the automotive and commercial vehicle markets. It operates in two segment, Signal and Power Solutions, and Advanced Safety and User Experience. The Signal and Power Solutions segment designs, manufactures, and assembles vehicle's electrical architecture, including engineered component products, connectors, wiring assemblies and harnesses, cable management products, electrical centers, and hybrid high voltage and safety distribution systems. The Advanced Safety and User Experience segment provides critical components, systems integration, and software development for vehicle safety, security, comfort, and convenience, such as sensing and perception systems, electronic control units, multi-domain controllers, vehicle connectivity systems, application software, and autonomous driving technologies. The company was formerly known as Delphi Automotive PLC and changed its name to Aptiv PLC in December 2017. Aptiv PLC was founded in 2011 and is based in Dublin, Ireland.",
    "ceo": "Mr. Kevin P. Clark",
    "sector": "Consumer Cyclical",
    "country": "IE",
    "fullTimeEmployees": "160000",
    "phone": "353 1 259 7013",
    "address": "5 Hanover Quay",
    "city": "Dublin",
    "state": null,
    "zip": "D02 VY79",
    "dcfDiff": 6.84586,
    "dcf": 117.436,
    "image": "https://financialmodelingprep.com/image-stock/APTV.png",
    "ipoDate": "2011-11-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]