[
  {
    "symbol": "AQN",
    "price": 8.25,
    "beta": 0.265031,
    "volAvg": 5451972,
    "mktCap": 5681486448,
    "lastDiv": 0.43,
    "range": "6.41-14.65",
    "changes": -0.02,
    "companyName": "Algonquin Power & Utilities Corp.",
    "currency": "USD",
    "cik": "0001174169",
    "isin": "CA0158571053",
    "cusip": "015857105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Renewable",
    "website": "https://algonquinpower.com",
    "description": "Algonquin Power & Utilities Corp., through its subsidiaries, owns and operates a portfolio of regulated and non-regulated generation, distribution, and transmission utility assets. The company operates through two segments, Regulated Services Group and Renewable Energy Group. The Regulated Services Group segment operates a portfolio of rate-regulated utilities located in the United States, Canada, Chile, and Bermuda. Its utilities provide distribution services to approximately 1,093,000 customer connections in the electric, natural gas, and water and wastewater sectors The Renewable Energy Group segment generates and sells electrical energy, capacity, ancillary products, and renewable attributes produced by its portfolio of renewable and clean power generation facilities primarily in the United States and Canada. It owns and operates hydroelectric, wind, solar, and thermal facilities; and owns and operates a portfolio of clean energy and water infrastructure assets. The company was incorporated in 1988 and is headquartered in Oakville, Canada.",
    "ceo": "Mr. Arun  Banskota",
    "sector": "Utilities",
    "country": "CA",
    "fullTimeEmployees": "3951",
    "phone": "19054654500",
    "address": "354 Davis Road",
    "city": "Oakville",
    "state": "ON",
    "zip": "L6J 2X1",
    "dcfDiff": 0.521763,
    "dcf": 7.82176,
    "image": "https://financialmodelingprep.com/image-stock/AQN.png",
    "ipoDate": "2009-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]