[
  {
    "symbol": "ARCAY",
    "price": 40.9,
    "beta": 1.214176,
    "volAvg": 45,
    "mktCap": 3663543880,
    "lastDiv": 0.8,
    "range": "32.26-45.95",
    "changes": -3.8,
    "companyName": "Arcadis NV",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Engineering & Construction",
    "website": "https://www.arcadis.com",
    "description": "Arcadis NV operates as a design and consultancy firm for natural and built assets worldwide. The company operates through four segments: Europe & Middle East, The Americas, Asia Pacific, and CallisonRTKL. It offers architectural based design consultancy services; and asset management services, such as asset management strategy and planning, asset management decision making and operational optimization, life cycle planning and asset management systems, asset information/condition assessment, risk and review, organization and people, and asset management/O&M. The company also provides business advisory services, including asset strategy and performance, business transformation and resiliency, investment and finance, operations and maintenance, and technology and information; cost and commercial management services; and design and engineering solutions for highways, railways, bridges, tunnels, power utilities, water utilities, ports and waterways, geotechnics, architecture, and structures, as well as building mechanical, electrical, and plumbing. In addition, it offers digital environmental health safety and sustainability, environmental restoration, and project management solutions. Further, the company provides mobility solutions for connected highways, intelligent rail and transit, integrated airports, and new mobility; places solutions; resilience solutions, including climate adaption, energy transition, enviro socio permitting, environmental restoration, sustainable advisory, sustainable operations, and water optimization; and water supply and treatment, distribution, resource management, and industrial water and wastewater services. It serves industrial manufacturing, technology, property and investment, contractors, and energy and resources sectors. The company was formerly known as Heidemij NV and changed its name to Arcadis N.V. in October 1997. Arcadis NV was founded in 1888 and is headquartered in Amsterdam, the Netherlands.",
    "ceo": "Mr. Alan G. Brookes B.Sc., BSc, FRICS",
    "sector": "Industrials",
    "country": "NL",
    "fullTimeEmployees": "31552",
    "phone": "31 88 426 1261",
    "address": "Gustav Mahlerplein 97-103",
    "city": "Amsterdam",
    "state": null,
    "zip": "1082 MS",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ARCAY.png",
    "ipoDate": "1993-12-30",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]