[
  {
    "symbol": "ARCC",
    "price": 18.62,
    "beta": 1.05845,
    "volAvg": 2998879,
    "mktCap": 10140098071,
    "lastDiv": 1.92,
    "range": "16.53-20.75",
    "changes": 0.34,
    "companyName": "Ares Capital Corporation",
    "currency": "USD",
    "cik": "0001287750",
    "isin": "US04010L1035",
    "cusip": "04010L103",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Asset Management",
    "website": "https://www.arescapitalcorp.com",
    "description": "Ares Capital Corporation is a business development company specializing in acquisition, recapitalization, mezzanine debt, restructurings, rescue financing, and leveraged buyout transactions of middle market companies. It also makes growth capital and general refinancing. It prefers to make investments in companies engaged in the basic and growth manufacturing, business services, consumer products, health care products and services, and information technology service sectors. The fund will also consider investments in industries such as restaurants, retail, oil and gas, and technology sectors. It focuses on investments in Northeast, Mid-Atlantic, Southeast and Southwest regions from its New York office, the Midwest region, from the Chicago office, and the Western region from the Los Angeles office. The fund typically invests between $20 million and $200 million and a maximum of $400 million in companies with an EBITDA between $10 million and $250 million. It makes debt investments between $10 million and $100 million The fund invests through revolvers, first lien loans, warrants, unitranche structures, second lien loans, mezzanine debt, private high yield, junior capital, subordinated debt, and non-control preferred and common equity. The fund also selectively considers third-party-led senior and subordinated debt financings and opportunistically considers the purchase of stressed and discounted debt positions. The fund prefers to be an agent and/or lead the transactions in which it invests. The fund also seeks board representation in its portfolio companies.",
    "ceo": "Mr. Robert Kipp DeVeer III",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1200",
    "phone": "310 201 4100",
    "address": "2000 Avenue of the Stars",
    "city": "Los Angeles",
    "state": "CA",
    "zip": "90067",
    "dcfDiff": 26.7193,
    "dcf": 46.3593,
    "image": "https://financialmodelingprep.com/image-stock/ARCC.png",
    "ipoDate": "2004-10-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]