[
  {
    "symbol": "ARCH",
    "price": 111.55,
    "beta": 0.70669,
    "volAvg": 469983,
    "mktCap": 2083095855,
    "lastDiv": 3.2,
    "range": "102.42-173.9",
    "changes": -0.9,
    "companyName": "Arch Resources, Inc.",
    "currency": "USD",
    "cik": "0001037676",
    "isin": "US03940R1077",
    "cusip": "03940R107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Thermal Coal",
    "website": "https://www.archrsc.com",
    "description": "Arch Resources, Inc. produces and sells thermal and metallurgical coal from surface and underground mines. As of December 31, 2021, the company operated seven active mines. It also owned or controlled primarily through long-term leases approximately 28,292 acres of coal land in Ohio; 952 acres of coal land in Maryland; 10,095 acres of coal land in Virginia; 306,033 acres of coal land in West Virginia; 81,470 acres of coal land in Wyoming; 234,543 acres of coal land in Illinois; 33,047 acres of coal land in Kentucky; 362 acres of coal land in Montana; 248 acres of coal land in Pennsylvania; and 19,018 acres of coal land in Colorado, as well as smaller parcels of property in Alabama, Indiana, Washington, Arkansas, California, Utah, and Texas. The company sells its products to utility, industrial, and steel producers in the United States, Europe, Asia, Central and South America, and Africa. The company was formerly known as Arch Coal, Inc. and changed its name to Arch Resources, Inc. in May 2020. Arch Resources, Inc. was incorporated in 1969 and is headquartered in St. Louis, Missouri.",
    "ceo": "Mr. Paul A. Lang",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "3404",
    "phone": "314 994 2700",
    "address": "1 CityPlace Drive",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63141",
    "dcfDiff": 28.5607,
    "dcf": 175.791,
    "image": "https://financialmodelingprep.com/image-stock/ARCH.png",
    "ipoDate": "2016-10-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]