[
  {
    "symbol": "ARE",
    "price": 112.53,
    "beta": 0.949295,
    "volAvg": 991058,
    "mktCap": 19469265420,
    "lastDiv": 4.96,
    "range": "108.81-172.65",
    "changes": -3.35,
    "companyName": "Alexandria Real Estate Equities, Inc.",
    "currency": "USD",
    "cik": "0001035443",
    "isin": "US0152711091",
    "cusip": "015271109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "REIT—Office",
    "website": "https://www.are.com",
    "description": "Alexandria Real Estate Equities, Inc. (NYSE:ARE), an S&P 500<sup>®</sup> urban office real estate investment trust (\"REIT\"), is the first, longest-tenured, and pioneering owner, operator, and developer uniquely focused on collaborative life science, technology, and agtech campuses in AAA innovation cluster locations, with a total market capitalization of $31.9 billion as of December 31, 2020, and an asset base in North America of 49.7 million square feet (\"SF\"). The asset base in North America includes 31.9 million RSF of operating properties and 3.3 million RSF of Class A properties undergoing construction, 7.1 million RSF of near-term and intermediate-term development and redevelopment projects, and 7.4 million SF of future development projects. Founded in 1994, Alexandria pioneered this niche and has since established a significant market presence in key locations, including Greater Boston, San Francisco, New York City, San Diego, Seattle, Maryland, and Research Triangle. Alexandria has a longstanding and proven track record of developing Class A properties clustered in urban life science, technology, and agtech campuses that provide our innovative tenants with highly dynamic and collaborative environments that enhance their ability to successfully recruit and retain world-class talent and inspire productivity, efficiency, creativity, and success. Alexandria also provides strategic capital to transformative life science, technology, and agtech companies through our venture capital platform. We believe our unique business model and diligent underwriting ensure a high-quality and diverse tenant base that results in higher occupancy levels, longer lease terms, higher rental income, higher returns, and greater long-term asset value.",
    "ceo": "Mr. Peter M. Moglia",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "593",
    "phone": "626-578-0777",
    "address": "26 North Euclid Avenue",
    "city": "Pasadena",
    "state": "CA",
    "zip": "91101",
    "dcfDiff": 8.01327,
    "dcf": 152.667,
    "image": "https://financialmodelingprep.com/image-stock/ARE.png",
    "ipoDate": "1997-05-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]