[
  {
    "symbol": "ARGX",
    "price": 384.68,
    "beta": 0.468582,
    "volAvg": 212537,
    "mktCap": 21418251508,
    "lastDiv": 0,
    "range": "333.07-423.991",
    "changes": 4.68,
    "companyName": "argenx SE",
    "currency": "USD",
    "cik": "0001697862",
    "isin": "US04016X1019",
    "cusip": "04016X101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.argenx.com",
    "description": "argenx SE, a biotechnology company, focuses on developing various therapies for the treatment of autoimmune diseases in the United States, the Netherlands, Belgium, Japan, Switzerland, Germany and France. Its lead product candidate is efgartigimod for the treatment of patients with myasthenia gravis, immune thrombocytopenia, pemphigus vulgaris, and chronic inflammatory demyelinating polyneuropathy in Phase III clinical trials; bullous pemphigoid and idiopathic inflammatory myopathy in Phase II/III clinical trials; and ENHANZE SC in Pre-clinical study. The company is also developing immunology innovation programs, including cusatuzumab for hematological cancer, as well as high risk MDS; ARGX-119, an antibody that targets muscle-specific tyrosine kinase stage; ARGX-117 for severe autoimmune indications; ARGX-118 for airway inflammation; and ARGX-120 to treat autoimmune diseases. In addition, its partnered product candidates include ARGX-115 for the treatment of cancer; ARGX-112 to treat interleukin-22 receptor; and ARGX-114, an antibody directed against the MET receptor. The company has strategic partnership with AbbVie S.À.R.L., Zai Lab Limited, and LEO Pharma A/S; and collaboration and license agreement with Genor Biopharma Co. Ltd, Université Catholique de Louvain, Sopartec S.A., NYU Langone Health, Leiden University Medical Center, AgomAb Therapeutics NV, Broteio Pharma B.V., University of Texas, BioWa, Inc., Cilag GmbH International, Staten Biotechnology B.V., and Shire International GmbH. argenx SE was incorporated in 2008 and is based in Breda, the Netherlands.",
    "ceo": "Mr. Timothy  Van Hauwermeiren EMBA, M.B.A., M.Sc., MSc",
    "sector": "Healthcare",
    "country": "NL",
    "fullTimeEmployees": "843",
    "phone": "31 10 703 8441",
    "address": "Willemstraat 5",
    "city": "Breda",
    "state": null,
    "zip": "4811 AH",
    "dcfDiff": 19.5813,
    "dcf": 400.481,
    "image": "https://financialmodelingprep.com/image-stock/ARGX.png",
    "ipoDate": "2017-05-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]