[
  {
    "symbol": "ARKAY",
    "price": 92.01,
    "beta": 1.290804,
    "volAvg": 2741,
    "mktCap": 6859888727,
    "lastDiv": 3.68,
    "range": "67.88-105.58",
    "changes": 1.13,
    "companyName": "Arkema S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US0412321095",
    "cusip": "041232109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Chemicals",
    "website": "https://www.arkema.com",
    "description": "Arkema S.A. manufactures and sells specialty chemicals and advanced materials worldwide. The company operates through Adhesive Solutions, Advanced Materials, Coating Solutions, and Intermediates segments. It provides adhesive solutions for construction, renovation of buildings, DIY, durable goods, and packaging and non-woven applications; and supplies technologies used in building activities for businesses and individuals, including sealants, tiles, flooring adhesives and waterproofing systems, and technologies used in industry, which include automotive, textiles, glazing, flexible and rigid packaging, and hygiene markets. The company also offers advanced materials consisting of specialty polyamides and polyvinylidene fluoride; and performance additives, such as specialty surfactants and molecular sieves, organic peroxides, thiochemicals, and hydrogen peroxide for use in automotive and transportation, oil and gas, renewable energies, consumer goods, electronics, construction, coatings, animal nutrition, and water treatment sectors. In addition, it provides coating solutions comprising EU/US acrylics and coating resins; sartomer photocure resins and coatex rheology additives; decorative paints, industrial coatings, and adhesives; and solutions for applications in the paper, superabsorbents, water treatment and oil and gas extraction, and 3D printing and electronics industries. Further, the company offers fluorogases and acrylics; and industrial intermediate chemicals used in construction, refrigeration and air conditioning, automotive, coatings, and water treatment sectors. Arkema S.A. was incorporated in 2003 and is headquartered in Colombes, France.",
    "ceo": "Mr. Thierry  Le Henaff",
    "sector": "Basic Materials",
    "country": "FR",
    "fullTimeEmployees": "21100",
    "phone": "33 1 49 00 74 63",
    "address": "420 rue d'Estienne d'Orves",
    "city": "Colombes",
    "state": null,
    "zip": "92700",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ARKAY.png",
    "ipoDate": "2006-05-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]