[
  {
    "symbol": "ARLP",
    "price": 17.87,
    "beta": 1.392253,
    "volAvg": 454845,
    "mktCap": 2272974650,
    "lastDiv": 2.8,
    "range": "17.05-27.63",
    "changes": -0.16,
    "companyName": "Alliance Resource Partners, L.P.",
    "currency": "USD",
    "cik": "0001086600",
    "isin": "US01877R1086",
    "cusip": "01877R108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Thermal Coal",
    "website": "https://www.arlp.com",
    "description": "Alliance Resource Partners, L.P., a diversified natural resource company, produces and markets coal primarily to utilities and industrial users in the United States. The company operates through four segments: Illinois Basin Coal Operations, Appalachia Coal Operations, Oil & Gas Royalties, and Coal Royalties. It produces a range of thermal and metallurgical coal with sulfur and heat contents. The company operates seven underground mining complexes in Illinois, Indiana, Kentucky, Maryland, Pennsylvania, and West Virginia. In addition, it leases land and operates a coal loading terminal on the Ohio River at Mt. Vernon, Indiana; and buys and resells coal, as well as owns mineral and royalty interests in approximately 1.5 million gross acres of oil and gas producing regions primarily in the Permian, Anadarko, and Williston Basins. Further, the company offers various mining technology products and services, including data network, communication and tracking systems, mining proximity detection systems, industrial collision avoidance systems, and data and analytics software. As of December 31, 2021, it had approximately 547.1 million tons of proven and probable coal mineral reserves, as well as 1.17 billion tons of measured, indicated, and inferred coal mineral resources in Illinois, Indiana, Kentucky, Maryland, Pennsylvania, and West Virginia. The company was founded in 1971 and is headquartered in Tulsa, Oklahoma.",
    "ceo": "Mr. Joseph W. Craft III",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "3371",
    "phone": "918 295 7600",
    "address": "1717 South Boulder Avenue",
    "city": "Tulsa",
    "state": "OK",
    "zip": "74119",
    "dcfDiff": 2.64255,
    "dcf": 23.3526,
    "image": "https://financialmodelingprep.com/image-stock/ARLP.png",
    "ipoDate": "1999-08-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]