[
  {
    "symbol": "ARMK",
    "price": 41.82,
    "beta": 1.644718,
    "volAvg": 2688266,
    "mktCap": 10898668045,
    "lastDiv": 0.44,
    "range": "29.66-45.72",
    "changes": 0.07,
    "companyName": "Aramark",
    "currency": "USD",
    "cik": "0001584509",
    "isin": "US03852U1060",
    "cusip": "03852U106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Business Services",
    "website": "https://www.aramark.com",
    "description": "Aramark provides food, facilities, and uniform services to education, healthcare, business and industry, sports, leisure, and corrections clients in the United States and internationally. It operates through three segments: Food and Support Services United States, Food and Support Services International, and Uniform and Career Apparel. The company offers food-related managed services, including dining, catering, food service management, and convenience-oriented retail services; non-clinical support services, such as patient food and nutrition, retail food, and procurement services; and plant operations and maintenance, custodial/housekeeping, energy management, grounds keeping, and capital project management services. It also provides on-site restaurants, catering, convenience stores, and executive dining services; beverage and vending services; and facility management services comprising landscaping, transportation, payment, and other facility consulting services relating to building operations. In addition, the company offers concessions, banquet, and catering services; retail services and merchandise sale, recreational, and lodging services; and facility management services at sports, entertainment, and recreational facilities. Further, the company offers correctional food; and operates commissaries, laundry facilities, and property rooms. Additionally, it provides design, sourcing and manufacturing, delivery, cleaning, maintenance, and marketing services for uniforms and accessories; provides managed restroom services; and rents uniforms, work clothing, outerwear, particulate-free garments, and non-garment items and related services that include mats, shop towels, and first aid supplies. The company was formerly known as ARAMARK Holdings Corporation and changed its name to Aramark in May 2014. Aramark was founded in 1959 and is based in Philadelphia, Pennsylvania.",
    "ceo": "Mr. John J. Zillmer",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "273875",
    "phone": "215 238 3000",
    "address": "2400 Market Street",
    "city": "Philadelphia",
    "state": "PA",
    "zip": "19103",
    "dcfDiff": 2.22934,
    "dcf": 42.0907,
    "image": "https://financialmodelingprep.com/image-stock/ARMK.png",
    "ipoDate": "2013-12-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]