[
  {
    "symbol": "ARNC",
    "price": 29.59,
    "beta": 1.89241,
    "volAvg": 2295666,
    "mktCap": 2968587160,
    "lastDiv": 25.599999999999937,
    "range": "16.33-30.68",
    "changes": 0.01,
    "companyName": "Arconic Corporation",
    "currency": "USD",
    "cik": "0001790982",
    "isin": "US03966V1070",
    "cusip": "03966V107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Metal Fabrication",
    "website": "https://www.arconic.com",
    "description": "Arconic Corporation manufactures and sells aluminum sheets, plates, extrusions, and architectural products in the United States, Canada, China, France, Germany, Hungary, Russia, the United Kingdom, and internationally. It operates through three segments: Rolled Products, Building and Construction Systems, and Extrusions. The Rolled Products segment provides a range of aluminum sheet and plate products for ground transportation, aerospace, industrial, and packaging markets; and roofing, architectural composite panels, ventilated facades and ceiling panels, spacers, culvert pipes, and gutters for building and construction markets. The Building and Construction Systems segment provides various products and building envelope solutions, such as entrances, curtain walls, windows, composite panels, and coil coated sheets for fabricators and glazing subcontractors under the Kawneer, Reynobond, and Reynolux brands. The Extrusions segment offers extruded products, including aerospace shapes, automotive shapes, seamless tubes, hollows, mortar fins, and high strength rods and bars for ground transportation, aerospace, and industrial markets. The company offers its products directly to customers, as well as through distributors. The company was formerly known as Arconic Rolled Products Corporation and changed its name to Arconic Corporation in April 2020. Arconic Corporation was founded in 1888 and is headquartered in Pittsburgh, Pennsylvania.",
    "ceo": "Mr. Timothy Donald Myers",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "11550",
    "phone": "412 992 2500",
    "address": "201 Isabella Street",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15212-5872",
    "dcfDiff": 0.0613185,
    "dcf": 23.4413,
    "image": "https://financialmodelingprep.com/image-stock/ARNC.png",
    "ipoDate": "2020-04-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]