[
  {
    "symbol": "ARW",
    "price": 137.3,
    "beta": 1.400352,
    "volAvg": 484701,
    "mktCap": 7755857320,
    "lastDiv": 0.22499999999999998,
    "range": "89.38-140.32",
    "changes": 0.24,
    "companyName": "Arrow Electronics, Inc.",
    "currency": "USD",
    "cik": "0000007536",
    "isin": "US0427351004",
    "cusip": "042735100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electronics & Computer Distribution",
    "website": "https://www.arrow.com",
    "description": "Arrow Electronics, Inc. provides products, services, and solutions to industrial and commercial users of electronic components and enterprise computing solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates in two segments, Global Components and Global Enterprise Computing Solutions. The Global Components segment markets and distributes semiconductor products and related services; passive, electro-mechanical, and interconnect products, including capacitors, resistors, potentiometers, power supplies, relays, switches, and connectors; and computing and memory products, as well as other products and services. The Global Enterprise Computing Solutions segment offers computing solutions, such as datacenter, cloud, security, and analytics solutions. This segment provides access to various services, including engineering and integration support, warehousing and logistics, marketing resources, and authorized hardware and software training. The company serves original equipment manufacturers, value-added resellers, managed service providers, contract manufacturers, and other commercial customers. Arrow Electronics, Inc. was founded in 1935 and is based in Centennial, Colorado.",
    "ceo": "Mr. Sean J. Kerins",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "22300",
    "phone": "303 824 4000",
    "address": "9201 East Dry Creek Road",
    "city": "Centennial",
    "state": "CO",
    "zip": "80112",
    "dcfDiff": 5.80436,
    "dcf": 111.506,
    "image": "https://financialmodelingprep.com/image-stock/ARW.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]