[
  {
    "symbol": "ARWR",
    "price": 36.92,
    "beta": 0.981338,
    "volAvg": 1006840,
    "mktCap": 3946748000,
    "lastDiv": 0,
    "range": "23.09-48.48",
    "changes": 0.84,
    "companyName": "Arrowhead Pharmaceuticals, Inc.",
    "currency": "USD",
    "cik": "0000879407",
    "isin": "US04280A1007",
    "cusip": "04280A100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://arrowheadpharma.com",
    "description": "Arrowhead Pharmaceuticals, Inc. develops medicines for the treatment of intractable diseases in the United States. The company's products in pipeline includes ARO-AAT, a RNA interference (RNAi) therapeutic candidate that is in Phase II clinical trial for the treatment of liver diseases associated with alpha-1 antitrypsin deficiency; ARO-APOC3, which is in phase 2b and one phase 3 clinical trial to treat hypertriglyceridemia; ARO-ANG3 that is in Phase 2b clinical trial to reduce production of angiopoietin-like protein 3; ARO-HSD, which is in Phase 1/2a clinical trial to treat liver diseases; ARO-ENaC, which is in a Phase 1/2a clinical trial to reduce production of the epithelial sodium channel alpha subunit in the airways of the lung; ARO-C3 for the treatment of complement-mediated disease that is in Phase 1/2a clinical trial; ARO-Lung2 for the treatment of chronic obstructive pulmonary disorder; ARO-DUX4 for the treatment of facioscapulohumeral muscular dystrophy; ARO-XDH to treat uncontrolled gout; ARO-COV for the treatment of COVID-19 and other pulmonary-borne pathogens; and ARO-HIF2, which is in phase 1b clinical trial to treat clear cell renal cell carcinoma. It is also involved in the development of JNJ-3989, a subcutaneously administered RNAi therapeutic candidate to treat chronic hepatitis B virus infection; Olpasiran to reduce the production of apolipoprotein A; and ARO-AMG1 for treating genetically validated cardiovascular targets. Arrowhead Pharmaceuticals, Inc. has a license and research collaboration agreement with Janssen Pharmaceuticals, Inc. to develop ARO-JNJ1, ARO-JNJ2, and ARO-JNJ3 RNAi therapeutics for liver-expressed targets; and license and research collaboration agreement with Takeda Pharmaceuticals U.S.A., Inc. to develop RNAi therapeutic candidate as a treatment for liver disease. Arrowhead Pharmaceuticals, Inc. was incorporated in 1989 and is headquartered in Pasadena, California.",
    "ceo": "Dr. Christopher R. Anzalone Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "397",
    "phone": "626 304 3400",
    "address": "177 East Colorado Boulevard",
    "city": "Pasadena",
    "state": "CA",
    "zip": "91105",
    "dcfDiff": 1.99224,
    "dcf": 31.6178,
    "image": "https://financialmodelingprep.com/image-stock/ARWR.png",
    "ipoDate": "1993-12-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]