[
  {
    "symbol": "ASB",
    "price": 16.14,
    "beta": 0.983098,
    "volAvg": 1730933,
    "mktCap": 2435380869,
    "lastDiv": 0.84,
    "range": "14.47-25.5",
    "changes": 0.05,
    "companyName": "Associated Banc-Corp",
    "currency": "USD",
    "cik": "0000007789",
    "isin": "US0454871056",
    "cusip": "045487105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.associatedbank.com",
    "description": "Associated Banc-Corp, a bank holding company, provides various banking and nonbanking products to individuals and businesses in Wisconsin, Illinois, and Minnesota. The company operates through three segments: Corporate and Commercial Specialty; Community, Consumer, and Business; and Risk Management and Shared Services. Its Corporate and Commercial Specialty segment offers lending solutions, including commercial loans and lines of credit, commercial real estate financing, construction loans, letters of credit, leasing, asset based lending, and loan syndications; deposit and cash management solutions, such as commercial checking and interest-bearing deposit products, cash vault and night depository services, liquidity solutions, payables and receivables solutions, and information services; specialized financial services such as interest rate risk management, foreign exchange solutions, and commodity hedging; fiduciary services such as administration of pension, profit-sharing and other employee benefit plans, fiduciary and corporate agency services, and institutional asset management; and investable funds solutions such as savings, money market deposit accounts, IRA accounts, CDs, fixed and variable annuities, full-service, discount and online investment brokerage; investment advisory services; and trust and investment management accounts. The company's Community, Consumer, and Business segment offers lending solutions, such as residential mortgages, home equity loans and lines of credit, personal and installment loans, auto loans, business loans, and business lines of credit; and deposit and transactional solutions such as checking, credit, debit and pre-paid cards, online banking and bill pay; and money transfer services. As of December 31, 2021, the company operated 215 banking branches. Associated Banc-Corp was founded in 1861 and is headquartered in Green Bay, Wisconsin.",
    "ceo": "Mr. Andrew J. Harmening",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4219",
    "phone": "920 491 7500",
    "address": "433 Main Street",
    "city": "Green Bay",
    "state": "WI",
    "zip": "54301",
    "dcfDiff": 8.99471,
    "dcf": 30.9747,
    "image": "https://financialmodelingprep.com/image-stock/ASB.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]