[
  {
    "symbol": "ASBFY",
    "price": 24.86,
    "beta": 1.218007,
    "volAvg": 8875,
    "mktCap": 19245865802,
    "lastDiv": 0.54,
    "range": "13.5-26.0",
    "changes": -0.12,
    "companyName": "Associated British Foods plc",
    "currency": "USD",
    "cik": null,
    "isin": "US0455194029",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Packaged Foods",
    "website": "https://www.abf.co.uk",
    "description": "Associated British Foods plc operates as a diversified food, ingredients, and retail company worldwide. It operates through five segments: Grocery, Sugar, Agriculture, Ingredients, and Retail. The Grocery segment manufactures and sells grocery products, including hot beverages, sugar and sweeteners, vegetable oils, balsamic vinegars, bread and baked goods, cereals, ethnic foods, and meat products to retail, wholesale, and foodservice businesses. The Sugar segment is involved in growing, processing, and selling sugar beet and sugar cane to industrial users. The Agriculture segment manufactures and sells animal feeds; and provides other products and services for the agriculture sector. The Ingredients segment manufactures bakers' yeast, bakery ingredients, enzymes, lipids, yeast extracts, and cereal specialties. The Retail segment is involved in buying and merchandising clothing and accessories through the Primark and Penneys retail chains, which offer womenswear, menswear, children's wear, footwear, accessories, homeware, and skincare products. The company was founded in 1935 and is headquartered in London, the United Kingdom. Associated British Foods plc is a subsidiary of Wittington Investments Limited.",
    "ceo": "Mr. George Garfield Weston",
    "sector": "Consumer Defensive",
    "country": "GB",
    "fullTimeEmployees": "132000",
    "phone": "44 20 7399 6500",
    "address": "Weston Centre",
    "city": "London",
    "state": null,
    "zip": "W1K 4QY",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ASBFY.png",
    "ipoDate": "2009-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]