[
  {
    "symbol": "ASGLY",
    "price": 7.2,
    "beta": 0.801149,
    "volAvg": 1845,
    "mktCap": 7856568115,
    "lastDiv": 0.3,
    "range": "5.67-7.69",
    "changes": 0.03,
    "companyName": "AGC Inc.",
    "currency": "USD",
    "cik": null,
    "isin": "US00109C1036",
    "cusip": "00109C103",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Chemicals",
    "website": "https://www.agc.com",
    "description": "AGC Inc. manufactures and sells glass, electronics, chemicals, and ceramics worldwide. The company offers architectural glass products, including laminated, insulating, wired, solar control, toughened, decorative, sound insulation, float and patterned, and industrial glasses; structural glazing systems; and automotive glass, such as laminated, tempered, and privacy glasses, as well as integrated glass antennas, patterned glazing products, and module assembly windows. It also provides glass substrates used for thin-film-transistor liquid crystal displays and OLEDs; synthetic fused silica glass, synthetic quartz crystal, silicon carbide, CMP slurry, through glass Vias, high refractive index glass, DOE diffuser, glass ceramics substrate, optical planar device, IR cut filter, aspherical glass and molded lens, micro lens array, and fly eye and condenser lens products; polycarbonate and optical sheets, thin sheets, and films; and glass frits and paste, as well as glass substrate for semiconductor packaging, and other electronic materials. In addition, the company offers cover glass for smartphones and tablet devices; glass substrates for photovoltaic devices and touch panels; specialty glass; extra clear float glass; transparent conductive oxide glass for a-Si type solar module; and ultra-thin glass for electronics devices. Further, it provides chlor-alkali, polyurethanes, fluoro, and specialty chemical products; high thermal insulation ceramics wall for furnaces; and ceramic beads, sputtering targets, abrasion resistant ceramics, alumina cement, engineering fine ceramics, and ceramics molding agent for 3D printers. Additionally, the company engages in the digital signage on glass, copper clad laminate, and plastic optical fiber businesses; and gas and solvents, and life Science business. The company was formerly known as Asahi Glass Co., Ltd. and changed its name to AGC Inc. in July 2018. AGC Inc. was founded in 1907 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Yoshinori  Hirai",
    "sector": "Basic Materials",
    "country": "JP",
    "fullTimeEmployees": "57609",
    "phone": "81 3 3218 5741",
    "address": "1-5-1, Marunouchi",
    "city": "Tokyo",
    "state": null,
    "zip": "100-8405",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ASGLY.png",
    "ipoDate": "2009-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]