[
  {
    "symbol": "ASGN",
    "price": 73.95,
    "beta": 1.65669,
    "volAvg": 373717,
    "mktCap": 3645735000,
    "lastDiv": 0,
    "range": "63.27-106.88",
    "changes": 0.46,
    "companyName": "ASGN Incorporated",
    "currency": "USD",
    "cik": "0000890564",
    "isin": "US00191U1025",
    "cusip": "00191U102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.asgn.com",
    "description": "ASGN Incorporated provides information technology services and professional solutions in the technology, digital, and creative fields for commercial and government sectors in the United States. It operates through two segments: Commercial and Federal Government. The Commercial Segment provides consulting, creative digital marketing, and permanent placement services primarily to Fortune 1000 and mid-market clients. This segment also offers workforce mobilization, modern enterprise, and digital innovation IT consulting services; and cloud, data and analytics, and digital transformation solutions. The Federal Government Segment provides mission-critical solutions to the department of defense, intelligence agencies, and civilian agencies. This segment offers cloud, cybersecurity, artificial intelligence, machine learning, application and IT modernization, and science and engineering solutions. The company was formerly known as On Assignment, Inc. and changed its name to ASGN Incorporated in April 2018. ASGN Incorporated was incorporated in 1985 and is based in Glen Allen, Virginia.",
    "ceo": "Mr. Theodore S. Hanson",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "4000",
    "phone": "888 482 8068",
    "address": "4400 Cox Road",
    "city": "Glen Allen",
    "state": "VA",
    "zip": "23060",
    "dcfDiff": 7.39006,
    "dcf": 97.6601,
    "image": "https://financialmodelingprep.com/image-stock/ASGN.png",
    "ipoDate": "1992-09-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]