[
  {
    "symbol": "ASH",
    "price": 83.84,
    "beta": 0.990492,
    "volAvg": 492229,
    "mktCap": 4389334208,
    "lastDiv": 1.54,
    "range": "80.0-114.36",
    "changes": 0.47,
    "companyName": "Ashland Inc.",
    "currency": "USD",
    "cik": "0001674862",
    "isin": "US0441861046",
    "cusip": "044186104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.ashland.com",
    "description": "Ashland Inc. provides additives and specialty ingredients worldwide. It operates through Life Sciences; Personal Care & Household; Specialty Additives; and Intermediates and Solvents segments. The Life Sciences segment offers pharmaceutical solutions, including controlled release polymers, disintegrants, tablet coatings, thickeners, solubilizers, and tablet binders; nutrition solutions, such as thickeners, stabilizers, emulsifiers, and additives; and nutraceutical solutions comprising products for weight management, joint comfort, stomach and intestinal health, sports nutrition, and general wellness, as well as custom formulation, toll processing, and particle engineering solutions. The Personal Care & Household segment provides a range of nature-based, biodegradable, and performance ingredients; solutions for toothpastes, mouth washes and rinses, denture cleaning, and care for teeth; and household supplies nature-derived rheology ingredients, biodegradable surface wetting agents, performance encapsulates, and specialty polymers. The Specialty Additives segment offers rheology modifiers, foam control agents, surfactants and wetting agents, pH neutralizers, advanced ceramics used in catalytic converters, environmental filters, ingredients for the manufacturing of ceramic capacitors, plasma display panels and solar cells, ingredients for textile printing, thermoplastic metals, and alloys for welding. The Intermediates and Solvents segment produces 1,4 butanediol and related derivatives, including n-methylpyrrolidone. It offers its products to customers in a range of consumer and industrial markets, such as architectural coatings, construction, energy, food and beverage, nutraceuticals, personal care, and pharmaceutical. The company was formerly known as Ashland Global Holdings Inc. Ashland Inc. was founded in 1924 and is based in Wilmington, Delaware.",
    "ceo": "Mr. Guillermo  Novo",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "3900",
    "phone": "302 995 3000",
    "address": "8145 Blazer Drive",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19808",
    "dcfDiff": 6.55262,
    "dcf": 114.203,
    "image": "https://financialmodelingprep.com/image-stock/ASH.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]