[
  {
    "symbol": "ASHTY",
    "price": 278.25,
    "beta": 1.440229,
    "volAvg": 6362,
    "mktCap": 30488687250,
    "lastDiv": 3.24,
    "range": "164.76-285.0",
    "changes": 1.59,
    "companyName": "Ashtead Group plc",
    "currency": "USD",
    "cik": null,
    "isin": "US0450551009",
    "cusip": "045055100",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Rental & Leasing Services",
    "website": "https://www.ashtead-group.com",
    "description": "Ashtead Group plc, together with its subsidiaries, engages in the construction, industrial, and general equipment rental business in the United States, the United Kingdom, and Canada. It provides pumps, power generation, heating, cooling, scaffolding, traffic management, temporary flooring, trench shoring, and lifting services. The company offers its products and services for facilities maintenance and municipalities, such as office complexes, apartment complexes, government, hospitals, data centers, parks and recreation departments, schools and universities, shopping centers, pavement/kerb repairs, and golf course maintenance; construction of airports, highways and bridges, office buildings, data centers, schools and universities, shopping centers, residential, remodeling, manufacturing plants, and green energy plants; emergency response for fire, hurricanes, flooding, tornadoes, winter, storms, residential and health emergencies, alternative care facilities, points of distribution, and mobile testing facilities; and entertainment and special events, including national events, concerts, sporting events, film and telvision production, theme parks, festivals farmers' markets, local 5k runs, and cycle races. It operates 967 stores in the United States, 89 stores in Canada, and 177 stores in the United Kingdom under the Sunbelt Rentals brand. The company was founded in 1947 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. Brendan  Horgan",
    "sector": "Industrials",
    "country": "GB",
    "fullTimeEmployees": "25347",
    "phone": "44 20 7726 9700",
    "address": "100 Cheapside",
    "city": "London",
    "state": null,
    "zip": "EC2V 6DT",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ASHTY.png",
    "ipoDate": "2014-07-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]