[
  {
    "symbol": "ASML",
    "price": 724.19,
    "beta": 1.181992,
    "volAvg": 970051,
    "mktCap": 285758143687,
    "lastDiv": 9.96,
    "range": "363.15-747.13",
    "changes": -0.89,
    "companyName": "ASML Holding N.V.",
    "currency": "USD",
    "cik": "0000937966",
    "isin": "USN070592100",
    "cusip": "N07059210",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductor Equipment & Materials",
    "website": "https://www.asml.com",
    "description": "ASML Holding N.V. develops, produces, markets, sells, and services advanced semiconductor equipment systems consisting of lithography, metrology, and inspection related systems for memory and logic chipmakers. The company provides extreme ultraviolet lithography systems; and deep ultraviolet lithography systems comprising immersion and dry lithography solutions to manufacture various range of semiconductor nodes and technologies. It also offers metrology and inspection systems, including YieldStar optical metrology solutions to measure the quality of patterns on the wafers; and HMI e-beam solutions to locate and analyze individual chip defects. In addition, the company provides computational lithography and software solutions to create applications that enhance the setup of the lithography system; and mature products and services that refurbish used lithography equipment and offers associated services. It operates in Japan, South Korea, Singapore, Taiwan, China, the Netherlands, Europe, the United States, and rest of Asia. The company was formerly known as ASM Lithography Holding N.V. and changed its name to ASML Holding N.V. in 2001. ASML Holding N.V. was founded in 1984 and is headquartered in Veldhoven, the Netherlands.",
    "ceo": "Mr. Peter T. F. M. Wennink",
    "sector": "Technology",
    "country": "NL",
    "fullTimeEmployees": "37704",
    "phone": "31 480 235 0934",
    "address": "De Run 6501",
    "city": "Veldhoven",
    "state": null,
    "zip": "5504 DR",
    "dcfDiff": 70.5126,
    "dcf": 596.877,
    "image": "https://financialmodelingprep.com/image-stock/ASML.png",
    "ipoDate": "1995-03-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]