[
  {
    "symbol": "ASO",
    "price": 52.82,
    "beta": 1.165741,
    "volAvg": 1828256,
    "mktCap": 4038368735,
    "lastDiv": 0.36,
    "range": "33.82-69.02",
    "changes": -0.56,
    "companyName": "Academy Sports and Outdoors, Inc.",
    "currency": "USD",
    "cik": "0001817358",
    "isin": "US00402L1070",
    "cusip": "00402L107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Specialty Retail",
    "website": "https://www.academy.com",
    "description": "Academy Sports and Outdoors, Inc., through its subsidiaries, operates as a sporting goods and outdoor recreational products retailer in the United States. The company sells coolers and drinkware, camping accessories, camping equipment, sunglasses, backpacks, and sports bags; marine equipment and fishing rods, reels, baits, and equipment; firearms, ammunition, archery and archery equipment, camouflage apparel, waders, shooting accessories, optics, airguns, and hunting equipment; team sports equipment, including baseball, football, basketball, soccer, golf, racket sports, and volleyball; fitness equipment and accessories, and nutrition supplies; and patio furniture, outdoor cooking, wheeled goods, trampolines, playsets, watersports, and pet equipment, as well as electronics products, watches, consumables, batteries, etc. It also offers outdoor apparel, seasonal apparel, denim, work apparel, graphic t-shirts, and accessories; boys and girls outdoor and athletic apparel; sporting apparel and apparel for fitness; professional and collegiate team licensed apparel and accessories; casual shoes and slippers, work and western boots, youth footwear, socks, and hunting and seasonal footwear; and boys and girls athletic footwear, running shoes, athletic lifestyle and training shoes, team and specialty sports footwear, and slides. The company sells its products under the Academy Sports + Outdoors, Magellan Outdoors, BCG, O'rageous, Outdoor Gourmet, and Freely brand names. As of June 14, 2022, it operated 260 retail locations in 16 contiguous states. The company also sells merchandise to customers through the academy.com website. Academy Sports and Outdoors, Inc. was founded in 1938 and is headquartered in Katy, Texas.",
    "ceo": "Mr. Steven Paul Lawrence",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "22000",
    "phone": "281 646 5200",
    "address": "1800 North Mason Road",
    "city": "Katy",
    "state": "TX",
    "zip": "77449",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ASO.png",
    "ipoDate": "2020-10-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]