[
  {
    "symbol": "ASR",
    "price": 279.95,
    "beta": 0.76952,
    "volAvg": 60825,
    "mktCap": 8398500000,
    "lastDiv": 5.653,
    "range": "179.01-314.48",
    "changes": -1.96,
    "companyName": "Grupo Aeroportuario del Sureste, S. A. B. de C. V.",
    "currency": "USD",
    "cik": "0001123452",
    "isin": "US40051E2028",
    "cusip": "40051E202",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Airports & Air Services",
    "website": "https://www.asur.com.mx",
    "description": "Grupo Aeroportuario del Sureste, S. A. B. de C. V. holds concessions to operate, maintain, and develop airports in the southeast region of Mexico. The company operates nine airports that are located in the cities of Cancún, Cozumel, Mérida, Huatulco, Oaxaca, Veracruz, Villahermosa, Tapachula, and Minatitlan. It provides aeronautical services, which include passenger, aircraft landing and parking, passenger walkway, and airport security services. The company also offers non-aeronautical services, such as leasing of space at its airports to retailers, restaurants, airlines, and other commercial tenants; catering, handling, and ground transportation services. In addition, it operates the Luis Muñoz Marín International Airport in San Juan, Puerto Rico; and holds concessions to operate the various airports in Colombia, including the Enrique Olaya Herrera Airport in Medellín and José María Córdova International Airport in Rionegro, the Los Garzones Airport in Montería, the Antonio Roldán Betancourt Airport in Carepa, the El Caraño Airport in Quibdó, and the Las Brujas Airport in Corozal. The company was incorporated in 1998 and is headquartered in Mexico City, Mexico.",
    "ceo": "Mr. Adolfo  Castro Rivas",
    "sector": "Industrials",
    "country": "MX",
    "fullTimeEmployees": "1787",
    "phone": "52 55 5284 0408",
    "address": "Bosque de Alisos No. 47A",
    "city": "Mexico City",
    "state": "DF",
    "zip": "05120",
    "dcfDiff": 251.055,
    "dcf": 532.665,
    "image": "https://financialmodelingprep.com/image-stock/ASR.png",
    "ipoDate": "2000-09-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]