[
  {
    "symbol": "ATEYY",
    "price": 128.42,
    "beta": 1.046743,
    "volAvg": 14209,
    "mktCap": 23656761880,
    "lastDiv": 0.97,
    "range": "45.24-142.66",
    "changes": 2.15,
    "companyName": "Advantest Corporation",
    "currency": "USD",
    "cik": "0001158838",
    "isin": "US00762U2006",
    "cusip": "00762U200",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Semiconductor Equipment & Materials",
    "website": "https://www.advantest.com",
    "description": "Advantest Corporation manufactures and sells semiconductor and component test system products and mechatronics-related products. It operates through three segments: Semiconductor and Component Test System; Mechatronics System; and Services, Support and Others. The Semiconductor and Component Test System segment provides customers with test system products for the semiconductor industry and the electronic parts industry. This segment offers test systems for SoC semiconductor devices; and test systems for memory semiconductors devices. The Mechatronics System segment provides test handlers; mechatronic-applied products for handling semiconductor devices; and device interfaces, which serve as interfaces with the devices that are measured. This segment also engages in the operations related to nano-technology products. The Services, Support and Others segment provides customer solutions for the semiconductor and component test system and mechatronics system segments; and support services. This segment is also involved in the sale of consumables and used products; and equipment lease business and others. In addition, the company engages in the research and development activities measuring and testing technologies. Advantest Corporation serves fabless semiconductor companies, foundries, and test houses, as well as industrial, design, and manufacturing companies in Japan, rest of Asia, the United States, and Europe. Advantest Corporation has collaboration with STMicroelectronics on advanced automated test cell for IC Testing; and partnership with PDF Solutions Inc. for cloud-based software solutions. The company was founded in 1954 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Yoshiaki  Yoshida",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "5941",
    "phone": "81 3 3214 7500",
    "address": "Shin Marunouchi Center Building",
    "city": "Tokyo",
    "state": null,
    "zip": "100-0005",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ATEYY.png",
    "ipoDate": "2001-09-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]