[
  {
    "symbol": "ATHM",
    "price": 29.19,
    "beta": 0.195774,
    "volAvg": 451390,
    "mktCap": 3596850180,
    "lastDiv": 0.58,
    "range": "23.66-40.89",
    "changes": -0.17,
    "companyName": "Autohome Inc.",
    "currency": "USD",
    "cik": "0001527636",
    "isin": "US05278C1071",
    "cusip": "05278C107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Internet Content & Information",
    "website": "https://www.autohome.com.cn",
    "description": "Autohome Inc. operates as an online destination for automobile consumers in the People's Republic of China. The company delivers interactive content and tools to automobile consumers through its three websites, autohome.com.cn, che168.com, and ttpai.cn on PCs, mobile devices, mobile applications, and mini apps. It provides media services, including automaker advertising services and regional marketing campaigns; and leads generation services comprising dealer subscription services, advertising services for individual dealers, and used automobile listing and other platform-based services. The company also offers Autohome Mall, an online transaction platform for users to review automotive-related information, purchase coupons offered by automakers for discounts, and make purchases to complete the transaction; data products; and online bidding platform for used automobiles, as well as collects commissions for facilitating transactions of auto-financing and insurance products on its platform. The company was formerly known as Sequel Limited and changed its name to Autohome Inc. in October 2011. Autohome Inc. was incorporated in 2008 and is headquartered in Beijing, the People's Republic of China.",
    "ceo": "Mr. Quan  Long",
    "sector": "Communication Services",
    "country": "CN",
    "fullTimeEmployees": "5395",
    "phone": "86 10 5985 7001",
    "address": "CEC Plaza, Tower B",
    "city": "Beijing",
    "state": null,
    "zip": "100080",
    "dcfDiff": 26.3217,
    "dcf": 62.8717,
    "image": "https://financialmodelingprep.com/image-stock/ATHM.png",
    "ipoDate": "2013-12-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]