[
  {
    "symbol": "ATI",
    "price": 41.59,
    "beta": 1.193309,
    "volAvg": 1093590,
    "mktCap": 5346311320,
    "lastDiv": 9.919999999999986,
    "range": "20.52-43.32",
    "changes": 0.76,
    "companyName": "ATI Inc.",
    "currency": "USD",
    "cik": "0001018963",
    "isin": "US01741R1023",
    "cusip": "01741R102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Metal Fabrication",
    "website": "https://www.atimaterials.com",
    "description": "ATI Inc. manufactures and sells specialty materials and components worldwide. The company operates in two segments: High Performance Materials & Components (HPMC) and Advanced Alloys & Solutions (AA&S). The HPMC segment produces various materials, including titanium and titanium-based alloys, nickel- and cobalt-based alloys and superalloys, advanced powder alloys and other specialty materials, in long product forms, such as ingot, billet, bar, rod, wire, shapes and rectangles, and seamless tubes, as well as precision forgings, components, and machined parts. The segment serves aerospace and defense, medical, and energy markets. The AA&S segment produces zirconium and related alloys, including hafnium and niobium, nickel-based alloys, titanium and titanium-based alloys, and specialty alloys in a variety of forms, such as plate, sheet, and precision rolled strip products. It also provides hot-rolling conversion services, including carbon steel products, and titanium products. This segment offers its solutions to the energy, aerospace and defense, automotive, and electronics markets. The company was formerly known as Allegheny Technologies Incorporated. ATI Inc. was founded in 1960 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Robert S. Wetherbee",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "6700",
    "phone": "800 289 7454",
    "address": "ATI Corporate",
    "city": "Dallas",
    "state": "TX",
    "zip": "75201",
    "dcfDiff": 2.09363,
    "dcf": 34.1064,
    "image": "https://financialmodelingprep.com/image-stock/ATI.png",
    "ipoDate": "1999-11-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]