[
  {
    "symbol": "ATKR",
    "price": 152.32,
    "beta": 2.165492,
    "volAvg": 479335,
    "mktCap": 5873413504,
    "lastDiv": 0,
    "range": "70.5-154.86",
    "changes": -0.3,
    "companyName": "Atkore Inc.",
    "currency": "USD",
    "cik": "0001666138",
    "isin": "US0476491081",
    "cusip": "047649108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electrical Equipment & Parts",
    "website": "https://www.atkore.com",
    "description": "Atkore Inc. manufactures and sells electrical, safety, and infrastructure products in the United States and internationally. The company offers electrical products, including conduits cables, and installation accessories. It also provides safety and infrastructure solutions, such as metal framing, mechanical pipe, perimeter security, and cable management. The company offers its products under the Allied Tube & Conduit, AFC Cable Systems, Kaf-Tech, Heritage Plastics, Unistrut, Power-Strut, Cope, US Tray, FRE Composites, Calbond, and Calpipe brands. It serves a group of end markets, including new construction; maintenance, repair, and remodel, as well as infrastructure; diversified industrials; alternative power generation; healthcare; data centers; and government through electrical, industrial, and mechanical contractors, as well as original equipment manufacturers. The company was formerly known as Atkore International Group Inc. and changed its name to Atkore Inc. in February 2021. Atkore Inc. was founded in 1959 and is headquartered in Harvey, Illinois.",
    "ceo": "Mr. William E. Waltz Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "4000",
    "phone": "708 339 1610",
    "address": "16100 South Lathrop Avenue",
    "city": "Harvey",
    "state": "IL",
    "zip": "60426",
    "dcfDiff": 1.90215,
    "dcf": 129.332,
    "image": "https://financialmodelingprep.com/image-stock/ATKR.png",
    "ipoDate": "2016-06-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]