[
  {
    "symbol": "ATLKY",
    "price": 14.32,
    "beta": 0.975095,
    "volAvg": 156504,
    "mktCap": 69715343196,
    "lastDiv": 0.22,
    "range": "8.63-15.35",
    "changes": -0.17,
    "companyName": "Atlas Copco AB",
    "currency": "USD",
    "cik": "0000748954",
    "isin": "US0492557063",
    "cusip": "049255706",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.atlascopcogroup.com",
    "description": "Atlas Copco AB, together with its subsidiaries, provides productivity solutions. The company operates through Compressor Technique, Vacuum Technique, Industrial Technique, and Power Technique segments. It offers piston compressors, oil-free tooth and scroll compressors, rotary screw compressors, oil-free blowers, oil-free centrifugal compressors, gas and process compressors, air and gas treatment equipment, and medical air solutions primarily for use in the manufacturing and process industries. The company also provides oil-sealed rotary vane, dry, and liquid ring vacuum pumps; and turbomolecular and cryogenic pumps, as well as abatement and integrated systems for the semiconductor and scientific, chemical process, food packaging, and paper handling industries. In addition, it offers pneumatic, hydraulic, and electric assembly tools, as well as control systems and associated software for safety-critical tightening; self-pierce riveting tools, dispensing equipment for adhesives and sealants, and flow drill fastening equipment; material removal tools, drills, and other pneumatic products; and machine vision solutions for customers in the automotive and general industries. Further, the company provides portable compressors, boosters, generators, lighting towers, pumps, and construction and demolition tools for civil engineering, oil and gas, construction, manufacturing, exploration drilling, and demolition industries, as well as specialty rental services. It operates in North America, South America, Europe, Africa, the Middle East, Asia, and Oceania. The company was founded in 1873 and is headquartered in Nacka, Sweden.",
    "ceo": "Mr. Mats  Rahmström",
    "sector": "Industrials",
    "country": "SE",
    "fullTimeEmployees": "50056",
    "phone": "46 87 43 80 00",
    "address": "Sickla Industriväg 19",
    "city": "Nacka",
    "state": null,
    "zip": "13154",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ATLKY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]