[
  {
    "symbol": "ATO",
    "price": 115.26,
    "beta": 0.619014,
    "volAvg": 930554,
    "mktCap": 16653572542,
    "lastDiv": 2.96,
    "range": "97.71-121.92",
    "changes": -1.93,
    "companyName": "Atmos Energy Corporation",
    "currency": "USD",
    "cik": "0000731802",
    "isin": "US0495601058",
    "cusip": "049560105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Gas",
    "website": "https://www.atmosenergy.com",
    "description": "Atmos Energy Corporation, together with its subsidiaries, engages in the regulated natural gas distribution, and pipeline and storage businesses in the United States. It operates through two segments, Distribution, and Pipeline and Storage. The Distribution segment is involved in the regulated natural gas distribution and related sales operations in eight states. This segment distributes natural gas to approximately three million residential, commercial, public authority, and industrial customers. As of September 30, 2021, it owned 71,921 miles of underground distribution and transmission mains. The Pipeline and Storage segment engages in the pipeline and storage operations. This segment transports natural gas for third parties and manages five underground storage reservoirs in Texas; and provides ancillary services to the pipeline industry, including parking arrangements, lending, and inventory sales. As of September 30, 2021, it owned 5,699 miles of gas transmission lines. Atmos Energy Corporation was founded in 1906 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. John Kevin Akers",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "4791",
    "phone": "972 934 9227",
    "address": "1800 Three Lincoln Centre",
    "city": "Dallas",
    "state": "TX",
    "zip": "75240",
    "dcfDiff": 0.739018,
    "dcf": 116.689,
    "image": "https://financialmodelingprep.com/image-stock/ATO.png",
    "ipoDate": "1983-12-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]