[
  {
    "symbol": "ATR",
    "price": 113.52,
    "beta": 0.635915,
    "volAvg": 245843,
    "mktCap": 7437989328,
    "lastDiv": 1.52,
    "range": "90.23-122.5",
    "changes": -1.2,
    "companyName": "AptarGroup, Inc.",
    "currency": "USD",
    "cik": "0000896622",
    "isin": "US0383361039",
    "cusip": "038336103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.aptar.com",
    "description": "AptarGroup, Inc. provides a range of dispensing, sealing, and material science solutions primarily for the beauty, personal care, home care, prescription drug, consumer health care, injectable, and food and beverage markets. The company operates through three segments: Pharma, Beauty + Home, and Food + Beverage. The Pharma segment provides pumps for nasal allergy treatments; and metered dose inhaler valves for respiratory ailments, such as asthma and chronic obstructive pulmonary diseases in pharmaceutical market; elastomer for injectable primary packaging components; and active material science solutions. The Beauty + Home segment primarily sells pumps, closures, aerosol valves, accessories, and sealing solutions to the personal care and home care markets; and pumps and decorative components to the beauty market. The Food + Beverage segment offers dispensing and non-dispensing closures, elastomeric flow control components, spray pumps, and aerosol valves to the food and beverage markets. It sells its products through own sales force, as well as independent representatives and distributors in Asia, Europe, Latin America, and North America. The company has a strategic partnership with PureCycle Technologies LLC to develop ultra-pure recycled polypropylene into dispensing applications; and a collaboration with Sonmol for developing a digital therapies and services platform targeting respiratory and other diseases. AptarGroup, Inc. was incorporated in 1992 and is headquartered in Crystal Lake, Illinois.",
    "ceo": "Mr. Stephan B. Tanda",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "13500",
    "phone": "815 477 0424",
    "address": "265 Exchange Drive",
    "city": "Crystal Lake",
    "state": "IL",
    "zip": "60014",
    "dcfDiff": 5.74585,
    "dcf": 106.984,
    "image": "https://financialmodelingprep.com/image-stock/ATR.png",
    "ipoDate": "1993-04-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]