[
  {
    "symbol": "ATRC",
    "price": 49.39,
    "beta": 1.351408,
    "volAvg": 272593,
    "mktCap": 2333297197,
    "lastDiv": 0,
    "range": "32.51-52.96",
    "changes": 0.82,
    "companyName": "AtriCure, Inc.",
    "currency": "USD",
    "cik": "0001323885",
    "isin": "US04963C2098",
    "cusip": "04963C209",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.atricure.com",
    "description": "AtriCure, Inc. develops, manufactures, and sells devices for the surgical ablation of cardiac tissue and systems, and intercostal nerves to medical centers in the United States, Europe, Asia, and internationally. The company offers Isolator Synergy Clamps, a single-use disposable radio frequency products; multifunctional pens and linear ablation devices, such as the MAX Pen device that enables surgeons to evaluate cardiac arrhythmias, perform temporary cardiac pacing, sensing, and stimulation and ablate cardiac tissue with the same device; and the Coolrail device, which enable users to make longer linear lines of ablation. It also provides cryoICE Cryoablation System that enables the user to make linear ablations of varied lengths; EPi-Sense Guided Coagulation System, a single-use disposable device used for the treatment of symptomatic, drug-refractory, and long-standing persistent atrial fibrillation; AtriClip System, an implantable device coupled to a single-use disposable applier; and LARIAT System, a suture-based solution for soft-tissue closure compatible with a range of anatomical shapes. In addition, the company sells Lumitip Dissectors to separate tissues to provide access to key anatomical structures that are targeted for ablation; Glidepath guides for placement of clamps; Subtle Cannula's to support access for EPi-Sense catheters; and various reusable cardiac surgery instruments, which are used during surgical procedures for repair or replacement of certain heart valves. It markets and sells its products through independent distributors and direct sales personnel. The company was incorporated in 2000 and is headquartered in Mason, Ohio.",
    "ceo": "Mr. Michael H. Carrel",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "1050",
    "phone": "513 755 4100",
    "address": "7555 Innovation Way",
    "city": "Mason",
    "state": "OH",
    "zip": "45040",
    "dcfDiff": 3.6763,
    "dcf": 46.9763,
    "image": "https://financialmodelingprep.com/image-stock/ATRC.png",
    "ipoDate": "2005-08-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]