[
  {
    "symbol": "ATVI",
    "price": 83.6,
    "beta": 0.410915,
    "volAvg": 7471237,
    "mktCap": 65722890394,
    "lastDiv": 0.47,
    "range": "70.94-87.01",
    "changes": -0.53,
    "companyName": "Activision Blizzard, Inc.",
    "currency": "USD",
    "cik": "0000718877",
    "isin": "US00507V1098",
    "cusip": "00507V109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Electronic Gaming & Multimedia",
    "website": "https://www.activisionblizzard.com",
    "description": "Activision Blizzard, Inc., together with its subsidiaries, develops and publishes interactive entertainment content and services in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through three segments: Activision, Blizzard, and King. It develops and distributes content and services on video game consoles, personal computers, and mobile devices, including subscription, full-game, and in-game sales, as well as by licensing software to third-party or related-party companies that distribute Activision and Blizzard products. The company also maintains a proprietary online gaming service, Battle.net that facilitates digital distribution of content, online social connectivity, and the creation of user-generated content. In addition, it operates esports leagues and offer digital advertising content; and provides warehousing, logistics, and sales distribution services to third-party publishers of interactive entertainment software, as well as manufacturers of interactive entertainment hardware products. The company's key product franchises include Call of Duty, World of Warcraft, Diablo, Hearthstone, Overwatch, Overwatch League, and Candy Crush. It serves retailers and distributors, including mass-market retailers, consumer electronics stores, discount warehouses, and game specialty stores through third-party distribution and licensing arrangements. The company is headquartered in Santa Monica, California.",
    "ceo": "Mr. Robert A. Kotick",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "13000",
    "phone": "310 255 2000",
    "address": "2701 Olympic Boulevard Building B",
    "city": "Santa Monica",
    "state": "CA",
    "zip": "90404",
    "dcfDiff": 11.5872,
    "dcf": 88.1972,
    "image": "https://financialmodelingprep.com/image-stock/ATVI.png",
    "ipoDate": "1993-10-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]