[
  {
    "symbol": "AUB",
    "price": 26.01,
    "beta": 1.036971,
    "volAvg": 565837,
    "mktCap": 1950609546,
    "lastDiv": 1.2,
    "range": "23.32-41.04",
    "changes": -0.43,
    "companyName": "Atlantic Union Bankshares Corporation",
    "currency": "USD",
    "cik": "0000883948",
    "isin": "US04911A1079",
    "cusip": "04911A107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.atlanticunionbank.com",
    "description": "Atlantic Union Bankshares Corporation operates as the holding company for Atlantic Union Bank that provides banking and related financial services to consumers and businesses. The company accepts various deposit products, including checking, savings, NOW, time deposit, and money market accounts; certificates of deposit; and other depository services. It also provides loans for commercial, industrial, residential mortgage, and consumer purposes. In addition, the company offers credit cards, automated teller machine (ATM) services, mobile and internet banking services, and online bill payment services, as well as financial planning, trust, and wealth management services. Further, it provides securities, brokerage, and investment advisory products and services; and originates and sells residential loan products in the secondary market. As of February 25, 2022, it operated 130 branches and approximately 150 ATMs in Virginia, Maryland, and North Carolina. The company was formerly known as Union Bankshares Corporation and changed its name to Atlantic Union Bankshares Corporation in May 2019. Atlantic Union Bankshares Corporation was founded in 1902 and is headquartered in Richmond, Virginia.",
    "ceo": "Mr. John C. Asbury",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1840",
    "phone": "804 633 5031",
    "address": "1051 East Cary Street",
    "city": "Richmond",
    "state": "VA",
    "zip": "23219",
    "dcfDiff": 6.71845,
    "dcf": 44.9285,
    "image": "https://financialmodelingprep.com/image-stock/AUB.png",
    "ipoDate": "1993-10-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]