[
  {
    "symbol": "AUOTY",
    "price": 5.97,
    "beta": 1.160616,
    "volAvg": 35485,
    "mktCap": 4712282124,
    "lastDiv": 0.42,
    "range": "4.62-8.24",
    "changes": -0.11,
    "companyName": "AUO Corporation",
    "currency": "USD",
    "cik": "0001172494",
    "isin": "US0022551073",
    "cusip": "002255107",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Electronic Components",
    "website": "https://www.auo.com",
    "description": "AUO Corporation researches, develops, produces, and sells thin film transistor liquid crystal displays (TFT-LCDs) and other flat panel displays. It operates through two segments, Display and Energy. The company also designs, manufactures, and sells ingots, solar wafers, and solar modules, as well as provides technical engineering and maintenance services for solar system projects. In addition, it sells and leases content management system and related hardware; plans, designs, and develops construction project for environmental protection and related project management; and designs, manufactures, and sells TFT-LCD modules, TV sets and related parts, backlight modules, automotive parts, and precision plastic parts. Further, the company engages in the design, manufacture, and sale of InGaN epi wafers and chips, and light emitting diode packages and modules; development, manufacturing, and sale of medical equipment; services related to educational activities and site rental; research and development, and IP related business; solar power generation; and sale and sales support of TFTLCD panels. Additionally, it develops and sells software and hardware for health care industry; provides software and hardware integration system and equipment relating to intelligent manufacturing, as well as related consulting services; and investment services. The company operates in the People's Republic of China, Taiwan, Japan, Singapore, and internationally. The company was formerly known as AU Optronics Corp. and changed its name to AUO Corporation in June 2022. AUO Corporation was founded in 1996 and is headquartered in Hsinchu City, Taiwan.",
    "ceo": "Dr. Fu-Jen  Ko Ph.D.",
    "sector": "Technology",
    "country": "TW",
    "fullTimeEmployees": null,
    "phone": "886 3 500 8899",
    "address": "Hsinchu Science Park",
    "city": "Hsinchu City",
    "state": null,
    "zip": "300094",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AUOTY.png",
    "ipoDate": "2002-05-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]