[
  {
    "symbol": "AVA",
    "price": 39.15,
    "beta": 0.514436,
    "volAvg": 471980,
    "mktCap": 2966141182,
    "lastDiv": 1.84,
    "range": "35.72-45.29",
    "changes": 0.08,
    "companyName": "Avista Corporation",
    "currency": "USD",
    "cik": "0000104918",
    "isin": "US05379B1070",
    "cusip": "05379B107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Diversified",
    "website": "https://www.avistacorp.com",
    "description": "Avista Corporation, together with its subsidiaries, operates as an electric and natural gas utility company. It operates in two segments, Avista Utilities and AEL&P. The Avista Utilities segment provides electric distribution and transmission, and natural gas distribution services in parts of eastern Washington and northern Idaho; and natural gas distribution services in parts of northeastern and southwestern Oregon, as well as generates electricity in Washington, Idaho, Oregon, and Montana. This segment also engages in the wholesale purchase and sale of electricity and natural gas. The AEL&P segment offers electric services to 17,400 customers in the city and borough of Juneau, Alaska. The company generates electricity through hydroelectric, thermal, and wind facilities. As of February 23, 2022, it provided electric service to 406,000 customers and natural gas to 372,000 customers. In addition, the company engages in venture fund investments, real estate investments, and other investments. Avista Corporation was incorporated in 1889 and is headquartered in Spokane, Washington.",
    "ceo": "Mr. Dennis P. Vermillion",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "1920",
    "phone": "509 489 0500",
    "address": "1411 East Mission Avenue",
    "city": "Spokane",
    "state": "WA",
    "zip": "99202-2600",
    "dcfDiff": 0.314488,
    "dcf": 39.6655,
    "image": "https://financialmodelingprep.com/image-stock/AVA.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]