[
  {
    "symbol": "AVAL",
    "price": 2.32,
    "beta": 0.746232,
    "volAvg": 81667,
    "mktCap": 2754234511,
    "lastDiv": 0.1,
    "range": "1.96-3.7",
    "changes": -0.01,
    "companyName": "Grupo Aval Acciones y Valores S.A.",
    "currency": "USD",
    "cik": "0001504764",
    "isin": "US40053W1018",
    "cusip": "40053W101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.grupoaval.com",
    "description": "Grupo Aval Acciones y Valores S.A. provides a range of financial services and products to public and private sector customers in Colombia and Central America. It offers traditional deposit services and products, including checking accounts, savings accounts, time deposits, and other deposits. The company also provides commercial loans comprising general purpose loans, working capital loans, leases, loans funded by development banks, corporate credit cards, and overdraft loans; consumer loans, such as payroll loans, personal loans, automobile and other vehicle loans, credit cards, overdrafts, leases, and general purpose loans; and microcredit and mortgage loans. In addition, the company offers pension and severance fund management services; investment banking, including services relating to capital markets, mergers and acquisitions, and project finance transactions; mobile and online banking services; and bancassurance, insurance, trust, bonded warehousing and brokerage transactions, real estate escrow services, merchandise and document storage and deposit, customs agency, cargo management, surety bond and merchandise distribution services, and payment and collection services. Further, it is involved in equity investments in various sectors, including infrastructure, energy and gas, agribusiness, and hospitality; and treasury operations. Grupo Aval Acciones y Valores S.A. was incorporated in 1994 and is headquartered in Bogotá, Colombia.",
    "ceo": "Mr. Luis Carlos  Sarmiento Gutierrez",
    "sector": "Financial Services",
    "country": "CO",
    "fullTimeEmployees": "77043",
    "phone": "57 601 743 3222",
    "address": "Carrera 13 No. 26A – 47",
    "city": "Bogotá",
    "state": null,
    "zip": null,
    "dcfDiff": 32891.1,
    "dcf": 32893.7,
    "image": "https://financialmodelingprep.com/image-stock/AVAL.png",
    "ipoDate": "2014-09-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]