[
  {
    "symbol": "AVAV",
    "price": 94.71,
    "beta": 0.594366,
    "volAvg": 241295,
    "mktCap": 2392753440,
    "lastDiv": 0,
    "range": "70.08-112.39",
    "changes": 4.39,
    "companyName": "AeroVironment, Inc.",
    "currency": "USD",
    "cik": "0001368622",
    "isin": "US0080731088",
    "cusip": "008073108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Aerospace & Defense",
    "website": "https://www.avinc.com",
    "description": "AeroVironment, Inc. designs, develops, produces, delivers, and supports a portfolio of robotic systems and related services for government agencies and businesses in the United States and internationally. It operates through four segments: Unmanned Aircraft Systems (UAS), Tactical Missile System (TMS), Medium Unmanned Aircraft Systems (MUAS), and High Altitude Pseudo-Satellite Systems (HAPS). The company supplies UAS, TMS, unmanned ground vehicle, and related services primarily to organizations within the U.S. Department of Defense and to international allied governments. It also designs, engineers, tools, and manufactures unmanned aerial and aircraft systems, including airborne platforms, payloads and payload integration, ground control systems, and ground support equipment and other items and services related to unmanned aircraft systems. In addition, the company offers small UAS products, including spare equipment, alternative payload modules, batteries, chargers, repair services, and customer support, as well as multiple aircraft, hand-held ground control system, and spare parts and accessories. Further, it develops high-altitude pseudo-satellite UAS systems. The company was incorporated in 1971 and is headquartered in Arlington, Virginia.",
    "ceo": "Mr. Wahid  Nawabi",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "1214",
    "phone": "805 520 8350",
    "address": "241 18th Street South",
    "city": "Arlington",
    "state": "VA",
    "zip": "22202",
    "dcfDiff": 10.2053,
    "dcf": 98.8053,
    "image": "https://financialmodelingprep.com/image-stock/AVAV.png",
    "ipoDate": "2007-01-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]