[
  {
    "symbol": "AVIFY",
    "price": 6.1,
    "beta": 0.04863,
    "volAvg": 148,
    "mktCap": 18141400781,
    "lastDiv": 0.22,
    "range": "4.73-6.51",
    "changes": -0.03,
    "companyName": "Advanced Info Service Public Company Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US00753G1031",
    "cusip": "00753G103",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.ais.th",
    "description": "Advanced Info Service Public Company Limited, together its subsidiaries, provides mobile network, fixed broadband, and digital services primarily in Thailand. The company operates through three segments: Mobile Phone Services, Mobile Phone and Equipment Sales, and Datanet and Broadband Services. It is involved in the operation of cellular telephone networks in the frequency of 26 GHz, 700 MHz, 900 MHz, 1800 MHz, 2100 MHz, and 2600 MHz frequencies. The company also distributes handsets, as well as cash cards; and electronic money and electronic payment services. In addition, it provides international telephone service, broadcasting network, and television broadcasting services for various channels, as well as insurance brokerage services. Further, the company offers IT system, content aggregator, and billing and collection outsourcing services; call center services; and land and building rental services, as well as related facilities. Additionally, it provides internet data center, and internet and satellite uplink-downlink services for communications; distributes internet equipment; publishes telephone directories and advertising; offers mobile contents; and provides training and online advertising services. The company was founded in 1986 and is headquartered in Bangkok, Thailand.",
    "ceo": "Mr. Somchai  Lertsutiwong",
    "sector": "Communication Services",
    "country": "TH",
    "fullTimeEmployees": null,
    "phone": "66 2 029 5000",
    "address": "414 AIS Tower 1",
    "city": "Bangkok",
    "state": null,
    "zip": "10400",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AVIFY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]