[
  {
    "symbol": "AVNT",
    "price": 39.64,
    "beta": 1.547887,
    "volAvg": 450337,
    "mktCap": 3610113741,
    "lastDiv": 0.99,
    "range": "27.65-49.73",
    "changes": 0.22,
    "companyName": "Avient Corporation",
    "currency": "USD",
    "cik": "0001122976",
    "isin": "US05368V1061",
    "cusip": "05368V106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.avient.com",
    "description": "Avient Corporation provides specialized formulator, services, and sustainable material solutions in the United States, Canada, Mexico, Europe, South America, and Asia. It operates through three segments: Color, Additives and Inks; Specialty Engineered Materials; and Distribution. The Color, Additives and Inks segment offers specialized color and additive concentrates in solid and liquid form for thermoplastics; dispersions for thermosets; and specialty inks. This segment products are used in various markets include medical, pharmaceutical devices, food packaging, personal care, cosmetics, transportation, building products, recreational, athletic apparel, construction, filtration, outdoor furniture, healthcare, wire, and cable. The Specialty Engineered Materials segment provides specialty polymer formulations, services, and solutions for designers, assemblers, and processors of thermoplastic materials; and long glass and carbon fiber technology to thermoset and thermoplastic composites. The Distribution segment distributes approximately 4,000 grades of engineering and commodity grade resins to custom injection molders and extruders. The company sells its products through direct sales personnel, distributors, and commissioned sales agents. The company was formerly known as PolyOne Corporation and changed its name to Avient Corporation in June 2020. Avient Corporation was founded in 1885 and is headquartered in Avon Lake, Ohio.",
    "ceo": "Mr. Robert M. Patterson",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "9700",
    "phone": "440 930 1000",
    "address": "33587 Walker Road",
    "city": "Avon Lake",
    "state": "OH",
    "zip": "44012",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AVNT.png",
    "ipoDate": "1999-09-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]