[
  {
    "symbol": "AVT",
    "price": 47.87,
    "beta": 1.369014,
    "volAvg": 523246,
    "mktCap": 4375289278,
    "lastDiv": 1.16,
    "range": "35.45-49.16",
    "changes": 0.39,
    "companyName": "Avnet, Inc.",
    "currency": "USD",
    "cik": "0000008858",
    "isin": "US0538071038",
    "cusip": "053807103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Electronics & Computer Distribution",
    "website": "https://www.avnet.com",
    "description": "Avnet, Inc., a technology solutions company, markets, sells, and distributes electronic components. The company operates through two segments, Electronic Components and Farnell. The Electronic Components segment markets, sells, and distributes semiconductors; interconnect, passive, and electromechanical devices; and other integrated components from electronic component manufacturers. It also offers design chain support that provides engineers with technical design solutions; engineering and technical resources to support product design, bill of materials development, and technical education and training; and supply chain solutions that provide support and logistical services to original equipment manufacturers, electronic manufacturing service providers, and electronic component manufacturers. In addition, this segment provides integrated solutions, such as technical design, integration, and assembly of embedded products, and systems and solutions primarily for industrial applications, as well as for intelligent and innovative embedded display solutions comprising touch and passive displays. Further, it develops and manufactures standard board and industrial subsystems, and application-specific devices that enable it to produce systems tailored to specific customer requirements. This segment serves various markets, such as automotive, medical, defense, aerospace, telecommunications, industrial, and digital editing. The Farnell segment distributes kits, tools, and electronic and industrial automation components, as well as test and measurement products to engineers and entrepreneurs. It has operations in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Avnet, Inc. was founded in 1921 and is headquartered in Phoenix, Arizona.",
    "ceo": "Mr. Philip R. Gallagher",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "15300",
    "phone": "480 643 2000",
    "address": "2211 South 47th Street",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85034",
    "dcfDiff": 0.43356,
    "dcf": 46.3636,
    "image": "https://financialmodelingprep.com/image-stock/AVT.png",
    "ipoDate": "1973-05-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]