[
  {
    "symbol": "AVTR",
    "price": 19.51,
    "beta": 1.333219,
    "volAvg": 6338240,
    "mktCap": 13171356456,
    "lastDiv": 0,
    "range": "17.91-32.765",
    "changes": -0.06,
    "companyName": "Avantor, Inc.",
    "currency": "USD",
    "cik": "0001722482",
    "isin": "US05352A1007",
    "cusip": "05352A100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.avantorsciences.com",
    "description": "Avantor, Inc. provides products and services to customers in biopharma, healthcare, education and government, advanced technologies, and applied materials industries in the Americas, Europe, Asia, the Middle East, and Africa. The company offers materials and consumables, such as purity chemicals and reagents, lab products and supplies, formulated silicone materials, customized excipients, customized single-use assemblies, process chromatography resins and columns, analytical sample prep kits, education and microbiology products, clinical trial kits, peristaltic pumps, and fluid handling tips. It also provides equipment and instrumentation products, including filtration systems, virus inactivation systems, incubators, analytical instruments, evaporators, ultra-low-temperature freezers, biological safety cabinets, and critical environment supplies. In addition, the company offers services and specialty procurements comprising onsite lab and production, clinical, equipment, procurement and sourcing, and biopharmaceutical material scale-up and development services. Avantor, Inc. was founded in 1904 and is headquartered in Radnor, Pennsylvania.",
    "ceo": "Mr. Michael  Stubblefield",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "14500",
    "phone": "610 386 1700",
    "address": "Radnor Corporate Center",
    "city": "Radnor",
    "state": "PA",
    "zip": "19087",
    "dcfDiff": 2.86406,
    "dcf": 21.2359,
    "image": "https://financialmodelingprep.com/image-stock/AVTR.png",
    "ipoDate": "2019-05-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]