[
  {
    "symbol": "AVVIY",
    "price": 9.94,
    "beta": 1.031034,
    "volAvg": 61148,
    "mktCap": 13607959877,
    "lastDiv": 0.74,
    "range": "8.05-11.39",
    "changes": -0.06,
    "companyName": "Aviva plc",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Insurance—Diversified",
    "website": "https://www.aviva.com",
    "description": "Aviva plc provides various insurance, retirement, investment, and savings products in the United Kingdom, Ireland, Canada, and internationally. The company offers life insurance, long-term health and accident insurance, savings, pension, and annuity products, as well as pension fund business and lifetime mortgage products. It also provides insurance cover to individuals, small and medium-sized businesses for risks associated with motor vehicles and medical expenses, as well as property and liability, such as employers' and professional indemnity liabilities. In addition, the company provides investment management services for institutional pension fund mandates; and manages various retail investment products, including investment funds, unit trusts, open-ended investment companies, and individual savings accounts for third-party financial institutions, pension funds, public sector organizations, investment professionals, and private investors. It markets its products through a network of insurance brokers, as well as MyAviva platform. The company was formerly known as CGNU plc and changed its name to Aviva plc in July 2002. Aviva plc was founded in 1696 and is headquartered in London, the United Kingdom.",
    "ceo": "Ms. Amanda Jayne Blanc ACII, MBA",
    "sector": "Financial Services",
    "country": "GB",
    "fullTimeEmployees": "24364",
    "phone": "44 20 7283 2000",
    "address": "St Helen’s",
    "city": "London",
    "state": null,
    "zip": "EC3P 3DQ",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AVVIY.png",
    "ipoDate": "2009-10-20",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]