[
  {
    "symbol": "AWI",
    "price": 72.37,
    "beta": 1.103521,
    "volAvg": 452459,
    "mktCap": 3265254793,
    "lastDiv": 1.02,
    "range": "62.03-94.94",
    "changes": -0.61,
    "companyName": "Armstrong World Industries, Inc.",
    "currency": "USD",
    "cik": "0000007431",
    "isin": "US04247X1028",
    "cusip": "04247X102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.armstrongceilings.com",
    "description": "Armstrong World Industries, Inc., together with its subsidiaries, designs, manufactures, and sells ceiling systems primarily for use in the construction and renovation of residential and commercial buildings in the United States, Canada, and Latin America. The company operates through Mineral Fiber and Architectural Specialties segments. The company produces suspended mineral fiber, soft fiber, fiberglass wool, and metal ceiling systems, as well as wood, wood fiber, glass-reinforced-gypsum, and felt ceiling and wall systems; ceiling component products, such as ceiling perimeters and trims, as well as grid products that support drywall ceiling systems; ceilings and walls for use in commercial settings; and acoustical controls, facades, and partitions. It sells its commercial ceiling and architectural specialties products to resale distributors and ceiling system contractors; and residential ceiling products to wholesalers and retailers, such as large home centers. The company was incorporated in 1891 and is headquartered in Lancaster, Pennsylvania.",
    "ceo": "Mr. Victor D. Grizzle",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "3000",
    "phone": "717-397-0611",
    "address": "2500 Columbia Avenue",
    "city": "Lancaster",
    "state": "PA",
    "zip": "17603",
    "dcfDiff": 1.50802,
    "dcf": 77.928,
    "image": "https://financialmodelingprep.com/image-stock/AWI.png",
    "ipoDate": "2006-10-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]