[
  {
    "symbol": "AWK",
    "price": 140.98,
    "beta": 0.576408,
    "volAvg": 889454,
    "mktCap": 27440911120,
    "lastDiv": 2.83,
    "range": "122.77-162.59",
    "changes": -1.9,
    "companyName": "American Water Works Company, Inc.",
    "currency": "USD",
    "cik": "0001410636",
    "isin": "US0304201033",
    "cusip": "030420103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Water",
    "website": "https://www.amwater.com",
    "description": "American Water Works Company, Inc., through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 14 states serving approximately 3.4 million active customers. The company serves residential customers; commercial customers, including food and beverage providers, commercial property developers and proprietors, and energy suppliers; fire service and private fire customers; industrial customers, such as large-scale manufacturers, mining, and production operations; public authorities comprising government buildings and other public sector facilities, such as schools and universities; and other utilities and community water and wastewater systems. It also provides water and wastewater services on various military installations; and undertakes contracts with municipal customers, primarily to operate and manage water and wastewater facilities, as well as offers other related services. In addition, the company operates approximately 80 surface water treatment plants; 480 groundwater treatment plants; 160 wastewater treatment plants; 52,500 miles of transmission, distribution, and collection mains and pipes; 1,100 groundwater wells; 1,700 water and wastewater pumping stations; 1,300 treated water storage facilities; and 76 dams. It serves approximately 14 million people with drinking water, wastewater, and other related services in 24 states. American Water Works Company, Inc. was founded in 1886 and is headquartered in Camden, New Jersey.",
    "ceo": "Ms. M. Susan Hardwick",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "6500",
    "phone": "856 955 4001",
    "address": "1 Water Street",
    "city": "Camden",
    "state": "NJ",
    "zip": "08102-1658",
    "dcfDiff": 8.66264,
    "dcf": 148.357,
    "image": "https://financialmodelingprep.com/image-stock/AWK.png",
    "ipoDate": "2008-04-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]