[
  {
    "symbol": "AX",
    "price": 37.3,
    "beta": 1.454225,
    "volAvg": 502704,
    "mktCap": 2204899980,
    "lastDiv": 0,
    "range": "33.15-51.46",
    "changes": -0.32,
    "companyName": "Axos Financial, Inc.",
    "currency": "USD",
    "cik": "0001299709",
    "isin": "US05465C1009",
    "cusip": "05465C100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://axosfinancial.com",
    "description": "Axos Financial, Inc., together with its subsidiaries, provides consumer and business banking products in the United States. It operates through Banking Business and Securities Business segments. The company offers deposits products, including consumer and business checking, demand, savings, time deposit, money market, zero balance, and insured cash sweep accounts. It also provides single family, multifamily, and commercial mortgage loans; commercial real estate secured loans; commercial and industrial non-real estate, asset-backed, lines of credit, and term loans; automobile loans; fixed rate term unsecured loans; and other loans, such as structure settlements, small business administration consumer loans, and securities-backed loans. In addition, the company offers ACH origination, wire transfer, commercial check printing, business bill pay and account transfer; remote deposit capture, mobile deposit, lockbox, merchant, and online payment portal; concierge banking; mobile and text messaging banking; and payment services, as well as debit and credit cards, and digital wallets. Further, it provides disclosed clearing services; back-office services, such as record keeping, trade reporting, accounting, general back-office support, securities and margin lending, reorganization assistance, and custody of securities; and financing to brokerage customers. The company was formerly known as BofI Holding, Inc. and changed its name to Axos Financial, Inc. in September 2018. Axos Financial, Inc. was incorporated in 1999 and is based in Las Vegas, Nevada.",
    "ceo": "Mr. Gregory  Garrabrants C.F.A., J.D.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1466",
    "phone": "858 649 2218",
    "address": "9205 West Russell Road",
    "city": "Las Vegas",
    "state": "NV",
    "zip": "89148",
    "dcfDiff": 3.76466,
    "dcf": 51.6647,
    "image": "https://financialmodelingprep.com/image-stock/AX.png",
    "ipoDate": "2005-03-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]