[
  {
    "symbol": "AXNX",
    "price": 50.27,
    "beta": 0.395278,
    "volAvg": 587675,
    "mktCap": 2532788599,
    "lastDiv": 0,
    "range": "47.59-79.92",
    "changes": 2.28,
    "companyName": "Axonics, Inc.",
    "currency": "USD",
    "cik": "0001603756",
    "isin": "US05465P1012",
    "cusip": "05465P101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Devices",
    "website": "https://www.axonics.com",
    "description": "Axonics, Inc., a medical technology company, engages in the development and commercialization of sacral neuromodulation (SNM) systems. The company's SNM systems are used to treat patients with overactive bladder, including urinary urge incontinence and urinary urgency frequency, as well as fecal incontinence and non-obstructive urinary retention. Its proprietary rechargeable SNM System (r-SNM) delivers mild electrical pulses to the targeted sacral nerve to restore normal communication to and from the brain to reduce the symptoms of bladder and bowel dysfunction. The company also offers Bulkamid, a urethral bulking agent to treat female stress urinary incontinence. It sells its products through a direct salesforce and distributors in the United States, the United Kingdom, Germany, the Netherlands, Nordic countries, and internationally. The company was formerly known as Axonics Modulation Technologies, Inc. and changed its name to Axonics, Inc. in March 2021. Axonics, Inc. was incorporated in 2012 and is based in Irvine, California.",
    "ceo": "Mr. Raymond W. Cohen",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "610",
    "phone": "949 396 6322",
    "address": "26 Technology Drive",
    "city": "Irvine",
    "state": "CA",
    "zip": "92618",
    "dcfDiff": 6.50269,
    "dcf": 68.9627,
    "image": "https://financialmodelingprep.com/image-stock/AXNX.png",
    "ipoDate": "2018-10-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]