[
  {
    "symbol": "AXON",
    "price": 194.59,
    "beta": 0.919718,
    "volAvg": 1180954,
    "mktCap": 14377339749,
    "lastDiv": 0,
    "range": "88.61-229.95",
    "changes": -0.79,
    "companyName": "Axon Enterprise, Inc.",
    "currency": "USD",
    "cik": "0001069183",
    "isin": "US05464C1018",
    "cusip": "05464C101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Aerospace & Defense",
    "website": "https://www.axon.com",
    "description": "Axon Enterprise, Inc. develops, manufactures, and sells conducted energy devices (CEDs) under the TASER brand in the United States and internationally. It operates through two segments, TASER, and Software and Sensors. The company also offers hardware and cloud-based software solutions that enable law enforcement to capture, securely store, manage, share, and analyze video and other digital evidence. Its products include TASER 7, TASER X26P, TASER X2, TASER Consumer devices, and related cartridges; on-officer body cameras, Axon Fleet in-car systems, and other devices; Axon Evidence digital evidence management software; Axon Signal enabled devices, as well as hardware extended warranties; and Axon docks, cartridges, and batteries. It sells its products through its direct sales force, distribution partners, online store, and third-party resellers. Axon Enterprise, Inc. has a strategic partnership with Fusus, Inc. to expand the capabilities of Axon Respond and the Fusus Real Time Crime Center in the Cloud solution to provide agencies real-time operations situational awareness, including streamlined investigative workflows. The company was formerly known as TASER International, Inc. and changed its name to Axon Enterprise, Inc. in April 2017. Axon Enterprise, Inc. was incorporated in 1993 and is headquartered in Scottsdale, Arizona.",
    "ceo": "Mr. Patrick W. Smith",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "2821",
    "phone": "480 991 0797",
    "address": "17800 North 85th Street",
    "city": "Scottsdale",
    "state": "AZ",
    "zip": "85255",
    "dcfDiff": 1.10758,
    "dcf": 192.718,
    "image": "https://financialmodelingprep.com/image-stock/AXON.png",
    "ipoDate": "2001-06-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]