[
  {
    "symbol": "AXP",
    "price": 169.78,
    "beta": 1.180281,
    "volAvg": 3090617,
    "mktCap": 126187461055,
    "lastDiv": 2.4,
    "range": "130.65-182.15",
    "changes": 1.59,
    "companyName": "American Express Company",
    "currency": "USD",
    "cik": "0000004962",
    "isin": "US0258161092",
    "cusip": "025816109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Credit Services",
    "website": "https://www.americanexpress.com",
    "description": "American Express Company, together with its subsidiaries, provides charge and credit payment card products, and travel-related services worldwide. The company operates through three segments: Global Consumer Services Group, Global Commercial Services, and Global Merchant and Network Services. Its products and services include payment and financing products; network services; accounts payable expense management products and services; and travel and lifestyle services. The company's products and services also comprise merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, third-party vendors and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.",
    "ceo": "Mr. Stephen Joseph Squeri",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "77300",
    "phone": "212 640 2000",
    "address": "200 Vesey Street",
    "city": "New York",
    "state": "NY",
    "zip": "10285",
    "dcfDiff": 7.20224,
    "dcf": 179.512,
    "image": "https://financialmodelingprep.com/image-stock/AXP.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]