[
  {
    "symbol": "AXS",
    "price": 52.35,
    "beta": 0.852112,
    "volAvg": 477024,
    "mktCap": 4460214974,
    "lastDiv": 1.76,
    "range": "48.32-63.99",
    "changes": -1.31,
    "companyName": "AXIS Capital Holdings Limited",
    "currency": "USD",
    "cik": "0001214816",
    "isin": "BMG0692U1099",
    "cusip": "G0692U109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.axiscapital.com",
    "description": "AXIS Capital Holdings Limited, through its subsidiaries, provides various specialty insurance and reinsurance products worldwide. It operates through two segments, Insurance and Reinsurance. The Insurance segment offers property insurance products for commercial buildings, residential premises, construction projects, and onshore energy installations; marine insurance products covering offshore energy, cargo, liability, recreational marine, fine art, specie, and hull war; and terrorism, aviation, credit and political risk, and liability insurance products. It also provides professional insurance products that cover directors' and officers' liability, errors and omissions liability, employment practices liability, fiduciary liability, crime, professional indemnity, cyber and privacy, medical malpractice, and other financial insurance related coverages for commercial enterprises, financial institutions, not-for-profit organizations, and other professional service providers. In addition, this segment offers accidental death, travel, and specialty health products for employer and affinity groups. The Reinsurance segment offers reinsurance products to insurance companies, including catastrophe reinsurance products; property reinsurance products covering property damage and related losses resulting from natural and man-made perils; professional lines; credit and surety; and motor liability products. This segment also provides agriculture reinsurance products; coverages for various types of construction risks and risks related to erection, testing, and commissioning of machinery and plants during the construction stage; marine and aviation reinsurance products; and personal accident, specialty health, accidental death, travel, life and disability reinsurance products. The company was founded in 2001 and is headquartered in Pembroke, Bermuda.",
    "ceo": "Mr. Vincent Christopher Tizzio",
    "sector": "Financial Services",
    "country": "BM",
    "fullTimeEmployees": "2064",
    "phone": "4414962600",
    "address": "AXIS House",
    "city": "Pembroke",
    "state": null,
    "zip": "HM 08",
    "dcfDiff": 3.2834,
    "dcf": 65.7134,
    "image": "https://financialmodelingprep.com/image-stock/AXS.png",
    "ipoDate": "2003-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]