[
  {
    "symbol": "AXSM",
    "price": 74.98,
    "beta": 1.913732,
    "volAvg": 793201,
    "mktCap": 3267118536,
    "lastDiv": 0,
    "range": "35.16-91.29",
    "changes": -8.39,
    "companyName": "Axsome Therapeutics, Inc.",
    "currency": "USD",
    "cik": "0001579428",
    "isin": "US05464T1043",
    "cusip": "05464T104",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.axsome.com",
    "description": "Axsome Therapeutics, Inc., a biopharmaceutical company, engages in the development of novel therapies for central nervous system (CNS) disorders in the United States. The company's product pipeline includes AXS-05, a therapeutic for the treatment of major depressive disorder and resistant depression disorders; and that is in the Phase III clinical trial to treat Alzheimer's disease agitation, as well as that has completed phase II clinical trial for the treatment of smoking cessation. It is also developing AXS-07, a novel, oral, rapidly absorbed, multi-mechanistic, and investigational medicine that has completed two Phase III trials for the acute treatment of migraine; AXS-12, a selective and potent norepinephrine reuptake inhibitor, which is in Phase III trial to treat narcolepsy; and AXS-14, a novel, oral, and investigational medicine that is in Phase III trial for the treatment of fibromyalgia. Axsome Therapeutics, Inc. has a research collaboration agreement with Duke University for evaluating AXS-05 in smoking cessation. The company was incorporated in 2012 and is based in New York, New York.",
    "ceo": "Dr. Herriot  Tabuteau M.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "393",
    "phone": "212 332 3241",
    "address": "22 Cortlandt Street",
    "city": "New York",
    "state": "NY",
    "zip": "10007",
    "dcfDiff": 10.6792,
    "dcf": 59.5908,
    "image": "https://financialmodelingprep.com/image-stock/AXSM.png",
    "ipoDate": "2015-11-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]