[
  {
    "symbol": "AXTA",
    "price": 32.39,
    "beta": 1.434154,
    "volAvg": 2222709,
    "mktCap": 7175453611,
    "lastDiv": 0,
    "range": "20.66-32.88",
    "changes": 0.03,
    "companyName": "Axalta Coating Systems Ltd.",
    "currency": "USD",
    "cik": "0001616862",
    "isin": "BMG0750C1082",
    "cusip": "G0750C108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.axalta.com",
    "description": "Axalta Coating Systems Ltd., through its subsidiaries, manufactures, markets, and distributes high-performance coatings systems in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. It operates through two segments, Performance Coatings and Transportation Coatings. The company offers water and solvent-borne products and systems to repair damaged vehicles for independent body shops, multi-shop operators, and original equipment manufacturer (OEM) dealership body shops. It also provides functional and decorative liquid, and powder coatings used in various industrial applications, including architectural cladding and fittings, automotive coatings, general industrial, job coaters, energy solutions, HVAC, appliances, industrial wood, coil, and oil and gas pipelines; and coatings for building materials, cabinet, wood and luxury vinyl flooring, and furniture market under the Voltatex, AquaEC, Durapon, Hydropon, UNRIVALED, Tufcote, and Ceranamel for liquid coatings; and Alesta, Nap-Gard, Abcite, Teodur, and Plascoat brands for powder coatings. In addition, the company develops and supplies electrocoat, primer, the basecoat, and clearcoat products for OEMs of light and commercial vehicles; and coatings systems for various commercial applications, including HDT, bus, and rail under the Imron, Imron Elite, Centari, Rival, Corlar epoxy undercoats, and AquaEC brands. It also sells its product under the Audurra, Challenger, Chemophan, ColorNet, Cromax, Cromax Mosaic, Durapon 70, Duxone, Harmonized Coating Technologies, Imron ExcelPro, Lutophen, Nason, Spies Hecker, Standox, Stollaquid, Syntopal, Syrox, Raptor, U-POL, and Vermeera brand names. The company was formerly known as Axalta Coating Systems Bermuda Co., Ltd. and changed its name to Axalta Coating Systems Ltd. in August 2014. Axalta Coating Systems Ltd. was founded in 1866 and is headquartered in Philadelphia, Pennsylvania.",
    "ceo": "Mr. Chrishan Anthon Sebastian Villavarayan",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "12000",
    "phone": "855 547 1461",
    "address": "50 Applied Bank Blvd",
    "city": "Glen Mills",
    "state": "PA",
    "zip": "19342",
    "dcfDiff": 0.0818639,
    "dcf": 29.3519,
    "image": "https://financialmodelingprep.com/image-stock/AXTA.png",
    "ipoDate": "2014-11-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]