[
  {
    "symbol": "AYI",
    "price": 160.66,
    "beta": 1.572887,
    "volAvg": 369690,
    "mktCap": 5108714878,
    "lastDiv": 0.52,
    "range": "149.3-202.9",
    "changes": -0.9,
    "companyName": "Acuity Brands, Inc.",
    "currency": "USD",
    "cik": "0001144215",
    "isin": "US00508Y1029",
    "cusip": "00508Y102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electrical Equipment & Parts",
    "website": "https://www.acuitybrands.com",
    "description": "Acuity Brands, Inc. provides lighting and building management solutions in North America and internationally. The company operates through two segments, Acuity Brands Lighting and Lighting Controls (ABL); and the Intelligent Spaces Group (ISG). The ABL segment provides commercial, architectural, and specialty lighting solutions, as well as lighting controls and components for various indoor and outdoor applications under the Lithonia Lighting, Holophane, Peerless, Gotham, Mark Architectural Lighting, Winona Lighting, Juno, Indy, Aculux, Healthcare Lighting, Hydrel, American Electric Lighting, Sunoptics, eldoLED, nLight, Sensor Switch, IOTA, A-Light, Cyclone, Eureka, Lumniaire LED, Luminis, Dark to Light, and RELOC Wiring Solutions brands. This segment serves electrical distributors, retail home improvement centers, electric utilities, national accounts, digital retailers, lighting showrooms, and energy service companies. The ISG segment offers building management systems and location-aware applications under the Distech Controls, Atrius, and Rockpile Ventures brands. This segment serves system integrators, as well as retail stores, airports, and enterprise campuses. Acuity Brands, Inc. was incorporated in 2001 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. Neil M. Ashe",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "13200",
    "phone": "404 853 1400",
    "address": "1170 Peachtree Street, N.E.",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30309-7676",
    "dcfDiff": 15.8335,
    "dcf": 200.953,
    "image": "https://financialmodelingprep.com/image-stock/AYI.png",
    "ipoDate": "2001-12-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]