[
  {
    "symbol": "AYX",
    "price": 43.48,
    "beta": 0.495422,
    "volAvg": 1863695,
    "mktCap": 3063152652,
    "lastDiv": 0,
    "range": "34.7-70.63",
    "changes": -0.19,
    "companyName": "Alteryx, Inc.",
    "currency": "USD",
    "cik": "0001689923",
    "isin": "US02156B1035",
    "cusip": "02156B103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.alteryx.com",
    "description": "Alteryx, Inc. operates in analytic process automation business in the Asia-Pacific, Europe, the Middle East, Africa, Latin America, and internationally. The company's analytics platform enables organizations to enhance business outcomes and the productivity of their business analysts, data scientists, citizen data scientists, and data engineers. Its analytics platform comprises Alteryx Designer, a data profiling, preparation, blending, analytics, data science, and process automation product; Alteryx Server, a server-based product to manage, automate, and govern processes and applications in a web-based environment; Alteryx Intelligence Suite, an augmented machine learning, auto-modeling, and text mining product; Alteryx Connect, a collaborative data exploration platform; and Alteryx Promote, an analytics model management product for data scientists and analytics teams to build, manage, monitor, and deploy predictive models into real-time production applications. The company's platform also offers cloud-native products comprising Alteryx Designer Cloud, a browser-based version of Alteryx Designer product; Alteryx Machine Learning, an automated machine learning product to build, validate, iterate, and explore machine learning models; Alteryx Auto Insights, an analytics solution that automates insights for business users; and Alteryx Trifacta, an open and interactive cloud platform for data engineers and analysts to collaboratively profile, prepare, and pipeline data for analytics and machine learning. In addition, it provides technical support, instruction, and customer services. It serves retail, food services, consumer products, telecom and cable, media and entertainment, professional services, financial services, energy and utilities, public sector, manufacturing, travel and hospitality, healthcare and insurance, and technology industries. The company was founded in 1997 and is headquartered in Irvine, California.",
    "ceo": "Mr. Mark F. Anderson",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2850",
    "phone": "888 836 4274",
    "address": "17200 Laguna Canyon Road",
    "city": "Irvine",
    "state": "CA",
    "zip": "92618",
    "dcfDiff": 10.2733,
    "dcf": 45.7467,
    "image": "https://financialmodelingprep.com/image-stock/AYX.png",
    "ipoDate": "2017-03-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]