[
  {
    "symbol": "AZEK",
    "price": 29.74,
    "beta": 1.615903,
    "volAvg": 1683204,
    "mktCap": 4444791938,
    "lastDiv": 0,
    "range": "15.12-30.26",
    "changes": 0.66,
    "companyName": "The AZEK Company Inc.",
    "currency": "USD",
    "cik": "0001782754",
    "isin": "US05478C1053",
    "cusip": "05478C105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://azekco.com",
    "description": "The AZEK Company Inc. engages in designing, manufacturing, and selling building products for residential, commercial, and industrial markets in the United States. It operates through two segments: Residential and Commercial. The Residential segment designs and manufactures engineered outdoor living products, which includes decking, railing, trim and moulding, and accessories under the TimberTech, AZEK Exteriors, VERSATEX, and ULTRALOX brand name. Its Commercial segment manufactures engineered polymer materials that is used in various industries, which includes outdoor, graphic displays and signage, educational, and recreational markets, as well as the food processing and chemical industries. This segment also offers bathroom partitions, shower and dressing stalls, lockers, and other storage solutions under the Aria, Eclipse, Hiny Hiders, TuffTec, and Duralife brand name to schools, parks, stadium arenas, industrial plants, and retail, recreational, and commercial facilities. The company was formerly known as CPG Newco LLC and changed its name to The AZEK Company Inc. in June 2020. The AZEK Company Inc. was incorporated in 2013 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Jesse G. Singh",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "2182",
    "phone": "877 275 2935",
    "address": "1330 West Fulton Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60607",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AZEK.png",
    "ipoDate": "2020-06-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]