[
  {
    "symbol": "AZN",
    "price": 70.96,
    "beta": 0.194636,
    "volAvg": 4156819,
    "mktCap": 219957543588,
    "lastDiv": 1.45,
    "range": "52.65-76.56",
    "changes": -0.71,
    "companyName": "AstraZeneca PLC",
    "currency": "USD",
    "cik": "0000901832",
    "isin": "US0463531089",
    "cusip": "046353108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.astrazeneca.com",
    "description": "AstraZeneca PLC, a biopharmaceutical company, focuses on the discovery, development, manufacturing, and commercialization of prescription medicines. Its marketed products include Calquence, Enhertu, Faslodex, Imfinzi, Iressa, Koselugo, Lumoxiti, Lynparza, Orpathys, Tagrisso, and Zoladex for oncology; Brilinta/Brilique, Bydureon/Byetta, BCise, Byetta, Crestor, Evrenzo, Farxiga/Forxiga, Komboglyze/Kombiglyze XR, Lokelma, Onglyza, Qtern, and Xigduo/Xigduo XR for cardiovascular, renal, and metabolism diseases; Bevespi Aerosphere, Breztri Aerosphere, Daliresp/Daxas, Duaklir Genuair, Fasenra, Pulmicort, Saphnelo, Symbicort, and Tudorza/Eklira/Bretaris for respiratory and immunology; and Andexxa/Ondexxya, Kanuma, Soliris, Strensiq, and Ultomiris for rare diseases. The company's marketed products also comprise Synagis for respiratory syncytial virus; Fluenz Tetra/FluMist Quadrivalent for Influenza; Seroquel IR/Seroquel XR for schizophrenia bipolar disease; Nexium, and Losec/Prilosec for gastroenterology; and Vaxzevria and Evusheld for covid-19. The company serves primary care and specialty care physicians through distributors and local representative offices in the United Kingdom, rest of Europe, the Americas, Asia, Africa, and Australasia. It has a collaboration agreement with Regeneron Pharmaceuticals, Inc. to research, develop, and commercialize small molecule medicines for obesity; Neurimmune AG to develop and commercialize NI006; Ionis Pharmaceuticals, Inc. to develop eplontersen, a liver-targeted antisense therapy in Phase III development for the treatment of transthyretin amyloidosis; Proteros Biostructures GmbH to jointly discover novel small molecules for the treatment of hematological cancers; Sierra Oncology, Inc. to develop and commercialize AZD5153. The company was formerly known as Zeneca Group PLC and changed its name to AstraZeneca PLC in April 1999. AstraZeneca PLC was incorporated in 1992 and is headquartered in Cambridge, the United Kingdom.",
    "ceo": "Mr. Pascal  Soriot D.V.M., M.B.A.",
    "sector": "Healthcare",
    "country": "GB",
    "fullTimeEmployees": "83500",
    "phone": "44 20 3749 5000",
    "address": "1 Francis Crick Avenue",
    "city": "Cambridge",
    "state": null,
    "zip": "CB2 0AA",
    "dcfDiff": 2.31013,
    "dcf": 67.8401,
    "image": "https://financialmodelingprep.com/image-stock/AZN.png",
    "ipoDate": "1993-05-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]