[
  {
    "symbol": "AZTA",
    "price": 46.04,
    "beta": 1.561267,
    "volAvg": 1149075,
    "mktCap": 3000270264,
    "lastDiv": 3.960000000000002,
    "range": "36.01-78.15",
    "changes": 1.21,
    "companyName": "Azenta, Inc.",
    "currency": "USD",
    "cik": "0000933974",
    "isin": "US1143401024",
    "cusip": "114340102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.azenta.com",
    "description": "Azenta, Inc. provides life science sample exploration and management solutions for the life sciences market in North America, Europe, China, the Asia Pacific, and internationally. The company operates through two reportable segments, Life Sciences Products and Life Sciences Services. The Life Sciences Products segment offers automated cold sample management systems for compound and biological sample storage; equipment for sample preparation and handling; consumables; and instruments that help customers in managing samples throughout their research discovery and development workflows. The Life Sciences Services segment provides comprehensive sample management programs, integrated cold chain solutions, informatics, and sample-based laboratory services to advance scientific research and support drug development. This segment's services include sample storage, genomic sequencing, gene synthesis, laboratory processing, laboratory analysis, biospecimen procurement, and other support services. It serves a range of life science customers, including pharmaceutical companies, biotechnology companies, biorepositories, and research institutes. The company was formerly known as Brooks Automation, Inc. and changed its name to Azenta, Inc. in December 2021. Azenta, Inc. was founded in 1978 and is headquartered in Chelmsford, Massachusetts.",
    "ceo": "Dr. Stephen S. Schwartz",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "3600",
    "phone": "978 262 2626",
    "address": "15 Elizabeth Drive",
    "city": "Chelmsford",
    "state": "MA",
    "zip": "01824",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/AZTA.png",
    "ipoDate": "1995-02-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]