[
  {
    "symbol": "BA",
    "price": 210.72,
    "beta": 1.425352,
    "volAvg": 5472561,
    "mktCap": 126767884308,
    "lastDiv": 59.013805000000026,
    "range": "120.99-223.91",
    "changes": 1.29,
    "companyName": "The Boeing Company",
    "currency": "USD",
    "cik": "0000012927",
    "isin": "US0970231058",
    "cusip": "097023105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.boeing.com",
    "description": "The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sales, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through four segments: Commercial Airplanes; Defense, Space & Security; Global Services; and Boeing Capital. The Commercial Airplanes segment provides commercial jet aircraft for passenger and cargo requirements, as well as fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Capital segment offers financing services and manages financing exposure for a portfolio of equipment under operating leases, sales-type/finance leases, notes and other receivables, assets held for sale or re-lease, and investments. The company was incorporated in 1916 and is based in Chicago, Illinois.",
    "ceo": "Mr. David L. Calhoun",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "156000",
    "phone": "312 544 2000",
    "address": "100 North Riverside Plaza",
    "city": "Chicago",
    "state": "IL",
    "zip": "60606-1596",
    "dcfDiff": 24.0789,
    "dcf": 187.091,
    "image": "https://financialmodelingprep.com/image-stock/BA.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]