[
  {
    "symbol": "BACHY",
    "price": 10.02,
    "beta": 0.411111,
    "volAvg": 53079,
    "mktCap": 145912243824,
    "lastDiv": 0.84,
    "range": "7.98-10.87",
    "changes": 0.015,
    "companyName": "Bank of China Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US06426M1045",
    "cusip": "06426M104",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Diversified",
    "website": "https://www.boc.cn",
    "description": "Bank of China Limited, together with its subsidiaries, provides various banking and financial services. It operates through six segments: Corporate Banking, Personal Banking, Treasury Operations, Investment Banking, Insurance, and Other Operations. The Corporate Banking segment offers current accounts, deposits, overdrafts, loans, trade-related products and other credit facilities, foreign currency, derivatives, and wealth management products to corporate customers, government authorities, and financial institutions. The Personal Banking segment provides savings deposits, personal loans, credit and debit cards, payments and settlements, wealth management products, and funds and insurance agency services to retail customers. The Treasury Operations segment is involved in foreign exchange transactions, customer-based interest rate and foreign exchange derivative transactions, money market transactions, proprietary trading, and asset and liability management. The Investment Banking segment offers debt and equity underwriting, financial advisory, stock brokerage, investment research and asset management, and private equity investment services, as well as sells and trades in securities. The Insurance segment underwrites general and life insurance products; and provides insurance agency services. As of December 31, 2021, the company had 10,382 branches and outlets, which include 520 institutions in the Chinese mainland and 550 institutions in Hong Kong, Macao, Taiwan, and other countries. It is also involved in the aircraft leasing business. The company was founded in 1912 and is headquartered in Beijing, China.",
    "ceo": "Mr. Jin  Liu",
    "sector": "Financial Services",
    "country": "CN",
    "fullTimeEmployees": "306182",
    "phone": "86 10 6659 6688",
    "address": "No. 1 Fuxingmen Nei Dajie",
    "city": "Beijing",
    "state": null,
    "zip": "100818",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BACHY.png",
    "ipoDate": "2009-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]