[
  {
    "symbol": "BAESY",
    "price": 47.57,
    "beta": 0.584291,
    "volAvg": 416709,
    "mktCap": 36274930488,
    "lastDiv": 1.32,
    "range": "33.64-52.73",
    "changes": -0.14,
    "companyName": "BAE Systems plc",
    "currency": "USD",
    "cik": "0000895564",
    "isin": null,
    "cusip": "05523R107",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Aerospace & Defense",
    "website": "https://www.baesystems.com",
    "description": "BAE Systems plc provides defense, aerospace, and security solutions worldwide. The company operates through five segments: Electronic Systems, Cyber & Intelligence, Platforms & Services (US), Air, and Maritime. The Electronic Systems segment offers electronic warfare systems, navigation systems, electro-optical sensors, military and commercial digital engine and flight controls, precision guidance and seeker solutions, military communication systems and data links, persistent surveillance systems, space electronics, and electric drive propulsion systems. The Cyber & Intelligence segment provides solutions to modernize, maintain, and test cyber-harden aircraft, radars, missile systems, and mission applications that detect and deter threats to national security; systems engineering, integration, and sustainment services for critical weapons systems, C5ISR, and cyber security; and solutions and services to intelligence and federal/civilian agencies. It also offers data intelligence solutions to defend against national-scale threats, protect their networks, and data against attacks; security and intelligence solutions to the United Kingdom government and allied international governments; anti-fraud and regulatory compliance solutions; and enterprise-level data and digital services. The Platforms & Services (US) segment manufactures combat vehicles, weapons, and munitions, as well as provides ship repair services and the management of government-owned munitions facilities. The Air segment develops, manufactures, upgrades, and supports combat and jet trainer aircraft. The Maritime segment designs, manufactures, and supports surface ships, submarines, torpedoes, radars, and command and combat systems; and supplies naval gun systems. It also supplies naval weapon systems, missile launchers, and precision munitions. The company was founded in 1970 and is based in Farnborough, the United Kingdom.",
    "ceo": "Dr. Charles  Woodburn",
    "sector": "Industrials",
    "country": "GB",
    "fullTimeEmployees": "93100",
    "phone": "44 12 5237 3232",
    "address": "Warwick House",
    "city": "Farnborough",
    "state": null,
    "zip": "GU14 6YU",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BAESY.png",
    "ipoDate": "2003-10-23",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]