[
  {
    "symbol": "BAFYY",
    "price": 8.51,
    "beta": 0.822605,
    "volAvg": 1373,
    "mktCap": 2398534922,
    "lastDiv": 0.26,
    "range": "5.9-10.05",
    "changes": -0.64,
    "companyName": "Balfour Beatty plc",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Engineering & Construction",
    "website": "https://www.balfourbeatty.com",
    "description": "Balfour Beatty plc finances, designs, develops, builds, and maintains infrastructure in the United Kingdom, the United States, and internationally. It operates through three segments: Construction Services, Support Services, and Infrastructure Investments. The Construction Services segment provides civil engineering, building, ground engineering, mechanical and electrical, refurbishment, fit-out, and rail engineering services. The Support Services segment designs, upgrades, manages, and maintains water, gas, and electricity networks, as well as rail and highways. The Infrastructure Investments segment is involved in the acquisition, operation, and disposal of infrastructure assets, such as roads, hospitals, student accommodation, military housing, offshore transmission networks, waste and biomass, and other concessions. This segment also develops and finances public and private infrastructure projects. The company serves government departments and agencies, regulated utilities, and private sector organizations. Balfour Beatty plc was founded in 1909 and is based in London, the United Kingdom.",
    "ceo": "Mr. Leo M. Quinn BSc (Hons), MSc",
    "sector": "Industrials",
    "country": "GB",
    "fullTimeEmployees": "25230",
    "phone": "44 20 7216 6800",
    "address": "5 Churchill Place",
    "city": "London",
    "state": null,
    "zip": "E14 5HU",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BAFYY.png",
    "ipoDate": "2012-07-10",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]