[
  {
    "symbol": "BAH",
    "price": 108.66,
    "beta": 0.587323,
    "volAvg": 924161,
    "mktCap": 14233373400,
    "lastDiv": 1.88,
    "range": "87.04-112.55",
    "changes": -0.41,
    "companyName": "Booz Allen Hamilton Holding Corporation",
    "currency": "USD",
    "cik": "0001443646",
    "isin": "US0995021062",
    "cusip": "099502106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Consulting Services",
    "website": "https://www.boozallen.com",
    "description": "Booz Allen Hamilton Holding Corporation provides management and technology consulting, analytics, engineering, digital solutions, mission operations, and cyber services to governments, corporations, and not-for-profit organizations in the United States and internationally. The company offers consulting solutions for various domains, business strategies, human capital, and operations. It also provides analytics services, which focuses on delivering transformational solutions in the areas of artificial intelligence, such as machine learning and deep learning; data science, such as data engineering and predictive modeling; automation and decision analytics; and quantum computing. In addition, the company designs, develops, and implements solutions built on contemporary methodologies and modern architectures; delivers engineering services and solutions to define, develop, implement, sustain, and modernize complex physical systems; and provides cyber risk management solutions, such as prevention, detection, and cost effectiveness. Booz Allen Hamilton Holding Corporation was founded in 1914 and is headquartered in McLean, Virginia.",
    "ceo": "Mr. Horacio D. Rozanski",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "31900",
    "phone": "703 902 5000",
    "address": "8283 Greensboro Drive",
    "city": "McLean",
    "state": "VA",
    "zip": "22102",
    "dcfDiff": 19.6706,
    "dcf": 112.401,
    "image": "https://financialmodelingprep.com/image-stock/BAH.png",
    "ipoDate": "2010-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]