[
  {
    "symbol": "BAK",
    "price": 11.67,
    "beta": 0.738013,
    "volAvg": 1253237,
    "mktCap": 4650308280,
    "lastDiv": 15.883,
    "range": "6.26-15.45",
    "changes": -0.17,
    "companyName": "Braskem S.A.",
    "currency": "USD",
    "cik": "0001071438",
    "isin": "US1055321053",
    "cusip": "105532105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Chemicals",
    "website": "https://www.braskem.com.br",
    "description": "Braskem S.A., together with its subsidiaries, produces and sells thermoplastic resins. The company operates through three segments: Brazil, United States and Europe, and Mexico. The Brazil segment produces and sells chemicals, including ethylene, polymer and chemical grade propylene, butadiene, butene-1, benzene, toluene, and xylenes products; fuels, such as automotive gasoline, liquefied petroleum gas, ethyl tertiary-butyl ether, and methyl tertiary-butyl ether; intermediates, such as cumene; aliphatics, aromatics, and hydrogenated solvents; and specialties comprising isoprene, dicyclopentadiene, piperylene, nonene, tetramer, polyisobutylene, and hydrocarbon resins. This segment also produces and sells polyethylene (PE) and polypropylene (PP); supplies electricity and other inputs to second-generation producers; produces and sells of PE, including the production of green PE from renewable resources; and produces and sells polyvinyl chloride and caustic soda. The United States and Europe segment produces and sells PP in the United States and Germany. The Mexico segment produces and sells ethylene, high-density PE, and low-density PE in Mexico. It also manufactures, sells, imports, and exports chemicals, petrochemicals, and fules; produces, supplies, and sells utilities, such as steam, water, compressed air, and industrial gases; and provides industrial services. The company was formerly known as Copene Petroquímica do Nordeste S.A. and changed its name to Braskem S.A. in 2002. Braskem S.A. was founded in 1972 and is headquartered in Camaçari, Brazil.",
    "ceo": "Mr. Roberto  Bischoff",
    "sector": "Basic Materials",
    "country": "BR",
    "fullTimeEmployees": "8312",
    "phone": "55 11 3576 9000",
    "address": "120, Rua Lemos Monteiro",
    "city": "São Paulo",
    "state": "SP",
    "zip": "05501-050",
    "dcfDiff": 23.8886,
    "dcf": 32.9186,
    "image": "https://financialmodelingprep.com/image-stock/BAK.png",
    "ipoDate": "1999-01-13",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]