[
  {
    "symbol": "BALL",
    "price": 56.65,
    "beta": 0.783802,
    "volAvg": 1935872,
    "mktCap": 17819144200,
    "lastDiv": 0.8,
    "range": "46.0-74.35",
    "changes": -0.86,
    "companyName": "Ball Corporation",
    "currency": "USD",
    "cik": "0000009389",
    "isin": "US0584981064",
    "cusip": "058498106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaging & Containers",
    "website": "https://www.ball.com",
    "description": "Ball Corporation supplies aluminum packaging products for the beverage, personal care, and household products industries in the United States, Brazil, and internationally. It operates through four segments: Beverage Packaging, North and Central America; Beverage Packaging, Europe, Middle East and Africa; Beverage Packaging, South America; and Aerospace. The company manufactures and sells aluminum beverage containers to fillers of carbonated soft drinks, beer, energy drinks, and other beverages. It also develops spacecraft, sensors and instruments, radio frequency systems, and other technologies for the civil, commercial, and national security aerospace markets, as well as offers defense hardware, antenna and video tactical solutions, civil and operational space hardware, and systems engineering services. In addition, the company designs, manufactures, and tests satellites, remote sensors, and ground station control hardware and software; and provides launch vehicle integration and satellite operational services. Further, it offers target identification, warning, and attitude control systems and components; cryogenic systems and associated sensor cooling devices; star trackers; and fast-steering mirrors to the government agencies or their prime contractors. Additionally, the company manufactures and sells extruded aluminum aerosol containers, recloseable aluminum bottles, aluminum cups, and aluminum slugs. Ball Corporation was founded in 1880 and is headquartered in Westminster, Colorado.",
    "ceo": "Mr. Daniel William Fisher",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "21000",
    "phone": "303 469 3131",
    "address": "9200 West 108th Circle",
    "city": "Westminster",
    "state": "CO",
    "zip": "80021-2510",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BALL.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]