[
  {
    "symbol": "BAM",
    "price": 32.05,
    "beta": 0,
    "volAvg": 1411637,
    "mktCap": 13218317400,
    "lastDiv": 1.28,
    "range": "26.76-36.5",
    "changes": -0.57,
    "companyName": "Brookfield Asset Management Inc.",
    "currency": "USD",
    "cik": "0001001085",
    "isin": "CA1125851040",
    "cusip": "112585104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.brookfield.com",
    "description": "Brookfield Asset Management is an alternative asset manager and REIT/Real Estate Investment Manager firm focuses on real estate, renewable power, infrastructure and venture capital and private equity assets. It manages a range of public and private investment products and services for institutional and retail clients. It typically makes investments in sizeable, premier assets across geographies and asset classes. It invests both its own capital as well as capital from other investors. Within private equity and venture capital, it focuses on acquisition, early ventures, control buyouts and financially distressed, buyouts and corporate carve-outs, recapitalizations, convertible, senior and mezzanine financings, operational and capital structure restructuring, strategic re-direction, turnaround, and under-performing midmarket companies. It invests in both public debt and equity markets. It invests in private equity sectors with focus on Business Services include infrastructure, healthcare, road fuel distribution and marketing, construction and real estate; Industrials include manufacturers of automotive batteries, graphite electrodes, returnable plastic packaging, and sanitation management and development; and Residential/ infrastructure services. It targets companies which likely possess underlying real assets, primarily in sectors such as industrial products, building materials, metals, mining, homebuilding, oil and gas, paper and packaging, manufacturing and forest product sectors. It invests globally with focus on North America including Brazil, the United States, Canada; Europe; and Australia; and Asia-Pacific. The firm considers equity investments in the range of $2 million to $500 million. It has a four-year investment period and a 10-year term with two one-year extensions. The firm prefers to take minority stake and majority stake. Brookfield Asset Management Inc. was founded in 1997 and based in Toronto, Canada with additional offices across Northern America; South America; Europe; Middle East and Asia.",
    "ceo": "Mr. James Bruce Flatt",
    "sector": "Financial Services",
    "country": "CA",
    "fullTimeEmployees": "2500",
    "phone": "416-363-9491",
    "address": "Brookfield Place",
    "city": "Toronto",
    "state": "ON",
    "zip": "M5J 2T3",
    "dcfDiff": 19.5692,
    "dcf": 52.0692,
    "image": "https://financialmodelingprep.com/image-stock/BAM.png",
    "ipoDate": "2022-12-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]