[
  {
    "symbol": "BAMXF",
    "price": 119,
    "beta": 1.101532,
    "volAvg": 1001,
    "mktCap": 78344478716,
    "lastDiv": 9.24,
    "range": "65.5-122.0",
    "changes": -0.75,
    "companyName": "Bayerische Motoren Werke Aktiengesellschaft",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Auto Manufacturers",
    "website": "https://www.bmwgroup.com",
    "description": "Bayerische Motoren Werke Aktiengesellschaft, together with its subsidiaries, develops, manufactures, and sells automobiles and motorcycles, and spare parts and accessories worldwide. It operates through Automotive, Motorcycles, and Financial Services segments. The Automotive segment is involved in the development, manufacture, assembling, and sale of automobiles, spare parts, accessories, and mobility services under the BMW, MINI, and Rolls-Royce brands. This segment sells its products through independent and authorized dealerships. The Motorcycles segment develops, manufactures, assembles, and sells motorcycles and scooters under the BMW Motorrad brand name, as well as spare parts and accessories. The Financial Services segment engages in automobile leasing, retail and dealership financing, multi-brand fleet, customer deposit, and insurance activities; and the provision of fleet management services under the Alphabet brand. The company was founded in 1916 and is based in Munich, Germany.",
    "ceo": "Mr. Oliver  Zipse",
    "sector": "Consumer Cyclical",
    "country": "DE",
    "fullTimeEmployees": "149475",
    "phone": "49 89 382 0",
    "address": "Petuelring 130",
    "city": "Munich",
    "state": null,
    "zip": "80788",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BAMXF.png",
    "ipoDate": "2009-02-13",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]