[
  {
    "symbol": "BAP",
    "price": 144.94,
    "beta": 0.894014,
    "volAvg": 329233,
    "mktCap": 11527528094,
    "lastDiv": 0.679,
    "range": "113.21-158.95",
    "changes": -0.06,
    "companyName": "Credicorp Ltd.",
    "currency": "USD",
    "cik": "0001001290",
    "isin": "BMG2519Y1084",
    "cusip": "G2519Y108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.grupocredicorp.com",
    "description": "Credicorp Ltd., a financial service holding company, provides various financial, insurance, and health services and products primarily in Peru and internationally. The company's Universal Banking segment offers deposits and current accounts, and various credits and financial instruments to individuals and legal entities. Its Insurance and Pensions segment issues insurance policies to cover losses in commercial property, transportation, marine vessels, automobile, life, health, and pensions, as well as provides private pension fund management services. The company's Microfinance segment manages loans, credits, deposits, and current accounts of the small and microenterprises. Its Investment Banking and Wealth Management segment offers its services to corporations, institutional investors, governments, and foundations; engages in structuring and placement of issues in the primary market, as well as the execution and negotiation of operations in the secondary market; and structures securitization processes for corporate customers and manages mutual funds. The company was founded in 1889 and is headquartered in Lima, Peru.",
    "ceo": "Mr. Luis Enrique Romero Belismelis",
    "sector": "Financial Services",
    "country": "PE",
    "fullTimeEmployees": "37166",
    "phone": "51 1 313 2000",
    "address": "Calle Centenario 156",
    "city": "Lima",
    "state": null,
    "zip": "12",
    "dcfDiff": 503.267,
    "dcf": 643.997,
    "image": "https://financialmodelingprep.com/image-stock/BAP.png",
    "ipoDate": "1995-10-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]