[
  {
    "symbol": "BASFY",
    "price": 11.98,
    "beta": 1.311111,
    "volAvg": 147606,
    "mktCap": 42813405583,
    "lastDiv": 0.94,
    "range": "9.01-14.74",
    "changes": 0.1429,
    "companyName": "BASF SE",
    "currency": "USD",
    "cik": null,
    "isin": "US0552625057",
    "cusip": "055262505",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Chemicals",
    "website": "https://www.basf.com",
    "description": "BASF SE operates as a chemical company worldwide. The company operates through six segments: Chemicals, Materials, Industrial Solutions, Surface Technologies, Nutrition & Care, and Agricultural Solutions. The Chemicals segment provides petrochemicals and intermediates. The Materials segment offers advanced materials and their precursors for applications and systems, such as isocyanates and polyamides, as well as inorganic basic products and specialties for plastic and plastic processing industries. The Industrial Solutions segment develops and markets ingredients and additives for industrial applications, such as polymer dispersions, pigments, resins, electronic materials, antioxidants, light stabilizers, oilfield chemicals, mineral processing, and hydrometallurgical chemicals. The Surface Technologies segment offers chemical solutions and automotive OEM, which include refinish coatings, surface treatment, catalysts, battery materials, and precious and base metal services for the automotive and chemical industries. The Nutrition & Care segment provides nutrition and care ingredients for food and feed producers, as well as pharmaceutical, cosmetics, detergent, and cleaner industries. The Agricultural Solutions segment offers crop protection products and seeds, such as fungicides, herbicides, insecticides, and biological crop production products, as well as seed treatment products. The company has strategic partnerships with Contemporary Amperex TechnologyCo., Limited on battery materials solutions, including cathode active materials and battery recycling. BASF SE was founded in 1865 and is headquartered in Ludwigshafen am Rhein, Germany.",
    "ceo": "Dr. Martin  Brudermuller",
    "sector": "Basic Materials",
    "country": "DE",
    "fullTimeEmployees": "109013",
    "phone": "49 0621 60 0",
    "address": "Carl-Bosch-Strasse 38",
    "city": "Ludwigshafen am Rhein",
    "state": null,
    "zip": "67056",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BASFY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]