[
  {
    "symbol": "BAX",
    "price": 45.08,
    "beta": 0.568661,
    "volAvg": 5523501,
    "mktCap": 22803717279,
    "lastDiv": 1.16,
    "range": "37.35-67.07",
    "changes": -0.32,
    "companyName": "Baxter International Inc.",
    "currency": "USD",
    "cik": "0000010456",
    "isin": "US0718131099",
    "cusip": "071813109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.baxter.com",
    "description": "Baxter International Inc., through its subsidiaries, develops and provides a portfolio of healthcare products worldwide. The company offers peritoneal dialysis and hemodialysis, and additional dialysis therapies and services; intravenous therapies, infusion pumps, administration sets, and drug reconstitution devices; remixed and oncology drug platforms, inhaled anesthesia and critical care products and pharmacy compounding services; parenteral nutrition therapies and related products; biological products and medical devices used in surgical procedures for hemostasis, tissue sealing and adhesion prevention; and continuous renal replacement therapies and other organ support therapies focused in the intensive care unit. It also provides connected care solutions, including devices, software, communications, and integration technologies; integrated patient monitoring and diagnostic technologies to help diagnose, treat, and manage a various illness and diseases, including respiratory therapy, cardiology, vision screening, and physical assessment; surgical video technologies, tables, lights, pendants, precision positioning devices and other accessories. In addition, the company offers contracted services to various pharmaceutical and biopharmaceutical companies. Its products are used in hospitals, kidney dialysis centers, nursing homes, rehabilitation centers, doctors' offices, and patients at home under physician supervision. The company sells its products through direct sales force, as well as through independent distributors, drug wholesalers, and specialty pharmacy or other alternate site providers in approximately 100 countries. It has an agreement with Celerity Pharmaceutical, LLC to develop acute care generic injectable premix and oncolytic molecules. Baxter International Inc. was incorporated in 1931 and is headquartered in Deerfield, Illinois.",
    "ceo": "Mr. Jose E. Almeida",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "60000",
    "phone": "224 948 2000",
    "address": "One Baxter Parkway",
    "city": "Deerfield",
    "state": "IL",
    "zip": "60015",
    "dcfDiff": 15.5379,
    "dcf": 61.5379,
    "image": "https://financialmodelingprep.com/image-stock/BAX.png",
    "ipoDate": "1981-10-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]