[
  {
    "symbol": "BB",
    "price": 5.01,
    "beta": 1.441319,
    "volAvg": 4683454,
    "mktCap": 2907533220,
    "lastDiv": 0,
    "range": "3.17-7.2",
    "changes": -0.04,
    "companyName": "BlackBerry Limited",
    "currency": "USD",
    "cik": "0001070235",
    "isin": "CA09228F1036",
    "cusip": "09228F103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.blackberry.com",
    "description": "BlackBerry Limited provides intelligent security software and services to enterprises and governments worldwide. The company operates through three segments: Cybersecurity, IoT, and Licensing and Other. The company offers BlackBerry Cyber Suite, which provides Cylance AI and machine learning-based cybersecurity solutions, including BlackBerry Protect, an EPP and available MTD solution; BlackBerry Optics, an EDR solution that provides visibility into and prevention of malicious activity; BlackBerry Guard, a managed detection and response solution; BlackBerry Gateway, an AI-empowered ZTNA solution; and BlackBerry Persona, a UEBA solution that provides authentication by validating user identity in real time. It also provides BlackBerry Spark Unified Endpoint Management Suite, such as BlackBerry UEM, a central software component of its secure communications platform; BlackBerry Dynamics that provides a development platform and secure container for mobile applications; BlackBerry AtHoc and BlackBerry Alert secure and networked critical event management solutions; and SecuSUITE for Government, a multi-OS voice and text messaging solution, as well as BBM Enterprise, an enterprise-grade secure instant messaging solution. In addition, the company offers BlackBerry QNX, which provides Neutrino operating system and BlackBerry QNX CAR platform, and other products; BlackBerry QNX, an embedded system solution; BlackBerry Jarvis, a cloud-based binary static application security testing platform; BlackBerry Certicom cryptography and management products, and BlackBerry Radar asset monitoring solution; and BlackBerry IVY, an intelligent vehicle data platform, as well as enterprise and cybersecurity consulting services. Further, it is involved in the patent licensing and legacy service access fees business. As of February 28, 2022, it owned approximately 38,000 worldwide patents and applications. BlackBerry Limited was incorporated in 1984 and is headquartered in Waterloo, Canada.",
    "ceo": "Mr. John S. Chen",
    "sector": "Technology",
    "country": "CA",
    "fullTimeEmployees": "3181",
    "phone": "15198887465",
    "address": "2200 University Avenue East",
    "city": "Waterloo",
    "state": "ON",
    "zip": "N2K 0A7",
    "dcfDiff": 0.818632,
    "dcf": 5.18863,
    "image": "https://financialmodelingprep.com/image-stock/BB.png",
    "ipoDate": "1999-02-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]