[
  {
    "symbol": "BBIO",
    "price": 18.01,
    "beta": 0.706023,
    "volAvg": 2005924,
    "mktCap": 2890622866,
    "lastDiv": 0,
    "range": "6.55-19.945",
    "changes": 1.72,
    "companyName": "BridgeBio Pharma, Inc.",
    "currency": "USD",
    "cik": "0001743881",
    "isin": "US10806X1028",
    "cusip": "10806X102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.bridgebio.com",
    "description": "BridgeBio Pharma, Inc. engages in the discovery, development, and delivery of various medicines for genetic diseases. The company has a pipeline of 30 development programs that include product candidates ranging from early discovery to late-stage development. Its products in development programs include AG10 and BBP-265, a small molecule stabilizer of transthyretin, or TTR that is in Phase 3 clinical trial for the treatment of TTR amyloidosis-cardiomyopathy, or ATTR-CM; BBP-831, a small molecule selective FGFR1-3 inhibitor, which is Phase 2 clinical trial to treat achondroplasia in pediatric patients; and BBP-631, an AAV5 gene transfer product candidate that is in Phase 2 clinical trial for the treatment of congenital adrenal hyperplasia, or CAH, driven by 21-hydroxylase deficiency, or 21OHD. The company also develops Encaleret, a small molecule antagonist of the calcium sensing receptor, or CaSR, which is in phase 2 proof-of-concept clinical trial for Autosomal Dominant Hypocalcemia Type 1, or ADH1; and BBP-711 for the treatment of hyperoxaluria, as well as patients suffering from recurrent kidney stones. In addition, it engages in developing products for Mendelian, oncology, and gene therapy diseases. BridgeBio Pharma, Inc. has license and collaboration agreements with the Leland Stanford Junior University; and The Regents of the University of California; Leidos Biomedical Research, Inc. The company was founded in 2015 and is headquartered in Palo Alto, California.",
    "ceo": "Dr. Neil  Kumar Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "392",
    "phone": "650 391 9740",
    "address": "421 Kipling Street",
    "city": "Palo Alto",
    "state": "CA",
    "zip": "94301",
    "dcfDiff": 3.05903,
    "dcf": 12.169,
    "image": "https://financialmodelingprep.com/image-stock/BBIO.png",
    "ipoDate": "2019-06-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]