[
  {
    "symbol": "BBY",
    "price": 82.28,
    "beta": 1.53169,
    "volAvg": 2349259,
    "mktCap": 17954401738,
    "lastDiv": 3.68,
    "range": "60.79-93.32",
    "changes": -0.63,
    "companyName": "Best Buy Co., Inc.",
    "currency": "USD",
    "cik": "0000764478",
    "isin": "US0865161014",
    "cusip": "086516101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Retail",
    "website": "https://investors.bestbuy.com/investor-relations/overview/default.aspx",
    "description": "Best Buy Co., Inc. retails technology products in the United States and Canada. The company operates in two segments, Domestic and International. Its stores provide computing products, such as desktops, notebooks, and peripherals; mobile phones comprising related mobile network carrier commissions; networking products; tablets covering e-readers; smartwatches; and consumer electronics consisting of digital imaging, health and fitness, home theater, portable audio comprising headphones and portable speakers, and smart home products. The company's stores also offer appliances, such as dishwashers, laundry, ovens, refrigerators, blenders, coffee makers, and vacuums; entertainment products consisting of drones, peripherals, movies, music, and toys, as well as gaming hardware and software, and virtual reality and other software products; and other products, such as baby, food and beverage, luggage, outdoor living, and sporting goods. In addition, it provides consultation, delivery, design, health-related, installation, memberships, repair, set-up, technical support, and warranty-related services. The company offers its products through stores and websites under the Best Buy, Best Buy Ads, Best Buy Business, Best Buy Health, CST, Current Health, Geek Squad, Lively, Magnolia, Best Buy Mobile, Pacific Kitchen, Home, and Yardbird, as well as domain names bestbuy.com, currenthealth.com, lively.com, yardbird.com, and bestbuy.ca. As of January 30, 2022, it had 1,144 stores. The company was formerly known as Sound of Music, Inc. The company was incorporated in 1966 and is headquartered in Richfield, Minnesota.",
    "ceo": "Ms. Corie Sue Barry",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "52200",
    "phone": "612 291 1000",
    "address": "7601 Penn Avenue South",
    "city": "Richfield",
    "state": "MN",
    "zip": "55423",
    "dcfDiff": 2.57303,
    "dcf": 82.607,
    "image": "https://financialmodelingprep.com/image-stock/BBY.png",
    "ipoDate": "1985-04-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]