[
  {
    "symbol": "BC",
    "price": 83.1,
    "beta": 1.531338,
    "volAvg": 609390,
    "mktCap": 5876266920,
    "lastDiv": 1.6,
    "range": "63.42-93.15",
    "changes": -0.35,
    "companyName": "Brunswick Corporation",
    "currency": "USD",
    "cik": "0000014930",
    "isin": "US1170431092",
    "cusip": "117043109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Recreational Vehicles",
    "website": "https://www.brunswick.com",
    "description": "Brunswick Corporation designs, manufactures, and markets recreation products worldwide. It operates through Propulsion; Parts & Accessories; and Boat segments. The Propulsion segment provides outboard, sterndrive, and inboard engines for independent boat builders and governments through marine dealers and distributors, specialty marine retailers, and marine service centers; and propulsion-related controls, rigging, and propellers to original equipment manufacturers and aftermarket retailers, distributors, and distribution businesses. This segment offers its products under the Mercury, Mercury MerCruiser, Mariner, Mercury Racing, and Mercury Diesel brands. The Parts & Accessories segment provides engine parts and consumables, electrical products, boat parts and systems, engine oils and lubricants, marine electronics and control systems, instruments, trolling motors, fuel systems, and electrical systems, as well as specialty vehicle, mobile, and transportation aftermarket products for aftermarket retailers, distributors, and distribution businesses, as well for as for the original equipment manufacturers in marine and non-marine markets; and supplies parts and accessories. This segment offers its products under the under the Mercury, Mercury Precision Parts, Quicksilver, and Seachoice brands. The Boat segment provides Sea Ray sport boats and cruisers; Bayliner sport cruisers, runabouts and Heyday wake; Boston Whaler fiberglass offshore boats; Lund fiberglass fishing boats; Crestliner, Cypress Cay, Harris, Lowe, Lund, Princecraft aluminum fishing, utility, pontoon, and deck boats; and Thunder Jet heavy-gauge aluminum boats, as well as the freedom boat club, dealer services, and technology to the marine industry through dealers and distributors. Brunswick Corporation was founded in 1845 and is headquartered in Mettawa, Illinois.",
    "ceo": "Mr. David M. Foulkes",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "19000",
    "phone": "847-735-4700",
    "address": "26125 North Riverwoods Boulevard",
    "city": "Mettawa",
    "state": "IL",
    "zip": "60045-3420",
    "dcfDiff": 4.52207,
    "dcf": 75.1779,
    "image": "https://financialmodelingprep.com/image-stock/BC.png",
    "ipoDate": "1981-12-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]