[
  {
    "symbol": "BCE",
    "price": 44.89,
    "beta": 0.513227,
    "volAvg": 1265137,
    "mktCap": 40948658000,
    "lastDiv": 2.9,
    "range": "39.88-51.11",
    "changes": 0.01,
    "companyName": "BCE Inc.",
    "currency": "USD",
    "cik": "0000718940",
    "isin": "CA05534B7604",
    "cusip": "05534B760",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.bce.ca",
    "description": "BCE Inc., a telecommunications and media company, provides wireless, wireline, Internet, and television (TV) services to residential, business, and wholesale customers in Canada. The company operates through three segments: Bell Wireless, Bell Wireline, and Bell Media. The Bell Wireless segment offers wireless voice and data communication products and services, as well as consumer electronics products. The Bell Wireline segment offers data, including internet access and Internet protocol television (IPTV), local telephone, and long distance services, as well as other communication services and products; and satellite TV service and connectivity servuces. This segment also buys and sells local telephone, long distance, data, and other services from or to resellers and other carriers. The Bell Media segment provides conventional TV, specialty TV, pay TV, streaming services, digital media services, radio broadcasting services, and out-of-home advertising services. BCE Inc. was founded in 1880 and is headquartered in Verdun, Canada.",
    "ceo": "Mr. Mirko  Bibic",
    "sector": "Communication Services",
    "country": "CA",
    "fullTimeEmployees": "44610",
    "phone": "15147868424",
    "address": "Building A",
    "city": "Verdun",
    "state": "QC",
    "zip": "H3E 3B3",
    "dcfDiff": 0.538883,
    "dcf": 47.3589,
    "image": "https://financialmodelingprep.com/image-stock/BCE.png",
    "ipoDate": "1982-11-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]