[
  {
    "symbol": "BCH",
    "price": 20.21,
    "beta": 0.096232,
    "volAvg": 135224,
    "mktCap": 10207767688,
    "lastDiv": 2.15,
    "range": "15.64-22.97",
    "changes": -0.13,
    "companyName": "Banco de Chile",
    "currency": "USD",
    "cik": "0001161125",
    "isin": "US0595201064",
    "cusip": "059520106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://portales.bancochile.cl",
    "description": "Banco de Chile, together with its subsidiaries, provides banking and financial products and services to customers in Chile. It operates through Retail Banking, Wholesale Banking, and Treasury and Money Market segments. The company offers deposit products, such as checking accounts, current accounts, demand deposits and accounts, saving accounts, and time deposits; commercial, mortgage, consumer, working capital, syndicated, and installment loans; and credit cards. It also provides leasing, factoring, and foreign trade services; international and treasury banking services; and financial advisory services. In addition, the company offers liquidity management services, debt instruments, and derivative contracts and leases, as well as financial transaction and currency trading services; and securities brokerage, mutual funds management, wholesale customer, investment banking and management, and insurance brokerage services. As of December 31, 2021, it operated through a network of 272 branches and 1,761 ATMs. The company serves individuals, small and medium-sized companies, corporate clients, and large companies. Banco de Chile was founded in 1893 and is headquartered in Santiago, Chile.",
    "ceo": "Mr. Hernan  Buchi Buc",
    "sector": "Financial Services",
    "country": "CL",
    "fullTimeEmployees": "12571",
    "phone": "56 2 653 1111",
    "address": "Ahumada 251",
    "city": "Santiago de Chile",
    "state": null,
    "zip": null,
    "dcfDiff": 9071.41,
    "dcf": 9092.88,
    "image": "https://financialmodelingprep.com/image-stock/BCH.png",
    "ipoDate": "2002-08-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]