[
  {
    "symbol": "BCMXY",
    "price": 16.72,
    "beta": 0.391187,
    "volAvg": 27,
    "mktCap": 53998579239,
    "lastDiv": 1.3,
    "range": "12.25-17.5",
    "changes": 0.11,
    "companyName": "Bank of Communications Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Diversified",
    "website": "https://www.bankcomm.com",
    "description": "Bank of Communications Co., Ltd. provides commercial banking products and services. The company operates through four business segments: Corporate Banking, Personal Banking, Treasury Businesses, and Other Businesses. It offers personal banking products and services, including savings deposit products, personal certificate of deposits, foreign currency deposit, and salary financing A products; mortgage and unsecured loans; bank cards; airport and personal wealth management advisor services; and physical precious metals, and structured deposits and wealth management products, as well as precious metal and commodity trading services. The company also provides corporate banking products and services comprising structured deposits and corporate certificate of deposits; syndicated loans and corporation overdraft services; wealth management services; investment banking and offshore banking services; corporate cash management and industrial chain financing services; structured deposits and wealth management products; and precious metal leasing, and precious metal and commodity trading services. In addition, it offers international banking services, such as corporate forex wealth management, document settlement, remittance and bill, and trade finance services; and interbank financing services. Further, the company provides financial leasing, trust investment, fund management, life insurance, securities dealing and brokerage, general insurance and reinsurance, debt-to-equity swaps, and financial products issuing and financial consulting services. As of December 31, 2021, It operated 248 branches in Mainland China; and 23 overseas branches and representative offices in 18 countries and regions with 69 overseas operating outlets. The company was founded in 1908 and is headquartered in Shanghai, the People's Republic of China.",
    "ceo": "Mr. Deqi  Ren",
    "sector": "Financial Services",
    "country": "CN",
    "fullTimeEmployees": "91823",
    "phone": "86 21 5876 6688",
    "address": "188 Yin Cheng Zhong Lu",
    "city": "Shanghai",
    "state": null,
    "zip": "200120",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BCMXY.png",
    "ipoDate": "2021-01-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]