[
  {
    "symbol": "BCO",
    "price": 68.12,
    "beta": 1.342253,
    "volAvg": 188467,
    "mktCap": 3162498248,
    "lastDiv": 0.88,
    "range": "48.38-73.39",
    "changes": -1.01,
    "companyName": "The Brink's Company",
    "currency": "USD",
    "cik": "0000078890",
    "isin": "US1096961040",
    "cusip": "109696104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Security & Protection Services",
    "website": "https://www.brinks.com",
    "description": "The Brink's Company provides secure transportation, cash management, and other security-related services in North America, Latin America, Europe, and internationally. The company offers armored vehicle transportation of valuables; automated teller machine (ATM) management services, such as cash replenishment, replenishment forecasting, cash optimization, ATM remote monitoring, service call dispatching, transaction processing, installation, and first and second line maintenance services; network infrastructure; and cash-in-transit services. It also provides transportation services for diamonds, jewelry, precious metals, securities, bank notes, currency, high-tech devices, electronics, and pharmaceuticals; vault outsourcing and money processing services; and services related to deploying and servicing intelligent safes and safe control devices, as well as cashier balancing, counterfeit detection, account consolidation, electronic reporting, check imaging, and reconciliation services. In addition, the company offers technology applications, including online cash tracking, cash inventory management, and other web-based tools. Further, it provides bill payment and collection services; prepaid cards and corporate debit cards; and security system design and installation services that include alarms, motion detectors, closed-circuit televisions, and digital video recorders, as well as access control systems comprising card and biometric readers, electronic locks, and turnstiles. Additionally, the company offers monitoring services; and security and guarding services to protect airports, offices, warehouses, stores, and public venues. It serves banks and financial institutions, retailers, government agencies, mints, jewelers, and other commercial operations. The company was formerly known as The Pittston Company and changed its name to The Brink's Company in May 2003. The Brink's Company was founded in 1859 and is headquartered in Richmond, Virginia.",
    "ceo": "Mr. Richard Mark Eubanks Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "69500",
    "phone": "804 289 9600",
    "address": "1801 Bayberry Court",
    "city": "Richmond",
    "state": "VA",
    "zip": "23226-8100",
    "dcfDiff": 11.2823,
    "dcf": 74.7823,
    "image": "https://financialmodelingprep.com/image-stock/BCO.png",
    "ipoDate": "1996-01-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]