[
  {
    "symbol": "BCPC",
    "price": 131.15,
    "beta": 0.703873,
    "volAvg": 88475,
    "mktCap": 4226662855,
    "lastDiv": 0.71,
    "range": "116.68-143.88",
    "changes": 0.28,
    "companyName": "Balchem Corporation",
    "currency": "USD",
    "cik": "0000009326",
    "isin": "US0576652004",
    "cusip": "057665200",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Specialty Chemicals",
    "website": "https://www.balchem.com",
    "description": "Balchem Corporation develops, manufactures, and markets specialty performance ingredients and products for the nutritional, food, pharmaceutical, animal health, medical device sterilization, plant nutrition, and industrial markets in the United States and internationally. It operates through three segments: Human Nutrition & Health, Animal Nutrition & Health, and Specialty Products. The Human Nutrition & Health segment supplies ingredients in the food and beverage industry. Its products include spray dried and emulsified powders, extrusion and agglomeration, blended lipid systems, liquid flavor delivery systems, juice and dairy bases, chocolate systems, and cereal systems, as well as ice cream bases and variegates. This segment also offers microencapsulation solutions for various applications; and human grade choline nutrients and mineral amino acid chelated products for nutrition and health applications. The Animal Nutrition & Health segment provides microencapsulated products to enhance health and milk production, and delivering nutrient supplements in ruminant animals; chelation technology, which offers enhanced nutrient absorption for various species of production and companion animals; and choline chloride, a nutrient for monogastric animal health. The Specialty Products segment offers ethylene oxide primarily for use in the health care industry; and single use canisters with ethylene oxide for sterilizing re-usable devices. This segment also markets and sells propylene oxide, a fumigant to aid in the control of insects and microbiological spoilage, as well as to reduce bacterial and mold contamination in shell and processed nut meats, processed spices, cacao beans, cocoa powder, raisins, figs, and prunes; and chelated minerals for high value crops. The company sells its products through sales force, independent distributors, and sales agents. Balchem Corporation was incorporated in 1967 and is headquartered in New Hampton, New York.",
    "ceo": "Mr. Theodore L. Harris",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "1331",
    "phone": "845 326 5600",
    "address": "52 Sunrise Park Road",
    "city": "New Hampton",
    "state": "NY",
    "zip": "10958",
    "dcfDiff": 16.5963,
    "dcf": 145.476,
    "image": "https://financialmodelingprep.com/image-stock/BCPC.png",
    "ipoDate": "1986-06-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]