[
  {
    "symbol": "BDC",
    "price": 93.36,
    "beta": 1.317605,
    "volAvg": 285735,
    "mktCap": 3972524016,
    "lastDiv": 0.2,
    "range": "50.9-96.51",
    "changes": 0.62,
    "companyName": "Belden Inc.",
    "currency": "USD",
    "cik": "0000913142",
    "isin": "US0774541066",
    "cusip": "077454106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Communication Equipment",
    "website": "https://www.belden.com",
    "description": "Belden Inc. provides portfolio of signal transmission solutions in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. It operates in two segments, Enterprise Solutions and Industrial Solutions. The Enterprise Solutions segment offers copper cable and connectivity solutions, fiber cable and connectivity solutions, interconnect panels, racks and enclosures, and signal extension and matrix switching systems for use in applications, such as local area networks, data centers, access control, 5G, fiber, and home and building automation. It also provides power, cooling, and airflow management products for mission-critical data center operations; and end-to-end copper and fiber network systems. This segment serves commercial real estate, hospitality, healthcare, education, financial, government, and broadband and wireless service providers, as well as end-markets, including sport venues, stadiums, data centers, military installations, and academia. The Industrial Solutions segment offers infrastructure components and on-machine connectivity systems; and industrial Ethernet switches, network management software, routers, firewalls, gateways, input/output (I/O) connectors/systems, industrial Ethernet cables, optical fiber industrial Ethernet cables, Fieldbus cables, IP and networking cables, I/O modules, distribution boxes, and customer specific wiring solutions. This segment provides its products for use in applications comprising network and fieldbus infrastructure; sensor and actuator connectivity; and power, control, and data transmission; and supplies heat-shrinkable tubing and wire management products to protect and organize wire and cable assemblies. It serves distributors, original equipment manufacturers, installers, and end-users. The company was formerly known as Belden CDT Inc. and changed its name to Belden Inc. in May 2007. Belden Inc. was founded in 1902 and is based in St. Louis, Missouri.",
    "ceo": "Dr. Ashish  Chand",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "8000",
    "phone": "314 854 8000",
    "address": "1 North Brentwood Boulevard",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63105",
    "dcfDiff": 15.8458,
    "dcf": 94.6358,
    "image": "https://financialmodelingprep.com/image-stock/BDC.png",
    "ipoDate": "1993-11-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]