[
  {
    "symbol": "BDORY",
    "price": 10.21,
    "beta": 0.597945,
    "volAvg": 246716,
    "mktCap": 29137093473,
    "lastDiv": 0.46,
    "range": "5.73-10.89",
    "changes": -0.15,
    "companyName": "Banco do Brasil S.A.",
    "currency": "USD",
    "cik": "0001433913",
    "isin": "US0595781040",
    "cusip": "059578104",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.bb.com.br",
    "description": "Banco do Brasil S.A., together with its subsidiaries, provides banking products and services for individuals, companies, and public sectors in Brazil and internationally. The company operates through Banking, Investments, Fund Management, Insurance (Insurance, Pension, and Capitalization), Payment Methods, and Other segments. The Banking segment offers various products and services, including deposits, loans, and other services to retail, wholesale, and public sector markets, as well as to micro-entrepreneurs. The Investments segment engages in the structuring and distribution of debts and equity instruments in primary and secondary markets; and provision of financial services. The Fund Management segment is involved in the purchase, sale, and custody of securities, as well as the management of portfolios, and investment funds and clubs. The Insurance, Pension and Capitalization segment provides life, property, and automobile insurance products, as well as private pension and capitalization plans. The Payment Methods segment is involved in the capturing, transmission, processing, and financial settlement of for electronic payment transactions. The Other segment engages in the provision of credit recovery and consortium management services; development, manufacturing, sale, rental, and integration of digital electronic systems, peripherals, programs, inputs, and computing supplies; sale of airline tickets; and lodging and organization of events. Banco do Brasil S.A. was incorporated in 1808 and is headquartered in Brasília, Brazil.",
    "ceo": "Ms. Tarciana Paula Gomes Medeiros",
    "sector": "Financial Services",
    "country": "BR",
    "fullTimeEmployees": "85953",
    "phone": "55 80 0729 5285",
    "address": "Banco do Brasil Building",
    "city": "Brasília",
    "state": "DF",
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BDORY.png",
    "ipoDate": "2009-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]