[
  {
    "symbol": "BEAM",
    "price": 33.08,
    "beta": 1.626695,
    "volAvg": 858600,
    "mktCap": 2521275032,
    "lastDiv": 1.125,
    "range": "28.62-73.27",
    "changes": 1.06,
    "companyName": "Beam Therapeutics Inc.",
    "currency": "USD",
    "cik": "0001745999",
    "isin": "US07373V1052",
    "cusip": "07373V105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.beamtx.com",
    "description": "Beam Therapeutics Inc., a biotechnology company, develops precision genetic medicines for patients suffering from serious diseases in the United States. The company is developing BEAM-101 for the treatment of sickle cell disease and beta thalassemia; BEAM-102 for the treatment of sickle cell disease; and BEAM-201, an allogeneic chimeric antigen receptor T cell for the treatment of relapsed/refractory T-cell acute lymphoblastic leukemia; and BEAM-301, a liver-targeted development candidate for the treatment of patients with Glycogen Storage Disease Type Ia. It also develops therapies for alpha-1 antitrypsin deficiency; ocular diseases; and other liver, muscle, and central nervous system disorders. The company has an alliance with Boston Children's Hospital; a research and clinical trial collaboration agreement with Magenta Therapeutics, Inc.; license agreement with Sana Biotechnology, Inc.; and a research collaboration with the Institute of Molecular and Clinical Ophthalmology Basel. It also has a research collaboration agreement with Pfizer Inc. and Apellis Pharmaceuticals, Inc.; and collaboration and license agreement with Verve Therapeutics, Inc. The company was incorporated in 2017 and is based in Cambridge, Massachusetts.",
    "ceo": "Mr. John M. Evans M.B.A.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "523",
    "phone": "857 327 8775",
    "address": "238 Main Street",
    "city": "Cambridge",
    "state": "MA",
    "zip": "02142",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BEAM.png",
    "ipoDate": "2020-02-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]