[
  {
    "symbol": "BECN",
    "price": 81.1,
    "beta": 1.582394,
    "volAvg": 418085,
    "mktCap": 5169995240,
    "lastDiv": 0,
    "range": "49.94-82.73",
    "changes": -0.65,
    "companyName": "Beacon Roofing Supply, Inc.",
    "currency": "USD",
    "cik": "0001124941",
    "isin": "US0736851090",
    "cusip": "073685109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Building Products & Equipment",
    "website": "https://www.becn.com",
    "description": "Beacon Roofing Supply, Inc., together with its subsidiaries, distributes residential and non-residential roofing materials, and complementary building products to contractors, home builders, building owners, lumberyards, and retailers. It offers pitched roofing and low slope roof products; gutters and sidings; building materials, such as lumber and composite, skylights and window, plywood and OSB, decking and railing, and HVAC products; and foam board, spray foam, roll, batt, mineral wool, fiberglass, and commercial insulation products, as well as radiant barriers and blown-in insulation and equipment. The company also provides above grade and below grade membranes and coatings, deck and floor coatings, plaza deck waterproofing products, damp proofing coatings, and air and vapor barriers; tools and equipment, including power and hand tools, ladders and scaffolding, air tools and compressors, nails, screws and fasteners, generators, work wear and safety gear, job site supplies, tool bags and belts, welding and soldering, cleaning supplies, drill bits, and saw blades; and solar panels, mounting hardware, inverters, and storage and batteries. As of September 30, 2021, it operated approximately 446 branches in 50 states of the United States and 6 provinces in Canada. Beacon Roofing Supply, Inc. was founded in 1928 and is headquartered in Herndon, Virginia.",
    "ceo": "Mr. Julian G. Francis",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "7478",
    "phone": "571 323 3939",
    "address": "505 Huntmar Park Drive",
    "city": "Herndon",
    "state": "VA",
    "zip": "20170",
    "dcfDiff": 6.31982,
    "dcf": 61.4198,
    "image": "https://financialmodelingprep.com/image-stock/BECN.png",
    "ipoDate": "2004-09-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]