[
  {
    "symbol": "BERY",
    "price": 63.64,
    "beta": 1.174647,
    "volAvg": 1201983,
    "mktCap": 7585888000,
    "lastDiv": 1,
    "range": "44.52-66.21",
    "changes": -0.58,
    "companyName": "Berry Global Group, Inc.",
    "currency": "USD",
    "cik": "0001378992",
    "isin": "US08579W1036",
    "cusip": "08579W103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaging & Containers",
    "website": "https://www.berryglobal.com",
    "description": "Berry Global Group, Inc. manufactures and supplies non-woven, flexible, and rigid products in consumer and industrial end markets. The company operates through Consumer Packaging International; Consumer Packaging North America; Engineered Materials; and Health, Hygiene & Specialties segments. The Consumer Packaging International segment offers closures and dispensing systems, pharmaceutical devices and packaging, bottles and canisters, containers, and technical components. The Consumer Packaging North America segment provides containers and pails, foodservice products, closures and overcaps, bottles and prescription vials, and tubes. The Engineered Materials segment offers stretch and shrink, converter, food and consumer, and agriculture films, as well as institutional can liners and retail bags. The Health, Hygiene & Specialties segment provides healthcare, hygiene, specialties, and tapes. Berry Global Group, Inc. sells its products through direct sales force of professionals and distributors in the United States, Canada, Europe, and internationally. The company was formerly known as Berry Plastics Group, Inc. and changed its name to Berry Global Group, Inc. in April 2017. Berry Global Group, Inc. was founded in 1967 and is based in Evansville, Indiana.",
    "ceo": "Mr. Thomas E. Salmon",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "46000",
    "phone": "812 424 2904",
    "address": "101 Oakley Street",
    "city": "Evansville",
    "state": "IN",
    "zip": "47710",
    "dcfDiff": 2.17865,
    "dcf": 62.0586,
    "image": "https://financialmodelingprep.com/image-stock/BERY.png",
    "ipoDate": "2012-10-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]