[
  {
    "symbol": "BESIY",
    "price": 104.6,
    "beta": 1.423754,
    "volAvg": 1212,
    "mktCap": 8341766006,
    "lastDiv": 3.13,
    "range": "38.1-114.08",
    "changes": -1.1,
    "companyName": "BE Semiconductor Industries N.V.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Semiconductor Equipment & Materials",
    "website": "https://www.besi.com",
    "description": "BE Semiconductor Industries N.V. develops, manufactures, markets, sells, and services semiconductor assembly equipment for the semiconductor and electronics industries worldwide. The company's principal products include die attach equipment, such as single chip, multi chip, multi module, flip chip, thermal compression bonding, fan out wafer level packaging, hybrid and embedded bridge die bonding, and die sorting systems; and packaging equipment, including conventional, ultra thin, and wafer level molding, as well as trim and form, and singulation systems. Its principal products also comprise plating equipment comprising tin, copper, and precious metal and solar plating systems, as well as related process chemicals; and tooling, conversion kits, spare parts, and other services. The company's principal brand names include Datacon, Esec, Fico, and Meco. It offers its products primarily to multinational chip manufacturers, assembly subcontractors, and electronics and industrial companies. The company was incorporated in 1995 and is headquartered in Duiven, the Netherlands.",
    "ceo": "Mr. Richard W. Blickman",
    "sector": "Technology",
    "country": "NL",
    "fullTimeEmployees": "1682",
    "phone": "31 26 319 4500",
    "address": "Ratio 6",
    "city": "Duiven",
    "state": null,
    "zip": "6921 RW",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BESIY.png",
    "ipoDate": "1995-12-05",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]