[
  {
    "symbol": "BFAM",
    "price": 89.47,
    "beta": 1.207042,
    "volAvg": 452475,
    "mktCap": 5172368064,
    "lastDiv": 0,
    "range": "54.19-95.53",
    "changes": -0.53,
    "companyName": "Bright Horizons Family Solutions Inc.",
    "currency": "USD",
    "cik": "0001437578",
    "isin": "US1091941005",
    "cusip": "109194100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Personal Services",
    "website": "https://www.brighthorizons.com",
    "description": "Bright Horizons Family Solutions Inc. provides early education and child care, back-up care, educational advisory, and other workplace solutions services for employers and families. The company operates through three segments: Full Service Center-Based Child Care, Back-Up Care, and Educational Advisory and Other Services. The Full Service Center-Based Child Care segment offers traditional center-based child care and early education, preschool, and elementary education services. The Back-Up Care segment provides center-based back-up child care, in-home child and adult/elder dependent care, school-age camps, virtual tutoring, and self-sourced reimbursed care services through child care centers, school-age campuses, and in-home caregivers, as well as the back-up care network. The Educational Advisory and Other Services segment offers tuition assistance and student loan repayment program administration, workforce education, and related educational consulting services, as well as college admissions advisory services. As of December 31, 2021, it operated 1,014 child care and early education centers in the United States, Puerto Rico, the United Kingdom, Canada, the Netherlands, and India. The company was formerly known as Bright Horizons Solutions Corp. and changed its name to Bright Horizons Family Solutions Inc. in July 2012. Bright Horizons Family Solutions Inc. was founded in 1986 and is headquartered in Newton, Massachusetts.",
    "ceo": "Mr. Stephen Howard Kramer",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "29000",
    "phone": "617 673 8000",
    "address": "2 Wells Avenue",
    "city": "Newton",
    "state": "MA",
    "zip": "02459",
    "dcfDiff": 1.10731,
    "dcf": 78.2373,
    "image": "https://financialmodelingprep.com/image-stock/BFAM.png",
    "ipoDate": "2013-01-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]