[
  {
    "symbol": "BG",
    "price": 91.81,
    "beta": 0.654577,
    "volAvg": 1274361,
    "mktCap": 13828238580,
    "lastDiv": 2.65,
    "range": "80.41-106.99",
    "changes": -0.6,
    "companyName": "Bunge Limited",
    "currency": "USD",
    "cik": "0001144519",
    "isin": "BMG169621056",
    "cusip": "G16962105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Farm Products",
    "website": "https://www.bunge.com",
    "description": "Bunge Limited operates as an agribusiness and food company worldwide. It operates through four segments: Agribusiness, Refined and Specialty Oils, Milling, and Sugar and Bioenergy. The Agribusiness segment purchases, stores, transports, processes, and sells agricultural commodities and commodity products, including oilseeds primarily soybeans, rapeseed, canola, and sunflower seeds, as well as grains primarily wheat and corn; and processes oilseeds into vegetable oils and protein meals. This segment offers its products for animal feed manufacturers, livestock producers, wheat and corn millers, and other oilseed processors, as well as third-party edible oil processing and biofuel companies; and for industrial and biodiesel production applications. The Refined and Specialty Oils segment sells packaged and bulk oils and fats that include cooking oils, shortenings, margarines, mayonnaise, and other products for baked goods companies, snack food producers, confectioners, restaurant chains, foodservice operators, infant nutrition companies, and other food manufacturers, as well as grocery chains, wholesalers, distributors, and other retailers. The Milling segment provides wheat flours and bakery mixes; corn milling products that comprise dry-milled corn meals and flours, wet-milled masa and flours, and flaking and brewer's grits, as well as soy-fortified corn meal, corn-soy blends, and other products; whole grain and fiber ingredients; quinoas and millets; die-cut pellets; and non-GMO products. The Sugar and Bioenergy segment produces sugar and ethanol; and generates electricity from burning sugarcane bagasse. Bunge Limited was founded in 1818 and is headquartered in St. Louis, Missouri.",
    "ceo": "Mr. Gregory A. Heckman",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "23000",
    "phone": "314 292 2000",
    "address": "1391 Timberlake Manor Parkway",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63017",
    "dcfDiff": 9.69333,
    "dcf": 107.293,
    "image": "https://financialmodelingprep.com/image-stock/BG.png",
    "ipoDate": "2001-08-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]