[
  {
    "symbol": "BGNE",
    "price": 179.86,
    "beta": 0.786619,
    "volAvg": 220448,
    "mktCap": 18964258540,
    "lastDiv": 0,
    "range": "124.46-280.62",
    "changes": -0.43,
    "companyName": "BeiGene, Ltd.",
    "currency": "USD",
    "cik": "0001651308",
    "isin": "US07725L1026",
    "cusip": "07725L102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.beigene.com",
    "description": "BeiGene, Ltd., a biotechnology company, focuses on discovering, developing, manufacturing, and commercializing various medicines worldwide. Its products include BRUKINSA to treat relapsed/refractory (R/R) mantle cell lymphoma; Tislelizumab to treat R/R classical Hodgkin's lymphoma; REVLIMID to treat multiple myeloma; VIDAZA to treat myelodysplastic syndromes, chronic myelomonocyte leukemia, and acute myeloid leukemia; XGEVA to treat giant cell tumor of bone; BLINCYTO to treat acute lymphoblastic leukemia; KYPROLIS to treat R/R multiple myeloma; SYLVANT to treat idiopathic multicentric castleman disease; QARZIBA to treat neuroblastoma; Pamiparib for the treatment of various solid tumors; and Pobevcy to treat metastatic colorectal cancer, liver cancer, and non-small cell lung cancer (NSCLC). The company's clinical stage drug candidates comprise Zanubrutinib, a BTK inhibitor to treat lymphomas; Tislelizumab, an anti-PD-1 antibody to treat solid and hematological cancers; Lifirafenib and BGB-3245 to treat melanoma, NSCLC, and endometrial cancer; and Sitravatinib, a multi-kinase inhibitor to treat NSCLC, melanoma, and other solid tumors. Its clinical stage drug candidates also include BGB-A333, a PD-L1 inhibitor to treat various solid tumors; Ociperlimab, a TIGIT inhibitor to treat various solid tumors; BGB-11417, a small molecule Bcl-2 inhibitor to treat mature B-cell malignancies; BGB-A445, an OX40 agonist antibody to treat solid tumors; Zanidatamab, a bispecific HER2 inhibitor to treat breast and gastric cancer; BGB-A425, a T-cell immunoglobulin and mucin-domain containing-3 inhibitor to treat various solid tumors; and BGB-15025, a small molecule inhibitor of HPK1. The company has strategic collaborations with Shoreline Biosciences, Inc., Amgen Inc., Novartis AG, and Bristol Myers Squibb company. BeiGene, Ltd. was incorporated in 2010 and is headquartered in Cambridge, Massachusetts.",
    "ceo": "Mr. John V. Oyler",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "9400",
    "phone": "781-801-1800",
    "address": "55 Cambridge Parkway",
    "city": "Cambridge",
    "state": "MA",
    "zip": "02142",
    "dcfDiff": 65.1506,
    "dcf": 194.649,
    "image": "https://financialmodelingprep.com/image-stock/BGNE.png",
    "ipoDate": "2016-02-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]