[
  {
    "symbol": "BIDU",
    "price": 141.79,
    "beta": 0.67183,
    "volAvg": 2609640,
    "mktCap": 49569357496,
    "lastDiv": 0,
    "range": "73.58-160.88",
    "changes": -2.11,
    "companyName": "Baidu, Inc.",
    "currency": "USD",
    "cik": "0001329099",
    "isin": "US0567521085",
    "cusip": "056752108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Content & Information",
    "website": "https://www.baidu.com",
    "description": "Baidu, Inc. offers internet search services in China. It operates through Baidu Core and iQIYI segments. The company offers Baidu App to access search, feed, and other services using mobile devices; Baidu Search to access its search and other services; Baidu Feed that provides users with personalized timeline based on their demographics and interests; and Haokan, a short video app. It also provides Baidu Knows, an online community where users can ask questions to other users; Baidu Wiki; Baidu Healthcare Wiki; Baidu Wenku; Baidu Scholar; Baidu Experience; Baidu Post; Baidu Maps, a voice-enabled mobile app that provides travel-related services; Baidu Drive; Baijiahao; and DuerOS, a smart assistant platform. In addition, it offers online marketing services, which include pay for performance, an auction-based services that allow customers to bid for priority placement of paid sponsored links and reach users who search for information related to their products or services; other marketing services that include display-based marketing services and other online marketing services based on performance criteria other than cost per click; mobile ecosystem, a portfolio of apps, including Baidu App, Haokan, and Baidu Post; various cloud services and solutions, such as platform as a service, software as a service, and infrastructure as a service; self-driving services, including maps, automated valet parking, autonomous navigation pilot, electric vehicles, and robotaxi fleets, as well as Xiaodu smart devices. Further, the company provides iQIYI, AN online entertainment service, including original and licensed content; other video content and membership; and online advertising services. Baidu, Inc. has strategic partnership with Zhejiang Geely Holding Group. The company was formerly known as Baidu.com, Inc. Baidu, Inc. was incorporated in 2000 and is headquartered in Beijing, China.",
    "ceo": "Mr. Yanhong  Li",
    "sector": "Communication Services",
    "country": "CN",
    "fullTimeEmployees": "41300",
    "phone": "86 10 5992 8888",
    "address": "Baidu Campus",
    "city": "Beijing",
    "state": null,
    "zip": "100085",
    "dcfDiff": 60.2819,
    "dcf": 199.322,
    "image": "https://financialmodelingprep.com/image-stock/BIDU.png",
    "ipoDate": "2005-08-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]