[
  {
    "symbol": "BIIB",
    "price": 284.02,
    "beta": 0.184507,
    "volAvg": 1003190,
    "mktCap": 41109622840,
    "lastDiv": 0,
    "range": "193.65-319.76",
    "changes": 1.07,
    "companyName": "Biogen Inc.",
    "currency": "USD",
    "cik": "0000875045",
    "isin": "US09062X1037",
    "cusip": "09062X103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.biogen.com",
    "description": "Biogen Inc. discovers, develops, manufactures, and delivers therapies for treating neurological and neurodegenerative diseases. The company offers TECFIDERA, VUMERITY, AVONEX, PLEGRIDY, TYSABRI, and FAMPYRA for multiple sclerosis (MS); SPINRAZA for spinal muscular atrophy; and FUMADERM to treat plaque psoriasis. It also provides BENEPALI, an etanercept biosimilar referencing ENBREL; ADUHELM for the treatment of Alzheimer's disease; IMRALDI, an adalimumab biosimilar referencing HUMIRA; and FLIXABI, an infliximab biosimilar referencing REMICADE. In addition, the company offers RITUXAN for treating non-Hodgkin's lymphoma, chronic lymphocytic leukemia (CLL), rheumatoid arthritis, two forms of ANCA-associated vasculitis, and pemphigus vulgaris; RITUXAN HYCELA for non-Hodgkin's lymphoma and CLL; GAZYVA to treat CLL and follicular lymphoma; and OCREVUS for treating relapsing MS and primary progressive MS; and other anti-CD20 therapies. Further, it develops BIIB135, BIIB061, BIIB091, and BIIB107 for MS and neuroimmunology; Aducanumab, Lecanemab, BIIB076, and BIIB080 to treat Alzheimer's disease and dementia; BIIB067, BIIB078, BIIB105, BIIB100, and BIIB110 to treat neuromuscular disorders; BIIB124, BIIB094, BIIB118, BIIB101, and BIIB122 for treating Parkinson's disease and movement disorders; BIIB125 and BIIB104 for treating neuropsychiatry; Dapirolizumab pegol and BIIB059 to treat immunology related diseases; BIIB093 and BIIB131 to treat acute neurology; BIIB074 for neuropathic pain; and BYOOVIZ, BIIB800, and SB15 biosimilars, which are under various stages of development. The company has collaboration and license agreements with Acorda Therapeutics, Inc.; Alkermes Pharma Ireland Limited; Denali Therapeutics Inc.; Eisai Co., Ltd.; Genentech, Inc.; Neurimmune SubOne AG; Ionis Pharmaceuticals, Inc.; Samsung Bioepis Co., Ltd.; Sangamo Therapeutics, Inc.; and Sage Therapeutics, Inc. Biogen Inc. was founded in 1978 and is headquartered in Cambridge, Massachusetts.",
    "ceo": "Mr. Christopher A. Viehbacher",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "8725",
    "phone": "617 679 2000",
    "address": "225 Binney Street",
    "city": "Cambridge",
    "state": "MA",
    "zip": "02142",
    "dcfDiff": 25.5698,
    "dcf": 315.65,
    "image": "https://financialmodelingprep.com/image-stock/BIIB.png",
    "ipoDate": "1991-09-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]