[
  {
    "symbol": "BIOVF",
    "price": 21.25,
    "beta": 0.395402,
    "volAvg": 168,
    "mktCap": 6303047840,
    "lastDiv": 0,
    "range": "18.25-26.48",
    "changes": 0,
    "companyName": "Swedish Orphan Biovitrum AB (publ)",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.sobi.com",
    "description": "Swedish Orphan Biovitrum AB (publ), an integrated biotechnology company, researches, develops, manufactures, and sells pharmaceuticals in the therapeutic areas of haematology, immunology, and genetic and metabolic diseases in Europe, North America, and internationally. It offers Alprolix for haemophilia B; Doptelet treatment of thrombocytopenia; Elocta for haemophilia A; Gamifant for hemophagocytic lymphohistiocytosis(HLH); Kineret for cryopyrin associated periodic syndrome, rheumatoid arthritis, and still's disease; Orfadin to treat hereditary tyrosinaemia type-1; and Synagis for serious lower respiratory tract infection. The company It also provides other products, such as Akynzeo, Aloxi, Ammonul, Betapred, Caphosol, Fibclot, IVheBex, and Willfact. In addition, it develops drug substance for ReFacto AF/Xyntha for Pfizer; BIVV001 for haemophilia A; and Nirsevimab for respiratory syncytial virus. The company has a strategic collaboration with Apellis Pharmaceuticals Inc. to develop pegcetacoplan for the treatment of multiple rare diseases, including paroxysmal nocturnal hemoglobinuria. Swedish Orphan Biovitrum AB (publ) is headquartered in Solna, Sweden.",
    "ceo": "Dr. Guido  Oelkers",
    "sector": "Healthcare",
    "country": "SE",
    "fullTimeEmployees": "1612",
    "phone": "46 86 97 20 00",
    "address": "Tomtebodavägen 23A",
    "city": "Solna",
    "state": null,
    "zip": "112 76",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BIOVF.png",
    "ipoDate": "2021-01-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]