[
  {
    "symbol": "BKEAY",
    "price": 1.23,
    "beta": 0.565517,
    "volAvg": 1072,
    "mktCap": 3445599065,
    "lastDiv": 0.04,
    "range": "0.9-1.4",
    "changes": 0.03,
    "companyName": "The Bank of East Asia, Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.hkbea.com",
    "description": "The Bank of East Asia, Limited, together with its subsidiaries, provides various banking and related financial services. Its personal banking services include corporate, individual, savings, current, time deposit, and supreme accounts; and fixed and call deposits, foreign currency deposits, MAS services, and auto-payroll products, as well as safe deposit boxes and remittance services. The company also provides corporate banking services, such as SME loans and financing guarantee schemes; corporate and commercial financing products, including syndicated and construction loans, acquisition and structured financing, working capital financing, share financing and IPO-related loans, and commercial mortgages; trade finance services and expert trade solutions; factoring services; import and export trade finance; guarantee services; eTradeConnect that allows buyers and sellers to connect, transact, share information, and submit applications for financing through a single platform; cash management services; corporate wealth management products; foreign exchange and treasury products; trade settlement and financing services; onshore and offshore loans; and marine cargo, property, trade credit, employee compensation, pet, medical, life, savings, and endowment insurance plans. In addition, it offers private banking services comprising investment advisory services; investment solutions, such as unit trusts, linked deposits, currency trading and management, global equities and bonds investments, structured products, and options and derivatives; portfolio management services; securities and futures broking services; cyber banking, credit cards, and ATM; and various international services. The company operates 150 outlets in Hong Kong, rest of Greater China, Southeast Asia, the United Kingdom, and the United States. The Bank of East Asia, Limited was incorporated in 1918 and is headquartered in Central, Hong Kong.",
    "ceo": "Mr. Kai Cheong  Li C.P.A., FCCA, AHKSA, FCIS, FCS, HKSI",
    "sector": "Financial Services",
    "country": "HK",
    "fullTimeEmployees": "8453",
    "phone": "852 3608 3608",
    "address": "10 Des Voeux Road",
    "city": "Central",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BKEAY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]