[
  {
    "symbol": "BKH",
    "price": 59.57,
    "beta": 0.584507,
    "volAvg": 406195,
    "mktCap": 3987234552,
    "lastDiv": 2.5,
    "range": "58.81-79.78",
    "changes": -0.73,
    "companyName": "Black Hills Corporation",
    "currency": "USD",
    "cik": "0001130464",
    "isin": "US0921131092",
    "cusip": "092113109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Diversified",
    "website": "https://www.blackhillscorp.com",
    "description": "Black Hills Corporation, through its subsidiaries, operates as an electric and natural gas utility company in the United States. It operates in two segments, Electric Utilities and Gas Utilities. The Electric Utilities segment generates, transmits, and distributes electricity to approximately 218,000 electric utility customers in Colorado, Montana, South Dakota, and Wyoming; and owns and operates 1,481.5 megawatts of generation capacity and 8,892 miles of electric transmission and distribution lines. The Gas Utilities segment distributes natural gas to approximately 1,094,000 natural gas utility customers in Arkansas, Colorado, Iowa, Kansas, Nebraska, and Wyoming; owns and operates 4,732 miles of intrastate gas transmission pipelines; 41,644 miles of gas distribution mains and service lines; six natural gas storage sites; and approximately 50,000 horsepower of compression and 515 miles of gathering lines. The company also constructs and maintains gas infrastructure facilities for gas transportation customers; and provides appliance repair services to residential utility customers, as well as electrical system construction services to large industrial customers. In addition, it produces electric power through wind, natural gas, and coal-fired generating plants; and coal at its coal mine located near Gillette, Wyoming. The company was incorporated in 1941 and is headquartered in Rapid City, South Dakota.",
    "ceo": "Mr. Linden R. Evans",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "2982",
    "phone": "605 721 1700",
    "address": "7001 Mount Rushmore Road",
    "city": "Rapid City",
    "state": "SD",
    "zip": "57702",
    "dcfDiff": 2.33713,
    "dcf": 68.9529,
    "image": "https://financialmodelingprep.com/image-stock/BKH.png",
    "ipoDate": "1973-02-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]