[
  {
    "symbol": "BKHYY",
    "price": 40.5,
    "beta": 0.456506,
    "volAvg": 3187,
    "mktCap": 10831846176,
    "lastDiv": 2.4,
    "range": "37.2-55.85",
    "changes": -0.7,
    "companyName": "Bank Hapoalim B.M.",
    "currency": "USD",
    "cik": null,
    "isin": "US0625103009",
    "cusip": "062510300",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.bankhapoalim.com",
    "description": "Bank Hapoalim B.M., together with its subsidiaries, provides various banking and financial products and services in Israel and internationally. It operates through Corporate Banking, Retail Banking, and Financial Markets and International Banking divisions. The company offers account-management services, credit for various purposes, deposits, and savings plans, and capital-market service; securities, and currencies and derivatives trading services; securities custody services; research, consulting, and advisory services; pension advisory and retirement planning services; and housing loans. It also provides credit for routine operations and investment financing, guarantees, letters of credit, foreign trade, and transactions in financial and derivative instruments, as well as investment services in various channels, such as foreign currency, shekels, securities, etc. In addition, the company offers financing for infrastructure projects, foreign trade and international trade financing, and project financing services; foreign trade transactions and transactions in financial derivatives; financing of working capital; syndication; credit-risk sales; financing of construction projects; dealing-room services; federal deposit insurance; and credit cards services. Further, it provides clearing of payment, asset management, investment portfolio management, investment banking, underwriting, and issuance management services. The company serves households, private-banking customers, foreign residents, small businesses, financial-asset managers, middle-market business clients, and large corporations through 175 branches, 601 external and 131 internal automatic teller machines, 126 external and 216 internal check-deposit machines, 30 information stations, 316 self-service stations, and 119 night safes. Bank Hapoalim B.M. was founded in 1921 and is based in Tel Aviv, Israel.",
    "ceo": "Mr. Dov  Kotler",
    "sector": "Financial Services",
    "country": "IL",
    "fullTimeEmployees": "8383",
    "phone": "972 3 714 4669",
    "address": "50 Rothschild Boulevard",
    "city": "Tel Aviv",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BKHYY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]