[
  {
    "symbol": "BKI",
    "price": 59.12,
    "beta": 0.482394,
    "volAvg": 1049582,
    "mktCap": 9267709847,
    "lastDiv": 0.27,
    "range": "53.15-68.78",
    "changes": 1.17,
    "companyName": "Black Knight, Inc.",
    "currency": "USD",
    "cik": "0001627014",
    "isin": "US09215C1053",
    "cusip": "09215C105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.blackknightinc.com",
    "description": "Black Knight, Inc. provides integrated software, data, and analytics solutions in North America and Internationally. The Software Solutions segment offers software and hosting solutions comprising MSP, a software as a service application platform for mortgage, home equity loans, and lines of credit; Servicing Digital, a web and mobile solution for consumers that provides easy access to customized timely information about their mortgages; Loss Mitigation, an integrated solution that supports retention and liquidation workouts; and Empower, a loan origination system used by lenders to originate mortgages, home equity loans, and HELOCs. This segment also provides LoanCatcher, a cloud-based loan origination system designed for the needs of brokers; and LoanSifter PPE designed to meet the needs of the broker community by providing access to investors and loan products. The Data and Analytics segment offers property ownership data, lien data, servicing data, automated valuation models, collateral risk scores, behavioral models, lead generation, multiple listing service, and other data solutions. The company was formerly known as Black Knight Financial Services, Inc. and changed its name to Black Knight, Inc. in October 2017. Black Knight, Inc. was founded in 2013 and is headquartered in Jacksonville, Florida.",
    "ceo": "Mr. Anthony M. Jabbour",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "6100",
    "phone": "904 854 5100",
    "address": "601 Riverside Avenue",
    "city": "Jacksonville",
    "state": "FL",
    "zip": "32204",
    "dcfDiff": 0.714252,
    "dcf": 61.6043,
    "image": "https://financialmodelingprep.com/image-stock/BKI.png",
    "ipoDate": "2015-05-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]