[
  {
    "symbol": "BKNG",
    "price": 2666.47,
    "beta": 1.336971,
    "volAvg": 319324,
    "mktCap": 98482603039,
    "lastDiv": 0,
    "range": "1616.85-2786.85",
    "changes": -33.8901,
    "companyName": "Booking Holdings Inc.",
    "currency": "USD",
    "cik": "0001075531",
    "isin": "US09857L1089",
    "cusip": "09857L108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Travel Services",
    "website": "https://www.bookingholdings.com",
    "description": "Booking Holdings Inc. provides travel and restaurant online reservation and related services worldwide. The company operates Booking.com, which offers online accommodation reservations; Rentalcars.com that provides online rental car reservation services; Priceline, which offer online travel reservation services, and consumers hotel, flight, and rental car reservation services, as well as vacation packages, cruises, and hotel distribution services. It also operates Agoda that provides online accommodation reservation services, as well as flight, ground transportation and activities reservation services. In addition, the company operates KAYAK, an online price comparison service that allows consumers to search and compare travel itineraries and prices, comprising airline ticket, accommodation reservation, and rental car reservation information; and OpenTable for booking online restaurant reservations. Further, it offers travel-related insurance products, and restaurant management services to consumers, travel service providers, and restaurants. The company was formerly known as The Priceline Group Inc. and changed its name to Booking Holdings Inc. in February 2018. The company was founded in 1997 and is headquartered in Norwalk, Connecticut.",
    "ceo": "Mr. Glenn D. Fogel",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "22400",
    "phone": "203 299 8000",
    "address": "800 Connecticut Avenue",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06854",
    "dcfDiff": 274.685,
    "dcf": 2189.83,
    "image": "https://financialmodelingprep.com/image-stock/BKNG.png",
    "ipoDate": "1999-03-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]