[
  {
    "symbol": "BKR",
    "price": 31.13,
    "beta": 1.474295,
    "volAvg": 6937316,
    "mktCap": 31514766800,
    "lastDiv": 0.76,
    "range": "20.42-33.12",
    "changes": 0.16,
    "companyName": "Baker Hughes Company",
    "currency": "USD",
    "cik": "0001701605",
    "isin": "US05722G1004",
    "cusip": "05722G100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Oil & Gas Equipment & Services",
    "website": "https://www.bakerhughes.com",
    "description": "Baker Hughes Company provides a portfolio of technologies and services to energy and industrial value chain worldwide. It operates through four segments: Oilfield Services (OFS), Oilfield Equipment (OFE), Turbomachinery & Process Solutions (TPS), and Digital Solutions (DS). The OFS segment offers exploration, drilling, wireline, evaluation, completion, production, and intervention services; and drilling and completions fluids, wireline services, downhole completion tools and systems, wellbore intervention tools and services, pressure pumping systems, oilfield and industrial chemicals, and artificial lift technologies for oil and natural gas, and oilfield service companies. The OFE segment provides subsea and surface wellheads, pressure control and production systems and services, flexible pipe systems for offshore and onshore applications, and life-of-field solutions, including well intervention and decommissioning solutions; and services related to onshore and offshore drilling and production operations. The TPS segment provides equipment and related services for mechanical-drive, compression, and power-generation applications across the oil and gas industry. Its product portfolio includes drivers, compressors, and turnkey solutions; and pumps, valves, and compressed natural gas and small-scale liquefied natural gas solutions. This segment serves upstream, midstream, downstream, onshore, offshore, and industrial customers. The DS segment provides sensor-based process measurements, machine health and condition monitoring, asset strategy and management, control systems, as well as non-destructive testing and inspection, and pipeline integrity solutions. The company was formerly known as Baker Hughes, a GE company and changed its name to Baker Hughes Company in October 2019. Baker Hughes Company is based in Houston, Texas.",
    "ceo": "Mr. Lorenzo  Simonelli",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "56000",
    "phone": "713 439 8600",
    "address": "17021 Aldine Westfield Road",
    "city": "Houston",
    "state": "TX",
    "zip": "77073-5101",
    "dcfDiff": 3.12815,
    "dcf": 34.4281,
    "image": "https://financialmodelingprep.com/image-stock/BKR.png",
    "ipoDate": "1987-04-06",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]