[
  {
    "symbol": "BL",
    "price": 54.09,
    "beta": 0.878169,
    "volAvg": 675620,
    "mktCap": 3271790511,
    "lastDiv": 0,
    "range": "48.73-77.9",
    "changes": -0.31,
    "companyName": "BlackLine, Inc.",
    "currency": "USD",
    "cik": "0001666134",
    "isin": "US09239B1098",
    "cusip": "09239B109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.blackline.com",
    "description": "BlackLine, Inc. provides cloud-based solutions to automate and streamline accounting and finance operations worldwide. It offers financial close management solutions, such as account reconciliations that provides a centralized workspace for users to collaborate on account reconciliations; transaction matching that analyzes and reconciles high volumes of individual transactions; and task management to create and manage processes and task lists. The company's financial close management solutions also include journal entry that allows users to generate, review, and post manual journal entries; variance analysis that monitors and identifies anomalous fluctuations in balance sheet and income statement account balances; consolidation integrity manager that manages the automated system-to-system tie-out process that occurs during the consolidation phase of the financial close; and compliance, an integrated solution that facilitates compliance-related initiatives, consolidates project management, and provides visibility over control self-assessments and testing. In addition, it offers accounts receivable automation solutions, which include cash application, credit and risk management, collections management, disputes and deductions, team and task management, and AR intelligence solutions. Further, the company provides intercompany workflow that stores permissions by entity and transaction type thereby ensuring both the initiator and the approver of the intercompany transaction are authorized to conduct business; intercompany processing, which records an organization's intercompany transactions; and netting and settlement that generates a real-time settlement matrix, which shows the balance of transactions. The company sells its solutions primarily through direct sales force to multinational corporations, large domestic enterprises, and mid-market companies across various industries. BlackLine, Inc. was incorporated in 2001 and is headquartered in Woodland Hills, California.",
    "ceo": "Mr. Owen M. Ryan",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1814",
    "phone": "818 223 9008",
    "address": "21300 Victory Boulevard",
    "city": "Woodland Hills",
    "state": "CA",
    "zip": "91367",
    "dcfDiff": 1.7529,
    "dcf": 69.9771,
    "image": "https://financialmodelingprep.com/image-stock/BL.png",
    "ipoDate": "2016-10-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]