[
  {
    "symbol": "BLCO",
    "price": 19.36,
    "beta": 0,
    "volAvg": 402546,
    "mktCap": 6780994570,
    "lastDiv": 0,
    "range": "12.2-20.19",
    "changes": -0.41,
    "companyName": "Bausch + Lomb Corporation",
    "currency": "USD",
    "cik": "0001860742",
    "isin": null,
    "cusip": "071705107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.bausch.com",
    "description": "Bausch + Lomb Corporation operates as an eye health company worldwide. It operates through three segments: Vision Care/Consumer Health Care, Ophthalmic Pharmaceuticals, and Surgical. The Vision Care/Consumer Health Care segment provides contact lens that covers the spectrum of wearing modalities, including daily disposable and frequently replaced contact lenses; and contact lens care products, over-the-counter eye drops, eye vitamins, and mineral supplements that address various conditions comprising eye allergies, conjunctivitis, and dry eye. The Ophthalmic Pharmaceuticals segment offers proprietary and generic pharmaceutical products for post-operative treatments, as well as for the treatment of eye conditions, such as glaucoma, ocular hypertension, and retinal diseases; and contact lenses for therapeutic use. The Surgical segment provides tools and technologies for the treatment of cataracts, and vitreous and retinal eye conditions; and intraocular lenses and delivery systems, phacoemulsification equipment, and other surgical instruments and devices. The company was founded in 1853 and is headquartered in Vaughan, Canada.",
    "ceo": "Mr. Brenton L.  Saunders J.D.",
    "sector": "Healthcare",
    "country": "CA",
    "fullTimeEmployees": "12900",
    "phone": "905 695 7700",
    "address": "520 Applewood Crescent",
    "city": "Vaughan",
    "state": "ON",
    "zip": "L4K 4B4",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BLCO.png",
    "ipoDate": "2022-05-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]