[
  {
    "symbol": "BLDR",
    "price": 135.34,
    "beta": 1.972887,
    "volAvg": 2529062,
    "mktCap": 17323520000,
    "lastDiv": 0,
    "range": "51.37-135.9899",
    "changes": 1.86,
    "companyName": "Builders FirstSource, Inc.",
    "currency": "USD",
    "cik": "0001316835",
    "isin": "US12008R1077",
    "cusip": "12008R107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.bldr.com",
    "description": "Builders FirstSource, Inc., together with its subsidiaries, manufactures and supplies building materials, manufactured components, and construction services to professional homebuilders, sub-contractors, remodelers, and consumers in the United States. It offers lumber and lumber sheet goods comprising dimensional lumber, plywood, and oriented strand board products that are used in on-site house framing; manufactured products, such as wood floor and roof trusses, steel roof trusses, wall panels, stairs, and engineered wood products; and windows, and interior and exterior door units, as well as interior and exterior trims and custom products under the Synboard brand name. The company also offers gypsum, roofing, and insulation products, including wallboards, ceilings, joint treatments, and finishes; and siding, metal, and concrete products, such as vinyl, composite, and wood siding products, as well as exterior trims, other exteriors, metal studs, and cement products. In addition, it provides other building products and services, such as cabinets and hardware, as well as turn-key framing, shell construction, design assistance, and professional installation services. The company was formerly known as BSL Holdings, Inc. and changed its name to Builders FirstSource, Inc. in October 1999. Builders FirstSource, Inc. was founded in 1998 and is based in Dallas, Texas.",
    "ceo": "Mr. David E. Rush",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "29000",
    "phone": "214 880 3500",
    "address": "2001 Bryan Street",
    "city": "Dallas",
    "state": "TX",
    "zip": "75201",
    "dcfDiff": 17.2406,
    "dcf": 60.0894,
    "image": "https://financialmodelingprep.com/image-stock/BLDR.png",
    "ipoDate": "2005-06-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]