[
  {
    "symbol": "BLKB",
    "price": 68.73,
    "beta": 1.197183,
    "volAvg": 229991,
    "mktCap": 3701976498,
    "lastDiv": 6.500000000000002,
    "range": "43.54-75.5",
    "changes": 0.17,
    "companyName": "Blackbaud, Inc.",
    "currency": "USD",
    "cik": "0001280058",
    "isin": "US09227Q1004",
    "cusip": "09227Q100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.blackbaud.com",
    "description": "Blackbaud, Inc. provides cloud software solutions to higher education institutions, K12 schools, healthcare organizations, faith communities, arts and cultural organizations, foundations, companies, and individual change agents in the United States and internationally. The company offers fundraising and relationship management solutions, such as Blackbaud Raiser's Edge NXT and Blackbaud CRM, Blackbaud eTapestry, Blackbaud TeamRaiser, JustGiving, and Blackbaud Guided Fundraising and Blackbaud Volunteer Network Fundraising; marketing and engagement solutions, including Blackbaud Luminate Online, Blackbaud Online Express, and Blackbaud School Website System; and financial management solutions comprising Blackbaud Financial Edge NXT, Blackbaud Tuition Management, and Blackbaud Financial Aid Management. It also provides grant and award management solutions, consisting of Blackbaud Grantmaking and Blackbaud Award Management; organizational and program management, such as Blackbaud Student Information System, Blackbaud Learning Management System, Blackbaud Enrollment Management System, Blackbaud Altru, and Blackbaud Church Management; social responsibility solutions, which includes YourCause GrantsConnect and YourCause CSRconnect; Blackbaud Merchant Services and Blackbaud Purchase Cards payment services; and Blackbaud's Intelligence for Good solutions, as well as donor acquisition, prospect research, data enrichment, and benchmarking and performance management solutions and services. It sells its solutions and related services through its direct sales force. Blackbaud, Inc. was founded in 1981 and is headquartered in Charleston, South Carolina.",
    "ceo": "Mr. Michael P. Gianoni",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3200",
    "phone": "843 216 6200",
    "address": "65 Fairchild Street",
    "city": "Charleston",
    "state": "SC",
    "zip": "29492",
    "dcfDiff": 3.93755,
    "dcf": 57.8424,
    "image": "https://financialmodelingprep.com/image-stock/BLKB.png",
    "ipoDate": "2004-07-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]