[
  {
    "symbol": "BMO",
    "price": 89.13,
    "beta": 1.139971,
    "volAvg": 572862,
    "mktCap": 63552005954,
    "lastDiv": 4.35,
    "range": "81.57-105.4",
    "changes": -1.02,
    "companyName": "Bank of Montreal",
    "currency": "USD",
    "cik": "0000927971",
    "isin": "CA0636711016",
    "cusip": "063671101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.bmo.com",
    "description": "Bank of Montreal provides diversified financial services primarily in North America. The company's personal banking products and services include checking and savings accounts, credit cards, mortgages, and financial and investment advice services; and commercial banking products and services comprise business deposit accounts, commercial credit cards, business loans and commercial mortgages, cash management solutions, foreign exchange, specialized banking programs, treasury and payment solutions, and risk management products for small business and commercial banking customers. It also offers investment and wealth advisory services; digital investing services; financial services and solutions; and investment management, and trust and custody services. In addition, the company provides life insurance, accident and sickness insurance, and annuity products; creditor and travel insurance to bank customers; and reinsurance solutions. Further, it offers client's debt and equity capital-raising services, as well as loan origination and syndication, and treasury management; strategic advice on mergers and acquisitions, restructurings, and recapitalizations, as well as valuation and fairness opinions; and trade finance, risk mitigation, and other operating services. Additionally, the company provides research and access to markets for institutional, corporate, and retail clients; trading solutions that include debt, foreign exchange, interest rate, credit, equity, securitization and commodities; new product development and origination services, as well as risk management advice and services to hedge against fluctuations; and funding and liquidity management services to its clients. It operates through approximately 900 bank branches and 3,300 automated banking machines in Canada and the United States. Bank of Montreal was founded in 1817 and is headquartered in Montreal, Canada.",
    "ceo": "Mr. William Darryl White",
    "sector": "Financial Services",
    "country": "CA",
    "fullTimeEmployees": "46722",
    "phone": "14168677191",
    "address": "129 rue Saint Jacques",
    "city": "Montreal",
    "state": "QC",
    "zip": "H2Y 1L6",
    "dcfDiff": 158.813,
    "dcf": 259.063,
    "image": "https://financialmodelingprep.com/image-stock/BMO.png",
    "ipoDate": "1994-10-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]