[
  {
    "symbol": "BMRN",
    "price": 92.22,
    "beta": 0.382042,
    "volAvg": 1049659,
    "mktCap": 17309785482,
    "lastDiv": 0,
    "range": "80.53-117.77",
    "changes": 0.49,
    "companyName": "BioMarin Pharmaceutical Inc.",
    "currency": "USD",
    "cik": "0001048477",
    "isin": "US09061G1013",
    "cusip": "09061G101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.biomarin.com",
    "description": "BioMarin Pharmaceutical Inc. develops and commercializes therapies for people with serious and life-threatening rare diseases and medical conditions. Its commercial products include Vimizim, an enzyme replacement therapy for the treatment of mucopolysaccharidosis (MPS) IV type A, a lysosomal storage disorder; Naglazyme, a recombinant form of N-acetylgalactosamine 4-sulfatase for patients with MPS VI; and Kuvan, a proprietary synthetic oral form of 6R-BH4 that is used to treat patients with phenylketonuria (PKU), an inherited metabolic disease. The company's commercial products also comprise Palynziq, a PEGylated recombinant phenylalanine ammonia lyase enzyme, which is delivered through subcutaneous injection to reduce blood Phe concentrations; Brineura, a recombinant human tripeptidyl peptidase 1 for the treatment of patients with ceroid lipofuscinosis type 2, a form of Batten disease; Voxzogo, a once daily injection analog of c-type natriuretic peptide for the treatment of achondroplasia; and Aldurazyme, a purified protein designed to be identical to a naturally occurring form of the human enzyme alpha-L-iduronidase. In addition, it develops valoctocogene roxaparvovec, an adeno associated virus vector, which is in Phase III clinical trial for the treatment of patients with severe hemophilia A; BMN 307, an AAV5 mediated gene therapy, which is in Phase 1/2 clinical trial to normalize blood Phe concentration levels in patients with PKU; and BMN 255 that is in Phase 1/2 clinical trial for treating primary hyperoxaluria. The company serves specialty pharmacies, hospitals, and non-U.S. government agencies, as well as distributors and pharmaceutical wholesalers in the United States, Europe, Latin America, and internationally. BioMarin Pharmaceutical Inc. has license and collaboration agreements with Sarepta Therapeutics, Ares Trading S.A., Catalyst Pharmaceutical Partners, Inc., and Asubio Pharma Co., Ltd. The company was incorporated in 1996 and is headquartered in San Rafael, California.",
    "ceo": "Mr. Jean-Jacques  Bienaime M.B.A., MBA",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "3082",
    "phone": "415 506 6700",
    "address": "770 Lindaro Street",
    "city": "San Rafael",
    "state": "CA",
    "zip": "94901",
    "dcfDiff": 25.6961,
    "dcf": 91.5739,
    "image": "https://financialmodelingprep.com/image-stock/BMRN.png",
    "ipoDate": "1999-07-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]