[
  {
    "symbol": "BMY",
    "price": 64.09,
    "beta": 0.433098,
    "volAvg": 8006541,
    "mktCap": 134643479576,
    "lastDiv": 2.28,
    "range": "62.88-81.44",
    "changes": -0.66,
    "companyName": "Bristol-Myers Squibb Company",
    "currency": "USD",
    "cik": "0000014272",
    "isin": "US1101221083",
    "cusip": "110122108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.bms.com",
    "description": "Bristol-Myers Squibb Company discovers, develops, licenses, manufactures, and markets biopharmaceutical products worldwide. It offers products for hematology, oncology, cardiovascular, immunology, fibrotic, neuroscience, and covid-19 diseases. The company's products include Revlimid, an oral immunomodulatory drug for the treatment of multiple myeloma; Eliquis, an oral inhibitor for reduction in risk of stroke/systemic embolism in NVAF, and for the treatment of DVT/PE; Opdivo for anti-cancer indications; Pomalyst/Imnovid indicated for patients with multiple myeloma; and Orencia for adult patients with active RA and psoriatic arthritis. It also provides Sprycel for the treatment of Philadelphia chromosome-positive chronic myeloid leukemia; Yervoy for the treatment of patients with unresectable or metastatic melanoma; Abraxane, a protein-bound chemotherapy product; Reblozyl for the treatment of anemia in adult patients with beta thalassemia; and Empliciti for the treatment of multiple myeloma. In addition, the company offers Zeposia to treat relapsing forms of multiple sclerosis; Breyanzi, a CD19-directed genetically modified autologous T cell immunotherapy for the treatment of adult patients with relapsed or refractory large B-cell lymphoma; Inrebic, an oral kinase inhibitor indicated for the treatment of adult patients with myelofibrosis; and Onureg for the treatment of adult patients with AML. It sells products to wholesalers, distributors, pharmacies, retailers, hospitals, clinics, and government agencies. The company was formerly known as Bristol-Myers Company. The company was founded in 1887 and is headquartered in New York, New York.",
    "ceo": "Dr. Giovanni  Caforio M.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "34300",
    "phone": "212 546 4000",
    "address": "430 East 29th Street",
    "city": "New York",
    "state": "NY",
    "zip": "10016",
    "dcfDiff": 12.7009,
    "dcf": 85.1509,
    "image": "https://financialmodelingprep.com/image-stock/BMY.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]