[
  {
    "symbol": "BNPQY",
    "price": 30.58,
    "beta": 1.698084,
    "volAvg": 182985,
    "mktCap": 73334507643,
    "lastDiv": 2.1,
    "range": "20.19-35.52",
    "changes": -0.04,
    "companyName": "BNP Paribas SA",
    "currency": "USD",
    "cik": "0000310732",
    "isin": "US05565A2024",
    "cusip": "05565A202",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://group.bnpparibas",
    "description": "BNP Paribas SA provides a range of banking and financial services in Europe, North America, Asia Pacific, and internationally. The company offers corporate and institutional banking services, such as consulting, financing and transaction banking for corporate clients and institutional investors; capital markets investment and financing; securities clearing, and custody services. It also provides commercial, and personal banking and services, including financing and leasing services, financing of individuals, and digital banking services, as well as current and savings account products, equipment leasing and financing solutions, and consumer loans. In addition, the company offers investment and protection services, which includes borrowers' insurance, which protects the insured party from the unexpected when taking out a mortgage, personal, auto, or consumer loan; savings and protection solutions comprising life insurance, employee savings, retirement savings, etc.; asset management, wealth management, and real estate services. The company was formerly known as Banque Nationale de Paris and changed its name to BNP Paribas SA in May 2000. BNP Paribas SA was founded in 1822 and is headquartered in Paris, France.",
    "ceo": "Mr. Jean-Laurent  Bonnafe",
    "sector": "Financial Services",
    "country": "FR",
    "fullTimeEmployees": "190000",
    "phone": "33 1 57 08 22 00",
    "address": "16 boulevard des Italiens",
    "city": "Paris",
    "state": null,
    "zip": "75009",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BNPQY.png",
    "ipoDate": "2003-06-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]