[
  {
    "symbol": "BNTX",
    "price": 106.9,
    "beta": 0.217213,
    "volAvg": 692183,
    "mktCap": 25761831000,
    "lastDiv": 2.111,
    "range": "100.08-188.985",
    "changes": 1.04,
    "companyName": "BioNTech SE",
    "currency": "USD",
    "cik": "0001776985",
    "isin": "US09075V1026",
    "cusip": "09075V102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.biontech.de",
    "description": "BioNTech SE, a biotechnology company, develops and commercializes immunotherapies for cancer and other infectious diseases. The company is developing FixVac product candidates, including BNT111, which is in Phase II clinical trial for advance melanoma; BNT112 that is in Phase I/IIa clinical trial for prostate cancer; BNT113, which is in Phase II clinical trial to treat HPV+ head and neck cancers; BNT114 that is in Phase I clinical trial for triple negative breast cancer; BNT115, which is in Phase I clinical trial in ovarian cancer; and BNT116, a preclinical stage product for non-small cell lung cancer. It also develops neoantigen specific immunotherapies, such as Autogene cevumeran (BNT122), which is in Phase II clinical trial for first-line melanoma, as well as in Phase 1a/1b clinical trial to treat multiple solid tumors; mRNA intratumoral immunotherapy comprising SAR441000 that is in Phase I clinical trial for solid tumors; and BNT141 and BNT142 that are in Phase I clinical trial to treat multiple solid tumors. In addition, the company develops RiboCytokines, which include BNT151, BNT152, and BNT153 to treat solid tumors; chimeric antigen receptor T cell immunotherapies, such as BNT211 to treat multiple solid tumors, and BNT221 for other cancers; and checkpoint immunomodulators consisting of GEN1046 and GEN1042, which are in Phase I/II clinical trial to treat solid tumors. Further, it develops BNT321, an IgG1 monoclonal antibody in Phase II clinical trial for pancreatic cancer; BNT411, a small molecule immunomodulator product candidate for solid tumors; prophylactic vaccine for COVID-19 and Influenza; and infectious disease immunotherapies and rare disease protein replacement therapies. The company has collaborations with Genentech, Inc.; Sanofi S.A.; Genmab A/S; Pfizer Inc.; Shanghai Fosun Pharmaceutical (Group) Co., Ltd.; and Regeneron Pharmaceuticals, Inc. BioNTech SE was incorporated in 2008 and is headquartered in Mainz, Germany.",
    "ceo": "Prof. Ugur  Sahin M.D.",
    "sector": "Healthcare",
    "country": "DE",
    "fullTimeEmployees": "5100",
    "phone": "49 6131 9084 0",
    "address": "An der Goldgrube 12",
    "city": "Mainz",
    "state": null,
    "zip": "55131",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BNTX.png",
    "ipoDate": "2019-10-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]