[
  {
    "symbol": "BOIVF",
    "price": 6.1,
    "beta": 0.765517,
    "volAvg": 39698,
    "mktCap": 17289596390,
    "lastDiv": 0.06,
    "range": "4.26-7.0",
    "changes": 0.03,
    "companyName": "Bolloré SE",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Entertainment",
    "website": "https://www.bollore.com",
    "description": "Bolloré SE engages in the transportation and logistics, communications, and electricity storage solutions businesses in Asia, Africa, the Americas, the Asia-Pacific, and internationally. It operates through Transportation and Logistics, Oil Logistics, Communications, and Electricity Storage and Systems segments. The company offers freight forwarding, railroad, and port services; and distributes and warehouses oil products. It also provides advertising, and communication consulting services; owns and publishes Cnews, a French daily newspaper; provides ticketing and venue services; acts as a pay-TV operator; and operates Mac-Mahon cinema theaters. Further, it develops batteries based on Lithium Metal Polymer technology for use in electric buses, as well as in stationary applications; energy storage solutions; and plastic films for capacitors, and shrink-wrap packaging films, as well as offers Bluebus electric buses. Additionally, the company designs, products, and markets solutions for passenger air and rail transport networks; integrates identification, tracking, and mobility solutions for logistics contractors, industry, and transport; develops terminals, electric charging points, and identification and geolocalization systems; operates shuttles; offers Bluecar electric vehicles and digital transformation solutions; provides equipment to control pedestrian and vehicles; and develops, deploys, and operates point-to-point car sharing solutions. The company was founded in 1822 and is based in Puteaux, France. Bolloré SE is a subsidiary of Financière de l'Odet SE.",
    "ceo": "Mr. Cyrille M.C. Bollore",
    "sector": "Communication Services",
    "country": "FR",
    "fullTimeEmployees": "73559",
    "phone": "33 1 46 96 44 33",
    "address": "Tour Bolloré",
    "city": "Puteaux",
    "state": null,
    "zip": "92811",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BOIVF.png",
    "ipoDate": "2010-10-15",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]