[
  {
    "symbol": "BOKF",
    "price": 81.71,
    "beta": 1.222183,
    "volAvg": 203466,
    "mktCap": 5441951368,
    "lastDiv": 2.16,
    "range": "70.21-110.85",
    "changes": -0.54,
    "companyName": "BOK Financial Corporation",
    "currency": "USD",
    "cik": "0000875357",
    "isin": "US05561Q2012",
    "cusip": "05561Q201",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://investor.bokf.com",
    "description": "BOK Financial Corporation operates as the financial holding company for BOKF, NA that provides various financial products and services in Oklahoma, Texas, New Mexico, Northwest Arkansas, Colorado, Arizona, and Kansas/Missouri. It operates through three segments: Commercial Banking, Consumer Banking, and Wealth Management. The Commercial Banking segment offers lending, treasury, cash management, and customer commodity risk management products for small businesses, middle market, and larger commercial customers, as well as operates TransFund electronic funds transfer network. The Consumer Banking segment provides lending and deposit services to small business customers through consumer branch network; and engages in the mortgage loan origination and servicing activities. The Wealth Management segment offers fiduciary, private bank, insurance, and investment advisory services; and brokerage and trading services primarily related to providing liquidity to the mortgage markets through trading of U.S. government agency mortgage-backed securities and related derivative contracts, as well as underwrites state and municipal securities. The company also provides commercial loans, such as loans for working capital, facilities acquisition or expansion, purchases of equipment, and other needs of commercial customers; and service, healthcare, manufacturing, wholesale/retail, energy, and other sector loans. In addition, it offers commercial real estate loans for the construction of buildings or other enhancements to real estate and property held by borrowers for investment purposes; and residential mortgage and personal loans. Further, the company provides automated teller machine (ATM), call center, and Internet and mobile banking services. As of December 31, 2021, it operated 2,593 TransFund ATM locations. The company was founded in 1910 and is headquartered in Tulsa, Oklahoma.",
    "ceo": "Mr. Stacy C. Kymes",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4796",
    "phone": "918 588 6000",
    "address": "Bank of Oklahoma Tower",
    "city": "Tulsa",
    "state": "OK",
    "zip": "74172",
    "dcfDiff": 45.1349,
    "dcf": 144.635,
    "image": "https://financialmodelingprep.com/image-stock/BOKF.png",
    "ipoDate": "1991-09-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]