[
  {
    "symbol": "BOUYF",
    "price": 33,
    "beta": 0.95249,
    "volAvg": 131,
    "mktCap": 12253196736,
    "lastDiv": 1.98,
    "range": "25.01-36.3",
    "changes": 0.1425,
    "companyName": "Bouygues SA",
    "currency": "USD",
    "cik": "0001445475",
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Engineering & Construction",
    "website": "https://www.bouygues.com",
    "description": "Bouygues SA, together with its subsidiaries, operates in the construction, telecom, and media sectors in France and internationally. The company designs, builds, renovates, operates, and deconstructs building, infrastructure, and industrial projects; develops urban planning, residential, and commercial projects; constructs and maintains roads and motorways, airport runways, ports, industrial logistics and commercial hubs, urban roads and amenities, external works, reserved-lane public transport facilities, leisure facilities, and environmental amenities, as well as undertakes civil engineering activities; produces and recycles construction materials; and distributes bitumen. It also engages in the construction, renewal, and maintenance of rail networks; fitting of road safety and signaling equipment; and laying and maintenance of pipes and pipelines. In addition, the company produces TF1, TMC, TFX, TF1, and LCI complementary TV channels; operates TV Breizh, Histoire, Ushuaïa, and Serieclub channels; produces, broadcasts, and distributes content; produces cinemas; operates la seine musicale entertainment and concert venue; and licenses, publishes, and boards games, as well as musical and events. Further, it offers telecom services; mobile and fixed Internet services; and Bbox Miami, an Android box for TV. Bouygues SA was founded in 1952 and is based in Paris, France.",
    "ceo": "Mr. Pascal  Grange",
    "sector": "Industrials",
    "country": "FR",
    "fullTimeEmployees": "200000",
    "phone": "33 1 44 20 10 79",
    "address": "32 Avenue Hoche",
    "city": "Paris",
    "state": null,
    "zip": "75008",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BOUYF.png",
    "ipoDate": "2010-12-31",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]