[
  {
    "symbol": "BOX",
    "price": 29.05,
    "beta": 0.997183,
    "volAvg": 1373529,
    "mktCap": 4208037982,
    "lastDiv": 0,
    "range": "24.0-34.98",
    "changes": -0.07,
    "companyName": "Box, Inc.",
    "currency": "USD",
    "cik": "0001372612",
    "isin": "US10316T1043",
    "cusip": "10316T104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.box.com",
    "description": "Box, Inc. provides a cloud content management platform that enables organizations of various sizes to manage and share their content from anywhere on any device. The company's Software-as-a-Service platform enables users to collaborate on content internally and with external parties, automate content-driven business processes, develop custom applications, and implement data protection, security, and compliance features to comply with legal and regulatory requirements, internal policies, and industry standards and regulations. It offers web, mobile, and desktop applications for cloud content management on a platform for developing custom applications, as well as industry-specific capabilities. As of January 31, 2022, the company had approximately 100,000 paying organizations, and its solution was offered in 25 languages. It serves financial services, health care, government, and legal services industries in the United States and internationally. The company was formerly known as Box.net, Inc. and changed its name to Box, Inc. in November 2011. Box, Inc. was incorporated in 2005 and is headquartered in San Francisco Bay Area, California.",
    "ceo": "Mr. Aaron  Levie",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2487",
    "phone": "877 729 4269",
    "address": "900 Jefferson Avenue",
    "city": "Redwood City",
    "state": "CA",
    "zip": "94063",
    "dcfDiff": 1.22899,
    "dcf": 30.891,
    "image": "https://financialmodelingprep.com/image-stock/BOX.png",
    "ipoDate": "2015-01-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]