[
  {
    "symbol": "BPMC",
    "price": 65.09,
    "beta": 0.704929,
    "volAvg": 610706,
    "mktCap": 3935816557,
    "lastDiv": 0,
    "range": "37.82-79.4",
    "changes": 2.1,
    "companyName": "Blueprint Medicines Corporation",
    "currency": "USD",
    "cik": "0001597264",
    "isin": "US09627Y1091",
    "cusip": "09627Y109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.blueprintmedicines.com",
    "description": "Blueprint Medicines Corporation, a precision therapy company, develops medicines for genomically defined cancers and blood disorders in the United States and internationally. The company is developing AYVAKIT for the treatment of systemic mastocytosis (SM) and gastrointestinal stromal tumors; BLU-263, an orally available, potent, and KIT inhibitor for the treatment of non-advanced SM and other mast cell disorders; and Fisogatinib, an orally available and potent inhibitor for the treatment of hepatocellular carcinoma. It is also developing GAVRETO for the treatment of RET fusion-positive non-small cell lung cancer, altered solid tumors, medullary thyroid carcinoma, and other solid tumors; BLU-701 and BLU-945 for the treatment of epidermal growth factor receptor driven non-small-cell lung carcinoma (NSCLC); and BLU-451 to treat NSCLC in patients with epidermal growth factor receptor gene (EGFR) exon 20 insertion mutations. In addition, the company is developing BLU-782, for the treatment of fibrodysplasia ossificans progressive; BLU- 222 to treat patients with cyclin E aberrant cancers; and BLU-852 for the treatment of advanced cancers. It has collaboration and license agreements with Clementia Pharmaceuticals, Inc.; Proteovant Therapeutics; CStone Pharmaceuticals; Genentech, Inc.; F. Hoffmann-La Roche Ltd and Hoffmann-La Roche Inc.; and Zai Lab (Shanghai) Co., Ltd. The company was formerly known as Hoyle Pharmaceuticals, Inc. and changed its name to Blueprint Medicines Corporation in June 2011. Blueprint Medicines Corporation was incorporated in 2008 and is headquartered in Cambridge, Massachusetts.",
    "ceo": "Ms. Kathryn  Haviland",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "651",
    "phone": "617 374 7580",
    "address": "45 Sidney Street",
    "city": "Cambridge",
    "state": "MA",
    "zip": "02139",
    "dcfDiff": 0.842141,
    "dcf": 46.9379,
    "image": "https://financialmodelingprep.com/image-stock/BPMC.png",
    "ipoDate": "2015-04-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]