[
  {
    "symbol": "BPOP",
    "price": 60.05,
    "beta": 0.84507,
    "volAvg": 587264,
    "mktCap": 4322044465,
    "lastDiv": 2.2,
    "range": "49.34-83.22",
    "changes": -0.53,
    "companyName": "Popular, Inc.",
    "currency": "USD",
    "cik": "0000763901",
    "isin": "PR7331747001",
    "cusip": "733174700",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.popular.com",
    "description": "Popular, Inc., through its subsidiaries, provides various retail, mortgage, and commercial banking products and services in Puerto Rico, the United States, and British Virgin Islands. The company provides savings, NOW, money market, and other interest-bearing demand accounts; non-interest bearing demand deposits; and certificates of deposit. It also offers commercial and industrial, commercial multi-family, commercial real estate, and residential mortgage loans; consumer loans, including personal loans, credit cards, automobile loans, home equity lines of credit, and other loans to individual borrowers; construction loans; and lease financing comprising automobile loans/leases. In addition, the company provides investment banking, auto and equipment leasing and financing, broker-dealer, and insurance services; debit cards; and online banking services. As of December 31, 2021, it operated 169 branches; and 616 ATMs in Puerto Rico, 23 ATMs in the Virgin Islands, and 91 ATMs in the United States Mainland. Popular, Inc. was founded in 1893 and is headquartered in Hato Rey, Puerto Rico.",
    "ceo": "Mr. Ignacio  Alvarez Esq.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "8975",
    "phone": "787 765 9800",
    "address": "209 MuNoz Rivera Avenue",
    "city": "Hato Rey",
    "state": "PR",
    "zip": "00918",
    "dcfDiff": 211.937,
    "dcf": 278.977,
    "image": "https://financialmodelingprep.com/image-stock/BPOP.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]