[
  {
    "symbol": "BR",
    "price": 161.73,
    "beta": 1.004225,
    "volAvg": 603672,
    "mktCap": 19034488890,
    "lastDiv": 2.9,
    "range": "131.35-183.33",
    "changes": 0.22,
    "companyName": "Broadridge Financial Solutions, Inc.",
    "currency": "USD",
    "cik": "0001383312",
    "isin": "US11133T1034",
    "cusip": "11133T103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.broadridge.com",
    "description": "Broadridge Financial Solutions, Inc. provides investor communications and technology-driven solutions for the financial services industry. The company's Investor Communication Solutions segment processes and distributes proxy materials to investors in equity securities and mutual funds, as well as facilitates related vote processing services; and distributes regulatory reports, class action, and corporate action/reorganization event information, as well as tax reporting solutions. It also offers ProxyEdge, an electronic proxy delivery and voting solution; data-driven solutions and an end-to-end platform for content management, composition, and omni-channel distribution of regulatory, marketing, and transactional information, as well as mutual fund trade processing services; data and analytics solutions; solutions for public corporations and mutual funds; SEC filing and capital markets transaction services; registrar, stock transfer, and record-keeping services; and omni-channel customer communications solutions, as well as operates Broadridge Communications Cloud platform that creates, delivers, and manages communications and customer engagement activities. The company's Global Technology and Operations segment provides solutions that automate the front-to-back transaction lifecycle of equity, mutual fund, fixed income, foreign exchange and exchange-traded derivatives, order capture and execution, trade confirmation, margin, cash management, clearance and settlement, reference data management, reconciliations, securities financing and collateral management, asset servicing, compliance and regulatory reporting, portfolio accounting, and custody-related services. This segment also offers business process outsourcing services; technology solutions, such portfolio management, compliance, fee billing, and operational support solutions; and capital market and wealth management solutions. The company was founded in 1962 and is headquartered in Lake Success, New York.",
    "ceo": "Mr. Timothy C. Gokey",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "14300",
    "phone": "516 472 5400",
    "address": "5 Dakota Drive",
    "city": "Lake Success",
    "state": "NY",
    "zip": "11042",
    "dcfDiff": 0.0297784,
    "dcf": 149.43,
    "image": "https://financialmodelingprep.com/image-stock/BR.png",
    "ipoDate": "2007-03-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]