[
  {
    "symbol": "BRC",
    "price": 47.54,
    "beta": 0.772535,
    "volAvg": 429987,
    "mktCap": 2350871873,
    "lastDiv": 0.92,
    "range": "40.52-56.35",
    "changes": 0.22,
    "companyName": "Brady Corporation",
    "currency": "USD",
    "cik": "0000746598",
    "isin": "US1046741062",
    "cusip": "104674106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Security & Protection Services",
    "website": "https://www.bradyid.com",
    "description": "Brady Corporation manufactures and supplies identification solutions (IDS) and workplace safety (WPS) products to identify and protect premises, products, and people in the United States and internationally. The IDS segment offers safety signs, floor-marking tapes, pipe markers, labeling systems, spill control products, and lockout/tagout devices for facility identification and protection; materials, printing systems, RFID and bar code scanners for product identification, brand protection labeling, work in process labeling, and finished product identification; and hand-held printers, wire markers, sleeves, and tags for wire identification, as well as software and services for safety compliance auditing, procedure writing, and training. Its products also comprise name tags, badges, lanyards, rigid card printing systems, and access control software for people identification; wristbands and labels for tracking and enhancing the safety of patients; and custom wristbands. This segment serves customers in various industries, such as industrial and electronic manufacturing, healthcare, chemical, oil, gas, automotive, aerospace, governments, mass transit, electrical contractors, education, leisure and entertainment, telecommunications, and others through distributors, direct sales, catalog marketing, and digital channels. The WPS segment provides workplace safety and compliance products, such as safety and compliance signs, tags, labels, and markings; informational signage and markings; asset tracking labels; first aid products; facility safety and personal protection equipment; and labor law and other compliance posters for various industries, including process, government, education, construction, and utilities, as well as manufacturers through catalog and digital channels. It also offers stock and custom identification products, as well as sells related resale products. Brady Corporation was incorporated in 1914 and is headquartered in Milwaukee, Wisconsin.",
    "ceo": "Mr. Russell R. Shaller",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5700",
    "phone": "414 358 6600",
    "address": "6555 West Good Hope Road",
    "city": "Milwaukee",
    "state": "WI",
    "zip": "53223",
    "dcfDiff": 1.80874,
    "dcf": 50.6813,
    "image": "https://financialmodelingprep.com/image-stock/BRC.png",
    "ipoDate": "1986-10-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]