[
  {
    "symbol": "BRDCY",
    "price": 20.88,
    "beta": 0.46475,
    "volAvg": 39785,
    "mktCap": 28578665134,
    "lastDiv": 0.68,
    "range": "16.08-22.15",
    "changes": 0.14,
    "companyName": "Bridgestone Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US1084412055",
    "cusip": "108441205",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Auto Parts",
    "website": "https://www.bridgestone.co.jp",
    "description": "Bridgestone Corporation, together with its subsidiaries, manufactures and sells tires and rubber products. It operates through two segments, Tires and Diversified Products. The company offers tires and tire tubes for passenger cars, trucks, buses, construction and mining vehicles, industrial machinery, agricultural machinery, aircraft, motorcycles, scooters, etc.; automotive parts; retreading materials and services; automotive maintenance and repair services; tire raw materials; and other tire-related products. It also provides vehicle parts, polyurethane foam and related products, electronic precision parts, industrial materials-related products, civil engineering and construction materials and equipment, and others; commercial roofing materials and other materials; golf balls, golf clubs, and other sporting goods; bicycles, bicycle-related goods, and others, as well as finance and other services. In addition, the company offers maintenance, IT/sensing technology, and other solutions for the mining, fleet, and agricultural sectors. It has operations in Japan, the United States, China, the Asia Pacific, Europe, Russia, the Middle East, Africa, Oceania, and internationally. The company was founded in 1931 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Shuichi  Ishibashi",
    "sector": "Consumer Cyclical",
    "country": "JP",
    "fullTimeEmployees": "129262",
    "phone": "81 3 6836 3333",
    "address": "1-1, Kyobashi 3-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "104-8340",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BRDCY.png",
    "ipoDate": "2009-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]