[
  {
    "symbol": "BRKR",
    "price": 72.3,
    "beta": 1.159507,
    "volAvg": 909791,
    "mktCap": 10608362678,
    "lastDiv": 0.2,
    "range": "48.42-84.84",
    "changes": -0.84,
    "companyName": "Bruker Corporation",
    "currency": "USD",
    "cik": "0001109354",
    "isin": "US1167941087",
    "cusip": "116794108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Devices",
    "website": "https://www.bruker.com",
    "description": "Bruker Corporation develops, manufactures, and distributes scientific instruments, and analytical and diagnostic solutions in the United States and internationally. The company operates through three segments: Bruker Scientific Instruments (BSI) Life Science, BSI NANO, and Bruker Energy & Supercon Technologies. It offers life science tools, and single and multiple modality systems; life science mass spectrometry; MALDI Biotyper rapid pathogen identification platform and related test kits, DNA test strips, and fluorescence-based polymerase chain reaction technology; genotype and fluorotype molecular diagnostics kits; research, analytical, and process analysis instruments and solutions; SARS-CoV 2 testing for the diagnosis of COVID-19 infection; and Fluorotyper-SARS-CoV 2 plus kits. It also provides range of portable analytical and bioanalytical detection systems, and related products; X-ray instruments; analytical tools for electron microscopes, as well as handheld, portable, and mobile X-ray fluorescence spectrometry instruments; atomic force microscopy instrumentation; non-contact nanometer resolution solution topography; and automated X-ray metrology, automated AFM defect-detection, and photomask repair and cleaning equipment. In addition, the company offers advanced optical fluorescence microscopy instruments; products and services to support the multi-omics needs of researchers in translational research, drug, and biomarker discovery; superconducting materials, such as metallic low temperature superconductors; devices and complex tools based on metallic low temperature superconductors; and non-superconducting high technology tools, such as synchrotron and beamline instrumentation. Bruker Corporation has a collaboration with Newomics Inc. on a LC-MS platform for drug discovery. The company was incorporated in 1991 and is headquartered in Billerica, Massachusetts.",
    "ceo": "Dr. Frank H. Laukien Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "8525",
    "phone": "978 663 3660",
    "address": "40 Manning Road",
    "city": "Billerica",
    "state": "MA",
    "zip": "01821",
    "dcfDiff": 1.61945,
    "dcf": 73.2694,
    "image": "https://financialmodelingprep.com/image-stock/BRKR.png",
    "ipoDate": "2000-08-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]