[
  {
    "symbol": "BRO",
    "price": 66.8,
    "beta": 0.752464,
    "volAvg": 1283306,
    "mktCap": 18947419200,
    "lastDiv": 0.46,
    "range": "52.82-68.43",
    "changes": -0.02,
    "companyName": "Brown & Brown, Inc.",
    "currency": "USD",
    "cik": "0000079282",
    "isin": "US1152361010",
    "cusip": "115236101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance Brokers",
    "website": "https://www.bbinsurance.com",
    "description": "Brown & Brown, Inc. markets and sells insurance products and services in the United States, Bermuda, Canada, Ireland, the United Kingdom, and the Cayman Islands. It operates through four segments: Retail, National Programs, Wholesale Brokerage, and Services. The Retail segment offers property and casualty, employee benefits insurance products, personal insurance products, specialties insurance products, loss control survey and analysis, consultancy, and claims processing services. It serves commercial, public and quasi-public entities, professional, and individual customers. The National Programs segment offers professional liability and related package insurance products for dentistry, legal, eyecare, insurance, financial, physicians, real estate title professionals, as well as supplementary insurance products related to weddings, events, medical facilities, and cyber liabilities. This segment also offers outsourced product development, marketing, underwriting, actuarial, compliance, and claims and other administrative services to insurance carrier partners; and commercial and public entity-related programs, and flood insurance products. It serves through independent agents. The Wholesale Brokerage segment markets and sells excess and surplus commercial and personal lines insurance through independent agents and brokers. The Services segment offers third-party claims administration and medical utilization management services in the workers' compensation and all-lines liability arenas, Medicare Set-aside, Social Security disability, Medicare benefits advocacy, and claims adjusting services. The company was founded in 1939 and is headquartered in Daytona Beach, Florida.",
    "ceo": "Mr. J. Powell Brown C.P.C.U., CPCU",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "15201",
    "phone": "386 252 9601",
    "address": "300 North Beach Street",
    "city": "Daytona Beach",
    "state": "FL",
    "zip": "32114",
    "dcfDiff": 3.61535,
    "dcf": 61.2154,
    "image": "https://financialmodelingprep.com/image-stock/BRO.png",
    "ipoDate": "1981-02-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]