[
  {
    "symbol": "BRP",
    "price": 24.52,
    "beta": 1.529003,
    "volAvg": 400566,
    "mktCap": 1562831240,
    "lastDiv": 0,
    "range": "19.26-33.34",
    "changes": -0.44,
    "companyName": "BRP Group, Inc.",
    "currency": "USD",
    "cik": "0001781755",
    "isin": "US05589G1022",
    "cusip": "05589G102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Insurance Brokers",
    "website": "https://www.baldwinriskpartners.com",
    "description": "BRP Group, Inc. markets and sells insurance products and services in the United States. The company operates through four segments: Middle Market, Specialty, MainStreet, and Medicare. The Middle Market segment provides commercial risk management, employee benefits solutions, and private risk management for mid-to-large size businesses and high net worth individuals, as well as its families. The Specialty segment delivers specialty insurers, professionals, individuals, and industry businesses the access to specialty markets, as well as capabilities and programs requiring underwriting and placement. This segment also operates as a managing general agent of the Future platform, which delivers proprietary, technology-enabled insurance solutions. The MainStreet segment offers personal insurance, commercial insurance, and life and health solutions to individuals and businesses in its communities. The Medicare segment provides consultation for government assistance programs and solutions, including Medicare and Medicare Advantage to seniors and Medicare-eligible individuals through a network of primarily independent contractor agents. The company was founded in 2011 and is headquartered in Tampa, Florida.",
    "ceo": "Mr. Trevor L. Baldwin",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3800",
    "phone": "866 279 0698",
    "address": "4211 West Boy Scout Boulevard",
    "city": "Tampa",
    "state": "FL",
    "zip": "33607",
    "dcfDiff": 5.80881,
    "dcf": 34.1788,
    "image": "https://financialmodelingprep.com/image-stock/BRP.png",
    "ipoDate": "2019-10-24",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]