[
  {
    "symbol": "BRTHY",
    "price": 31.275,
    "beta": 0.854789,
    "volAvg": 58,
    "mktCap": 3932111925,
    "lastDiv": 0.98,
    "range": "28.25-39.2",
    "changes": -0.055,
    "companyName": "Brother Industries, Ltd.",
    "currency": "USD",
    "cik": "0000014595",
    "isin": "US1148132079",
    "cusip": "114813207",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Business Equipment & Supplies",
    "website": "https://global.brother",
    "description": "Brother Industries, Ltd. manufactures and sells communications and printing equipment in Japan, the Americas, Europe, Asia, Oceania, the Middle East, Africa, and internationally. It operates through six segments Printing & Solutions, Personal & Home, Machinery, Network & Contents, Domino, and Others. The Printing & Solutions segment offers inkjet printers; all-in-one black-and-white and color laser printers; fax machines and scanners; and electronic stationary comprising labeling systems, and label and mobile printers. The Personal & Home segment provides home sewing and cutting machines, sewing and embroidery machines, and commercial embroidery machines. The Machinery segment offers industrial sewing machines, machine tools, and garment printers, as well as industrial parts, such as reducers and gears. The Network & Contents segment provides online karaoke systems, music boxes, applications for smartphones/tablets, health care supporting equipment, and content services, as well as manages Karaoke clubs. The Domino segment offers coding and marking equipment, and digital printing equipment. The Others segment engages in real estate and other activities. The company was formerly known as Nippon Sewing Machine Manufacturing Co. and changed its name to Brother Industries, Ltd. in 1962. Brother Industries, Ltd. was founded in 1908 and is headquartered in Nagoya, Japan.",
    "ceo": "Mr. Ichiro  Sasaki",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "41215",
    "phone": "81 5 2824 2511",
    "address": "15-1, Naeshiro-cho",
    "city": "Nagoya",
    "state": null,
    "zip": "467-8561",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BRTHY.png",
    "ipoDate": "2009-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]