[
  {
    "symbol": "BRZE",
    "price": 43.415,
    "beta": 0,
    "volAvg": 999424,
    "mktCap": 4236739822,
    "lastDiv": 0,
    "range": "22.535-50.97",
    "changes": 2.195,
    "companyName": "Braze, Inc.",
    "currency": "USD",
    "cik": "0001676238",
    "isin": "US10576N1028",
    "cusip": "10576N102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.braze.com",
    "description": "Braze, Inc. operates a customer engagement platform that provides interactions between consumers and brands worldwide. It offers data ingestion products, such as Braze software development kits that automatically manage data ingestion and the delivery of mobile and web notifications, in-application/in-browser interstitial messages, and content cards, as well as can be integrated into a range of digital interfaces and application development frameworks; REST API that can be used to import or export data or to trigger workflows between Braze and brands' existing technology stacks; and partner cohort syncing, which allow brands to sync user cohorts from partners. The company also offers classification products, including segmentation that can define reusable segments of consumers based upon attributes, events, or predictive propensity scores; segment insights, which allows customers to analyze how segments are performing relative to each other across a set of pre-selected key performance indicators, and helps to understand the factors that determine which consumers belong to a particular segment; and predictive suite that allows customers to identify groups of consumers that are of critical business value. In addition, it provides personalization and action products; and orchestration products, which include Canvas, an orchestration tool that allows customers to create journeys, mapping out multi-steps, and cross-channel messaging experiences, which include onboarding flows, nurture campaigns, win-back strategies, and others; campaigns, which allow customers to send one set of single-channel or multi-channel messages to be delivered to customers in a particular user segment; event and API triggering; frequency capping and rate limiting; intelligent selection; and reporting and analytics. The company was formerly known as Appboy, Inc. and changed its name to Braze, Inc. in November 2017. Braze, Inc. was incorporated in 2011 and is headquartered in New York, New York.",
    "ceo": "Mr. William  Magnuson",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1501",
    "phone": "609 964 0585",
    "address": "330 West 34th Street",
    "city": "New York",
    "state": "NY",
    "zip": "10001",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BRZE.png",
    "ipoDate": "2021-11-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]