[
  {
    "symbol": "BSAC",
    "price": 18.26,
    "beta": 0.327739,
    "volAvg": 409069,
    "mktCap": 8602560046,
    "lastDiv": 1.25,
    "range": "13.37-20.04",
    "changes": -0.1,
    "companyName": "Banco Santander-Chile",
    "currency": "USD",
    "cik": "0001027552",
    "isin": "US05965X1090",
    "cusip": "05965X109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://banco.santander.cl",
    "description": "Banco Santander-Chile, together with its subsidiaries, provides commercial and retail banking products and services in Chile. It operates through Retail Banking, Middle-Market, Corporate Investment Banking, and Corporate Activities segments. The company offers debit and credit cards, checking accounts, and savings products; consumer, automobile, commercial, mortgage, and government-guaranteed loans; and Chilean peso and foreign currency denominated loans to finance various commercial transactions, trade, foreign currency forward contracts, and credit lines, as well as mortgage financing services. It also provides mutual funds, insurance and securities brokerage, foreign exchange, financial leasing, factoring, financial consulting and advisory, investment management, foreign trade, treasury, and transactional services, as well as specialized services to finance projects for the real estate industry. In addition, the company offers short-term financing and fund raising, and brokerage services, as well as derivatives, securitization, and other tailor-made products. It serves individuals, small to middle-sized entities, companies, and large corporations, as well as universities, government entities, and local and regional governments. As of December 31, 2021, the company operated 326 branches, which include 220 under the Santander brand name, 14 under the Select brand name, 7 specialized branches for the middle market, and 22 as auxiliary and payment centers, as well as 1,338 ATMs, including depository ATMs. Banco Santander-Chile was incorporated in 1977 and is headquartered in Santiago, Chile.",
    "ceo": "Mr. Roman  Blanco Reinosa",
    "sector": "Financial Services",
    "country": "CL",
    "fullTimeEmployees": "9477",
    "phone": "56 2 320 2000",
    "address": "Bandera 140",
    "city": "Santiago de Chile",
    "state": null,
    "zip": null,
    "dcfDiff": 11165.2,
    "dcf": 11181.6,
    "image": "https://financialmodelingprep.com/image-stock/BSAC.png",
    "ipoDate": "1994-10-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]