[
  {
    "symbol": "BSBR",
    "price": 6.26,
    "beta": 0.675342,
    "volAvg": 740282,
    "mktCap": 46712684902,
    "lastDiv": 0.34,
    "range": "4.76-6.59",
    "changes": -0.11,
    "companyName": "Banco Santander (Brasil) S.A.",
    "currency": "USD",
    "cik": "0001471055",
    "isin": "US05967A1079",
    "cusip": "05967A107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.santander.com.br",
    "description": "Banco Santander (Brasil) S.A., together with its subsidiaries, provides various banking products and services to individuals, small and medium enterprises, and corporate customers in Brazil and internationally. The company operates in two segments, Commercial Banking and Global Wholesale Banking. It offers deposits and other bank funding instruments; debit and credit cards; digital prepaid solutions; payment platform; loyalty programs; employee benefit vouchers; payroll loans; digital lending and online debt renegotiation services; mortgages; home equity financing products; consumer credit; and local loans, commercial and trade finance, guarantees, structured loans, and cash management and funding solutions, as well as on-lending transfer services. It also provides funding and financial advisory services related to projects, origination and distribution of fixed-income securities in the debt capital markets, financing of acquisitions and syndicated loans, other structured financing arrangements, and subordinated debt and energy efficiency transactions; advisory services for mergers and acquisitions, and equity capital markets transactions; and stock brokerage and advisory, equity, and equity research services. In addition, the company structures and offers foreign exchange, derivative, and investment products for institutional investors, and corporate and retail customers; and provides market making services. Further, it offers instant payment services; range of products and services focused on the agribusiness sector; microfinance services; and online automotive listing and digital car insurance solutions, as well as digital trading platform. Additionally, it provides its financial services and products to its customers through multichannel distribution network comprising branches, mini-branches, ATMs, call centers, Internet banking, and mobile banking. Banco Santander (Brasil) S.A. was incorporated in 1985 and is headquartered in São Paulo, Brazil.",
    "ceo": "Mr. Mario Roberto Opice Leao",
    "sector": "Financial Services",
    "country": "BR",
    "fullTimeEmployees": "53556",
    "phone": "55 11 3553 3300",
    "address": "Avenida Presidente Juscelino Kubitschek",
    "city": "São Paulo",
    "state": "SP",
    "zip": "04543-011",
    "dcfDiff": 4.03331,
    "dcf": 9.60331,
    "image": "https://financialmodelingprep.com/image-stock/BSBR.png",
    "ipoDate": "2009-10-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]