[
  {
    "symbol": "BSMX",
    "price": 5.46,
    "beta": 0.811263,
    "volAvg": 102298,
    "mktCap": 7405179425,
    "lastDiv": 0.65,
    "range": "4.52-7.11",
    "changes": 0.13,
    "companyName": "Banco Santander México, S.A., Institución de Banca Múltiple, Grupo Financiero Santander México",
    "currency": "USD",
    "cik": "0001698287",
    "isin": "US05969B1035",
    "cusip": "05969B103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.santander.com.mx",
    "description": "Banco Santander México, S.A., Institución de Banca Múltiple, Grupo Financiero Santander México provides various banking products and services in Mexico. The company operates through Retail Banking and Corporate and Investment Banking segments. It offers various deposit products, such as current accounts, savings accounts, and time deposits, as well as certificates of interbank deposits; and payroll loans, personal loans, credit cards, mortgages, and insurance brokerage services. The company also provides cash management, working capital solutions, and trade finance; structured credit and debt products, project finance, and asset based finance; financial and strategic advisory services for mergers and acquisition; solutions and services for investing and hedging; and Internet and mobile banking services. It serves individuals, private banking clients, small and medium-sized enterprises, middle-market corporations, government institutions, and corporate and institutional customers. As of December 31, 2021, it operated through a network of 1,346 offices; 9,498 ATMs; and 2,540 contact center positions. The company was formerly known as Banco Santander (México), S.A., Institución de Banca Múltiple, Grupo Financiero Santander and changed its name to Banco Santander México, S.A., Institución de Banca Múltiple, Grupo Financiero Santander México in September 2012. The company was incorporated in 1932 and is headquartered in Mexico City, Mexico. Banco Santander México, S.A., Institución de Banca Múltiple, Grupo Financiero Santander México is a subsidiary of Grupo Financiero Santander México, S.A. de C.V.",
    "ceo": "Mr. Felipe Francisco García Ascencio",
    "sector": "Financial Services",
    "country": "MX",
    "fullTimeEmployees": "26461",
    "phone": "52 55 5257 8000",
    "address": "Av. ProlongaciOn Ps de la Reforma 500",
    "city": "Mexico City",
    "state": "DF",
    "zip": "01219",
    "dcfDiff": 59.3524,
    "dcf": 65.7424,
    "image": "https://financialmodelingprep.com/image-stock/BSMX.png",
    "ipoDate": "2012-09-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": true,
    "isFund": false
  }
]