[
  {
    "symbol": "BSY",
    "price": 53.29,
    "beta": 1.18865,
    "volAvg": 957503,
    "mktCap": 15633793880,
    "lastDiv": 0.2,
    "range": "30.51-54.24",
    "changes": 0.57,
    "companyName": "Bentley Systems, Incorporated",
    "currency": "USD",
    "cik": "0001031308",
    "isin": "US08265T2087",
    "cusip": "08265T208",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.bentley.com",
    "description": "Bentley Systems, Incorporated, together with its subsidiaries, provides infrastructure engineering software solutions in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. The company offers open modeling and open simulation applications for infrastructure design integration, which include MicroStation, OpenRoads, OpenRail, OpenPlant, OpenBuildings, OpenBridge, OpenSite, OpenFlows, STAAD and RAM, SACS, MOSES, AutoPIPE, SITEOPS, CUBE, DYNAMEQ, EMME, and LEGION; and geoprofessional applications for modeling and simulation of near and deep subsurface conditions, including Leapfrog, AGS Workbench, GeoStudio, Imago, MX Deposit, Oasis montaj, PLAXIS, and OpenGround. It also provides project delivery systems that support collaboration, work-sharing, and 4D construction modeling for infrastructure project delivery enterprises, such as ProjectWise, ProjectWise Design Review Service, and SYNCHRO; and asset and network performance systems, such as AssetWise ALIM, AssetWise Asset Reliability, AssetWise Enterprise Interoperability, AssetWise 4D Analytics, AssetWise Linear, and Seequent Central. In addition, it offers industry solutions comprising AssetWise Linear SUPERLOAD, AssetWise Linear Analytics, AssetWise Inspections, ContextCapture, OpenCities, OpenUtilities, OpenTower, OpenWindPower, Power Line, SPIDA, OrbitGT, sensemetrics, PlantSight, and WaterSight. The company serves civil, structural, geotechnical, geoscience subsurface engineers, architects, geospatial professionals, city and regional planners, contractors, fabricators, and operations and maintenance engineers. Bentley Systems, Incorporated was incorporated in 1984 and is headquartered in Exton, Pennsylvania.",
    "ceo": "Mr. Gregory S. Bentley",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "5000",
    "phone": "610 458 5000",
    "address": "685 Stockton Drive",
    "city": "Exton",
    "state": "PA",
    "zip": "19341",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BSY.png",
    "ipoDate": "2020-09-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]