[
  {
    "symbol": "BTLCY",
    "price": 3.79,
    "beta": 1.468199,
    "volAvg": 95245,
    "mktCap": 3680013980,
    "lastDiv": 0.28,
    "range": "3.54-6.1",
    "changes": 0.04,
    "companyName": "British Land Company Plc",
    "currency": "USD",
    "cik": null,
    "isin": "US1108281007",
    "cusip": "110828100",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "REIT—Diversified",
    "website": "https://www.britishland.com",
    "description": "Our portfolio of high quality UK commercial property is focused on London Offices and Retail around the UK. We own or manage a portfolio valued at £13.7bn (British Land share: £10.3bn) as at 30 September 2020 making us one of Europe's largest listed real estate investment companies. Our strategy is to provide places which meet the needs of our customers and respond to changing lifestyles - Places People Prefer. We do this by creating great environments both inside and outside our buildings and use our scale and placemaking skills to enhance and enliven them. This expands their appeal to a broader range of occupiers, creating enduring demand and driving sustainable, long term performance. Our Offices portfolio comprises three office-led campuses in central London as well as high quality standalone buildings and accounts for 65% of our portfolio. Our Retail portfolio is focused on retail parks and shopping centres, and accounts for 31% of our portfolio. Increasingly our focus is on providing a mix of uses and this is most evident at Canada Water, our 53 acre redevelopment opportunity where we have plans to create a new neighbourhood for London. Sustainability is embedded throughout our business. Our places, which are designed to meet high sustainability standards, become part of local communities, provide opportunities for skills development and employment and promote wellbeing. In April 2016 British Land received the Queen's Award for Enterprise: Sustainable Development, the UK's highest accolade for business success for economic, social and environmental achievements over a period of five years.",
    "ceo": "Mr. Simon G. Carter MA, ACA",
    "sector": "Real Estate",
    "country": "GB",
    "fullTimeEmployees": "647",
    "phone": "44 20 7486 4466",
    "address": "York House",
    "city": "London",
    "state": null,
    "zip": "W1H 7LX",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BTLCY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]