[
  {
    "symbol": "BTU",
    "price": 20.87,
    "beta": 1.02183,
    "volAvg": 3441675,
    "mktCap": 3019889000,
    "lastDiv": 0.07,
    "range": "17.42-32.89",
    "changes": -0.2,
    "companyName": "Peabody Energy Corporation",
    "currency": "USD",
    "cik": "0001064728",
    "isin": "US7045511000",
    "cusip": "704551100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Thermal Coal",
    "website": "https://www.peabodyenergy.com",
    "description": "Peabody Energy Corporation engages in coal mining business in the United States, Japan, Taiwan, Australia, India, Indonesia, China, Vietnam, South Korea, and internationally. The company operates through Seaborne Thermal Mining, Seaborne Metallurgical Mining, Powder River Basin Mining, and Other U.S. Thermal Mining segments. It is involved in mining, preparation, and sale of thermal coal primarily to electric utilities; mining bituminous and sub-bituminous coal deposits; and mining metallurgical coal, such as hard coking coal, semi-hard coking coal, semi-soft coking coal, and pulverized coal injection coal. The company supplies coal primarily to electricity generators, industrial facilities, and steel manufacturers. As of December 31, 2021, it owned interests in 17 coal mining operations located in the United States and Australia; and had approximately 2.5 billion tons of proven and probable coal reserves and approximately 450,000 acres of surface property through ownership and lease agreements. The company also engages in direct and brokered trading of coal and freight-related contracts, as well as provides transportation-related services. Peabody Energy Corporation was founded in 1883 and is headquartered in St. Louis, Missouri.",
    "ceo": "Mr. James C. Grech",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "5500",
    "phone": "314 342 3400",
    "address": "Peabody Plaza",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63101-1826",
    "dcfDiff": 10.2577,
    "dcf": 37.5077,
    "image": "https://financialmodelingprep.com/image-stock/BTU.png",
    "ipoDate": "2017-04-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]