[
  {
    "symbol": "BTVCY",
    "price": 21.72,
    "beta": 0.718773,
    "volAvg": 37729,
    "mktCap": 2803356960,
    "lastDiv": 0.71,
    "range": "15.37-23.705",
    "changes": -0.215,
    "companyName": "Britvic plc",
    "currency": "USD",
    "cik": null,
    "isin": "US1111901047",
    "cusip": "111190104",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Beverages—Non-Alcoholic",
    "website": "https://www.britvic.com",
    "description": "Britvic plc, together with its subsidiaries, manufactures, markets, distributes, and sells soft drinks in the United Kingdom, the Republic of Ireland, France, Brazil, and internationally. It also provides fruit juices, syrups, squash, mineral water, liquid concentrates, ready-to-drink nectar drinks, sodas, mixers, and energy and flavored drinks. The company offers its products under the 7UP, Aqua Libra, Ballygowan, Britvic, drench, Robinsons, Gatorade, J2O, Lipton, London Essence, Mathieu Teisseire, Mountain Dew, Pepsi MAX, Plenish, Purdey's, Rockstar, R. White's, Tango, Teisseire, Bela Ischia, Britvic, Dafruta, Maguary, Mathieu Teisseire, Pressade, Puro Coco, C&C, Cidona, Club, Edge, Energise Sport, MiWadi, Moulin de Valdonne, and TK brands. In addition, it supplies water-coolers and bottled water; engages in the wholesale of soft drinks to the licensed trade; offers pension funding and financing services; and designs, installs, and maintains integrated tap solutions. The company was incorporated in 2005 and is headquartered in Hemel Hempstead, the United Kingdom.",
    "ceo": "Mr. Simon  Litherland",
    "sector": "Consumer Defensive",
    "country": "GB",
    "fullTimeEmployees": "4346",
    "phone": "44 1217 111 102",
    "address": "Breakspear Park",
    "city": "Hemel Hempstead",
    "state": null,
    "zip": "HP2 4TZ",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BTVCY.png",
    "ipoDate": "2018-03-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]