[
  {
    "symbol": "BVNRY",
    "price": 9.53,
    "beta": 1.410344,
    "volAvg": 6492,
    "mktCap": 2333477785,
    "lastDiv": 0.59345,
    "range": "8.34-19.31",
    "changes": -0.02,
    "companyName": "Bavarian Nordic A/S",
    "currency": "USD",
    "cik": null,
    "isin": "US0717711099",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Biotechnology",
    "website": "https://www.bavarian-nordic.com",
    "description": "Bavarian Nordic A/S develops, manufactures, and commercializes life-saving vaccines. The company offers non-replicating smallpox and monkeypox vaccines under the IMVAMUNE, IMVANEX, and JYNNEOS names; rabies vaccine for human use under the Rabipur/RabAvert name; tick-borne encephalitis vaccine under the Encepur name; and Ebola vaccine under the MVABEA name. It is also developing MVA-BN (freeze-dried) that has completed Phase III clinical trials for the treatment of smallpox; MVA-BN RSV, which is in Phase III clinical trials for the treatment of respiratory syncytial virus; ABNCoV2 that has completed Phase II clinical trial for the treatment of SARS-CoV-2; and TAEK-VAC, which is in Phase I/II clinical trial for treatment of advanced HER2 and brachyury-expressing cancers. It has license and collaboration agreement with AdaptVac; and license agreements with National Cancer Institute and Public Health Service. The company operates in the United States, Belgium, Germany, the Netherlands, Sweden, Switzerland, Austria, the United Kingdom, Japan, and internationally. Bavarian Nordic A/S was incorporated in 1992 and is headquartered in Hellerup, Denmark.",
    "ceo": "Dr. Paul John Chaplin MSc, Ph.D.",
    "sector": "Healthcare",
    "country": "DK",
    "fullTimeEmployees": "1040",
    "phone": "45 33 26 83 83",
    "address": "Philip Heymans Alle 3",
    "city": "Hellerup",
    "state": null,
    "zip": "2900",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BVNRY.png",
    "ipoDate": "2013-04-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]