[
  {
    "symbol": "BVRDF",
    "price": 27.21268,
    "beta": 0.90613,
    "volAvg": 233,
    "mktCap": 12309900930,
    "lastDiv": 0.82,
    "range": "21.68-28.46",
    "changes": 0.9177,
    "companyName": "Bureau Veritas SA",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Consulting Services",
    "website": "https://www.bureauveritas.com",
    "description": "Bureau Veritas SA provides laboratory testing, inspection, and certification services. It operates through six segments: Marine & Offshore; Agri-Food & Commodities; Industry; Buildings & Infrastructure; Certification; and Consumer Products. The company engages in the inspecting, analyzing, auditing, and certifying the products, assets, and management systems of its customers in relation to regulatory benchmarks or volunteers, as well as issues compliance reports. It also provides laboratory and on-site testing services for manufacturing and process industries; inspection services for products, services, assets, and installations, as well as designed to control quality, verify quantity, and meet regulatory requirements; and certification services for management systems, products, and people. The company serves automotive and transportation, building and infrastructure, chemicals, commodities and agriculture, consumer products and retail, food, marine and offshore, oil and gas, and power and utilities industries, as well as financial services and public sectors. It operates in approximately 140 countries through a network of 1,600 offices and laboratories. Bureau Veritas SA was founded in 1828 and is based in Neuilly-sur-Seine, France.",
    "ceo": "Ms. Hinda  Gharbi M.Sc.",
    "sector": "Industrials",
    "country": "FR",
    "fullTimeEmployees": "77799",
    "phone": "33 1 55 24 70 00",
    "address": "Immeuble Newtime",
    "city": "Neuilly-sur-Seine",
    "state": null,
    "zip": "92200",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BVRDF.png",
    "ipoDate": "2010-04-26",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]