[
  {
    "symbol": "BWA",
    "price": 47.71,
    "beta": 1.416549,
    "volAvg": 2454033,
    "mktCap": 11181935448,
    "lastDiv": 0.68,
    "range": "31.14-51.14",
    "changes": 1.36,
    "companyName": "BorgWarner Inc.",
    "currency": "USD",
    "cik": "0000908255",
    "isin": "US0997241064",
    "cusip": "099724106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Auto Parts",
    "website": "https://www.borgwarner.com",
    "description": "BorgWarner Inc. provides solutions for combustion, hybrid, and electric vehicles worldwide. The company operates through four segments: Air Management, E-Propulsion & Drivetrain, Fuel Injection, and Aftermarket. The Air Management segment offers turbochargers, eBoosters, eTurbos, timing systems, emissions systems, thermal systems, gasoline ignition technology, smart remote actuators, powertrain sensors, canisters, cabin heaters, battery modules and systems, battery packs, battery heaters, and battery charging. The E-Propulsion & Drivetrain segment provides rotating electrical components, power electronics, control modules, software, friction, and mechanical products for automatic transmissions and torque-management products. The Fuel Injection segment develops and manufactures gasoline and diesel fuel injection components and systems. The Aftermarket segment sells products and services to independent aftermarket customers and original equipment service customers. This segment provides a range of solutions, including fuel injection, electronics and engine management, maintenance, and test equipment and vehicle diagnostics. The company sells its products to original equipment manufacturers of light vehicles, which comprise passenger cars, sport-utility vehicles, vans, and light trucks; commercial vehicles, including medium-duty and heavy-duty trucks, and buses; and off-highway vehicles, such as agricultural and construction machinery, and marine applications, as well as to tier one vehicle systems suppliers and the aftermarket for light, commercial, and off-highway vehicles. The company was formerly known as Borg-Warner Automotive, Inc. BorgWarner Inc. was incorporated in 1987 and is headquartered in Auburn Hills, Michigan.",
    "ceo": "Mr. Frederic B. Lissalde",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "52700",
    "phone": "248 754 9200",
    "address": "3850 Hamlin Road",
    "city": "Auburn Hills",
    "state": "MI",
    "zip": "48326",
    "dcfDiff": 3.63516,
    "dcf": 49.6052,
    "image": "https://financialmodelingprep.com/image-stock/BWA.png",
    "ipoDate": "1993-08-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]