[
  {
    "symbol": "BWXT",
    "price": 70.22,
    "beta": 0.808802,
    "volAvg": 823370,
    "mktCap": 6421457213,
    "lastDiv": 0.92,
    "range": "49.14-70.32",
    "changes": 0.38,
    "companyName": "BWX Technologies, Inc.",
    "currency": "USD",
    "cik": "0001486957",
    "isin": "US05605H1005",
    "cusip": "05605H100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.bwxt.com",
    "description": "BWX Technologies, Inc. manufactures and sells nuclear components in the United States, Canada, and internationally. It operates in three segments: Nuclear Operations Group, Nuclear Power Group, and Nuclear Services Group. The Nuclear Operations Group segment provides precision naval and critical nuclear components, reactors, nuclear fuel, and assemblies for the United States Department of Energy/National Nuclear Security Administration's Naval Nuclear Propulsion Program and other uses; missile launch tubes for United States Navy submarines; close-tolerance and equipment for nuclear applications; and converts Cold War-era government stockpiles of high-enriched uranium, as well as receives, stores, characterizes, dissolves, recovers, and purifies uranium-bearing materials; supplies research reactor fuel elements for colleges, universities, and national laboratories; and components for defense applications. The Nuclear Power Group segment offers commercial nuclear steam generators, nuclear fuel, fuel handling systems, pressure vessels, reactor components, heat exchangers, tooling delivery systems, and containers; engineering and in-plant services for nuclear power plants; designs, manufactures, commissions, and services nuclear power generation equipment; in-plant inspection, maintenance, and modification services, as well as non-destructive examination and tooling/repair solutions; and supplies medical radioisotopes and radiopharmaceuticals for research, diagnostic, and therapeutic uses. The Nuclear Services Group segment provides nuclear materials processing, environmental site restoration, and management and operating services; develops technology for nuclear power sources application; and designs, engineers, licenses, and manufactures nuclear reactors. The company was formerly known as The Babcock & Wilcox Company and changed its name to BWX Technologies, Inc. in June 2015. BWX Technologies, Inc. was founded in 1867 and is headquartered in Lynchburg, Virginia.",
    "ceo": "Mr. Rex D. Geveden",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "7000",
    "phone": "434 522 3800",
    "address": "800 Main Street",
    "city": "Lynchburg",
    "state": "VA",
    "zip": "24504",
    "dcfDiff": 1.7913,
    "dcf": 59.3787,
    "image": "https://financialmodelingprep.com/image-stock/BWXT.png",
    "ipoDate": "2010-08-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]