[
  {
    "symbol": "BX",
    "price": 91.29,
    "beta": 1.488028,
    "volAvg": 3958235,
    "mktCap": 109691330960,
    "lastDiv": 3.9,
    "range": "71.72-110.9",
    "changes": -0.04,
    "companyName": "Blackstone Inc.",
    "currency": "USD",
    "cik": "0001393818",
    "isin": "US09260D1072",
    "cusip": "09260D107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.blackstone.com",
    "description": "Blackstone Inc. is an alternative asset management firm specializing in real estate, private equity, hedge fund solutions, credit, secondary funds of funds, public debt and equity and multi-asset class strategies. The firm typically invests in early-stage companies. It also provide capital markets services. The real estate segment specializes in opportunistic, core+ investments as well as debt investment opportunities collateralized by commercial real estate, and stabilized income-oriented commercial real estate across North America, Europe and Asia. The firm's corporate private equity business pursues transactions throughout the world across a variety of transaction types, including large buyouts,special situations, distressed mortgage loans, mid-cap buyouts, buy and build platforms, which involves multiple acquisitions behind a single management team and platform, and growth equity/development projects involving significant majority stakes in portfolio companies and minority investments in operating companies, shipping, real estate, corporate or consumer loans, and alternative energy greenfield development projects in energy and power, property, dislocated markets, shipping opportunities, financial institution breakups, re-insurance, and improving freight mobility, financial services, healthcare, life sciences, enterprise tech and consumer, as well as consumer technologies. The firm considers investment in Asia and Latin America. It has a three year investment period. Its hedge fund business manages a broad range of commingled and customized fund solutions and its credit business focuses on loans, and securities of non-investment grade companies spread across the capital structure including senior debt, subordinated debt, preferred stock and common equity. Blackstone Inc. was founded in 1985 and is headquartered in New York, New York with additional offices across Asia, Europe and North America.",
    "ceo": "Mr. Stephen Allen Schwarzman B.A., M.B.A.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4695",
    "phone": "212 583 5000",
    "address": "345 Park Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10154",
    "dcfDiff": 3.09204,
    "dcf": 92.768,
    "image": "https://financialmodelingprep.com/image-stock/BX.png",
    "ipoDate": "2007-06-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]