[
  {
    "symbol": "BXSL",
    "price": 27.51,
    "beta": 0,
    "volAvg": 675925,
    "mktCap": 4423167840,
    "lastDiv": 3.08,
    "range": "22.0-27.785",
    "changes": 0.12,
    "companyName": "Blackstone Secured Lending Fund",
    "currency": "USD",
    "cik": "0001736035",
    "isin": null,
    "cusip": "09261X102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.bxsl.com",
    "description": "Blackstone Secured Lending Fund is business development company and a Delaware statutory trust formed on March 26, 2018, and structured as an externally managed, non-diversified closed-end investment Fund. On October 26, 2018, the fund elected to be regulated as a business development company (BDC) under the Investment Company Act of 1940, as amended (the 1940 Act). In addition, the Fund elected to be treated for U.S. federal income tax purposes, as a regulated investment company (RIC), as defined under Subchapter M of the Internal Revenue Code of 1986, as amended (the Code). The fund also intends to continue to comply with the requirements prescribed by the Code in order to maintain tax treatment as a RIC. The fund's investment objectives are to generate current income and, to a lesser extent, long-term capital appreciation. The Fund seeks to achieve its investment objective primarily through originated loans, equity and other securities, including syndicated loans, of private U.S. companies, specifically small and middle market companies, typically in the form of first lien senior secured and unitranche loans (including first out/last out loans), and to a lesser extent, second lien, third lien, unsecured and subordinated loans and other debt and equity securities.",
    "ceo": "Mr. Brad  Marshall",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": null,
    "phone": "212 503 2100",
    "address": "345 Park Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10154",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BXSL.png",
    "ipoDate": "2021-10-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": true
  }
]