[
  {
    "symbol": "BYDDF",
    "price": 32.155,
    "beta": 0.636781,
    "volAvg": 84711,
    "mktCap": 101781817481,
    "lastDiv": 0.16,
    "range": "21.29-42.49",
    "changes": -0.265,
    "companyName": "BYD Company Limited",
    "currency": "USD",
    "cik": "0001445162",
    "isin": "CNE100000296",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Auto Manufacturers",
    "website": "https://www.byd.com",
    "description": "BYD Company Limited, together with its subsidiaries, engages in the research, development, manufacture, and sale of automobiles and related products in the People's Republic of China and internationally. It operates through three segments: Rechargeable Batteries and Photovoltaic Products; Mobile Handset Components, Assembly Service and Other Products; and Automobiles and Related Products and Other Products. The company offers internal combustion, hybrid, and battery-electric passenger vehicles; buses, coaches, and taxis; logistics, construction, and sanitation vehicles; and vehicles for warehousing, port, airport, and mining operations. It also manufactures and sells lithium-ion and nickel batteries, photovoltaic products, and iron batteries primarily for mobile phones, electric tools, and other portable electronic instruments; mobile handset components, such as housings and electronic components; medical protection products; and automobiles, and auto-related molds and components, as well as provides assembly, and automobiles leasing and after sales services. In addition, it offers rail transit equipment; solar batteries and arrays; and urban rail transportation services. The company was founded in 1995 and is headquartered in Shenzhen, China.",
    "ceo": "Mr. Chuan-Fu  Wang",
    "sector": "Consumer Cyclical",
    "country": "CN",
    "fullTimeEmployees": "570100",
    "phone": "86 755 8988 8888",
    "address": "3009, BYD Road",
    "city": "Shenzhen",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BYDDF.png",
    "ipoDate": "2009-02-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]