[
  {
    "symbol": "BZLFY",
    "price": 38.24,
    "beta": 0.487739,
    "volAvg": 28287,
    "mktCap": 12922251694,
    "lastDiv": 0.76,
    "range": "28.79-41.0",
    "changes": 0.15,
    "companyName": "Bunzl plc",
    "currency": "USD",
    "cik": null,
    "isin": "US1207384066",
    "cusip": "120738307",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Food Distribution",
    "website": "https://www.bunzl.com",
    "description": "Bunzl plc operates as a distribution and services company in the North America, Continental Europe, the United Kingdom, Ireland, and internationally. The company offers food packaging, films, labels, cleaning and hygiene supplies, and personal protection equipment to grocery stores, supermarkets, and convenience stores. It also provides food packaging, disposable tableware, guest amenities, catering equipment, agricultural supplies, cleaning and hygiene products, and safety items to hotels, restaurants, contract caterers, food processors, commercial growers, and the leisure sector; and gloves, boots, hard hats, ear and eye protection, and other workwear, as well as cleaning and hygiene supplies, and asset protection products to industrial and construction, and ecommerce sectors. In addition, the company offers chemicals and hygiene paper to cleaning and facilities management companies, and industrial and public customers; gloves, masks, swabs, gowns, bandages, and other healthcare related equipment; and healthcare devices to hospitals, care homes, and other facilities serving the healthcare sector. Further, it provides packaging and other store supplies to retail chains, boutiques, department stores, home improvement chains, office supply companies, and related e-commerce sales channels. The company was founded in 1854 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. Frank  van Zanten M.B.A., MBA",
    "sector": "Consumer Defensive",
    "country": "GB",
    "fullTimeEmployees": "22451",
    "phone": "44 20 7725 5000",
    "address": "York House",
    "city": "London",
    "state": null,
    "zip": "W1H 7JT",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/BZLFY.png",
    "ipoDate": "2007-06-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]