[
  {
    "symbol": "C",
    "price": 46.23,
    "beta": 1.568661,
    "volAvg": 15027390,
    "mktCap": 89998250281,
    "lastDiv": 2.04,
    "range": "40.01-54.56",
    "changes": -0.17,
    "companyName": "Citigroup Inc.",
    "currency": "USD",
    "cik": "0000831001",
    "isin": "US1729674242",
    "cusip": "172967424",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.citigroup.com",
    "description": "Citigroup Inc., a diversified financial services holding company, provides various financial products and services to consumers, corporations, governments, and institutions in North America, Latin America, Asia, Europe, the Middle East, and Africa. The company operates in two segments, Global Consumer Banking (GCB) and Institutional Clients Group (ICG). The GCB segment offers traditional banking services to retail customers through retail banking, Citi-branded cards, and Citi retail services. It also provides various banking, credit card, lending, and investment services through a network of local branches, offices, and electronic delivery systems. The ICG segment offers wholesale banking products and services, including fixed income and equity sales and trading, foreign exchange, prime brokerage, derivative, equity and fixed income research, corporate lending, investment banking and advisory, private banking, cash management, trade finance, and securities services to corporate, institutional, public sector, and high-net-worth clients. As of December 31, 2020, it operated 2,303 branches primarily in the United States, Mexico, and Asia. Citigroup Inc. was founded in 1812 and is headquartered in New York, New York.",
    "ceo": "Ms. Jane Nind Fraser",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "240000",
    "phone": "212 559 1000",
    "address": "388 Greenwich Street",
    "city": "New York",
    "state": "NY",
    "zip": "10013",
    "dcfDiff": 127.932,
    "dcf": 179.792,
    "image": "https://financialmodelingprep.com/image-stock/C.png",
    "ipoDate": "1977-01-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]