[
  {
    "symbol": "CABO",
    "price": 674.85,
    "beta": 0.838732,
    "volAvg": 59095,
    "mktCap": 3834099539,
    "lastDiv": 11.4,
    "range": "602.7-1464.2",
    "changes": 8.62,
    "companyName": "Cable One, Inc.",
    "currency": "USD",
    "cik": "0001632127",
    "isin": "US12685J1051",
    "cusip": "12685J105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.cableone.biz",
    "description": "Cable One, Inc., together with its subsidiaries, provides data, video, and voice services in the United States. The company offers residential data services, a service to enhance Wi-Fi signal throughout the home. It also provides residential video services, such as local networks; local community programming that includes governmental and public access; and other channels, as well as digital video services, including national and regional cable networks, music channels, and an interactive and electronic programming guide with parental controls. In addition, the company offers premium channels that offer movies, original programming, live sporting events, and concerts and other features; and advanced video services, such as whole-home DVRs and high-definition set-top boxes, as well as TV Everywhere product, which enables its video customers to stream various channels and shows to mobile devices and computers. Further, it provides residential voice services comprising local and long-distance calling, voicemail, call waiting, three-way calling, caller ID, anonymous call rejection, and other features, as well as international calling by the minute services. Additionally, the company offers data, voice, and video products to business customers, including small to mid-markets, enterprises, and wholesale and carrier customers. As of December 31, 2021, it served approximately 1.2 million residential and business customers in 24 states through its Sparklight, Fidelity, and Clearwave brands. Cable One, Inc. was incorporated in 1980 and is headquartered in Phoenix, Arizona.",
    "ceo": "Ms. Julia M. Laulis",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "3132",
    "phone": "602 364 6000",
    "address": "210 East Earll Drive",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85012",
    "dcfDiff": 71.5721,
    "dcf": 727.178,
    "image": "https://financialmodelingprep.com/image-stock/CABO.png",
    "ipoDate": "2015-06-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]