[
  {
    "symbol": "CACI",
    "price": 336.43,
    "beta": 0.97183,
    "volAvg": 159182,
    "mktCap": 7668282633,
    "lastDiv": 0,
    "range": "245.32-336.81",
    "changes": 1.74,
    "companyName": "CACI International Inc",
    "currency": "USD",
    "cik": "0000016058",
    "isin": "US1271903049",
    "cusip": "127190304",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.caci.com",
    "description": "CACI International Inc, together with its subsidiaries, provides expertise and technology to enterprise and mission customers in support of national security missions and government modernization/transformation in the intelligence, defense, and federal civilian sectors. It operates in two segments, Domestic Operations and International Operations. The Domestic Operations segment offers information solutions and services to the U.S. federal government agencies and commercial enterprises in the areas, such as digital solutions, C4ISR, cyber and space, engineering services, enterprise IT, and mission support. The International Operations segment provides a range of IT services, proprietary data, and software products to the commercial and government customers in the United Kingdom, continental Europe, and internationally. The company designs, implements, protects, and manages secure enterprise IT solutions. It also offers software-defined, full-spectrum cyber, electronic warfare, and counter-unmanned aircraft system solutions; and platform integration and modernization and sustainment, as well as system engineering, naval architecture, training and simulation, and logistics engineering. In addition, the company provides enterprise cloud solutions for classified and unclassified networks; and intelligence support that ensures continuous advances in collection, analysis, and dissemination to optimize decision-making. CACI International Inc was founded in 1962 and is headquartered in Reston, Virginia.",
    "ceo": "Mr. John S. Mengucci",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "22000",
    "phone": "703 841 7800",
    "address": "12021 Sunset Hills Road",
    "city": "Reston",
    "state": "VA",
    "zip": "20190",
    "dcfDiff": 15.3024,
    "dcf": 310.392,
    "image": "https://financialmodelingprep.com/image-stock/CACI.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]