[
  {
    "symbol": "CAE",
    "price": 21.48,
    "beta": 1.988455,
    "volAvg": 202333,
    "mktCap": 6832551548,
    "lastDiv": 2.648999999999996,
    "range": "15.23-27.07",
    "changes": 0.1,
    "companyName": "CAE Inc.",
    "currency": "USD",
    "cik": "0001173382",
    "isin": "CA1247651088",
    "cusip": "124765108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.cae.com",
    "description": "CAE Inc., together with its subsidiaries, provides simulation training and critical operations support solutions worldwide. It operates through three segments: Civil Aviation, Defense and Security, and Healthcare. The Civil Aviation segment provides training solutions for flight, cabin, maintenance, and ground personnel in commercial, business, and helicopter aviation; flight simulation training devices; and ab initio pilot training and crew sourcing services, as well as end to end digitally enabled crew management, training operations solutions, and optimization software. The Defense and Security segment offers training and mission support solutions for defense forces across multi-domain operations, OEMs, government agencies and public safety organizations. The Healthcare segment provides integrated education and training solutions, including interventional and imaging simulations, curricula, audiovisual debriefing solutions, center management platforms, and patient simulators for healthcare students and clinical professionals, hospital and university simulation centers, medical and nursing schools, paramedic organizations, defense forces, medical societies, public health agencies and OEMs. The company was formerly known as CAE Industries Ltd. and changed its name to CAE Inc. in 1993. CAE Inc. was incorporated in 1947 and is headquartered in Saint-Laurent, Canada.",
    "ceo": "Mr. Marc  Parent CM",
    "sector": "Industrials",
    "country": "CA",
    "fullTimeEmployees": "13000",
    "phone": "15143416780",
    "address": "8585 Cote-de-Liesse",
    "city": "Saint-Laurent",
    "state": "QC",
    "zip": "H4T 1G6",
    "dcfDiff": 2.27553,
    "dcf": 24.6155,
    "image": "https://financialmodelingprep.com/image-stock/CAE.png",
    "ipoDate": "2002-07-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]