[
  {
    "symbol": "CAG",
    "price": 33.05,
    "beta": 0.557746,
    "volAvg": 4250845,
    "mktCap": 15761776614,
    "lastDiv": 1.32,
    "range": "32.3-41.3",
    "changes": -1.19,
    "companyName": "Conagra Brands, Inc.",
    "currency": "USD",
    "cik": "0000023217",
    "isin": "US2058871029",
    "cusip": "205887102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaged Foods",
    "website": "https://www.conagrabrands.com",
    "description": "Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company in North America. The company operates in four segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice. The Grocery & Snacks segment primarily offers shelf stable food products through various retail channels in the United States. The Refrigerated & Frozen segment provides temperature-controlled food products through various retail channels in the United States. The International segment offers food products in various temperature states through retail and foodservice channels outside of the United States. The Foodservice segment offers branded and customized food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for restaurants and other foodservice establishments in the United States. The company sells its products under the Birds Eye, Duncan Hines, Healthy Choice, Marie Callender's, Reddi-wip, Slim Jim, Angie's BOOMCHICKAPOP, Duke's, Earth Balance, Gardein, and Frontera brands. The company was formerly known as ConAgra Foods, Inc. and changed its name to Conagra Brands, Inc. in November 2016. Conagra Brands, Inc. was founded in 1861 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Sean M. Connolly",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "18000",
    "phone": "312 549 5000",
    "address": "222 West Merchandise Mart Plaza",
    "city": "Chicago",
    "state": "IL",
    "zip": "60654",
    "dcfDiff": 0.102363,
    "dcf": 36.5624,
    "image": "https://financialmodelingprep.com/image-stock/CAG.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]