[
  {
    "symbol": "CAH",
    "price": 93.81,
    "beta": 0.772535,
    "volAvg": 2295288,
    "mktCap": 23884026000,
    "lastDiv": 2,
    "range": "51.32-94.31",
    "changes": 0.72,
    "companyName": "Cardinal Health, Inc.",
    "currency": "USD",
    "cik": "0000721371",
    "isin": "US14149Y1082",
    "cusip": "14149Y108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Distribution",
    "website": "https://www.cardinalhealth.com",
    "description": "Cardinal Health, Inc. operates as an integrated healthcare services and products company in the United States, Canada, Europe, Asia, and internationally. It provides customized solutions for hospitals, healthcare systems, pharmacies, ambulatory surgery centers, clinical laboratories, physician offices, and patients in the home. The company operates in two segments, Pharmaceutical and Medical. The Pharmaceutical segment distributes branded and generic pharmaceutical, specialty pharmaceutical, and over-the-counter healthcare and consumer products. The segment also provides services to pharmaceutical manufacturers and healthcare providers for specialty pharmaceutical products; operates nuclear pharmacies and radiopharmaceutical manufacturing facilities; repackages generic pharmaceuticals and over-the-counter healthcare products; and offers medication therapy management and patient outcomes services to hospitals, other healthcare providers, and payers, as well as provides pharmacy management services to hospitals. The Medical segment manufactures, sources, and distributes Cardinal Health branded medical, surgical, and laboratory products and devices that include exam and surgical gloves; needles, syringe, and sharps disposals; compressions; incontinences; nutritional delivery products; wound care products; single-use surgical drapes, gowns, and apparels; fluid suction and collection systems; urology products; operating room supply products; and electrode product lines. The segment also distributes a range of national brand products, including medical, surgical, and laboratory products; provides supply chain services and solutions to hospitals, ambulatory surgery centers, clinical laboratories, and other healthcare providers; and assembles and sells sterile, and non-sterile procedure kits. The company was incorporated in 1979 and is headquartered in Dublin, Ohio.",
    "ceo": "Mr. Jason M. Hollar",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "46500",
    "phone": "614 757 5000",
    "address": "7000 Cardinal Place",
    "city": "Dublin",
    "state": "OH",
    "zip": "43017",
    "dcfDiff": 12.8284,
    "dcf": 89.3084,
    "image": "https://financialmodelingprep.com/image-stock/CAH.png",
    "ipoDate": "1983-08-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]