[
  {
    "symbol": "CALX",
    "price": 48.92,
    "beta": 1.553521,
    "volAvg": 701538,
    "mktCap": 3240661372,
    "lastDiv": 0,
    "range": "33.18-77.44",
    "changes": 0.37,
    "companyName": "Calix, Inc.",
    "currency": "USD",
    "cik": "0001406666",
    "isin": "US13100M5094",
    "cusip": "13100M509",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.calix.com",
    "description": "Calix, Inc., together with its subsidiaries, provides cloud and software platforms, and systems and services in the United States, rest of Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company's cloud and software platforms, and systems and services enable broadband service providers (BSPs) to provide a range of services. It provides Calix Cloud platform, a role-based analytics platform comprising Calix Marketing Cloud, Calix Support Cloud, and Calix Operations Cloud, which are configurable to display role-based insights and enable BSPs to anticipate and target new revenue-generating services and applications through mobile application. The company also offers EXOS, a carrier class premises operating system and fully integrated with its GigaSpire family of systems to be ready for deployment as a complete subscriber experience solutions for BSP's residential and business subscribers; and AXOS, a software platform to access edge of the network by its architecture and operations. It offers its products through its direct sales force and resellers. Calix, Inc. was incorporated in 1999 and is headquartered in San Jose, California.",
    "ceo": "Mr. Michael  Weening",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1426",
    "phone": "408 514 3000",
    "address": "2777 Orchard Parkway",
    "city": "San Jose",
    "state": "CA",
    "zip": "95134",
    "dcfDiff": 17.0867,
    "dcf": 68.1867,
    "image": "https://financialmodelingprep.com/image-stock/CALX.png",
    "ipoDate": "2010-03-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]