[
  {
    "symbol": "CARCY",
    "price": 12.4,
    "beta": 0.991187,
    "volAvg": 14,
    "mktCap": 2886285901,
    "lastDiv": 0.49,
    "range": "12.23-20.36",
    "changes": -0.56,
    "companyName": "China Resources Cement Holdings Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Building Materials",
    "website": "https://www.crcement.com",
    "description": "China Resources Cement Holdings Limited, an investment holding company, manufactures and sells cement, concrete, and related products and services in Mainland China and Hong Kong. The company engages in the excavation of limestone; and production, sale, and distribution of cement, clinker, and concrete. It offers Portland, ordinary Portland, composite Portland, and slag Portland cement under the Runfeng name. The company's products are used in the construction of infrastructure projects, such as railways, highways, subways, bridges, airports, ports, dams, and hydroelectric and nuclear power stations, as well as high-rise buildings, and suburban and rural area development. It also trades in cement products and construction materials; provides environmental protection engineering and building materials testing and consultancy services; mines aggregates; holds properties; and manufactures and sells prefabricated construction materials. The company was incorporated in 2003 and is headquartered in Wanchai, Hong Kong. China Resources Cement Holdings Limited is a subsidiary of CRH (Cement) Limited.",
    "ceo": "Mr. Shiqing  Jing",
    "sector": "Basic Materials",
    "country": "HK",
    "fullTimeEmployees": "19046",
    "phone": "852 3118 6800",
    "address": "China Resources Building",
    "city": "Wan Chai",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CARCY.png",
    "ipoDate": "2011-09-01",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]