[
  {
    "symbol": "CARR",
    "price": 49.32,
    "beta": 1.164548,
    "volAvg": 5995061,
    "mktCap": 41174210949,
    "lastDiv": 0.74,
    "range": "33.1-49.63",
    "changes": -0.17,
    "companyName": "Carrier Global Corporation",
    "currency": "USD",
    "cik": "0001783180",
    "isin": "US14448C1045",
    "cusip": "14448C104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.corporate.carrier.com",
    "description": "Carrier Global Corporation provides heating, ventilating, and air conditioning (HVAC), refrigeration, fire, security, and building automation technologies worldwide. It operates through three segments: HVAC, Refrigeration, and Fire & Security. The HVAC segment provides products, controls, services, and solutions to meet the heating, cooling, and ventilation needs of residential and commercial customers. Its products include air conditioners, heating systems, controls, and aftermarket components, as well as aftermarket repair and maintenance services and building automation solutions. The Refrigeration segment offers transport refrigeration and monitoring products and services, as well as digital solutions for trucks, trailers, shipping containers, intermodal applications, food retail, and warehouse cooling; and commercial refrigeration solutions, such as refrigerated cabinets, freezers, systems, and controls. The Fire & Security segment provides various residential, commercial, and industrial technologies, including fire, flame, gas, smoke, and carbon monoxide detection; portable fire extinguishers; fire suppression systems; intruder alarms; access control systems; video management systems; and electronic controls. Its other fire and security service offerings comprise audit, design, installation, and system integration, as well as aftermarket maintenance and repair and monitoring services. The company offers its products under the Autronica, Det-Tronics, Edwards, Fireye, GST, Kidde, LenelS2, Marioff, Onity, and Supra; Carrier, Automated Logic, Bryant, CIAT, Day & Night, Heil, NORESCO, and Riello; and Carrier Commercial Refrigeration, Carrier Transicold, and Sensitech brands. The company was incorporated in 2019 and is headquartered in Palm Beach Gardens, Florida.",
    "ceo": "Mr. David L. Gitlin",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "52000",
    "phone": "561 365 2000",
    "address": "13995 Pasteur Boulevard",
    "city": "Palm Beach Gardens",
    "state": "FL",
    "zip": "33418",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CARR.png",
    "ipoDate": "2020-03-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]