[
  {
    "symbol": "CASY",
    "price": 235.44,
    "beta": 0.814788,
    "volAvg": 255856,
    "mktCap": 8773083000,
    "lastDiv": 1.72,
    "range": "182.69-249.9",
    "changes": 7.71,
    "companyName": "Casey's General Stores, Inc.",
    "currency": "USD",
    "cik": "0000726958",
    "isin": "US1475281036",
    "cusip": "147528103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Specialty Retail",
    "website": "https://www.caseys.com",
    "description": "Casey's General Stores, Inc., together with its subsidiaries, operates convenience stores under the Casey's and Casey's General Store names. Its stores offer a selection of food, including freshly prepared foods, such as pizza, donuts, and sandwiches; beverages; tobacco and nicotine products; health and beauty aids; automotive products; and other nonfood items. The company's stores also provide motor fuel for sale on a self-service basis; and gasoline and diesel fuel. In addition, its stores offer various products, include soft drinks, energy, water, sports drinks, juices, coffee, and tea and dairy products; beer, wine, and spirits; snacks, candy, packaged bakery, and other food items; ice, ice cream, meals, and appetizers; health and beauty aids, electronic accessories, housewares, and pet supplies; and lotto/lottery and prepaid cards. Further, the company operates two stores that sells tobacco and nicotine products; one liquor store; and one grocery store. As of April 30, 2022, it operated 2,452 convenience stores. Casey's General Stores, Inc. was founded in 1959 and is headquartered in Ankeny, Iowa.",
    "ceo": "Mr. Darren M. Rebelez",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "20292",
    "phone": "515 965 6100",
    "address": "One SE Convenience Boulevard",
    "city": "Ankeny",
    "state": "IA",
    "zip": "50021",
    "dcfDiff": 20.2291,
    "dcf": 248.289,
    "image": "https://financialmodelingprep.com/image-stock/CASY.png",
    "ipoDate": "1983-10-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]