[
  {
    "symbol": "CAT",
    "price": 241.87,
    "beta": 1.07993,
    "volAvg": 3197285,
    "mktCap": 124888604601,
    "lastDiv": 4.8,
    "range": "160.6-266.04",
    "changes": 1.18,
    "companyName": "Caterpillar Inc.",
    "currency": "USD",
    "cik": "0000018230",
    "isin": "US1491231015",
    "cusip": "149123101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Farm & Heavy Construction Machinery",
    "website": "https://www.caterpillar.com",
    "description": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, and industrial gas turbines worldwide. Its Construction Industries segment offers asphalt pavers, backhoe loaders, compactors, cold planers, compact track and multi-terrain loaders, excavators, motorgraders, pipelayers, road reclaimers, site prep tractors, skid steer loaders, telehandlers, and utility vehicles; mini, small, medium, and large excavators; compact, small, and medium wheel loaders; track-type tractors and loaders; and wheel excavators. The Resource Industries segment provides electric rope shovels, draglines, hydraulic shovels, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway trucks, articulated trucks, wheel tractor scrapers, wheel dozers, fleet management, landfill compactors, soil compactors, machinery components, autonomous ready vehicles and solutions, select work tools, and safety services and mining performance solutions. The Energy & Transportation segment offers reciprocating engines, generator sets, integrated systems and solutions, turbines and turbine-related services, remanufactured reciprocating engines and components, centrifugal gas compressors, diesel-electric locomotives and components, and other rail-related products and services for marine, oil and gas, industrial, and electric power generation sectors. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing plans; and insurance and risk management products for vehicles, power generation facilities, and marine vessels. The All Other operating segment manufactures filters and fluids, undercarriage, ground engaging tools, etc. The company was formerly known as Caterpillar Tractor Co. and changed its name to Caterpillar Inc. in 1986. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
    "ceo": "Mr. D. James Umpleby III",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "109100",
    "phone": "224-551-4000",
    "address": "510 Lake Cook Road",
    "city": "Deerfield",
    "state": "IL",
    "zip": "60015",
    "dcfDiff": 15.5016,
    "dcf": 249.038,
    "image": "https://financialmodelingprep.com/image-stock/CAT.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]