[
  {
    "symbol": "CATY",
    "price": 32,
    "beta": 1.134859,
    "volAvg": 343317,
    "mktCap": 2321142272,
    "lastDiv": 1.36,
    "range": "27.24-47.3",
    "changes": -0.27,
    "companyName": "Cathay General Bancorp",
    "currency": "USD",
    "cik": "0000861842",
    "isin": "US1491501045",
    "cusip": "149150104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.cathaygeneralbancorp.com",
    "description": "Cathay General Bancorp operates as the holding company for Cathay Bank that offers various commercial banking products and services to individuals, professionals, and small to medium-sized businesses in the United States. The company offers various deposit products, including passbook accounts, checking accounts, money market deposit accounts, certificates of deposit, individual retirement accounts, and public funds deposits. It also provides loan products, such as commercial mortgage loans, commercial loans, small business administration loans, residential mortgage loans, real estate construction loans, and home equity lines of credit, as well as installment loans to individuals for household, and other consumer expenditures. In addition, the company offers trade financing, letter of credit, wire transfer, forward currency spot and forward contract, traveler's check, safe deposit, night deposit, social security payment deposit, collection, bank-by-mail, drive-up and walk-up window, automatic teller machine, Internet banking, investment, and other customary bank services, as well as securities and insurance products. As of March 1, 2022, it operated 31 branches in Southern California, 16 branches in Northern California, 10 branches in New York, four branches in Washington, two branches in Illinois, and two branches in Texas, as well as one branch each in Maryland, Massachusetts, Nevada, and New Jersey, and Hong Kong; and a representative office each in Beijing, Taipei, and Shanghai. The company was founded in 1962 and is headquartered in Los Angeles, California.",
    "ceo": "Mr. Chang Ming Liu",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1178",
    "phone": "213 625 4700",
    "address": "777 North Broadway",
    "city": "Los Angeles",
    "state": "CA",
    "zip": "90012",
    "dcfDiff": 34.6396,
    "dcf": 76.8696,
    "image": "https://financialmodelingprep.com/image-stock/CATY.png",
    "ipoDate": "1990-12-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]