[
  {
    "symbol": "CBOE",
    "price": 134.52,
    "beta": 0.505281,
    "volAvg": 635270,
    "mktCap": 14201814480,
    "lastDiv": 2,
    "range": "111.83-140.82",
    "changes": 0.43,
    "companyName": "Cboe Global Markets, Inc.",
    "currency": "USD",
    "cik": "0001374310",
    "isin": "US12503M1080",
    "cusip": "12503M108",
    "exchange": "BATS",
    "exchangeShortName": "ETF",
    "industry": "Financial Data & Stock Exchanges",
    "website": "https://www.cboe.com",
    "description": "Cboe Global Markets, Inc., through its subsidiaries, operates as an options exchange worldwide. It operates through five segments: Options, North American Equities, Futures, Europe and Asia Pacific, and Global FX. The Options segment trades in listed market indices. The North American Equities segment trades in listed U.S. and Canadian equities. This segment also offers exchange-traded products (ETP) transaction and ETP listing services. The Futures segment trades in futures. The Europe and Asia Pacific segment offers pan-European listed equities and derivatives transaction services, ETPs, exchange-traded commodities, and international depository receipts, as well as ETP listings and clearing services. The Global FX segment provides institutional foreign exchange (FX) trading and non-deliverable forward FX transactions services. The company has strategic relationships with S&P Dow Jones Indices, LLC; FTSE International Limited; Frank Russell Company; MSCI Inc.; and DJI Opco, LLC. The company was formerly known as CBOE Holdings, Inc. and changed its name to Cboe Global Markets, Inc. in October 2017. Cboe Global Markets, Inc. was founded in 1973 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Edward T. Tilly",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1543",
    "phone": "312 786 5600",
    "address": "433 West Van Buren Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60607",
    "dcfDiff": 5.05809,
    "dcf": 127.158,
    "image": "https://financialmodelingprep.com/image-stock/CBOE.png",
    "ipoDate": "2010-06-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]