[
  {
    "symbol": "CBSH",
    "price": 46.7,
    "beta": 0.751408,
    "volAvg": 619035,
    "mktCap": 5824330600,
    "lastDiv": 1.08,
    "range": "45.55-75.21",
    "changes": -0.41,
    "companyName": "Commerce Bancshares, Inc.",
    "currency": "USD",
    "cik": "0000022356",
    "isin": "US2005251036",
    "cusip": "200525103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.commercebank.com",
    "description": "Commerce Bancshares, Inc. operates as the bank holding company for Commerce Bank that provides retail, mortgage banking, corporate, investment, trust, and asset management products and services to individuals and businesses in the United States. It operates through three segments: Consumer, Commercial, and Wealth. The Consumer segment offers various banking products and services, including consumer deposits; consumer loans, such as automobile, motorcycle, marine, tractor/trailer, recreational vehicle, fixed rate and revolving home equity, and other consumer loans; patient health care financing; real estate loans; indirect and other consumer financing; personal mortgage banking; consumer installment lending; and consumer debit and credit bank cards. The Commercial segment provides corporate lending, leasing, international, merchant and commercial bank card, and securities safekeeping and bond accounting services; and business products, government deposits, and related commercial cash management services, as well as sells fixed income securities to correspondent banks, corporations, public institutions, municipalities, and individuals. The Wealth segment provides traditional trust and estate planning, advisory and discretionary investment portfolio management, and brokerage services, as well as private banking accounts. The company also offers private equity investment, securities brokerage, insurance agency, specialty lending, and leasing services, as well as online and mobile banking services. It operates through a network of 287 locations in Missouri, Kansas, Illinois, Oklahoma, and Colorado, as well as commercial offices. Commerce Bancshares, Inc. was founded in 1865 and is headquartered in Kansas City, Missouri.",
    "ceo": "Mr. John W. Kemper",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4636",
    "phone": "816 234 2000",
    "address": "1000 Walnut",
    "city": "Kansas City",
    "state": "MO",
    "zip": "64106",
    "dcfDiff": 43.4464,
    "dcf": 108.866,
    "image": "https://financialmodelingprep.com/image-stock/CBSH.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]