[
  {
    "symbol": "CBU",
    "price": 48.1,
    "beta": 0.62183,
    "volAvg": 398917,
    "mktCap": 2584355280,
    "lastDiv": 1.76,
    "range": "44.26-72.86",
    "changes": 0.4,
    "companyName": "Community Bank System, Inc.",
    "currency": "USD",
    "cik": "0000723188",
    "isin": "US2036071064",
    "cusip": "203607106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://cbna.com",
    "description": "Community Bank System, Inc. operates as the bank holding company for Community Bank, N.A. that provides various banking and other financial services to retail, commercial, and municipal customers. It operates through three segments: Banking, Employee Benefit Services, and All Other. The company offers various deposits products, such as checking, savings, and money market deposit accounts, as well as time deposits. It also provides loans, including consumer mortgages; general purpose commercial and industrial loans, and mortgages on commercial properties; paycheck protection program loans; installment loans that are originated through selected dealerships and are secured by automobiles, marine, and other recreational vehicles; personal installment loans and lines of credit for consumers; and home equity products. In addition, the company offers broker-dealer and investment advisory; cash management, investment, and treasury services; asset management; and employee benefit services, as well as operates as a full-service insurance agency that offers personal and commercial lines of insurance, and other risk management products and services. Further, it provides contribution plan administration, employee benefit trust, collective investment fund, retirement plan administration, fund administration, transfer agency, actuarial and benefit consulting, VEBA/HRA, and health and welfare consulting services. Additionally, the company offers wealth management, retirement planning, higher educational planning, fiduciary, risk management, trust, and personal financial planning services; and investment alternatives, including stocks, bonds, mutual funds, and advisory products, as well as master recordkeeping services. As of January 24, 2022, it operated approximately 215 customer facilities across Upstate New York, Northeastern Pennsylvania, Vermont, and Western Massachusetts. Community Bank System, Inc. was founded in 1866 and is headquartered in DeWitt, New York.",
    "ceo": "Mr. Mark E. Tryniski",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2839",
    "phone": "315 445 2282",
    "address": "5790 Widewaters Parkway",
    "city": "Dewitt",
    "state": "NY",
    "zip": "13214-1883",
    "dcfDiff": 44.6864,
    "dcf": 100.556,
    "image": "https://financialmodelingprep.com/image-stock/CBU.png",
    "ipoDate": "1985-11-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]