[
  {
    "symbol": "CC",
    "price": 35.36,
    "beta": 1.876056,
    "volAvg": 1460245,
    "mktCap": 5274156160,
    "lastDiv": 1,
    "range": "23.58-38.36",
    "changes": 0.45,
    "companyName": "The Chemours Company",
    "currency": "USD",
    "cik": "0001627223",
    "isin": "US1638511089",
    "cusip": "163851108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.chemours.com",
    "description": "The Chemours Company provides performance chemicals in North America, the Asia Pacific, Europe, the Middle East, Africa, and Latin America. It operates through four segments: Titanium Technologies, Thermal & Specialized Solutions, Advanced Performance Materials, and Chemical Solutions. The Titanium Technologies segment provides TiO2 pigment under the Ti-Pure and BaiMax brands for delivering whiteness, brightness, opacity, and protection in various of applications, such as architectural and industrial coatings, flexible and rigid plastic packaging, polyvinylchloride, laminate papers used for furniture and building materials, coated paper, and coated paperboard used for packaging. The Thermal & Specialized Solutions segment offers of refrigerants, thermal management solutions, propellants, foam blowing agents, and specialty solvents. The Advanced Performance Materials segment products portfolio includes various industrial resins, specialty products, membranes, and coatings for consumer electronics, semiconductors, digital communications, transportation, energy, oil and gas, and medical, and others applications. The Chemical Solutions segment comprises a portfolio of industrial chemicals used as raw materials and catalysts for gold production, clean and disinfect, oil and gas, water treatment, electronics, and automotive applications. The company sells its products through direct and indirect channels, as well as through a network of resellers and distributors. The Chemours Company was founded in 2014 and is headquartered in Wilmington, Delaware.",
    "ceo": "Mr. Mark E. Newman",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "6600",
    "phone": "302 773 1000",
    "address": "1007 Market Street",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19899",
    "dcfDiff": 5.79275,
    "dcf": 40.8928,
    "image": "https://financialmodelingprep.com/image-stock/CC.png",
    "ipoDate": "2015-06-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]