[
  {
    "symbol": "CCEP",
    "price": 64.01,
    "beta": 0.69272,
    "volAvg": 1078691,
    "mktCap": 29370733484,
    "lastDiv": 1.89,
    "range": "41.8-66.79",
    "changes": -0.74,
    "companyName": "Coca-Cola Europacific Partners PLC",
    "currency": "USD",
    "cik": "0001650107",
    "isin": "GB00BDCPN049",
    "cusip": "G25839104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Beverages—Non-Alcoholic",
    "website": "https://www.cocacolaep.com",
    "description": "Coca-Cola Europacific Partners PLC, together with its subsidiaries, produces, distributes, and sells a range of non-alcoholic ready to drink beverages. The company offers flavours, mixers, and energy drinks; soft drinks, waters, enhanced water, and isotonic drinks; and ready-to-drink tea and coffee, juices, and other drinks. It provides its products under the Coca-Cola, Diet Coke, Coca-Cola Zero Sugar, Fanta, Sprite, Monster Energy, Coca-Cola Energy, Relentless, nalu, URGE, BURN, Kuli, REIGN, POWERADE, Appletiser, Schweppes, FINLEY, mezzo mix, Royal Bliss, Lift, Vio SCHORLE, Coca-Cola Signature Mixers, NORDIC MIST, smartwater, Chaudfontaine, AQUARIUS, VILAS del Turbon, BONAQUA, Apollinaris, Krystal, Honest, Costa Coffee, Fuzetea, CHAQWA, NESTEA, Capri-Sun, Oasis, Minute Maid, MER, and Tropico brands. In addition, the company engages in the bottling and other operations. As of March 15, 2022, it served approximately 600 million consumers. The company was formerly known as Coca-Cola European Partners plc and changed its name to Coca-Cola Europacific Partners PLC in May 2021. Coca-Cola Europacific Partners PLC was founded in 1986 and is based in Uxbridge, the United Kingdom.",
    "ceo": "Mr. Damian Paul Gammell",
    "sector": "Consumer Defensive",
    "country": "GB",
    "fullTimeEmployees": "33000",
    "phone": "44 1895 231 313",
    "address": "Pemberton House",
    "city": "Uxbridge",
    "state": null,
    "zip": "UB8 1EZ",
    "dcfDiff": 0.8195,
    "dcf": 54.2705,
    "image": "https://financialmodelingprep.com/image-stock/CCEP.png",
    "ipoDate": "1986-11-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]