[
  {
    "symbol": "CCK",
    "price": 85.2,
    "beta": 1.060915,
    "volAvg": 1428466,
    "mktCap": 10232520000,
    "lastDiv": 0.96,
    "range": "66.0-102.68",
    "changes": -2.23,
    "companyName": "Crown Holdings, Inc.",
    "currency": "USD",
    "cik": "0001219601",
    "isin": "US2283681060",
    "cusip": "228368106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaging & Containers",
    "website": "https://www.crowncork.com",
    "description": "Crown Holdings, Inc. designs, manufactures, and sells packaging products and equipment for consumer goods and industrial products in the Americas, Europe, and the Asia Pacific. It offers products for consumer goods, including steel and aluminum cans for food and beverage industries. The company also provides products for industrial products, such as steel and plastic strap consumables and equipment, paper-based protective packaging, and plastic film consumables and equipment to metals, food and beverage, construction, agricultural, corrugated, and general industries. In addition, it offers other consumer products, glass bottles for beverage products, steel crowns, aluminum caps, steel strap, plastic strap, industrial film, and other related products, as well as equipment and tools, such as manual, semi-automatic, and automatic equipment and tools used in end of line manufacturing applications to apply industrial solutions consumables. Crown Holdings, Inc. was founded in 1892 and is headquartered in Yardley, Pennsylvania.",
    "ceo": "Mr. Timothy J. Donahue",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "26000",
    "phone": "215 698 5100",
    "address": "770 Township Line Road",
    "city": "Yardley",
    "state": "PA",
    "zip": "19067-4232",
    "dcfDiff": 4.65731,
    "dcf": 83.7927,
    "image": "https://financialmodelingprep.com/image-stock/CCK.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]