[
  {
    "symbol": "CCOI",
    "price": 67.02,
    "beta": 0.432042,
    "volAvg": 277535,
    "mktCap": 3237635670,
    "lastDiv": 3.74,
    "range": "46.75-75.0",
    "changes": 0.2,
    "companyName": "Cogent Communications Holdings, Inc.",
    "currency": "USD",
    "cik": "0001158324",
    "isin": "US19239V3024",
    "cusip": "19239V302",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Telecom Services",
    "website": "https://www.cogentco.com",
    "description": "Cogent Communications Holdings, Inc., through its subsidiaries, provides high-speed Internet access, private network, and data center colocation space services in North America, Europe, Asia, South America, Australia, and Africa. The company offers on-net Internet access and private network services to law firms, financial services firms, and advertising and marketing firms, as well as heath care providers, educational institutions and other professional services businesses, other Internet service providers, telephone companies, cable television companies, Web hosting companies, media service providers, mobile phone operators, content delivery network companies, and commercial content and application service providers. It also provides Internet access and private network services to customers that are not located in buildings directly connected to its network; and on-net services to customers located in buildings that are physically connected to its network. In addition, the company offers off-net services to corporate customers using other carriers' circuits to provide the last mile portion of the link from the customers' premises to the network. Further, it operates data centers that allow its customers to collocate their equipment and access the network. The company operates 54 data centers and provides facilities to 3,035 buildings and on-net services to 1,817 to multi-tenant office buildings. It serves primarily to small and medium-sized businesses, communications service providers, and other bandwidth-intensive organizations. Cogent Communications Holdings, Inc. was founded in 1999 and is headquartered in Washington, the District of Columbia.",
    "ceo": "Mr. David  Schaeffer Ph.D.",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "1107",
    "phone": "202 295 4200",
    "address": "2450 North Street NW",
    "city": "Washington",
    "state": "DC",
    "zip": "20037",
    "dcfDiff": 3.35458,
    "dcf": 64.6754,
    "image": "https://financialmodelingprep.com/image-stock/CCOI.png",
    "ipoDate": "2002-02-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]