[
  {
    "symbol": "CCOZY",
    "price": 15.22,
    "beta": 0.631034,
    "volAvg": 9,
    "mktCap": 13040480247,
    "lastDiv": 1.17,
    "range": "14.96-18.05",
    "changes": 0.5014,
    "companyName": "China Coal Energy Company Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Thermal Coal",
    "website": "https://www.chinacoalenergy.com",
    "description": "China Coal Energy Company Limited primarily engages in the production and trade of coal, coal chemical business, coal mining equipment manufacturing, pithead power generation, and other related businesses in the People's Republic of China and internationally. It operates through Coal, Coal-Chemical, Mining Machinery, Finance, and Others segments. The company offers thermal and coking coal. It also produces and sells polyolefin, methanol, urea, and other coal chemical products, as well as coke; research, designs, develops, manufactures, and sells coal mining machinery and equipment; and provides after-sales services. In addition, the company is involved in aluminum, electricity generation, and other manufacturing businesses. Further, it provides equipment trading agency, tendering, investment management, finance, and waste disposal services. The company was founded in 2006 and is based in Beijing, the People's Republic of China. China Coal Energy Company Limited is a subsidiary of China National Coal Group Corporation.",
    "ceo": "Mr. Shudong  Wang",
    "sector": "Energy",
    "country": "CN",
    "fullTimeEmployees": "46450",
    "phone": "86 10 8223 6028",
    "address": "No. 1 Huangsidajie",
    "city": "Beijing",
    "state": null,
    "zip": "100120",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CCOZY.png",
    "ipoDate": "2010-02-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]