[
  {
    "symbol": "CDNS",
    "price": 229.36,
    "beta": 1.064084,
    "volAvg": 1958804,
    "mktCap": 62542802240,
    "lastDiv": 0,
    "range": "138.76-242.65",
    "changes": 0.56,
    "companyName": "Cadence Design Systems, Inc.",
    "currency": "USD",
    "cik": "0000813672",
    "isin": "US1273871087",
    "cusip": "127387108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.cadence.com",
    "description": "Cadence Design Systems, Inc. provides software, hardware, services, and reusable integrated circuit (IC) design blocks worldwide. The company offers functional verification services, including emulation and prototyping hardware. Its functional verification offering consists of JasperGold, a formal verification platform; Xcelium, a parallel logic simulation platform; Palladium, an enterprise emulation platform; and Protium, a prototyping platform for chip verification. The company also provides digital IC design and sign off products, including Genus logic synthesis and Joules RTL power solutions, as well as Modus software solution to reduce systems-on-chip design-for-test time; physical implementation tools, such as place and route, optimization, and multiple patterning preparation; and signoff products to signoff the design as ready for silicon manufacturing. In addition, it offers custom IC design and simulation products to create schematic and physical representations of circuits down to the transistor level for analog, mixed-signal, custom digital, memory, and radio frequency designs; and system design and analysis products to develop printed circuit boards and IC packages, as well as to analyze electromagnetic, electro-thermal, and other multi-physics effects. Further, the company provides intellectual property (IP) products comprising pre-verified and customizable functional blocks to integrate into customer's ICs; and verification IP and memory models to emulate and model the expected behavior and interaction of standard industry system interface protocols. Additionally, it offers services related to methodology, education, and hosted design solutions, as well as technical support and maintenance services. The company serves 5G communications, aerospace and defense, automotive, industrial and healthcare, mobile, consumer, and hyperscale computing markets. Cadence Design Systems, Inc. was incorporated in 1987 and is headquartered in San Jose, California.",
    "ceo": "Dr. Anirudh  Devgan Ph.D.",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "10200",
    "phone": "408 943 1234",
    "address": "Building 5",
    "city": "San Jose",
    "state": "CA",
    "zip": "95134",
    "dcfDiff": 19.265,
    "dcf": 165.765,
    "image": "https://financialmodelingprep.com/image-stock/CDNS.png",
    "ipoDate": "1987-06-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]