[
  {
    "symbol": "CDW",
    "price": 177.48,
    "beta": 1.102464,
    "volAvg": 982374,
    "mktCap": 23921998180,
    "lastDiv": 2.36,
    "range": "147.91-215.0",
    "changes": -0.18,
    "companyName": "CDW Corporation",
    "currency": "USD",
    "cik": "0001402057",
    "isin": "US12514G1085",
    "cusip": "12514G108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Information Technology Services",
    "website": "https://www.cdw.com",
    "description": "CDW Corporation provides information technology (IT) solutions in the United States, the United Kingdom, and Canada. It operates through three segments: Corporate, Small Business, and Public. The company offers discrete hardware and software products and services, as well as integrated IT solutions, including on-premise, hybrid, and cloud capabilities across data center and networking, digital workspace, and security. Its hardware products comprise notebooks/mobile devices, network communications, desktop computers, video monitors, enterprise and data storage, and others; and software products consists of application suites, security, virtualization, operating systems, and network management. The company also provides advisory and design, software development, implementation, managed, professional, configuration, and telecom services, as well as warranties; mission critical software, systems, and network solutions; and implementation and installation, and repair services to its customers through various third-party service providers. It serves government, education, and healthcare customers; and small, medium, and large business customers. The company was founded in 1984 and is headquartered in Vernon Hills, Illinois.",
    "ceo": "Ms. Christine A. Leahy",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "11400",
    "phone": "847 465 6000",
    "address": "200 North Milwaukee Avenue",
    "city": "Vernon Hills",
    "state": "IL",
    "zip": "60061",
    "dcfDiff": 6.38753,
    "dcf": 186.902,
    "image": "https://financialmodelingprep.com/image-stock/CDW.png",
    "ipoDate": "2013-06-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]