[
  {
    "symbol": "CE",
    "price": 113.98,
    "beta": 1.295774,
    "volAvg": 1320532,
    "mktCap": 12399656240,
    "lastDiv": 2.8,
    "range": "86.71-128.35",
    "changes": 0.84,
    "companyName": "Celanese Corporation",
    "currency": "USD",
    "cik": "0001306830",
    "isin": "US1508701034",
    "cusip": "150870103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Chemicals",
    "website": "https://www.celanese.com",
    "description": "Celanese Corporation, a technology and specialty materials company, manufactures and sells high performance engineered polymers in the United States and internationally. The company operates through three segments: Engineered Materials, Acetate Tow, and Acetyl Chain. The Engineered Materials segment develops, produces, and supplies specialty polymers for automotive and medical applications, as well as for use in industrial products and consumer electronics. It also offers acesulfame potassium, a sweetener for use in various beverages, confections, and dairy products; and food protection ingredients, such as potassium sorbate and sorbic acid for use in foods, beverages, and personal care products. The Acetate Tow segment provides acetate tows and flakes for use in filter products applications. The Acetyl Chain segment produces and supplies acetyl products, including acetic acid, vinyl acetate monomers, acetic anhydride, and acetate esters that are used as starting materials for colorants, paints, adhesives, coatings, and pharmaceuticals; and organic solvents and intermediates for pharmaceutical, agricultural, and chemical products. It also offers vinyl acetate-based emulsions for use in paints and coatings, adhesives, construction, glass fiber, textiles, and paper applications; and ethylene vinyl acetate resins and compounds, as well as low-density polyethylene for use in flexible packaging films, lamination film products, hot melt adhesives, automotive parts, and carpeting applications. In addition, it manufactures ultra-high molecular weight polyethylene. Celanese Corporation was founded in 1918 and is headquartered in Irving, Texas.",
    "ceo": "Ms. Lori J. Ryerkerk BS",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "13263",
    "phone": "972 443 4000",
    "address": "222 West Las Colinas Boulevard",
    "city": "Irving",
    "state": "TX",
    "zip": "75039-5421",
    "dcfDiff": 16.4068,
    "dcf": 104.093,
    "image": "https://financialmodelingprep.com/image-stock/CE.png",
    "ipoDate": "2005-01-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]