[
  {
    "symbol": "CELH",
    "price": 150.35,
    "beta": 1.8,
    "volAvg": 1237093,
    "mktCap": 11545256220,
    "lastDiv": 0,
    "range": "61.62-153.94",
    "changes": -0.36,
    "companyName": "Celsius Holdings, Inc.",
    "currency": "USD",
    "cik": "0001341766",
    "isin": "US15118V2079",
    "cusip": "15118V207",
    "exchange": "NASDAQ Capital Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Beverages—Non-Alcoholic",
    "website": "https://www.celsiusholdingsinc.com",
    "description": "Celsius Holdings, Inc. develops, processes, markets, distributes, and sells functional drinks and liquid supplements in North America, Europe, Asia, and internationally. It offers various carbonated and non-carbonated functional energy drinks under the CELSIUS Originals name; dietary supplement in carbonated flavors, including apple jack'd, orangesicle, inferno punch, cherry lime, blueberry pomegranate, strawberry dragon fruit, tangerine grapefruit, and jackfruit under the CELSIUS HEAT name; and branched-chain amino acids functional energy drink that fuels muscle recovery under the CELSIUS BCCA+ENERGY name. The company also provides CELSIUS On-the-Go, a powdered form of the active ingredients in functional energy drinks in individual On-The-Go packets and canisters; and sparkling grapefruit, cucumber lime, and orange pomegranate, as well as pineapple coconut, watermelon berry, and strawberries and cream non-carbonated functional energy drinks under the CELSIUS Sweetened. It distributes its products through direct-to-store delivery distributors and direct to retailers, including supermarkets, convenience stores, drug stores, nutritional stores, and mass merchants, as well as health clubs, spas, gyms, the military, and e-commerce websites. The company was formerly known as Vector Ventures, Inc. and changed its name to Celsius Holdings, Inc. in January 2007. Celsius Holdings, Inc. was founded in 2004 and is headquartered in Boca Raton, Florida.",
    "ceo": "Mr. John  Fieldly",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "378",
    "phone": "561 276 2239",
    "address": "2424 North Federal Highway",
    "city": "Boca Raton",
    "state": "FL",
    "zip": "33431",
    "dcfDiff": 2.72165,
    "dcf": 96.3083,
    "image": "https://financialmodelingprep.com/image-stock/CELH.png",
    "ipoDate": "2007-01-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]