[
  {
    "symbol": "CENT",
    "price": 38.25,
    "beta": 0.694366,
    "volAvg": 45417,
    "mktCap": 1974606487,
    "lastDiv": 29.200001,
    "range": "35.6-45.89",
    "changes": -0.12,
    "companyName": "Central Garden & Pet Company",
    "currency": "USD",
    "cik": "0000887733",
    "isin": "US1535271068",
    "cusip": "153527106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Packaged Foods",
    "website": "https://www.central.com",
    "description": "Central Garden & Pet Company produces and distributes various products for the lawn and garden, and pet supplies markets in the United States. It operates through two segments, Pet and Garden. The Pet segment provides dog and cat supplies, such as dog treats and chews, toys, pet beds and grooming products, waste management and training pads, and pet containment; supplies for aquatics, small animals, reptiles, and pet birds, including toys, cages and habitats, bedding, and food and supplements; animal and household health and insect control products; live fish and products for fish, reptiles, and other aquarium-based pets, such as aquariums, furniture and lighting fixtures, pumps, filters, water conditioners, food, and supplements; and products for horses and livestock, as well as outdoor cushions and pillows. This segment sells its products under the Aqueon, Cadet, Comfort Zone, Farnam, Four Paws, Kaytee, K&H Pet Products, Nylabone, and Zilla brands. The Garden segment offers lawn and garden supplies products that include grass seed; wild bird feed, bird feeders, bird houses, and other birding accessories; fertilizers; decorative outdoor lifestyle products; live plants; and weed and grass, as well as other herbicides, insecticide, and pesticide products. This segment sells its lawn and garden supplies products under the AMDRO, Ferry-Morse, Pennington, and Sevin brands, as well as under Bell Nursery, Lilly Miller, and Over-N-Out other brand names. Central Garden & Pet Company was founded in 1955 and is based in Walnut Creek, California.",
    "ceo": "Mr. Timothy P. Cofer",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "6400",
    "phone": "925 948 4000",
    "address": "1340 Treat Boulevard",
    "city": "Walnut Creek",
    "state": "CA",
    "zip": "94597",
    "dcfDiff": 11.0183,
    "dcf": 52.2883,
    "image": "https://financialmodelingprep.com/image-stock/CENT.png",
    "ipoDate": "1992-07-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]