[
  {
    "symbol": "CEQP",
    "price": 26.46,
    "beta": 2.468309,
    "volAvg": 497754,
    "mktCap": 2785179600,
    "lastDiv": 2.62,
    "range": "22.11-31.46",
    "changes": 0.46,
    "companyName": "Crestwood Equity Partners LP",
    "currency": "USD",
    "cik": "0001136352",
    "isin": "US2263442087",
    "cusip": "226344208",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.crestwoodlp.com",
    "description": "Crestwood Equity Partners LP develops, acquires, owns, controls, and operates assets and operations in the energy midstream sector in the United States. It operates through three segments: Gathering and Processing North; Gathering and Processing South; and Storage and Logistics. The Gathering and Processing North segment offers natural gas, crude oil, and produced water gathering, compression, treating, processing, and disposal services to producers in the Williston Basin and Powder River Basin. This segment owns and operates natural gas facilities with approximately 0.4 Bcf/d of gathering capacity and 0.5 Bcf/d of processing capacity; crude oil facilities with approximately 150,000 Bbls/d of gathering capacity and 266,000 Bbls of storage capacity; and produced water facilities with approximately 130,000 Bbls/d of gathering and disposal capacity. The Gathering and Processing South segment provides natural gas gathering, compression, treating, and processing; and produced water gathering and disposal services to producers in the Marcellus, Barnett, and Delaware basins. This segment owns and operates natural gas facilities with 2.5 Bcf/d of gathering capacity and 0.7 Bcf/d of processing capacity; and produced water facilities with approximately 75,000 Bbls/d of gathering and disposal capacity. The Storage and Logistics segment offers natural gas liquids, crude oil, and natural gas storage, terminal, marketing, and transportation, including rail, truck and pipeline services to producers, refiners, marketers, utilities, and other customers. Crestwood Equity GP LLC serves as the general partner of Crestwood Equity Partners LP. The company was formerly known as Inergy L.P. and changed its name to Crestwood Equity Partners LP in October 2013. Crestwood Equity Partners LP was incorporated in 2001 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Robert G. Phillips",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "753",
    "phone": "832 519 2200",
    "address": "811 Main Street",
    "city": "Houston",
    "state": "TX",
    "zip": "77002",
    "dcfDiff": 18.7908,
    "dcf": 8.44923,
    "image": "https://financialmodelingprep.com/image-stock/CEQP.png",
    "ipoDate": "2010-03-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]