[
  {
    "symbol": "CERE",
    "price": 32.57,
    "beta": 1.47912,
    "volAvg": 559990,
    "mktCap": 5108050549,
    "lastDiv": 0,
    "range": "22.63-41.46",
    "changes": -0.1,
    "companyName": "Cerevel Therapeutics Holdings, Inc.",
    "currency": "USD",
    "cik": "0001805387",
    "isin": "US15678U1280",
    "cusip": "15678U128",
    "exchange": "NASDAQ Capital Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.cerevel.com",
    "description": "Cerevel Therapeutics Holdings, Inc., a clinical-stage biopharmaceutical company, engages in the development of various therapies for neuroscience diseases. It is developing emraclidine, a positive allosteric modulator (PAM) that is in phase 1b clinical trials for the treatment of schizophrenia; and Darigabat, a PAM, which is in Phase 2 proof-of-concept trial in patients with drug-resistant focal onset seizures in epilepsy or focal epilepsy, as well as in phase 1 trial to treat acute anxiety. The company's products also comprise Tavapadon, a selective dopamine D1/D5 partial agonist that is in phase 3 clinical trial for the treatment of early- and late-stage Parkinson's disease; CVL-871, a selective dopamine D1/D5 partial agonist, which is in Phase 2a clinical trial to treat dementia-related apathy; CVL-936, a selective dopamine D3-preferring antagonist, which is in Phase I clinical trial for the treatment of substance use disorder; CVL-354, a selective kappa-opioid receptor antagonist to treat major depressive disorder and substance use disorder; and CVL-047, selective PDE4 inhibitor for the treatment of major depressive disorder and substance use disorder. It is also involved in the development of an M4 agonist program for the treatment of psychosis and related indications; and an LRRK2 inhibitor program to address disease progression in Parkinson's. The company was founded in 2018 and is headquartered in Cambridge, Massachusetts.",
    "ceo": "Mr. Ronald C. Renaud Jr., MBA",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "319",
    "phone": "844 304 2048",
    "address": "222 Jacobs Street",
    "city": "Cambridge",
    "state": "MA",
    "zip": "02141",
    "dcfDiff": 4.459,
    "dcf": 29.971,
    "image": "https://financialmodelingprep.com/image-stock/CERE.png",
    "ipoDate": "2020-07-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]