[
  {
    "symbol": "CERT",
    "price": 17.78,
    "beta": 1.57484,
    "volAvg": 1251879,
    "mktCap": 2841812960,
    "lastDiv": 0,
    "range": "10.6-24.96",
    "changes": 0.52,
    "companyName": "Certara, Inc.",
    "currency": "USD",
    "cik": "0001827090",
    "isin": "US15687V1098",
    "cusip": "15687V109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Health Information Services",
    "website": "https://www.certara.com",
    "description": "Certara, Inc. provides software products and technology-enabled services to customers for biosimulation in drug discovery, preclinical and clinical research, regulatory submissions, and market access. It offers medicines to patients using biosimulation software, technology, and services to transform drug discovery and development. The company also provides related technology-enabled services to guide its customers' new drugs through the regulatory submission process and into the market. Its technology-enabled services include mechanistic biosimulation, empirical biosimulation, drug development and regulatory strategy, clinical pharmacology, model-based meta-analysis, regulatory writing and medical communications, regulatory operations, and market access. Further, company offers software, comprising mechanistic biosimulation platform, empirical PK/PD biosimulation platform, data standardization and compliance software, scientific informatics platform, clinical outcomes databases for biosimulation, authoring and management of regulatory submissions platform, and market access communication platform. The company serves biopharmaceutical companies, and academic and government institutions. It has operations in the United States, Canada, Spain, Luxembourg, Portugal, the United Kingdom, Germany, France, the Netherlands, Denmark, Switzerland, Italy, Poland, Japan, the Philippines, India, Australia, and China. Certara Inc. was founded in 2008 and is headquartered in Princeton, New Jersey.",
    "ceo": "Dr. William F. Feehery Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "1150",
    "phone": "609 716 7900",
    "address": "100 Overlook Center",
    "city": "Princeton",
    "state": "NJ",
    "zip": "08540",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CERT.png",
    "ipoDate": "2020-12-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]