[
  {
    "symbol": "CFLT",
    "price": 35.54,
    "beta": 0,
    "volAvg": 4290329,
    "mktCap": 10524531102,
    "lastDiv": 0,
    "range": "16.6-37.51",
    "changes": 1.81,
    "companyName": "Confluent, Inc.",
    "currency": "USD",
    "cik": "0001699838",
    "isin": "US20717M1036",
    "cusip": "20717M103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.confluent.io",
    "description": "Confluent, Inc. operates a data streaming platform in the United States and internationally. It offers Confluent Cloud, a managed cloud-native service for connecting and processing data; and Confluent Platform, an enterprise-grade self-managed software that connects and processes data in real-time with the foundational platform for data in motion. It also provides Kafka Connect that enables to build connectors to integrate Apache Kafka with other apps and data systems; ksqlDB, a database for stream processing applications; and stream governance, a solution that is designed for the intricacies of streaming data, which allows teams to expand usage of real-time data without bypassing requirements for risk management and regulatory compliance. In addition, it also offers training and professional services. The company was formerly known as Infinitem, Inc. and changed its name to Confluent, Inc. in September 2014. Confluent, Inc. was incorporated in 2014 and is headquartered in Mountain View, California.",
    "ceo": "Mr. Edward  Kreps",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2761",
    "phone": "800 439 3207",
    "address": "899 West Evelyn Avenue",
    "city": "Mountain View",
    "state": "CA",
    "zip": "94041",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CFLT.png",
    "ipoDate": "2021-06-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]