[
  {
    "symbol": "CFR",
    "price": 103.96,
    "beta": 1.043309,
    "volAvg": 601432,
    "mktCap": 6694878456,
    "lastDiv": 3.48,
    "range": "92.55-160.6",
    "changes": -1.23,
    "companyName": "Cullen/Frost Bankers, Inc.",
    "currency": "USD",
    "cik": "0000039263",
    "isin": "US2298991090",
    "cusip": "229899109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.frostbank.com",
    "description": "Cullen/Frost Bankers, Inc. operates as the bank holding company for Frost Bank that offers commercial and consumer banking services in Texas. It operates in two segments, Banking and Frost Wealth Advisors. The company offers commercial banking services to corporations and other business clients, including financing for industrial and commercial properties, interim construction related to industrial and commercial properties, equipment, inventories and accounts receivables, and acquisitions; commercial leasing; and treasury management services. It also provides consumer banking services, such as checking accounts, savings programs, automated-teller machines (ATMs), overdraft facilities, installment and real estate loans, home equity loans and lines of credit, drive-in and night deposit services, safe deposit facilities, and brokerage services. In addition, the company offers international banking services comprising deposits, loans, letters of credit, foreign collections, funds, and foreign exchange services. Further, it acts as a correspondent for approximately 171 financial institutions; offers trust, investment, agency, and custodial services for individual and corporate clients; provides capital market services that include sales and trading, new issue underwriting, money market trading, advisory, and securities safekeeping and clearance; and supports international business activities. Additionally, the company offers insurance and securities brokerage services; and holds securities for investment purposes, as well as investment management services to Frost-managed mutual funds, institutions, and individuals. It operates approximately 157 financial centers and 1,650 ATMs. The company serves energy, manufacturing, services, construction, retail, telecommunications, healthcare, military, and transportation industries. Cullen/Frost Bankers, Inc. was founded in 1868 and is headquartered in San Antonio, Texas.",
    "ceo": "Mr. Phillip D. Green",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4985",
    "phone": "210 220 4011",
    "address": "111 West Houston Street",
    "city": "San Antonio",
    "state": "TX",
    "zip": "78205",
    "dcfDiff": 276.362,
    "dcf": 403.812,
    "image": "https://financialmodelingprep.com/image-stock/CFR.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]