[
  {
    "symbol": "CGEMY",
    "price": 37.68,
    "beta": 1.108812,
    "volAvg": 108995,
    "mktCap": 32389274634,
    "lastDiv": 0.7,
    "range": "29.56-41.25",
    "changes": 0.48,
    "companyName": "Capgemini SE",
    "currency": "USD",
    "cik": null,
    "isin": "US13961R1005",
    "cusip": "13961R100",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Information Technology Services",
    "website": "https://www.capgemini.com",
    "description": "Capgemini SE provides consulting, digital transformation, technology, and engineering services primarily in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. The company offers strategy and transformation services, including strategy, technology, data science, and creative design to support various clients within the digital economy. It also provides applications and technology services that helps the clients to develop, modernize, extend, and secure their IT and digital environment using the latest technologies, as well as offers local technology services in cloud, cybersecurity, quality assurance, testing, and new technology fields. In addition, the company offers business process outsourcing and transactional services, as well as installation and maintenance services for its clients' IT infrastructures in data centers or in the cloud. It serves various industries, including consumer goods and retail; energy and utilities; banking, capital markets, and insurance; manufacturing and life sciences; public sector; telecommunications, media, and technology; and services. Capgemini SE has a strategic partnership with CONA Services LLC to develop digital solutions for the consumer products industry and retail customers. The company was founded in 1967 and is headquartered in Paris, France.",
    "ceo": "Mr. Aiman  Ezzat",
    "sector": "Technology",
    "country": "FR",
    "fullTimeEmployees": "359567",
    "phone": "33 1 47 54 50 00",
    "address": "Place de l'Etoile",
    "city": "Paris",
    "state": null,
    "zip": "75017",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CGEMY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]