[
  {
    "symbol": "CGNX",
    "price": 54.75,
    "beta": 1.594014,
    "volAvg": 797553,
    "mktCap": 9449904312,
    "lastDiv": 0.28,
    "range": "40.21-58.12",
    "changes": 0.36,
    "companyName": "Cognex Corporation",
    "currency": "USD",
    "cik": "0000851205",
    "isin": "US1924221039",
    "cusip": "192422103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.cognex.com",
    "description": "Cognex Corporation provides machine vision products that capture and analyze visual information in order to automate manufacturing and distribution tasks worldwide. Its machine vision products are used to automate the manufacturing and tracking of discrete items, including mobile phones, aspirin bottles, and automobile tires by locating, identifying, inspecting, and measuring them during the manufacturing or distribution process. The company offers VisionPro software, a suite of patented vision tools for advanced programming; QuickBuild that allows customers to build vision applications with a graphical, flowchart-based programming interface; and Cognex deep learning vision software. It also provides a range of inspection tasks, including part location, identification, measurement, assembly verification, and robotic guidance; vision sensors for vision applications, such as checking the presence and size of parts; and the In-Sight product line of vision systems and sensors. In addition, the company offers DataMan, an image-based barcode readers and barcode verifiers. It sells its products to consumer electronics, automotive, consumer products, food and beverage, pharmaceuticals, and medical devices industries, as well as through a network of distributors and integrators. Cognex Corporation was incorporated in 1981 and is headquartered in Natick, Massachusetts.",
    "ceo": "Mr. Robert J. Willett",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2441",
    "phone": "508 650 3000",
    "address": "One Vision Drive",
    "city": "Natick",
    "state": "MA",
    "zip": "01760-2059",
    "dcfDiff": 3.40529,
    "dcf": 49.3347,
    "image": "https://financialmodelingprep.com/image-stock/CGNX.png",
    "ipoDate": "1989-07-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]