[
  {
    "symbol": "CHBAY",
    "price": 37.38,
    "beta": 0.466666,
    "volAvg": 0,
    "mktCap": 5416960080,
    "lastDiv": 0.96,
    "range": "25.95-37.38",
    "changes": 0,
    "companyName": "The Chiba Bank, Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US1670711092",
    "cusip": "167071109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.chibabank.co.jp",
    "description": "The Chiba Bank, Ltd., together with its subsidiaries, provides banking products and services in Japan and internationally. It offers various deposit products; and various loans and bills discounting products, as well as investment management and investment advisory services. The company also engages in securities, leasing, credit card, and credit guarantee business; management and collection of claims; and outsourcing of operational business. In addition, it rents and maintains office buildings and welfare facilities; purchases and sells supplies and consumer goods; and develops and sells software, and commissioned computation tasks. Further, the company provides housing loan guarantees and fee collection services; information, survey, and consulting services; and accounting, general administration entrustment, and temporary staff services. Additionally, it engages in the research and investigation of IT and financial technologies; and operation and management of investment funds, and M&A advisory services. The company serves individuals, and small and mid-sized enterprises. As of June 25, 2021, it operated 186 domestic offices, including 183 branches and 3 money exchange counters; 3 overseas branches in New York, Hong Kong, and London; and 3 overseas representative offices in Shanghai, Singapore, and Bangkok. The company was incorporated in 1943 and is headquartered in Chiba, Japan.",
    "ceo": "Mr. Tsutomu  Yonemoto",
    "sector": "Financial Services",
    "country": "JP",
    "fullTimeEmployees": "3965",
    "phone": "81 4 3245 1111",
    "address": "1-2, Chiba-minato",
    "city": "Chiba",
    "state": null,
    "zip": "260-8720",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CHBAY.png",
    "ipoDate": "2011-04-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]