[
  {
    "symbol": "CHCJY",
    "price": 9.45,
    "beta": 0.508045,
    "volAvg": 134,
    "mktCap": 35914628960,
    "lastDiv": 0.96,
    "range": "7.445-10.915",
    "changes": 0.4166,
    "companyName": "China CITIC Bank Corporation Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.citicbank.com",
    "description": "China CITIC Bank Corporation Limited provides various banking products and services in the People's Republic of China and internationally. The company operates through Corporate Banking, Personal Banking, and Treasury Operations segments. It accepts deposits; offers corporate and personal loans; and provides securities agency, remittance and settlement, and guarantee services, as well as investment banking and international services. The company also engages in the capital markets operations and inter-bank operations, including inter-bank money market transactions, repurchase transactions, investments, and trading in debt instruments; and derivatives and forex trading. In addition, it offers asset management, finance leasing, and other non-banking financial services. The company serves corporations, government agencies, and non-financial institutions; and individual customers and micro and small enterprises. As of December 31, 2021, it operated 1,415 outlets, including 37 tier-one branches, 126 tier-two branches, and 1,252 sub-branches; 1,569 self-service banks; and 5,398 self-service terminals, as well as 9,078 smart teller machines. The company was founded in 1987 and is headquartered in Beijing, the People's Republic of China. China CITIC Bank Corporation Limited operates as a subsidiary of CITIC Corporation Limited.",
    "ceo": "Mr. Kang  Wang",
    "sector": "Financial Services",
    "country": "CN",
    "fullTimeEmployees": "60314",
    "phone": "86 10 6663 8188",
    "address": "Building No. 1",
    "city": "Beijing",
    "state": null,
    "zip": "100020",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CHCJY.png",
    "ipoDate": "2013-04-03",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]