[
  {
    "symbol": "CHDN",
    "price": 132.96,
    "beta": 1.120422,
    "volAvg": 404135,
    "mktCap": 9954383332,
    "lastDiv": 0.36,
    "range": "89.17-150.45",
    "changes": -0.49,
    "companyName": "Churchill Downs Incorporated",
    "currency": "USD",
    "cik": "0000020212",
    "isin": "US1714841087",
    "cusip": "171484108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Gambling",
    "website": "https://www.churchilldownsincorporated.com",
    "description": "Churchill Downs Incorporated operates as a racing, online wagering, and gaming entertainment company in the United States. It operates through three segments: Live and Historical Racing, TwinSpires, and Gaming. As of December 31, 2021, the company owned and operated three pari-mutuel gaming entertainment venues with approximately 3,050 historical racing machines (HRMs) in Kentucky; TwinSpires, an online wagering platform for horse racing, sports, and iGaming; nine retail sportsbooks; and casino gaming in eight states with approximately 11,000 slot machines and video lottery terminals, and 200 table games. It also offers streaming video of live horse races, replays, and an assortment of racing and handicapping information; and provides the Bloodstock Research Information Services platform for horse racing statistical data. In addition, the company manufactures and operates pari-mutuel wagering systems for racetracks, off-track betting facilities, and other pari-mutuel wagering businesses. Churchill Downs Incorporated was founded in 1875 and is headquartered in Louisville, Kentucky.",
    "ceo": "Mr. William C. Carstanjen",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "5500",
    "phone": "502 636 4400",
    "address": "600 North Hurstbourne Parkway",
    "city": "Louisville",
    "state": "KY",
    "zip": "40222",
    "dcfDiff": 21.5439,
    "dcf": 226.926,
    "image": "https://financialmodelingprep.com/image-stock/CHDN.png",
    "ipoDate": "1993-03-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]