[
  {
    "symbol": "CHDRY",
    "price": 216.51,
    "beta": 1.068582,
    "volAvg": 91,
    "mktCap": 156242705956,
    "lastDiv": 3.25,
    "range": "136.76-242.83",
    "changes": 6.015,
    "companyName": "Christian Dior SE",
    "currency": "USD",
    "cik": null,
    "isin": "US1707151064",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Luxury Goods",
    "website": "https://www.dior-finance.com",
    "description": "Christian Dior SE, through its subsidiaries, engages in the production, distribution, and retail of fashion and leather goods, wines and spirits, perfumes and cosmetics, and watches and jewelry worldwide. The company offers its fashion and leather goods under the Louis Vuitton, Christian Dior Couture, Loewe, Marc Jacobs, Celine, Kenzo, Givenchy, Pink Shirtmaker, Emilio Pucci, Berluti, Loro Piana, Rimowa brand names; wines and spirits under the Hennessy, Glenmorangie, Ardbeg, a Belvedere, Volcán de mi Tierra, Moët & Chandon, Dom Pérignon, Veuve Clicquot, Krug, Château d'Yquem, Ruinart, Belvedere, Glenmorangie, Newton Vineyards, Bodega Numanthia, and Château d'Esclans brand names; and perfumes and cosmetics under the Parfums Christian Dior, Guerlain, Parfums Givenchy, Make Up For Ever, Benefit Cosmetics, Fresh, Acqua di Parma, KVD Vegan Beauty, Fenty, Ole Henriksen, and Maison Francis Kurkdjian brand names. It also provides watches and jewelry under the Tiffany, Bvlgari, TAG Heuer, Zenith, Hublot, Chaumet, and Fred brand names. In addition, the company operates retail stores under the DFS Galleria, Sephora, Le Bon Marché, and Ile de Beauté names; publishes Le Parisien- Aujourd'hui en France, a daily newspaper; designs and builds yachts; and operates the Cova pastry shops. Further, it is involved in real estate activities under the La Samaritaine brand name; and hotel business. The company sells its products through store network, including e-commerce websites; and agents and distributors. As of December 31, 2021, it operated 5,556 stores. The company was incorporated in 1946 and is headquartered in Paris, France. Christian Dior SE was formerly a subsidiary of Semyrhamis SA.",
    "ceo": "Mr. Antoine  Arnault",
    "sector": "Consumer Cyclical",
    "country": "FR",
    "fullTimeEmployees": "146479",
    "phone": "33 1 44 13 22 22",
    "address": "30, avenue Montaigne",
    "city": "Paris",
    "state": null,
    "zip": "75008",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CHDRY.png",
    "ipoDate": "2013-12-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]