[
  {
    "symbol": "CHFFF",
    "price": 0.390595,
    "beta": 0.929118,
    "volAvg": 48,
    "mktCap": 2399417311,
    "lastDiv": 0.03,
    "range": "0.0-0.6",
    "changes": -0.0036,
    "companyName": "China Everbright Environment Group Limited",
    "currency": "USD",
    "cik": "0001601994",
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Waste Management",
    "website": "https://www.cebenvironment.com",
    "description": "China Everbright Environment Group Limited, provides environmental solutions worldwide. The company's Environmental Energy Project Construction and Operation segment constructs and operates food waste and leachate treatment, sludge treatment and disposal, methane-to-energy, fecal treatment, fly ash landfill, medical waste treatment, and solid waste treatment projects, as well as waste-to-energy plants. Its Greentech Project Construction and Operation segment constructs and operates integrated biomass utilization, hazardous and solid waste treatment, and solar energy and wind power projects, as well as offers environmental remediation services. The company's Environmental Water Project Construction and Operation segment constructs, upgrades, and operates waste water treatment, water supply, reusable water and sludge harmless treatment, sponge city construction, river-basin ecological restoration, waste water source heat pump, and leachate treatment projects. This segment also researches and develops water environment technologies and engineering projects. Its Others segment conducts environmental protection technology research and development projects; provides environmental related technological, and protection project equipment construction and installation services; designs environmental protection projects; and sells related equipment. This segment also offers waste sorting, renewable resources utilization, and sanitation operation services; sells energy-saving street lamps; and provides energy management contract projects. It also operates biomass electricity and heat cogeneration projects; and collects and treats municipal wastes. The company was formerly known as China Everbright International Limited and changed its name to China Everbright Environment Group Limited in September 2020. The company was incorporated in 1961 and is headquartered in Hong Kong, Hong Kong.",
    "ceo": "Mr. Zusheng  Luan",
    "sector": "Industrials",
    "country": "HK",
    "fullTimeEmployees": "12400",
    "phone": "852 2804 1886",
    "address": "Far East Finance Centre",
    "city": "Hong Kong",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CHFFF.png",
    "ipoDate": "2012-03-14",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]