[
  {
    "symbol": "CHKP",
    "price": 126.73,
    "beta": 0.686971,
    "volAvg": 926630,
    "mktCap": 15304168260,
    "lastDiv": 0,
    "range": "107.54-135.93",
    "changes": 0.55,
    "companyName": "Check Point Software Technologies Ltd.",
    "currency": "USD",
    "cik": "0001015922",
    "isin": "IL0010824113",
    "cusip": "M22465104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.checkpoint.com",
    "description": "Check Point Software Technologies Ltd. develops, markets, and supports a range of products and services for IT security worldwide. The company offers a portfolio of network security, endpoint security, data security, and management solutions. It provides Check Point Infinity Architecture, a cyber security architecture that protects against 5th and 6th generation cyber-attacks across various networks, endpoint, cloud, workloads, Internet of Things, and mobile. The company also offers security gateways and software platforms that support small and medium sized business (SMB) to large enterprise data center and telco-grade environments; and threat prevention technologies and zero-day protections. In addition, the company provides cloud network security, security and posture management, cloud workload protection, and cloud web application protection for web applications and APIs; and Check Point Harmony that delivers endpoint and secure connectivity for remote user access. Further, the company provides technical customer support programs and plans; professional services in implementing, upgrading, and optimizing Check Point products comprising design planning and security implementation; and certification and educational training services on Check Point products. It sells its products through multiple distribution channels, including distributors, resellers, system integrators, original equipment manufacturers, and managed security service providers. Check Point Software Technologies Ltd. was incorporated in 1993 and is headquartered in Tel Aviv, Israel.",
    "ceo": "Mr. Gil  Shwed",
    "sector": "Technology",
    "country": "IL",
    "fullTimeEmployees": "6026",
    "phone": "972 3 753 4555",
    "address": "5 Shlomo Kaplan Street",
    "city": "Tel Aviv",
    "state": null,
    "zip": "6789159",
    "dcfDiff": 2.42523,
    "dcf": 131.455,
    "image": "https://financialmodelingprep.com/image-stock/CHKP.png",
    "ipoDate": "1996-06-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]