[
  {
    "symbol": "CHRW",
    "price": 93.88,
    "beta": 0.809859,
    "volAvg": 1184787,
    "mktCap": 10931293320,
    "lastDiv": 2.44,
    "range": "86.6-121.23",
    "changes": -0.56,
    "companyName": "C.H. Robinson Worldwide, Inc.",
    "currency": "USD",
    "cik": "0001043277",
    "isin": "US12541W2098",
    "cusip": "12541W209",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Integrated Freight & Logistics",
    "website": "https://www.chrobinson.com",
    "description": "C.H. Robinson Worldwide, Inc., together with its subsidiaries, provides freight transportation services and logistics solutions to companies in various industries worldwide. The company operates in two segments, North American Surface Transportation and Global Forwarding. It offers transportation and logistics services, such as truckload; less than truckload transportation brokerage services, which include the shipment of single or multiple pallets of freight; intermodal transportation that comprise the shipment service of freight in containers or trailers by a combination of truck and rail; and non-vessel ocean common carrier and freight forwarding services, as well as organizes air shipments and provides door-to-door services. The company also offers customs broker services; and other logistics services, such as fee-based managed, warehousing, small parcel, and other services. It has contractual relationships with approximately 85,000 transportation companies, including motor carriers, railroads, and air and ocean carriers. In addition, the company is involved in buying, selling, and/or marketing of fresh produce, including fresh fruits, vegetables, and other value-added perishable items under the Robinson Fresh name. Further, it provides transportation management services or managed TMS; and other surface transportation services. The company offers its fresh produce to grocery retailers, restaurants, produce wholesalers, and foodservice distributors through a network of independent produce growers and suppliers. C.H. Robinson Worldwide, Inc. was founded in 1905 and is headquartered in Eden Prairie, Minnesota.",
    "ceo": "Mr. Scott P. Anderson",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "16902",
    "phone": "952 937 8500",
    "address": "14701 Charlson Road",
    "city": "Eden Prairie",
    "state": "MN",
    "zip": "55347-5076",
    "dcfDiff": 1.49338,
    "dcf": 99.4934,
    "image": "https://financialmodelingprep.com/image-stock/CHRW.png",
    "ipoDate": "1997-10-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]