[
  {
    "symbol": "CHT",
    "price": 38.07,
    "beta": 0.005821,
    "volAvg": 84772,
    "mktCap": 29532613064,
    "lastDiv": 3.1201,
    "range": "32.9-43.08",
    "changes": -0.1409,
    "companyName": "Chunghwa Telecom Co., Ltd.",
    "currency": "USD",
    "cik": "0001132924",
    "isin": "US17133Q5027",
    "cusip": "17133Q502",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.cht.com.tw",
    "description": "Chunghwa Telecom Co., Ltd., together with its subsidiaries, provides telecommunication services in Taiwan and internationally. It operates through Domestic Fixed Communications Business, Mobile Communications Business, Internet Business, International Fixed Communications Business, and Others segments. The company offers local and domestic long-distance telephone, broadband access, and related services; information and communication technology and VAS services; and interconnection with its fixed-line network to other mobile and fixed-line operators. It also provides mobile; HiNet Internet, data communication, and cloud; Internet data center; and international long-distance telephone and data services. In addition, the company distributes and sells mobile handsets, data cards, electronic materials, and computing and business machinery equipment and software; designs, develops, manufactures, sells, and services semiconductor testing components, printed circuit boards, and electronic components and finished products, and automatic license plate recognition software and hardware products. Further, it offers real estate development and property management; system, network, and communications integration; intelligent buildings and energy network; digital information supply and advertisement; property and liability insurance agency; family education; computing equipment installation; management consultancy; data processing; telecommunication engineering; Internet identify; and information and communication solution services. Additionally, the company provides software design services, and Internet contents production and play services; motion picture production and distribution; and energy saving solutions and international circuits, and services for electronic parts and machinery processed products. The company was incorporated in 1996 and is headquartered in Taipei City, Taiwan.",
    "ceo": "Mr. Shui-Yi  Kuo",
    "sector": "Communication Services",
    "country": "TW",
    "fullTimeEmployees": "19872",
    "phone": "886 2 2344 5488",
    "address": "No. 21-3, Xinyi Road",
    "city": "Taipei City",
    "state": null,
    "zip": "100",
    "dcfDiff": 47.5867,
    "dcf": 85.7867,
    "image": "https://financialmodelingprep.com/image-stock/CHT.png",
    "ipoDate": "2003-07-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]