[
  {
    "symbol": "CHTR",
    "price": 359.39,
    "beta": 1.106338,
    "volAvg": 1064132,
    "mktCap": 54115152125,
    "lastDiv": 0,
    "range": "297.66-496.37",
    "changes": 5.55,
    "companyName": "Charter Communications, Inc.",
    "currency": "USD",
    "cik": "0001091667",
    "isin": "US16119P1084",
    "cusip": "16119P108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Telecom Services",
    "website": "https://corporate.charter.com",
    "description": "Charter Communications, Inc. operates as a broadband connectivity and cable operator company serving residential and commercial customers in the United States. The company offers subscription-based video services, including video on demand, high-definition television, digital video recorder, pay-per-view services. It provides Internet services, such as security suite that protects computers from viruses and spyware, and threats from malicious actors; in-home WiFi, which provides customers with high performance wireless routers to enhance their in-home wireless Internet experience; out-of-home WiFi; and Spectrum WiFi services, as well as video services. The company also offers voice communications services using voice over Internet protocol technology; and broadband communications solutions, such as Internet access, data networking, fiber connectivity, video entertainment, and business telephone services to cellular towers and office buildings for business and carrier organizations. In addition, it provides mobile services; offers video programming, static IP and business WiFi, email and security, and multi-line telephone services, as well as Web-based service management; sells local advertising across various platforms for networks, such as TBS, CNN, and ESPN; sells advertising inventory to local sports and news channels; and offers Audience App for optimizes linear inventory. Further, the company offers communications products and managed service solutions; data connectivity services to mobile and wireline carriers on a wholesale basis; and owns and operates regional sports and news networks. It serves approximately 32 million customers in 41 states. The company was founded in 1993 and is headquartered in Stamford, Connecticut.",
    "ceo": "Mr. Christopher L. Winfrey",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "101700",
    "phone": "203 905 7801",
    "address": "400 Washington Boulevard",
    "city": "Stamford",
    "state": "CT",
    "zip": "06902",
    "dcfDiff": 22.5381,
    "dcf": 371.872,
    "image": "https://financialmodelingprep.com/image-stock/CHTR.png",
    "ipoDate": "2010-01-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]