[
  {
    "symbol": "CHX",
    "price": 28.87,
    "beta": 2.558098,
    "volAvg": 1329220,
    "mktCap": 5715509380,
    "lastDiv": 0.34,
    "range": "16.64-33.65",
    "changes": 0.03,
    "companyName": "ChampionX Corporation",
    "currency": "USD",
    "cik": "0001723089",
    "isin": "US15872M1045",
    "cusip": "15872M104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Oil & Gas Equipment & Services",
    "website": "https://www.championx.com",
    "description": "ChampionX Corporation provides chemistry solutions, and engineered equipment and technologies to oil and gas companies worldwide. The company's Production Chemical Technologies segment offers onshore and offshore chemical solutions, such as corrosion inhibitors, scale inhibitors, emulsion breakers, and biocides to oil and natural gas production and midstream markets to manage and control corrosion, oil and water separation, flow assurance, sour gas treatment, and water-related issues. The company's Production & Automation Technologies segment provides artificial lift equipment, end-to-end automation and digital solutions, and other production equipment, including electrical submersible pumping systems, gas lift systems, jet pumps, multiplex surface pumps, plunger lift equipment, progressive cavity pumping systems, downhole rod lift systems, emissions monitoring solutions, chemical injection systems, flow control valves, and gauges under the Harbison-Fischer, Norris, Alberta Oil Tool, Oil Lift Technology, PCS Ferguson, Pro-Rod, Upco, Unbridled ESP, Norriseal-Wellmark, Quartzdyne, Spirit, Theta, Timberline, and Windrock brands. The company's Drilling Technologies segment offers polycrystalline diamond cutter inserts, bearings, valves, and mining tools under the US Synthetic brand for use in oil and gas drill bits, renewable energy applications, mixers, and agitators; and high-density ceramic roof bolt mining tools for underground mining operations. The company's Reservoir Chemical Technologies segment provides chemistry-oriented solutions and technologies for well drilling, cementing, fracturing, acidizing, and other well interventions, as well as fracturing fluid packages, drilling and cement additives, and products for acidizing activities. ChampionX Corporation is headquartered in The Woodlands, Texas.",
    "ceo": "Mr. Sivasankaran  Somasundaram",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "7300",
    "phone": "281 403 5772",
    "address": "Building 4",
    "city": "The Woodlands",
    "state": "TX",
    "zip": "77381",
    "dcfDiff": 0.823172,
    "dcf": 32.0968,
    "image": "https://financialmodelingprep.com/image-stock/CHX.png",
    "ipoDate": "2018-04-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]