[
  {
    "symbol": "CI",
    "price": 274.74,
    "beta": 0.629929,
    "volAvg": 1826012,
    "mktCap": 81287873280,
    "lastDiv": 4.92,
    "range": "240.5-340.11",
    "changes": -1.06,
    "companyName": "Cigna Corporation",
    "currency": "USD",
    "cik": "0001739940",
    "isin": "US1255231003",
    "cusip": "125523100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Healthcare Plans",
    "website": "https://www.cigna.com",
    "description": "Cigna Corporation provides insurance and related products and services in the United States. Its Evernorth segment provides a range of coordinated and point solution health services, including pharmacy, benefits management, care delivery and management, and intelligence solutions to health plans, employers, government organizations, and health care providers. The company's Cigna Healthcare segment offers medical, pharmacy, behavioral health, dental, vision, health advocacy programs, and other products and services for insured and self-insured customers; Medicare Advantage, Medicare Supplement, and Medicare Part D plans for seniors, as well as individual health insurance plans to on and off the public exchanges; and health care coverage in its international markets, as well as health care benefits for mobile individuals and employees of multinational organizations. The company also offers permanent insurance contracts sold to corporations to provide coverage on the lives of certain employees for financing employer-paid future benefit obligations. It distributes its products and services through insurance brokers and consultants; directly to employers, unions and other groups, or individuals; and private and public exchanges. The company was founded in 1792 and is headquartered in Bloomfield, Connecticut.",
    "ceo": "Mr. David Michael Cordani",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "71300",
    "phone": "860 226 6000",
    "address": "900 Cottage Grove Road",
    "city": "Bloomfield",
    "state": "CT",
    "zip": "06002",
    "dcfDiff": 22.0243,
    "dcf": 330.324,
    "image": "https://financialmodelingprep.com/image-stock/CI.png",
    "ipoDate": "1982-03-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]