[
  {
    "symbol": "CICHY",
    "price": 12.85,
    "beta": 0.533716,
    "volAvg": 80406,
    "mktCap": 160631431168,
    "lastDiv": 1.08,
    "range": "10.31-14.29",
    "changes": 0.01,
    "companyName": "China Construction Bank Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US1689191088",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Diversified",
    "website": "https://www.ccb.com",
    "description": "China Construction Bank Corporation provides various banking and related financial services to individuals and corporate customers in the People's Republic of China and internationally. It operates through Corporate Banking, Personal Banking, Treasury Business, and Others segments. The company accepts various deposits, such as foreign currency, all in one accounts, RMB, corporate term and notification, and corporate demand deposits, as well corporate deposits by agreement. Its loan products include personal business, car, and housing loans; and SME, traditional credit, commercial draft, buyer credit, and RMB credit line loans. The company also offers credit cards; physical gold for personal investment and personal gold accounts; foreign exchange services; certificate treasury and savings bonds, securities deposit accounts, and securities services, as well as bank-securities transfer and book-entry treasury bond over the counter services; and wealth management products. In addition, it provides collection, salaries payment, third-party collection and payment, insurance agency, and remittance services; international settlement and financing, and FI services; securities and fund settlement services; guarantee-based, consulting and advising, and factoring services; fund custody services; and e-banking services. Further, the company offers institutional services comprising services for government agencies, social security, banks cooperation, bank-securities cooperation, bank-insurance cooperation, and services for non-banking financial institutions. It operates 14,741 banking outlets. China Construction Bank Corporation was founded in 1954 and is headquartered in Beijing, the People's Republic of China.",
    "ceo": "Mr. Guoli  Tian",
    "sector": "Financial Services",
    "country": "CN",
    "fullTimeEmployees": "376682",
    "phone": "86 10 6621 5533",
    "address": "No. 25, Financial Street",
    "city": "Beijing",
    "state": null,
    "zip": "100033",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CICHY.png",
    "ipoDate": "2009-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]