[
  {
    "symbol": "CIGI",
    "price": 96.02,
    "beta": 1.588263,
    "volAvg": 98227,
    "mktCap": 4216967952,
    "lastDiv": 0.3,
    "range": "84.16-133.03",
    "changes": -1.22,
    "companyName": "Colliers International Group Inc.",
    "currency": "USD",
    "cik": "0000913353",
    "isin": "CA1946931070",
    "cusip": "194693107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Real Estate Services",
    "website": "https://www.colliers.com",
    "description": "Colliers International Group Inc. provides commercial real estate professional and investment management services to corporate and institutional clients in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It offers sales brokerage services, including real estate sales, debt origination and placement, equity capital raising, market value opinions, acquisition advisory, and transaction management services; and landlord and tenant representation services. The company provides outsourcing and advisory services, such as corporate and workplace solutions; valuation and advisory services; workplace strategy services; loan servicing; property marketing; research services; and engineering design services for property and building, infrastructure, transportation, environmental and telecommunications end-markets. It also offers property management services comprising building operations and maintenance, facilities management, lease administration, property accounting and financial reporting, contract management and, construction management; and project management services, which include bid document review, construction monitoring and delivery management, contract administration and integrated cost control, development management, facility and engineering functionality, milestone and performance monitoring, quality assurance, risk management and strategic project consulting. In addition, the company provides investment management services that consists of asset management advisory and administration, transaction, and incentive services. The company was founded in 1972 and is headquartered in Toronto, Canada.",
    "ceo": "Mr. Jay Stewart Hennick CM",
    "sector": "Real Estate",
    "country": "CA",
    "fullTimeEmployees": "18450",
    "phone": "14169609500",
    "address": "1140 Bay Street",
    "city": "Toronto",
    "state": "ON",
    "zip": "M5S 2B4",
    "dcfDiff": 3.19619,
    "dcf": 101.874,
    "image": "https://financialmodelingprep.com/image-stock/CIGI.png",
    "ipoDate": "1995-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]