[
  {
    "symbol": "CIHKY",
    "price": 23.01,
    "beta": 0.979109,
    "volAvg": 38967,
    "mktCap": 116061750804,
    "lastDiv": 1.22,
    "range": "16.04-33.99",
    "changes": -0.01,
    "companyName": "China Merchants Bank Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US16950T1025",
    "cusip": "16950T102",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.cmbchina.com",
    "description": "China Merchants Bank Co., Ltd., together with its subsidiaries, provides various banking products and services. It operates through Wholesale Finance Business, Retail Finance Business, and Other Business segments. The company offers current, demand, time, call, savings, notice, and renminbi accounts. Its loan products include personal commercial real estate, consumption, housing, and car loans; loans to finance for studying abroad; micro-business loans; mortgage loans for equipment; joint guarantee, special guarantee, and housing mortgage loan; bank acceptance, discount, liquid capital, and fixed asset loans; and loans for vessels. The company also offers credit cards; insurance products; open-ended funds; discount and guarantees for commercial bills, redemption of commercial bills, and guaranteed discount for commercial acceptance bills; and financial consultation, debt financing underwriting, merger and acquisition financing, and equity financing and enterprise listing services. In addition, it provides forfeiting and risk participation, escrow, cross-border RMB clearing, and interbank services; and risk and financial management, cross-border RMB and oversea financing, international factoring and settlement, and trade finance services. Further, the company offers financial leasing and guarantee, investment and wealth management, forex option and gold trading, forex express trading, international, offshore and private banking, custody, pension, and electronic banking services. As of December 31, 2021, it operated 143 branches; 1,770 sub-branches; one branch-level operation center; 2,812 self-service centers; 6,592 self-service machines; one representative office; 14,746 visual counters in Mainland China. The company also operates in Hong Kong, New York, London, Singapore, Luxembourg, Sydney, and Taipei. China Merchants Bank Co., Ltd. was founded in 1987 and is headquartered in Shenzhen, China.",
    "ceo": "Mr. Liang  Wang",
    "sector": "Financial Services",
    "country": "CN",
    "fullTimeEmployees": "112999",
    "phone": "86 755 8319 8888",
    "address": "China Merchants Bank Tower",
    "city": "Shenzhen",
    "state": null,
    "zip": "518040",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CIHKY.png",
    "ipoDate": "2011-04-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]