[
  {
    "symbol": "CKHUY",
    "price": 6.14,
    "beta": 0.985057,
    "volAvg": 125480,
    "mktCap": 23516445993,
    "lastDiv": 0.37,
    "range": "4.81-6.89",
    "changes": -0.01,
    "companyName": "CK Hutchison Holdings Limited",
    "currency": "USD",
    "cik": "0001637120",
    "isin": "US12562Y1001",
    "cusip": "12562Y100",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Conglomerates",
    "website": "https://www.ckh.com.hk",
    "description": "CK Hutchison Holdings Limited, an investment holding company, operates in ports and related services, retail, infrastructure, and telecommunications businesses worldwide. The company invests in, develops, and operates ports, which operate 291 berths in 52 ports spanning 26 countries; and provides logistics and transportation-related services, such as cruise ship terminals, distribution centers, rail services, and ship repair facilities. It also operates 12 retail brands with 16,398 stores that offer personal care, health and beauty products, food and fine wines, consumer electronics, and electrical appliances in Asia and Europe, as well as operates supermarkets; and manufactures and distributes bottled water and other beverages under the Watsons Water and Mr. Juicy brands in Hong Kong and Mainland China. In addition, the company invests in energy infrastructure, transportation infrastructure, water infrastructure, waste management, waste-to-energy, household infrastructure, and other infrastructure related businesses primarily in Hong Kong, Mainland China, the United Kingdom, Continental Europe, Australia, New Zealand, Canada, and the United States. Further, it provides mobile telecommunications and data services, as well as operates as an integrated energy company in the United States, Canada, and the Asia Pacific. Additionally, it researches, develops, manufactures, commercializes, markets, and sells nutraceuticals, pharmaceuticals, and agriculture-related products; provides marine construction and ship repair yard, water supply and sewerage, electricity generation and distribution, gas distribution, and aircraft maintenance services; and leases rolling stocks. CK Hutchison Holdings Limited was founded in 1828 and is based in Central, Hong Kong.",
    "ceo": "Mr. Tzar Kuoi  Li B.Sc, B.Sc., LLD, LLD (Hon), M.Sc., MSc",
    "sector": "Industrials",
    "country": "HK",
    "fullTimeEmployees": "300000",
    "phone": "852 2128 1188",
    "address": "Cheung Kong Center",
    "city": "Central",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CKHUY.png",
    "ipoDate": "2015-06-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]