[
  {
    "symbol": "CL",
    "price": 75.91,
    "beta": 0.485915,
    "volAvg": 5285041,
    "mktCap": 62972506880,
    "lastDiv": 1.92,
    "range": "67.84-83.81",
    "changes": 0.18,
    "companyName": "Colgate-Palmolive Company",
    "currency": "USD",
    "cik": "0000021665",
    "isin": "US1941621039",
    "cusip": "194162103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Household & Personal Products",
    "website": "https://www.colgatepalmolive.com",
    "description": "Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products worldwide. The company operates through two segments, Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment offers toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other related items. This segment markets and sells its products under various brands, which include Colgate, Darlie, elmex, hello, meridol, Sorriso, Tom's of Maine, Irish Spring, Palmolive, Protex, Sanex, Softsoap, Lady Speed Stick, Speed Stick, EltaMD, Filorga, PCA SKIN, Ajax, Axion, Fabuloso, Murphy, Suavitel, Soupline, and Cuddly to a range of traditional and eCommerce retailers, wholesalers, and distributors. It also includes pharmaceutical products for dentists and other oral health professionals. The Pet Nutrition segment offers pet nutrition products for everyday nutritional needs under the Hill's Science Diet brand; and a range of therapeutic products to manage disease conditions in dogs and cats under the Hill's Prescription Diet brand. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.",
    "ceo": "Mr. Noel R. Wallace",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "33800",
    "phone": "212 310 2000",
    "address": "300 Park Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10022-7499",
    "dcfDiff": 6.31079,
    "dcf": 77.9008,
    "image": "https://financialmodelingprep.com/image-stock/CL.png",
    "ipoDate": "1973-05-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]