[
  {
    "symbol": "CLF",
    "price": 16.39,
    "beta": 2.202464,
    "volAvg": 9360427,
    "mktCap": 8442144941,
    "lastDiv": 8.91312500000001,
    "range": "11.83-22.83",
    "changes": -0.15,
    "companyName": "Cleveland-Cliffs Inc.",
    "currency": "USD",
    "cik": "0000764065",
    "isin": "US1858991011",
    "cusip": "185899101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Steel",
    "website": "https://www.clevelandcliffs.com",
    "description": "Cleveland-Cliffs Inc. operates as a flat-rolled steel producer in North America. The company offers carbon steel products, such as hot-rolled, cold-rolled, electrogalvanized, hot-dip galvanized, hot-dip galvannealed, aluminized, enameling, and advanced high-strength steel products; stainless steel products; plates; and grain oriented and non-oriented electrical steel products. It also provides tubular components, including carbon steel, stainless steel, and electric resistance welded tubing. In addition, the company offers tinplate products, such as electrolytic tin coated and chrome coated sheet, and tin mill products; tooling and sampling; raw materials; ingots, rolled blooms, and cast blooms; and hot-briquetted iron products. Further, it owns five iron ore mines in Minnesota and Michigan. The company serves automotive, infrastructure and manufacturing, distributors and converters, and steel producers. Cleveland-Cliffs Inc. was formerly known as Cliffs Natural Resources Inc. and changed its name to Cleveland-Cliffs Inc. in August 2017. The company was founded in 1847 and is headquartered in Cleveland, Ohio.",
    "ceo": "Mr. C. Lourenco Goncalves",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "27000",
    "phone": "216 694 5700",
    "address": "200 Public Square",
    "city": "Cleveland",
    "state": "OH",
    "zip": "44114-2315",
    "dcfDiff": 6.46221,
    "dcf": 15.1578,
    "image": "https://financialmodelingprep.com/image-stock/CLF.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]