[
  {
    "symbol": "CLH",
    "price": 160.02,
    "beta": 1.368661,
    "volAvg": 391751,
    "mktCap": 8657738082,
    "lastDiv": 0,
    "range": "83.56-160.5",
    "changes": 1.85,
    "companyName": "Clean Harbors, Inc.",
    "currency": "USD",
    "cik": "0000822818",
    "isin": "US1844961078",
    "cusip": "184496107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Waste Management",
    "website": "https://www.cleanharbors.com",
    "description": "Clean Harbors, Inc. provides environmental and industrial services in North America. The company operates through two segments, Environmental Services and Safety-Kleen Sustainability Solutions. The Environmental Services segment collects, transports, treats, and disposes hazardous and non-hazardous waste, such as resource recovery, physical treatment, fuel blending, incineration, landfill disposal, wastewater treatment, lab chemicals disposal, and explosives management services; and CleanPack services, including collection, identification, categorization, specialized packaging, transportation, and disposal of laboratory chemicals and household hazardous waste. This segment also provides industrial maintenance and specialty industrial services, and utilizes specialty equipment and resources that performs field services. The Safety-Kleen Sustainability Solutions segment offers specially designed parts washers; automotive and industrial cleaning products, such as antifreeze, windshield washer fluid, degreasers, glass and floor cleaners, hand cleaners, absorbents, mats, and spill kits; pickup and transportation services for hazardous and non-hazardous containerized waste for recycling or disposal; and vacuum services to remove solids, residual oily water and sludge, and other fluids from customers oil/water separators, sumps, and collection tanks, as well as remove and collect waste fluids found at metal fabricators, auto maintenance providers, and general manufacturers. This segment also manufactures, formulates, packages, distributes, and markets lubricants; and provides containerized waste, vacuum services, used motor oil collection, and contract blending and packaging services. Clean Harbors, Inc. was incorporated in 1980 and is headquartered in Norwell, Massachusetts.",
    "ceo": "Mr. Eric W. Gerstenberg",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "19775",
    "phone": "781 792 5000",
    "address": "42 Longwater Drive",
    "city": "Norwell",
    "state": "MA",
    "zip": "02061-9149",
    "dcfDiff": 1.23332,
    "dcf": 126.157,
    "image": "https://financialmodelingprep.com/image-stock/CLH.png",
    "ipoDate": "1987-11-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]