[
  {
    "symbol": "CLVT",
    "price": 9.34,
    "beta": 1.099148,
    "volAvg": 5351290,
    "mktCap": 6311635461,
    "lastDiv": 0,
    "range": "7.16-14.99",
    "changes": 0.16,
    "companyName": "Clarivate Plc",
    "currency": "USD",
    "cik": "0001764046",
    "isin": "JE00BJJN4441",
    "cusip": "G21810109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.clarivate.com",
    "description": "Clarivate Plc, an information services and analytics company, provides structured information and analytics for discovery, protection, and commercialization of scientific research, innovations, and brands. It offers Web of Science products and services, such as Web of Science, InCites, Journal Citation Reports, EndNote, ScholarOne, Converis, Publons, and Kopernio to organizations that plan, fund, implement, and utilize research; and Life Sciences products, including Cortellis and Newport Integrity for pharmaceutical and biotechnology companies to support research, market intelligence, and competitive monitoring in connection with the development and commercialization of new drugs. The company also provides Derwent products, which include Derwent Innovation, Techstreet, and IP Professional Services that enables its customers to evaluate the novelty of potential new products, confirm freedom to operate with respect to their product design, help them secure patent protection, assess the competitive technology landscape, and ensure that their products comply with required industry standards; CompuMark products, such as trademark screening, searching, and watching products and services for businesses and law firms; and MarkMonitor products, which helps enterprises to establish, manage, optimize, and protect their online presence. It serves government and academic institutions, life science companies, and research and development corporations in the Americas, the Middle East, Africa, Europe, and the Asia Pacific. The company was formerly known as Clarivate Analytics Plc and changed its name to Clarivate Plc in May 2020. Clarivate Plc is headquartered in London, the United Kingdom.",
    "ceo": "Mr. Jonathan  Gear",
    "sector": "Technology",
    "country": "GB",
    "fullTimeEmployees": "11600",
    "phone": "44 20 7433 4000",
    "address": "70 St. Mary Axe",
    "city": "London",
    "state": null,
    "zip": "EC3A 8BE",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CLVT.png",
    "ipoDate": "2018-10-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]