[
  {
    "symbol": "CLX",
    "price": 156.94,
    "beta": 0.280633,
    "volAvg": 1223740,
    "mktCap": 19386013500,
    "lastDiv": 4.72,
    "range": "124.58-178.21",
    "changes": -2.58,
    "companyName": "The Clorox Company",
    "currency": "USD",
    "cik": "0000021076",
    "isin": "US1890541097",
    "cusip": "189054109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Household & Personal Products",
    "website": "https://www.thecloroxcompany.com",
    "description": "The Clorox Company manufactures and markets consumer and professional products worldwide. It operates through four segments: Health and Wellness, Household, Lifestyle, and International. The Health and Wellness segment offers cleaning products, such as laundry additives and home care products primarily under the Clorox, Clorox2, Scentiva, Pine-Sol, Liquid-Plumr, Tilex, and Formula 409 brands; professional cleaning and disinfecting products under the CloroxPro and Clorox Healthcare brands; professional food service products under the Hidden Valley brand; and vitamins, minerals and supplement products under the RenewLife, Natural Vitality, NeoCell, and Rainbow Light brands in the United States. The Household segment provides cat litter products under the Fresh Step and Scoop Away brands; bags and wraps under the Glad brand; and grilling products under the Kingsford brand in the United States. The Lifestyle segment offers dressings, dips, seasonings, and sauces primarily under the Hidden Valley brand; natural personal care products under the Burt's Bees brand; and water-filtration products under the Brita brand in the United States. The International segment provides laundry additives; home care products; water-filtration systems; digestive health products; grilling products; cat litter products; food products; bags and wraps; natural personal care products; and professional cleaning and disinfecting products internationally primarily under the Clorox, Ayudin, Clorinda, Poett, Pine-Sol, Glad, Brita, RenewLife, Ever Clean and Burt's Bees brands. The Clorox Company sells its products primarily through mass retailers; grocery outlets; warehouse clubs; dollar stores; home hardware centers; drug, pet and military stores; third-party and owned e-commerce channels; and distributors, as well as a direct sales force The company was founded in 1913 and is headquartered in Oakland, California.",
    "ceo": "Ms. Linda  Rendle",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "9000",
    "phone": "510 271 7000",
    "address": "1221 Broadway",
    "city": "Oakland",
    "state": "CA",
    "zip": "94612-1888",
    "dcfDiff": 11.3359,
    "dcf": 151.836,
    "image": "https://financialmodelingprep.com/image-stock/CLX.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]