[
  {
    "symbol": "CM",
    "price": 42.27,
    "beta": 1.023569,
    "volAvg": 1160450,
    "mktCap": 38792700720,
    "lastDiv": 2.58,
    "range": "39.4-53.36",
    "changes": -0.09,
    "companyName": "Canadian Imperial Bank of Commerce",
    "currency": "USD",
    "cik": "0001045520",
    "isin": "CA1360691010",
    "cusip": "136069101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.cibc.com",
    "description": "Canadian Imperial Bank of Commerce, a diversified financial institution, provides various financial products and services to personal, business, public sector, and institutional clients in Canada, the United States, and internationally. The company operates through four strategic business units: Canadian Personal and Business Banking; Canadian Commercial Banking and Wealth Management; U.S. Commercial Banking and Wealth Management; and Capital Markets. The company offers chequing, savings, and business accounts; mortgages; loans, lines of credit, student lines of credit, and business and agriculture loans; investment and insurance services; and credit cards, as well as overdraft protection services. It also provides day-to-day banking, borrowing and credit, specialty, investing and wealth, and international services; correspondent banking and online foreign exchange services; and cash management services. Canadian Imperial Bank of Commerce was founded in 1867 and is headquartered in Toronto, Canada.",
    "ceo": "Mr. Victor G. Dodig",
    "sector": "Financial Services",
    "country": "CA",
    "fullTimeEmployees": "48673",
    "phone": "12128563612",
    "address": "81 Bay Street",
    "city": "Toronto",
    "state": "ON",
    "zip": "M5J 0E7",
    "dcfDiff": 83.2129,
    "dcf": 127.843,
    "image": "https://financialmodelingprep.com/image-stock/CM.png",
    "ipoDate": "1997-11-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]