[
  {
    "symbol": "CMA",
    "price": 42.11,
    "beta": 1.175,
    "volAvg": 4258556,
    "mktCap": 5544623700,
    "lastDiv": 2.84,
    "range": "28.4-87.02",
    "changes": 0.01,
    "companyName": "Comerica Incorporated",
    "currency": "USD",
    "cik": "0000028412",
    "isin": "US2003401070",
    "cusip": "200340107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.comerica.com",
    "description": "Comerica Incorporated, through its subsidiaries, provides various financial products and services. It operates through Commercial Bank, Retail Bank, Wealth Management, and Finance segments. The Commercial Bank segment offers various products and services, including commercial loans and lines of credit, deposits, cash management, capital market products, international trade finance, letters of credit, foreign exchange management services, and loan syndication services for small and middle market businesses, multinational corporations, and governmental entities. The Retail Bank segment provides personal financial services, such as consumer lending, consumer deposit gathering, and mortgage loan origination. This segment also offers various consumer products that include deposit accounts, installment loans, credit cards, student loans, home equity lines of credit, and residential mortgage loans, as well as commercial products and services to micro-businesses. The Wealth Management segment provides products and services comprising fiduciary, private banking, retirement, investment management and advisory, and investment banking and brokerage services. This segment also sells annuity products, as well as life, disability, and long-term care insurance products. The Finance segment engages in the securities portfolio, and asset and liability management activities. It operates in Texas, California, Michigan, Arizona, Florida, Canada, and Mexico. The company was formerly known as DETROITBANK Corporation and changed its name to Comerica Incorporated in July 1982. Comerica Incorporated was founded in 1849 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Curtis Chatman Farmer",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "7586",
    "phone": "214 462 6831",
    "address": "Comerica Bank Tower",
    "city": "Dallas",
    "state": "TX",
    "zip": "75201",
    "dcfDiff": 164.354,
    "dcf": 236.924,
    "image": "https://financialmodelingprep.com/image-stock/CMA.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]