[
  {
    "symbol": "CMAKY",
    "price": 3.534,
    "beta": 0.297945,
    "volAvg": 212,
    "mktCap": 21983494143,
    "lastDiv": 0.31,
    "range": "2.76-4.25",
    "changes": -0.056,
    "companyName": "China Minsheng Banking Corp., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.cmbc.com.cn",
    "description": "China Minsheng Banking Corp., Ltd. provides various financial products and services to individuals, small and micro-enterprises, corporate customers, government agencies, and financial institutions in the People's Republic of China. The company operates through Corporate Banking, Retail Banking, and Others segments. Its deposit products include saving accounts, deposit certificates, contracted deposits, agreement deposits, call deposits, corporate term deposits, and corporate current deposits. The company also offers personal housing mortgage, individual automobile purchase, household composite consumption, home, medium and long term, and short-term working capital loans; micro-credit products for individuals; debit and credit cards; and safe deposit boxes. In addition, it provides payment and collection, and clearing services, as well as internet, mobile, and telephone banking services. Further, the company offers gross settlement; wages distribution agency and letter of guarantee; cash management; trade finance; industrial chain finance; individual forex settlement, forex remittance, travelers promissory notes, collection, individual deposit certificate, and guarantee letter products; and comprehensive credit granting, forex settlement and sale, financial product investment, and trust financing services. Additionally, it provides convenient finance, investment banking, and asset management services, as well as non-financial services in the education, business travel, traveler, art, luxury life, health, club, and isports areas. As of December 31, 2021, the company has approximately 140 branch-level institutions, 1,193 business outlets, 1,078 community sub-branches, and 136 small business sub-branches. China Minsheng Banking Corp., Ltd. was founded in 1996 and is headquartered in Beijing, the People's Republic of China.",
    "ceo": "Mr. Yingxin  Gao",
    "sector": "Financial Services",
    "country": "CN",
    "fullTimeEmployees": "62615",
    "phone": "86 10 5856 0975",
    "address": "China Minsheng Bank Building",
    "city": "Beijing",
    "state": null,
    "zip": "100031",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CMAKY.png",
    "ipoDate": "2011-06-29",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]