[
  {
    "symbol": "CMC",
    "price": 52.08,
    "beta": 1.25,
    "volAvg": 793954,
    "mktCap": 6082214880,
    "lastDiv": 0.64,
    "range": "31.47-58.09",
    "changes": 1,
    "companyName": "Commercial Metals Company",
    "currency": "USD",
    "cik": "0000022444",
    "isin": "US2017231034",
    "cusip": "201723103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Steel",
    "website": "https://www.cmc.com",
    "description": "Commercial Metals Company manufactures, recycles, and fabricates steel and metal products, and related materials and services in the United States, Poland, China, and internationally. The company processes and sells ferrous and nonferrous scrap metals to steel mills and foundries, aluminum sheet and ingot manufacturers, brass and bronze ingot makers, copper refineries and mills, secondary lead smelters, specialty steel mills, high temperature alloy manufacturers, and other consumers. It also manufactures and sells finished long steel products, including rebar, merchant bar, light structural, and other special sections, as well as semi-finished billets for re-rolling and forging applications. In addition, the company provides fabricated steel products used to reinforce concrete primarily in the construction of commercial and non-commercial buildings, hospitals, convention centers, industrial plants, power plants, highways, bridges, arenas, stadiums, and dams; sells and rents construction-related products and equipment to concrete installers and other businesses; and manufactures and sells strength bars for the truck trailer industry, special bar steels for the energy market, and armor plates for military vehicles. Further, it manufactures rebars, merchant bars, and wire rods; and sells fabricated rebars, wire meshes, fabricated meshes, assembled rebar cages, and other fabricated rebar by-products to fabricators, manufacturers, distributors, and construction companies. The company was founded in 1915 and is headquartered in Irving, Texas.",
    "ceo": "Ms. Barbara R. Smith CPA",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "12483",
    "phone": "214 689 4300",
    "address": "6565 North MacArthur Boulevard",
    "city": "Irving",
    "state": "TX",
    "zip": "75039",
    "dcfDiff": 3.36957,
    "dcf": 51.5004,
    "image": "https://financialmodelingprep.com/image-stock/CMC.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]