[
  {
    "symbol": "CMCSA",
    "price": 41.67,
    "beta": 0.997535,
    "volAvg": 18785625,
    "mktCap": 173321363267,
    "lastDiv": 1.16,
    "range": "28.39-43.72",
    "changes": 0.19,
    "companyName": "Comcast Corporation",
    "currency": "USD",
    "cik": "0001166691",
    "isin": "US20030N1019",
    "cusip": "20030N101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Telecom Services",
    "website": "https://corporate.comcast.com",
    "description": "Comcast Corporation operates as a media and technology company worldwide. It operates through Cable Communications, Media, Studios, Theme Parks, and Sky segments. The Cable Communications segment offers broadband, video, voice, wireless, and other services to residential and business customers under the Xfinity brand; and advertising services. The Media segment operates NBCUniversal's television and streaming platforms, including national, regional, and international cable networks, the NBC and Telemundo broadcast, and Peacock networks. The Studios segment operates NBCUniversal's film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The Sky segment offers direct-to-consumer services, such as video, broadband, voice and wireless phone services, and content business operates entertainment networks, the Sky News broadcast network, and Sky Sports networks. The company also owns the Philadelphia Flyers, as well as the Wells Fargo Center arena in Philadelphia, Pennsylvania; and provides streaming service, such as Peacock. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.",
    "ceo": "Mr. Brian L. Roberts",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "186000",
    "phone": "215 286 1700",
    "address": "One Comcast Center",
    "city": "Philadelphia",
    "state": "PA",
    "zip": "19103-2838",
    "dcfDiff": 3.38269,
    "dcf": 36.2173,
    "image": "https://financialmodelingprep.com/image-stock/CMCSA.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]