[
  {
    "symbol": "CME",
    "price": 183.14,
    "beta": 0.424295,
    "volAvg": 1459000,
    "mktCap": 65878206565,
    "lastDiv": 4.4,
    "range": "166.55-211.19",
    "changes": 4.19,
    "companyName": "CME Group Inc.",
    "currency": "USD",
    "cik": "0001156375",
    "isin": "US12572Q1058",
    "cusip": "12572Q105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Financial Data & Stock Exchanges",
    "website": "https://www.cmegroup.com",
    "description": "CME Group Inc., together with its subsidiaries, operates contract markets for the trading of futures and options on futures contracts worldwide. It offers futures and options products based on interest rates, equity indexes, foreign exchange, agricultural commodities, energy, and metals, as well as fixed income products. The company also provides clearing house services, including clearing, settling, and guaranteeing futures and options contracts, and cleared swaps products traded through its exchanges; and trade processing and risk mitigation services. In addition, the company offers a range of market data services, including real-time and historical data services. It serves professional traders, financial institutions, institutional and individual investors, corporations, manufacturers, producers, governments, and central banks. The company was formerly known as Chicago Mercantile Exchange Holdings Inc. and changed its name to CME Group Inc. in July 2007. CME Group Inc. was founded in 1898 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Terrence A. Duffy",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3460",
    "phone": "312 930 1000",
    "address": "20 South Wacker Drive",
    "city": "Chicago",
    "state": "IL",
    "zip": "60606",
    "dcfDiff": 8.72713,
    "dcf": 184.407,
    "image": "https://financialmodelingprep.com/image-stock/CME.png",
    "ipoDate": "2002-12-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]