[
  {
    "symbol": "CMHHY",
    "price": 14.41,
    "beta": 1.00498,
    "volAvg": 7,
    "mktCap": 5768870349,
    "lastDiv": 9.987112,
    "range": "11.193738-16.56164",
    "changes": 0,
    "companyName": "China Merchants Port Holdings Company Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Marine Shipping",
    "website": "https://www.cmport.com.hk",
    "description": "China Merchants Port Holdings Company Limited, an investment holding company, operates as a port operator in Mainland China, Hong Kong, Taiwan, and internationally. It operates through Ports operation, Bonded Logistics Operation, and Other Operations. The company engages in the container, and bulk and general cargo terminals; and logistic park operation, ports transportation, and airport cargo handling activities. It also invests, develops, and constructs modular housings; and provides container terminal services. In addition, the company engages in port construction and development; and operation of berths; operation of tugboats. Further, it offers tugboat berthing assistance and barge services at the arrival of ships to the ports, tallying in the course of cargo handling, and supply of shore power and freshwater for vessels. The company was formerly known as China Merchants Holdings (International) Company Limited and changed its name to China Merchants Port Holdings Company Limited in June 2016. The company was founded in 1872 and is headquartered in Central, Hong Kong. China Merchants Port Holdings Company Limited is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange.",
    "ceo": "Mr. Xiufeng  Wang",
    "sector": "Industrials",
    "country": "HK",
    "fullTimeEmployees": "8425",
    "phone": "852 2102 8888",
    "address": "China Merchants Tower",
    "city": "Central",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CMHHY.png",
    "ipoDate": "2009-12-29",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]