[
  {
    "symbol": "CMI",
    "price": 239.13,
    "beta": 1.014084,
    "volAvg": 989450,
    "mktCap": 33846460200,
    "lastDiv": 6.28,
    "range": "187.92-261.91",
    "changes": -0.49,
    "companyName": "Cummins Inc.",
    "currency": "USD",
    "cik": "0000026172",
    "isin": "US2310211063",
    "cusip": "231021106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.cummins.com",
    "description": "Cummins Inc. designs, manufactures, distributes, and services diesel and natural gas engines, electric and hybrid powertrains, and related components worldwide. It operates through five segments: Engine, Distribution, Components, Power Systems, and New Power. The company offers diesel and natural gas-powered engines under the Cummins and other customer brands for the heavy and medium-duty truck, bus, recreational vehicle, light-duty automotive, construction, mining, marine, rail, oil and gas, defense, and agricultural markets; and offers new parts and services, as well as remanufactured parts and engines. It also provides power generation systems, high-horsepower engines, heavy and medium duty engines, application engineering services, custom-designed assemblies, retail and wholesale aftermarket parts, and in-shop and field-based repair services. In addition, the company offers emission solutions; turbochargers; air and fuel filters, fuel water separators, lube and hydraulic filters, coolants, fuel additives, and other filtration systems; and electronic control modules, sensors, and supporting software, as well as new, replacement, and remanufactured fuel systems. Further, it provides automated transmissions; standby and prime power generators, controls, paralleling systems, and transfer switches, as well as A/C generator/alternator products under the Stamford and AVK brands; and electrified power systems with components and subsystems, including battery, fuel cell, and hydrogen production technologies. Additionally, it offers filtration, aftertreatment, controls systems, air handling systems, automated transmissions, electric power generation systems, and batteries. The company sells its products to original equipment manufacturers, distributors, dealers, and other customers. The company was formerly known as Cummins Engine Company and changed its name to Cummins Inc. in 2001. Cummins Inc. was founded in 1919 and is headquartered in Columbus, Indiana.",
    "ceo": "Ms. Jennifer W. Rumsey",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "73600",
    "phone": "812 377 5000",
    "address": "500 Jackson Street",
    "city": "Columbus",
    "state": "IN",
    "zip": "47202-3005",
    "dcfDiff": 15.556,
    "dcf": 264.246,
    "image": "https://financialmodelingprep.com/image-stock/CMI.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]