[
  {
    "symbol": "CMWAY",
    "price": 65.95,
    "beta": 0.828735,
    "volAvg": 38916,
    "mktCap": 111256987334,
    "lastDiv": 2.76,
    "range": "58.14-78.96",
    "changes": -0.32,
    "companyName": "Commonwealth Bank of Australia",
    "currency": "USD",
    "cik": null,
    "isin": "US2027126000",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Diversified",
    "website": "https://www.commbank.com.au",
    "description": "Commonwealth Bank of Australia provides integrated financial services in Australia, New Zealand, and internationally. It operates through Retail Banking Services, Business Banking, Institutional Banking and Markets, and New Zealand segments. The company offers retail, premium, business, offshore, and institutional banking services; and funds management, superannuation, and share broking products and services, as well as car, health, life, income protection, and travel insurance. It offers transaction, savings, foreign currency accounts; term deposits; personal and business loans; overdrafts; equipment finance; credit cards; international payment and trade; and private banking services, as well as home and car loans, and importer finance products. The company also provides advisory services for high net worth individuals; equities trading and margin lending services; debt capital, transaction banking, working capital, and risk management services; and international and foreign exchange services. As of June 30, 2021, it operated 875 branches and 2,492 ATMs. The company was founded in 1911 and is based in Sydney, Australia.",
    "ceo": "Mr. Matthew  Comyn EMBA",
    "sector": "Financial Services",
    "country": "AU",
    "fullTimeEmployees": "48860",
    "phone": "61 2 9378 2000",
    "address": "Tower 1",
    "city": "Sydney",
    "state": "NSW",
    "zip": "2000",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CMWAY.png",
    "ipoDate": "2010-04-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]