[
  {
    "symbol": "CNA",
    "price": 38.29,
    "beta": 0.680633,
    "volAvg": 174120,
    "mktCap": 10371000273,
    "lastDiv": 1.68,
    "range": "35.9-45.46",
    "changes": -0.78,
    "companyName": "CNA Financial Corporation",
    "currency": "USD",
    "cik": "0000021175",
    "isin": "US1261171003",
    "cusip": "126117100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.cna.com",
    "description": "CNA Financial Corporation provides commercial property and casualty insurance products primarily in the United States. It operates through Specialty, Commercial, International, Life & Group, and Corporate & Other segments. The company offers professional liability coverages and risk management services to various professional firms, including architects, real estate agents, and accounting and law firms; directors and officers, employment practices, fiduciary, and fidelity coverages to small and mid-size firms, public and privately held firms, and not-for-profit organizations; professional and general liability, as well as associated standard property and casualty coverages for healthcare industry; surety and fidelity bonds; and warranty and alternative risks products. It also provides property insurance products, such as property, marine, boiler, and machinery coverages; casualty insurance products comprising workers' compensation, general and product liability, commercial auto, and umbrella coverages; specialized loss-sensitive insurance programs and total risk management services; and run-off long term care policies. In addition, the company offers long-tail exposures comprising commercial automobile liability, workers' compensation, general and medical professional liability, other professional and management liability, and assumed reinsurance run-off and products liability; and short-tail exposures, such as property, commercial automobile physical damage, marine, and surety. It markets its products through independent agents, brokers, and general underwriters to small, medium, and large businesses; insurance companies; associations; professionals; and other groups in the marine, oil and gas, construction, manufacturing, life science, property, financial services, healthcare, and technology industries. The company was founded in 1853 and is headquartered in Chicago, Illinois. CNA Financial Corporation operates as a subsidiary of Loews Corporation.",
    "ceo": "Mr. Dino Ennio Robusto",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "6100",
    "phone": "312 822 5000",
    "address": "151 North Franklin Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60606",
    "dcfDiff": 1.00481,
    "dcf": 44.1548,
    "image": "https://financialmodelingprep.com/image-stock/CNA.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]