[
  {
    "symbol": "CNHI",
    "price": 14.08,
    "beta": 1.682394,
    "volAvg": 6672641,
    "mktCap": 18806514975,
    "lastDiv": 0.4,
    "range": "10.6-17.98",
    "changes": -0.11,
    "companyName": "CNH Industrial N.V.",
    "currency": "USD",
    "cik": "0001567094",
    "isin": "NL0010545661",
    "cusip": "N20944109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Farm & Heavy Construction Machinery",
    "website": "https://www.cnhindustrial.com",
    "description": "CNH Industrial N.V. designs, produces, markets, sells, and finances agricultural and construction equipment, trucks, commercial vehicles, buses, and specialty vehicles in North America, Europe, South America, and internationally. It operates through five segments: Agriculture, Construction, Commercial and Specialty Vehicles, Powertrain, and Financial. The Agriculture segment provides farm machinery and implements that include two-and four-wheel drive tractors, crawler tractors, combines, cotton pickers, grape and sugar cane harvesters, hay and forage equipment, planting and seeding equipment, soil preparation and cultivation implements, and material handling equipment under the New Holland Agriculture, Case IH, STEYR, Miller, Kongskilde, Överum, K-Line, and JF brands. The Construction segment offers excavators, crawler dozers, graders, wheel and backhoe loaders, and skid steer and compact track loaders under the CASE Construction and New Holland Construction brands. The Commercial and Specialty Vehicles segment provides light, medium, and heavy vehicles for the transportation and distribution of goods under the IVECO brand; commuter buses and city-buses under the IVECO BUS and Heuliez Bus brands; quarry and mining equipment under the IVECO ASTRA brand; firefighting vehicles under the Magirus brand; and vehicles for civil defense and peace-keeping missions under the Iveco Defence Vehicles brand. The Powertrain segment offers engines, transmission systems, and axles for on- and off-road applications, as well as for marine and power generation under the FPT Industrial brand. The Financial Services segment provides and administers retail financing to customers for the purchase or lease of new and used industrial equipment or vehicles, and other equipment; wholesale financing, which primarily consists of floor plan financing; and trade receivables factoring services. The company was founded in 1842 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. Scott Wellington Wine",
    "sector": "Industrials",
    "country": "GB",
    "fullTimeEmployees": "40070",
    "phone": "44 20 7766 0346",
    "address": "25 St. James's Street",
    "city": "London",
    "state": null,
    "zip": "SW1A 1HA",
    "dcfDiff": 2.11572,
    "dcf": 19.6957,
    "image": "https://financialmodelingprep.com/image-stock/CNHI.png",
    "ipoDate": "2013-09-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]