[
  {
    "symbol": "CNM",
    "price": 30.56,
    "beta": 0,
    "volAvg": 1352474,
    "mktCap": 7062660358,
    "lastDiv": 4.682799999999996,
    "range": "18.75-30.8",
    "changes": 0.26,
    "companyName": "Core & Main, Inc.",
    "currency": "USD",
    "cik": "0001856525",
    "isin": "US21874C1027",
    "cusip": "21874C102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Industrial Distribution",
    "website": "https://www.coreandmain.com",
    "description": "Core & Main, Inc. distributes water, wastewater, storm drainage, and fire protection products and related services to municipalities, private water companies, and professional contractors in the municipal, non-residential, and residential end markets in the United States. Its products include pipes, valves, hydrants, fittings, and other products and services; storm drainage products, such as corrugated piping systems, retention basins, inline drains, manholes, grates, geosynthetics, and other related products; fire protection products, including fire protection pipes, sprinkler heads and other devices, fire suppression systems, and related accessories, as well as fabrication services; and meter products, such as smart meter products, installation, software and other services. The company's specialty products and services are used in the maintenance, repair, replacement, and construction of water and fire protection infrastructure. Core & Main, Inc. was founded in 1874 and is headquartered in St. Louis, Missouri.",
    "ceo": "Mr. Stephen O. LeClair",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "4500",
    "phone": "314 432 4700",
    "address": "1830 Craig Park Court",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63146",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CNM.png",
    "ipoDate": "2021-07-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]