[
  {
    "symbol": "CNMD",
    "price": 134.7,
    "beta": 1.384859,
    "volAvg": 373124,
    "mktCap": 4118492910,
    "lastDiv": 0.8,
    "range": "71.09-138.47",
    "changes": 1.49,
    "companyName": "CONMED Corporation",
    "currency": "USD",
    "cik": "0000816956",
    "isin": "US2074101013",
    "cusip": "207410101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.conmed.com",
    "description": "CONMED Corporation, a medical technology company, develops, manufactures, and sells surgical devices and related equipment for surgical procedures worldwide. It offers orthopedic surgery products, including TruShot with Y-Knot All-In-One Soft Tissue Fixation System, Y-knot All-Suture Anchors, and PopLok Knotless Suture Anchors, which provide unique clinical solutions to orthopedic surgeons for the repair of soft tissue injuries, as well as supporting products that enable surgeons to perform minimally invasive sports medicine surgeries. The company markets orthopedic surgery products under the Hall, CONMED Linvatec, Concept, and Shutt brands. It also offers general surgery products, such as clinical insufflation, smoke evacuation, electrosurgical, and endomechanical products; and endoscopic technologies, including diagnostic and therapeutic products for use in gastroenterology procedures, and products for the treatment of diseases of the biliary structures, as well as cardiac monitoring products comprising ECG and EEG electrodes, and cardiac defibrillation pads. The company markets its products directly to hospitals, surgery centers, and other healthcare institutions, as well as through medical specialty distributors. CONMED Corporation was incorporated in 1970 and is headquartered in Largo, Florida.",
    "ceo": "Mr. Curt R. Hartman",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "4100",
    "phone": "727 392 6464",
    "address": "11311 Concept Boulevard",
    "city": "Largo",
    "state": "FL",
    "zip": "33773-4908",
    "dcfDiff": 13.1129,
    "dcf": 82.8171,
    "image": "https://financialmodelingprep.com/image-stock/CNMD.png",
    "ipoDate": "1987-07-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]