[
  {
    "symbol": "CNO",
    "price": 23.14,
    "beta": 1.148943,
    "volAvg": 825396,
    "mktCap": 2650779560,
    "lastDiv": 0.6,
    "range": "16.56-26.35",
    "changes": 0.16,
    "companyName": "CNO Financial Group, Inc.",
    "currency": "USD",
    "cik": "0001224608",
    "isin": "US12621E1038",
    "cusip": "12621E103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Life",
    "website": "https://www.cnoinc.com",
    "description": "CNO Financial Group, Inc., through its subsidiaries, develops, markets, and administers health insurance, annuity, individual life insurance, and other insurance products for senior and middle-income markets in the United States. It offers Medicare supplement, supplemental health, and long-term care insurance policies; life insurance; and annuities, as well as Medicare advantage plans to individuals through phone, online, mail, and face-to-face. The company also focuses on worksite and group sales for businesses, associations, and other membership groups by interacting with customers at their place of employment. In addition, it provides fixed index annuities; fixed interest annuities, including fixed rate single and flexible premium deferred annuities; single premium immediate annuities; supplemental health products, such as specified disease, accident, and hospital indemnity products; and long-term care plans primarily to retirees and older self-employed individuals in the middle-income market. Further, the company offers universal life and other interest-sensitive life products; and traditional life policies that include whole life, graded benefit life, term life, and single premium whole life products, as well as graded benefit life insurance products. CNO Financial Group, Inc. markets its products under the Bankers Life, Washington National, and Colonial Penn brand names. The company sells its products through agents, independent producers, and direct marketing. CNO Financial Group, Inc. was founded in 1979 and is headquartered in Carmel, Indiana.",
    "ceo": "Mr. Gary Chandru Bhojwani",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3400",
    "phone": "317 817 6100",
    "address": "11825 North Pennsylvania Street",
    "city": "Carmel",
    "state": "IN",
    "zip": "46032",
    "dcfDiff": 2.02801,
    "dcf": 23.442,
    "image": "https://financialmodelingprep.com/image-stock/CNO.png",
    "ipoDate": "2003-09-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]