[
  {
    "symbol": "CNP",
    "price": 28.73,
    "beta": 0.885563,
    "volAvg": 3657238,
    "mktCap": 18129462940,
    "lastDiv": 0.76,
    "range": "25.03-33.5",
    "changes": -0.48,
    "companyName": "CenterPoint Energy, Inc.",
    "currency": "USD",
    "cik": "0001130310",
    "isin": "US15189T1079",
    "cusip": "15189T107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.centerpointenergy.com",
    "description": "CenterPoint Energy, Inc. operates as a public utility holding company in the United States. The company operates through Electric and Natural Gas segments. The Electric segment includes electric transmission and distribution services to electric customers and electric generation assets, as well as assets in the wholesale power market. The Natural Gas segment provides natural gas distribution services, as well as home appliance maintenance and repair services to customers in Minnesota; and home repair protection plans to natural gas customers in Arkansas, Indiana, Mississippi, Ohio, Oklahoma, and Texas and Louisiana through a third party. This segment also engages in the sale of regulated intrastate natural gas, and transportation and storage of natural gas for residential, commercial, industrial, and transportation customers. As of December 31, 2021, it served approximately 2.7 million metered customers; owned 239 substation sites with a total installed rated transformer capacity of 71,241 megavolt amperes; operated approximately 1,00,000 linear miles of natural gas distribution and transmission mains; and owned and operated 285 miles of intrastate pipeline in Louisiana, Texas, and Oklahoma. The company was founded in 1866 and is headquartered in Houston, Texas.",
    "ceo": "Mr. David John Lesar B.Sc., C.P.A., CPA, M.B.A.",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "8986",
    "phone": "713 207 1111",
    "address": "1111 Louisiana Street",
    "city": "Houston",
    "state": "TX",
    "zip": "77002",
    "dcfDiff": 0.537668,
    "dcf": 30.2777,
    "image": "https://financialmodelingprep.com/image-stock/CNP.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]