[
  {
    "symbol": "CNS",
    "price": 56.41,
    "beta": 1.324647,
    "volAvg": 168598,
    "mktCap": 2770706893,
    "lastDiv": 2.28,
    "range": "52.34-78.87",
    "changes": -0.16,
    "companyName": "Cohen & Steers, Inc.",
    "currency": "USD",
    "cik": "0001284812",
    "isin": "US19247A1007",
    "cusip": "19247A100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.cohenandsteers.com",
    "description": "Cohen & Steers, Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides its services to institutional investors, including pension funds, endowments, and foundations. It manages separate client-focused equity, fixed income, multi-asset, and commodity portfolios through its subsidiaries. The firm launches and manages equity, fixed income, balanced, and multi-asset mutual funds through its subsidiaries. Through its subsidiaries, it also launches and manages hedge funds. The firm invests in public equity, fixed income, and commodity markets across the globe through its subsidiaries. Through its subsidiaries, it invests in companies operating in the real estate sector, including real estate investment trusts, infrastructure sector, and natural energy resources sector for its equity and fixed income investments. The firm also invests in preferred securities for its fixed income investments through its subsidiaries. Cohen & Steers, Inc. was founded in 1986 and is based in New York, with additional offices in London, United Kingdom; Central, Hong Kong; Tokyo, Japan; and Seattle, Washington.",
    "ceo": "Mr. Joseph Martin Harvey",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "388",
    "phone": "800 330 7348",
    "address": "280 Park Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10017",
    "dcfDiff": 1.28761,
    "dcf": 69.7924,
    "image": "https://financialmodelingprep.com/image-stock/CNS.png",
    "ipoDate": "2004-08-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]