[
  {
    "symbol": "CNX",
    "price": 17.33,
    "beta": 1.317253,
    "volAvg": 2845804,
    "mktCap": 2869432080,
    "lastDiv": 5.2316600000000015,
    "range": "14.36-19.76",
    "changes": 0.08,
    "companyName": "CNX Resources Corporation",
    "currency": "USD",
    "cik": "0001070412",
    "isin": "US12653C1080",
    "cusip": "12653C108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas E&P",
    "website": "https://www.cnx.com",
    "description": "CNX Resources Corporation, an independent natural gas and midstream company, acquires, explores for, develops, and produces natural gas properties in the Appalachian Basin. The company operates in two segments, Shale and Coalbed Methane. It produces and sells pipeline quality natural gas primarily for gas wholesalers. The company owns rights to extract natural gas in Pennsylvania, West Virginia, and Ohio from approximately 526,000 net Marcellus Shale acres; and approximately 610,000 net acres of Utica Shale, as well as rights to extract natural gas from other shale and shallow oil and gas positions from approximately 1,006,000 net acres in Illinois, Indiana, New York, Ohio, Pennsylvania, Virginia, and West Virginia. It also owns rights to extract coalbed methane (CBM) in Virginia from approximately 282,000 net CBM acres in Central Appalachia, as well as 1,733,000 net CBM acres in West Virginia, Pennsylvania, Ohio, Illinois, Indiana, and New Mexico. In addition, the company designs, builds, and operates natural gas gathering systems to move gas from the wellhead to interstate pipelines or other local sales points; owns and operates approximately 2,600 miles of natural gas gathering pipelines, as well as various natural gas processing facilities. It also offers turn-key solutions for water sourcing, delivery, and disposal for its natural gas operations and for third parties. The company was formerly known as CONSOL Energy Inc. and changed its name to CNX Resources Corporation in November 2017. CNX Resources Corporation was founded in 1860 and is headquartered in Canonsburg, Pennsylvania.",
    "ceo": "Mr. Nicholas J. DeIuliis",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "441",
    "phone": "724 485 4000",
    "address": "CNX Center",
    "city": "Canonsburg",
    "state": "PA",
    "zip": "15317-6506",
    "dcfDiff": 1.09641,
    "dcf": 17.6264,
    "image": "https://financialmodelingprep.com/image-stock/CNX.png",
    "ipoDate": "1999-04-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]