[
  {
    "symbol": "COIHY",
    "price": 35.53,
    "beta": 0.681226,
    "volAvg": 6970,
    "mktCap": 9922498914,
    "lastDiv": 0.64,
    "range": "32.9-46.94",
    "changes": 0.5899,
    "companyName": "Croda International Plc",
    "currency": "USD",
    "cik": null,
    "isin": "US2270473059",
    "cusip": "227047206",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Chemicals",
    "website": "https://www.croda.com",
    "description": "Croda International Plc creates, makes, and sells specialty chemicals in Europe, the Middle East, Africa, North America, Asia, and Latin America. It operates through four segments: Consumer Care, Life Sciences, Performance Technologies, and Industrial Chemicals. The company offers adhesives; crop protection additives and adjuvants, seed enhancement and animal health chemicals, chemical bio-stimulants, and specialty additives for agricultural films; and lubricant additives, coatings and polymers, vehicle cleaning chemicals, and products for automotive textiles and fibers, as well as specialty additives for plastics, and battery and catalyst industries. It also provides specialty ingredients for self-tanning, color cosmetics, bath and shower, deodorants, anti-perspirants, depilatories, men's grooming, and oral hygiene, as well as skin, hair, sun, body, and baby care applications; construction chemicals and bitumen additives; dietary supplements; and materials and polymer additives for electronics and devices. In addition, the company offers chemistries, emulsifiers, fuel and power generation additives, and polymer additives; food additives; specialty polymer additives for furniture and wood applications; household, industrial, and institutional cleaning products; lubricants; oleochemicals; and packaging, print, and paper chemicals. Further, it provides paints and coatings; active pharmaceutical ingredients; thermal management products; plastic and rubber products; skin health products; hygiene and industrial nonwovens, botanical extracts, tissues, and textile auxiliaries; and water treatment chemicals. Additionally, the company offers bio-based phase change materials for buildings and ventilation, clothing and healthcare, electronics and devices, food and refrigeration, energy storage and recovery, temperature controlled packaging, and vehicles and automotive applications. The company was incorporated in 1925 and is headquartered in Goole, the United Kingdom.",
    "ceo": "Mr. Stephen Edward Foots",
    "sector": "Basic Materials",
    "country": "GB",
    "fullTimeEmployees": "5825",
    "phone": "44 1405 860551",
    "address": "Cowick Hall",
    "city": "Goole",
    "state": null,
    "zip": "DN14 9AA",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/COIHY.png",
    "ipoDate": "2012-08-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]