[
  {
    "symbol": "COKE",
    "price": 646.33,
    "beta": 0.903169,
    "volAvg": 38280,
    "mktCap": 6058497058,
    "lastDiv": 2,
    "range": "405.03-694.2",
    "changes": 1.56,
    "companyName": "Coca-Cola Consolidated, Inc.",
    "currency": "USD",
    "cik": "0000317540",
    "isin": "US1910981026",
    "cusip": "191098102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Beverages—Non-Alcoholic",
    "website": "https://www.cokeconsolidated.com",
    "description": "Coca-Cola Consolidated, Inc., together with its subsidiaries, manufactures, markets, and distributes nonalcoholic beverages primarily products of The Coca-Cola Company in the United States. The company offers sparkling beverages, such as carbonated beverages; and still beverages, including energy products, as well as noncarbonated beverages comprising bottled water, ready to drink coffee and tea, enhanced water, juices, and sports drinks. It also sells its products to other Coca-Cola bottlers; and post-mix products that are dispensed through equipment, which mixes the fountain syrup with carbonated or still water enabling fountain retailers to sell finished products to consumers in cups or glasses. In addition, the company distributes products for various other beverage brands that include Dr Pepper and Monster Energy. It sells and distributes its products directly to grocery stores, mass merchandise stores, club stores, convenience stores, and drug stores; and restaurants, schools, amusement parks, and recreational facilities, as well as through vending machine outlets. The company was formerly known as Coca-Cola Bottling Co. Consolidated and changed its name to Coca-Cola Consolidated, Inc. in January 2019. Coca-Cola Consolidated, Inc. was incorporated in 1980 and is headquartered in Charlotte, North Carolina.",
    "ceo": "Mr. J. Frank Harrison III",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "15000",
    "phone": "704 557 4400",
    "address": "4100 Coca-Cola Plaza",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28211",
    "dcfDiff": 5.63357,
    "dcf": 491.716,
    "image": "https://financialmodelingprep.com/image-stock/COKE.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]