[
  {
    "symbol": "COLB",
    "price": 20.2,
    "beta": 0.924295,
    "volAvg": 2152624,
    "mktCap": 4206710438,
    "lastDiv": 1.44,
    "range": "17.54-35.53",
    "changes": -0.32,
    "companyName": "Columbia Banking System, Inc.",
    "currency": "USD",
    "cik": "0000887343",
    "isin": "US1972361026",
    "cusip": "197236102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.columbiabank.com",
    "description": "Columbia Banking System, Inc. operates as the bank holding company for Columbia State Bank that provides a range of banking services to small and medium-sized businesses, professionals, and individuals in the United States. It offers personal banking products and services, including noninterest and interest-bearing checking, savings, money market, and certificate of deposit accounts; home mortgages for purchases and refinances, home equity loans and lines of credit, and other personal loans; debit and credit cards; and digital banking services. The company also provides business banking products and services, such as checking, savings, interest-bearing money market, and certificate of deposit accounts; agricultural, asset-based, builder, and other commercial real estate loans, as well as loans guaranteed by the small business administration; and professional banking, treasury management, merchant card, and international banking services. In addition, it offers wealth management solutions that include financial planning services, such as asset allocation, net worth analysis, estate planning and preservation, education funding, and wealth transfer; long-term care, and life and disability insurance solutions; individual retirement solutions comprising retirement planning, retirement income strategies, and traditional and Roth individual retirement accounts; and business solutions, which comprise business retirement plans, key person insurance, business succession planning, and deferred compensation plans to individuals, families, and professional businesses. Further, the company provides fiduciary, investment, and administrative trust services, such as personal and special needs trusts, estate settlement, and investment agency and charitable management. It operates a network of 153 branch locations, including 68 in the state of Washington, 59 in Oregon, 15 in Idaho, and 11 in California. The company was founded in 1993 and is headquartered in Tacoma, Washington.",
    "ceo": "Mr. Clint E. Stein",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3500",
    "phone": "253 305 1900",
    "address": "1301 A Street",
    "city": "Tacoma",
    "state": "WA",
    "zip": "98402-2156",
    "dcfDiff": 14.4264,
    "dcf": 44.4764,
    "image": "https://financialmodelingprep.com/image-stock/COLB.png",
    "ipoDate": "1992-06-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]