[
  {
    "symbol": "COLM",
    "price": 76.57,
    "beta": 0.948239,
    "volAvg": 342754,
    "mktCap": 4750418114,
    "lastDiv": 1.2,
    "range": "65.02-98.32",
    "changes": 0.28,
    "companyName": "Columbia Sportswear Company",
    "currency": "USD",
    "cik": "0001050797",
    "isin": "US1985161066",
    "cusip": "198516106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Apparel Manufacturing",
    "website": "https://www.columbia.com",
    "description": "Columbia Sportswear Company, together with its subsidiaries, designs, sources, markets, and distributes outdoor, active, and everyday lifestyle apparel, footwear, accessories, and equipment in the United States, Latin America, the Asia Pacific, Europe, the Middle East, Africa, and Canada. The company provides apparel, accessories, and equipment that are used in various activities, such as skiing, snowboarding, hiking, climbing, mountaineering, camping, hunting, fishing, trail running, water sports, yoga, golf, and adventure travel. It also offers footwear products that include lightweight hiking boots, trail running shoes, rugged cold weather boots for activities on snow and ice, sandals and shoes for use in water activities, and function-first fashion footwear and casual shoes for everyday use. The company sells its products under the Columbia, Mountain Hardwear, SOREL, and prAna brand names through the company owned network of branded and outlet retail stores, brand-specific e-commerce sites, and concession-based arrangements with third-parties at branded outlet and shop-in-shop retail locations, as well as through independently operated specialty outdoor and sporting goods stores, sporting goods chains, department store chains, Internet retailers, and international distributors. As of December 31, 2021, it operated approximately 455 retail stores. The company was founded in 1938 and is headquartered in Portland, Oregon.",
    "ceo": "Mr. Timothy P. Boyle",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "9450",
    "phone": "503 985 4000",
    "address": "14375 Northwest Science Park Drive",
    "city": "Portland",
    "state": "OR",
    "zip": "97229",
    "dcfDiff": 4.36445,
    "dcf": 95.9645,
    "image": "https://financialmodelingprep.com/image-stock/COLM.png",
    "ipoDate": "1998-03-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]