[
  {
    "symbol": "COO",
    "price": 380.5,
    "beta": 0.915492,
    "volAvg": 298251,
    "mktCap": 18837755950,
    "lastDiv": 0.06,
    "range": "244.22-395.2",
    "changes": 1.89,
    "companyName": "The Cooper Companies, Inc.",
    "currency": "USD",
    "cik": "0000711404",
    "isin": "US2166484020",
    "cusip": "216648402",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.coopercos.com",
    "description": "The Cooper Companies, Inc., together with its subsidiaries, develops, manufactures, and markets contact lens wearers. The company operates in two segments, CooperVision and CooperSurgical. The CooperVision segment offers spherical lense, including lenses that correct near and farsightedness; and toric and multifocal lenses comprising lenses correcting vision challenges, such as astigmatism, presbyopia, myopia, ocular dryness and eye fatigues in the Americas, Europe, Middle East, Africa, and Asia Pacific. The CooperSurgical segment focuses on family and women's health care, which provides medical devices, fertility, genomics, diagnostics, and contraception to health care professionals and patients worldwide. It offers surgical and office products, including PARAGARD, uterine manipulators, retractors, closure products, point of care products, LEEP products, endosee, and illuminate and fetal pillows; fertility products and services, such as fertility consumables and equipment, and embryo options and preimplantation genetic testing. The Cooper Companies, Inc. was founded in 1958 and is headquartered in San Ramon, California.",
    "ceo": "Mr. Albert G. White III",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "14000",
    "phone": "925 460 3600",
    "address": "6101 Bollinger Canyon Road",
    "city": "San Ramon",
    "state": "CA",
    "zip": "94583",
    "dcfDiff": 35.3943,
    "dcf": 309.086,
    "image": "https://financialmodelingprep.com/image-stock/COO.png",
    "ipoDate": "1983-01-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]