[
  {
    "symbol": "CORT",
    "price": 21.44,
    "beta": 0.494014,
    "volAvg": 762974,
    "mktCap": 2177832320,
    "lastDiv": 0,
    "range": "17.86-30.14",
    "changes": -0.14,
    "companyName": "Corcept Therapeutics Incorporated",
    "currency": "USD",
    "cik": "0001088856",
    "isin": "US2183521028",
    "cusip": "218352102",
    "exchange": "NASDAQ Capital Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.corcept.com",
    "description": "Corcept Therapeutics Incorporated discovers, develops, and commercializes drugs for the treatment of severe metabolic, oncologic, and neuropsychiatric disorders in the United States. The company offers Korlym (mifepristone) tablets as a once-daily oral medication for the treatment of hyperglycemia secondary to hypercortisolism in adult patients with endogenous Cushing's syndrome, who have type 2 diabetes mellitus or glucose intolerance, and have failed surgery or are not candidates for surgery. It is developing relacorilant to treat patients with Cushing's syndrome; and nab-paclitaxel in combination with relacorilant, which has completed Phase II clinical trial to treat patients with advanced ovarian tumors, as well as for the treatment of cortisol excess. The company is also developing selective cortisol modulator to treat patients with metastatic castration-resistant prostate cancer; selective cortisol modulator for the treatment of antipsychotic-induced weight gain and other disorders; and FKBP5 gene expression assays. Corcept Therapeutics Incorporated was incorporated in 1998 and is headquartered in Menlo Park, California.",
    "ceo": "Dr. Joseph K. Belanoff M.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "299",
    "phone": "650 327 3270",
    "address": "149 Commonwealth Drive",
    "city": "Menlo Park",
    "state": "CA",
    "zip": "94025",
    "dcfDiff": 3.43026,
    "dcf": 26.6903,
    "image": "https://financialmodelingprep.com/image-stock/CORT.png",
    "ipoDate": "2004-04-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]