[
  {
    "symbol": "COTY",
    "price": 12.21,
    "beta": 1.873591,
    "volAvg": 4945608,
    "mktCap": 10412651272,
    "lastDiv": 2.6750000000000003,
    "range": "6.19-12.64",
    "changes": -0.23,
    "companyName": "Coty Inc.",
    "currency": "USD",
    "cik": "0001024305",
    "isin": "US2220702037",
    "cusip": "222070203",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Household & Personal Products",
    "website": "https://www.coty.com",
    "description": "Coty Inc., together with its subsidiaries, engages in the manufacture, marketing, distribution, and sale of beauty products worldwide. The company provides prestige fragrances, skin care, and color cosmetics products through prestige retailers, including perfumeries, department stores, e-retailers, direct-to-consumer websites, and duty-free shops under the Alexander McQueen, Burberry, Bottega Veneta, Calvin Klein, Cavalli, Chloe, Davidoff, Escada, Gucci, Hugo Boss, Jil Sander, Joop!, Kylie Jenner, Lacoste, Lancaster, Marc Jacobs, Miu Miu, Nikos, philosophy, Kim Kardashian West, and Tiffany & Co. brands. It also offers mass color cosmetics, fragrance, skin care, and body care products primarily through hypermarkets, supermarkets, drug stores, pharmacies, mid-tier department stores, traditional food and drug retailers, and e-commerce retailers under the Adidas, Beckham, Biocolor, Bozzano, Bourjois, Bruno Banani, CoverGirl, Jovan, Max Factor, Mexx, Monange, Nautica, Paixao, Rimmel, Risque, Sally Hansen, Stetson, and 007 James Bond brands. Coty Inc. also sells its products through third-party distributors to approximately 150 countries and territories. The company was founded in 1904 and is based in New York, New York. Coty Inc. is a subsidiary of Cottage Holdco B.V.",
    "ceo": "Ms. Sue Y. Nabi",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "11012",
    "phone": "212 389 7300",
    "address": "350 Fifth Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10118",
    "dcfDiff": 2.02854,
    "dcf": 7.83146,
    "image": "https://financialmodelingprep.com/image-stock/COTY.png",
    "ipoDate": "2013-06-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]