[
  {
    "symbol": "CPB",
    "price": 45.32,
    "beta": 0.344366,
    "volAvg": 2459929,
    "mktCap": 13509529440,
    "lastDiv": 1.48,
    "range": "44.76-57.78",
    "changes": -0.88,
    "companyName": "Campbell Soup Company",
    "currency": "USD",
    "cik": "0000016732",
    "isin": "US1344291091",
    "cusip": "134429109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaged Foods",
    "website": "https://www.campbellsoupcompany.com",
    "description": "Campbell Soup Company, together with its subsidiaries, manufactures and markets food and beverage products the United States and internationally. The company operates through Meals & Beverages and Snacks segments. The Meals & Beverages segment engages in the retail and foodservice businesses in the United States and Canada. This segment provides Campbell's condensed and ready-to-serve soups; Swanson broth and stocks; Pacific Foods broth, soups, and non-dairy beverages; Prego pasta sauces; Pace Mexican sauces; Campbell's gravies, pasta, beans, and dinner sauces; Swanson canned poultry; Plum baby food and snacks; V8 juices and beverages; and Campbell's tomato juice. The Snacks segment retails Pepperidge Farm cookies, crackers, fresh bakery, and frozen products; Milano cookies and Goldfish crackers; and Snyder's of Hanover pretzels, Lance sandwich crackers, Cape Cod and Kettle Brand potato chips, Late July snacks, Snack Factory Pretzel Crisps, Pop Secret popcorn, Emerald nuts, and other snacking products. This segment is also involved in the retail business in Latin America. It sells its products through retail food chains, mass discounters and merchandisers, club stores, convenience stores, drug stores, and dollar stores, as well as e-commerce and other retail, commercial, and non-commercial establishments, and independent contractor distributors. The company was founded in 1869 and is headquartered in Camden, New Jersey.",
    "ceo": "Mr. Mark A. Clouse",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "14700",
    "phone": "856 342 4800",
    "address": "1 Campbell Place",
    "city": "Camden",
    "state": "NJ",
    "zip": "08103-1799",
    "dcfDiff": 1.28623,
    "dcf": 52.4162,
    "image": "https://financialmodelingprep.com/image-stock/CPB.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]