[
  {
    "symbol": "CPK",
    "price": 118.4,
    "beta": 0.608098,
    "volAvg": 76462,
    "mktCap": 2106324160,
    "lastDiv": 2.36,
    "range": "105.79-138.49",
    "changes": -3.48,
    "companyName": "Chesapeake Utilities Corporation",
    "currency": "USD",
    "cik": "0000019745",
    "isin": "US1653031088",
    "cusip": "165303108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Gas",
    "website": "https://www.chpk.com",
    "description": "Chesapeake Utilities Corporation operates as an energy delivery company. The company operates through two segments, Regulated Energy and Unregulated Energy. The Regulated Energy segment engages in the natural gas distribution operations in central and southern Delaware, Maryland's eastern shore, and Florida; regulated natural gas transmission in the Delmarva Peninsula and Florida; and regulated electric distribution in northeast and northwest Florida. The Unregulated Energy segment engages in the propane operations in the Mid-Atlantic region, North Carolina, South Carolina, and Florida; unregulated natural gas transmission/supply operation in central and eastern Ohio; generation of electricity and steam; and provision of compressed natural gas, liquefied natural gas, and renewable natural gas transportation and pipeline solutions primarily to utilities and pipelines in the eastern United States. This segment also provides other unregulated energy services, such as energy-related merchandise sales; heating, ventilation, and air conditioning services; and plumbing and electrical services. The company was founded in 1859 and is headquartered in Dover, Delaware.",
    "ceo": "Mr. Jeffry M. Householder",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "1034",
    "phone": "302 734 6799",
    "address": "909 Silver Lake Boulevard",
    "city": "Dover",
    "state": "DE",
    "zip": "19904",
    "dcfDiff": 5.52329,
    "dcf": 118.797,
    "image": "https://financialmodelingprep.com/image-stock/CPK.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]