[
  {
    "symbol": "CPRI",
    "price": 35.55,
    "beta": 2.298943,
    "volAvg": 2469679,
    "mktCap": 4172752350,
    "lastDiv": 0,
    "range": "34.25-69.25",
    "changes": -0.92,
    "companyName": "Capri Holdings Limited",
    "currency": "USD",
    "cik": "0001530721",
    "isin": "VGG1890L1076",
    "cusip": "G1890L107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Luxury Goods",
    "website": "https://www.capriholdings.com",
    "description": "Capri Holdings Limited designs, markets, distributes, and retails branded women's and men's apparel, footwear, and accessories in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia. It operates through three segments: Versace, Jimmy Choo, and Michael Kors. The company offers ready-to-wear, accessories, footwear, handbags, scarves and belts, small leather goods, eyewear, watches, jewelry, fragrances, and home furnishings through a distribution network, including boutiques, department, and specialty stores, as well as through e-commerce sites. It also licenses Versace brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of jeans, fragrances, watches, eyewear, and home furnishings. The company was formerly known as Michael Kors Holdings Limited and changed its name to Capri Holdings Limited in December 2018. Capri Holdings Limited was founded in 1981 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. John D. Idol",
    "sector": "Consumer Cyclical",
    "country": "GB",
    "fullTimeEmployees": "10400",
    "phone": "44 20 7632 8600",
    "address": "33 Kingsway",
    "city": "London",
    "state": null,
    "zip": "WC2B 6UF",
    "dcfDiff": 12.0318,
    "dcf": 52.6082,
    "image": "https://financialmodelingprep.com/image-stock/CPRI.png",
    "ipoDate": "2011-12-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]