[
  {
    "symbol": "CPRT",
    "price": 89.71,
    "beta": 1.224647,
    "volAvg": 2207419,
    "mktCap": 42831142400,
    "lastDiv": 0,
    "range": "52.285-90.34",
    "changes": 0.73,
    "companyName": "Copart, Inc.",
    "currency": "USD",
    "cik": "0000900075",
    "isin": "US2172041061",
    "cusip": "217204106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Auto & Truck Dealerships",
    "website": "https://www.copart.com",
    "description": "Copart, Inc. provides online auctions and vehicle remarketing services in the United States, Canada, the United Kingdom, Brazil, the Republic of Ireland, Germany, Finland, the United Arab Emirates, Oman, Bahrain, and Spain. It offers a range of services for processing and selling vehicles over the internet through its virtual bidding third generation internet auction-style sales technology to vehicle sellers, insurance companies, banks and finance companies, charities, fleet operators, dealers, vehicle rental companies, and individuals. The company's services include online seller access, salvage estimation, estimating, end-of-life vehicle processing, virtual insured exchange, transportation, vehicle inspection stations, on-demand reporting, title processing and procurement, loan payoff, flexible vehicle processing programs, buy it now, member network, sales process, and dealer services. Its services also comprise services to sell vehicles through CashForCars.com; U-Pull-It service that allows buyer to remove valuable parts and sell the remaining parts and car body; copart 360, an online technology for posting vehicle images; membership tiers for those registering to buy vehicles through Copart.com; and virtual queue to secure a place in line while visiting one of its locations. The company sells its products principally to licensed vehicle dismantlers, rebuilders, repair licensees, used vehicle dealers, and exporters, as well as to the public. The company was incorporated in 1982 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. A. Jayson Adair",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "9500",
    "phone": "972 391 5000",
    "address": "14185 Dallas Parkway",
    "city": "Dallas",
    "state": "TX",
    "zip": "75254",
    "dcfDiff": 1.36248,
    "dcf": 68.4425,
    "image": "https://financialmodelingprep.com/image-stock/CPRT.png",
    "ipoDate": "1994-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]