[
  {
    "symbol": "CR",
    "price": 84.58,
    "beta": 1.476408,
    "volAvg": 420012,
    "mktCap": 4798240316,
    "lastDiv": 0.72,
    "range": "67.28-86.06",
    "changes": 1.17,
    "companyName": "Crane Company",
    "currency": "USD",
    "cik": "0000025445",
    "isin": "US2243991054",
    "cusip": "224441105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.craneco.com",
    "description": "Crane Company, together with its subsidiaries, manufactures and sells engineered industrial products in the Americas, Europe, the Middle East, Asia, and Australia. The company has four business segments: Aerospace & Electronics, Process Flow Technologies, Payment & Merchandising Technologies, and Engineered Materials. The Aerospace & Electronics segment supplies critical components and systems, including original equipment and aftermarket parts, primarily for the commercial aerospace, and the military aerospace, defense, and space markets. This segment also offers pressure sensors for aircraft engine control, aircraft braking systems for fighter jets, power conversion solutions for spacecraft, and lubrication systems. The Process Flow Technologies segment provides engineered fluid handling equipment for mission critical applications. It offers process valves and related products, commercial valves, and pumps and systems. The Payment & Merchandising Technologies segment provides electronic equipment and associated software leveraging extensive, and proprietary core capabilities, including payment verification and authentication, as well as automation solutions, field service solutions, remote diagnostics, and productivity enhancing software solutions. The Engineered Materials segment manufactures fiberglass-reinforced plastic panels and coils, primarily for use in the manufacturing of recreational vehicles and in commercial and industrial buildings applications. It provides products and solutions to customers across end markets, including aerospace, defense, chemical and pharmaceutical, water and wastewater, payment automation, non-residential and municipal construction, energy, and banknote design and production, as well as for a range of general industrial and consumer applications. The company was formerly known as Crane Holdings, Co. Crane Company was founded in 1855 and is based in Stamford, Connecticut.",
    "ceo": "Mr. Max H. Mitchell",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "7000",
    "phone": "203 363 7300",
    "address": "100 First Stamford Place",
    "city": "Stamford",
    "state": "CT",
    "zip": "06902",
    "dcfDiff": 1.24554,
    "dcf": 112.134,
    "image": "https://financialmodelingprep.com/image-stock/CR.png",
    "ipoDate": "2023-03-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]