[
  {
    "symbol": "CRARY",
    "price": 5.76,
    "beta": 1.655555,
    "volAvg": 158672,
    "mktCap": 34844427878,
    "lastDiv": 0.56,
    "range": "3.92-6.42",
    "changes": -0.01,
    "companyName": "Crédit Agricole S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US2253131054",
    "cusip": "225313105",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.credit-agricole.com",
    "description": "Crédit Agricole S.A. provides retail, corporate, insurance, and investment banking products and services worldwide. It operates through Asset Gathering; Large Customers; Specialised Financial Services; French Retail Banking - LCL; and International Retail Banking. The company offers banking products and services, including savings and current accounts and deposits, finance, payments, and flow management services; consumer finance products; and banking and specialized financial services. It also provides wealth management services that allow individual customers to manage, protect, and transfer their assets, as well as other asset management services; and savings/retirement, death and disability/creditor/group, and property and casualty insurance products. In addition, the company offers financing solutions for property and equipment investment and renewal requirements; trade receivable financing and management solutions for corporates; and financing services for renewable energy and public infrastructure projects, as well as leasing services. Further, it provides investment banking, structured finance, international trade finance, commercial banking, capital market, and syndication services; and asset servicing solutions for investment products, as well as various asset classes, such as execution, clearing, forex, security lending and borrowing, custody, depositary bank, fund administration, middle-office outsourcing solutions, and fund distribution support and issuer services. The company serves retail customers, corporates, banks and financial institutions, government agencies, and local authorities. Crédit Agricole S.A. was founded in 1894 and is headquartered in Montrouge, France. Crédit Agricole S.A. operates as a subsidiary of SAS Rue La Boétie.",
    "ceo": "Mr. Philippe  Brassac",
    "sector": "Financial Services",
    "country": "FR",
    "fullTimeEmployees": "71652",
    "phone": "33 1 43 23 52 02",
    "address": "12 place des Etats-Unis",
    "city": "Montrouge",
    "state": null,
    "zip": "92127",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CRARY.png",
    "ipoDate": "2009-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]