[
  {
    "symbol": "CRBG",
    "price": 17.25,
    "beta": 0,
    "volAvg": 2588409,
    "mktCap": 11180501664,
    "lastDiv": 0.92,
    "range": "14.01-23.5",
    "changes": 0.04,
    "companyName": "Corebridge Financial, Inc.",
    "currency": "USD",
    "cik": "0001889539",
    "isin": "US21871X1090",
    "cusip": "21871X109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.corebridgefinancial.com",
    "description": "Corebridge Financial, Inc. provides retirement solutions and insurance products in the United States. It operates through Individual Retirement, Group Retirement, Life Insurance, and Institutional Markets segments. The Individual Retirement segment provides fixed annuities, fixed index annuities, variable annuities and retail mutual funds. The Group Retirement segment offers record-keeping services, plan administration and compliance services, and financial planning and advisory solutions to employer-defined contribution plans and their participants, as well as proprietary and non-proprietary annuities, advisory services, and brokerage products. The Life Insurance segment offers term life and universal life insurance in the United States, as well as issues individual life, whole life, and group life insurance in the United Kingdom; and distributes medical insurance in Ireland. The Institutional Markets segment provides stable value wraps, structured settlement and pension risk transfer annuities, corporate and bank owned life insurance, high net worth products, and guaranteed investment contracts. The company was formerly known as SAFG Retirement Services, Inc. Corebridge Financial, Inc. was incorporated in 1998 and is headquartered in Houston, Texas. Corebridge Financial, Inc. operates as a subsidiary of American International Group, Inc.",
    "ceo": "Mr. Kevin Timothy Hogan",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": null,
    "phone": "877 375 2422",
    "address": "2919 Allen Parkway",
    "city": "Houston",
    "state": "TX",
    "zip": "77019",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CRBG.png",
    "ipoDate": "2022-09-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]