[
  {
    "symbol": "CRCT",
    "price": 14.2,
    "beta": -0.029433,
    "volAvg": 297920,
    "mktCap": 3272986301,
    "lastDiv": 1.35,
    "range": "5.91-17.89",
    "changes": -0.1,
    "companyName": "Cricut, Inc.",
    "currency": "USD",
    "cik": "0001828962",
    "isin": "US22658D1000",
    "cusip": "22658D100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Computer Hardware",
    "website": "https://cricut.com",
    "description": "Cricut, Inc. designs and markets a creativity platform that enables users to turn ideas into professional-looking handmade goods. It operates in three segments: Connected Machines, Subscriptions, and Accessories and Materials. The company offers connected machines, design apps, and accessories and materials for users to create personalized birthday cards, mugs, T-shirts, and large-scale interior decorations. Its connected machines include Cricut Joy, Cricut Explore, and Cricut Maker to cut, write, score, and create decorative effects using various materials, such as paper, vinyl, leather, and others; and design apps comprise Design Space app and Cricut Joy-specific app. The company also provides Cricut Access and Cricut Access Premium subscription offerings, and in-app purchases; and a software that integrates its connected machines and design apps. In addition, it offers a range of accessories and materials, such as Cricut EasyPress, Cricut Mug Press, various hand tools, machine replacement tools and blades, and project materials. The company offers its products through its third-party brick-and-mortar and online retail partners; and its website cricut.com, as well as through a network of distributors. It operates in the United States, the United Kingdom, Ireland, Australia, New Zealand, and Western Europe, as well as the Middle East, Latin America, South Africa, and Asia. The company was formerly known as Provo Craft & Novelty, Inc. and changed its name to Cricut, Inc. in March 2018. The company was incorporated in 1969 and is headquartered in South Jordan, Utah.",
    "ceo": "Mr. Ashish  Arora",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "690",
    "phone": "385 351 0633",
    "address": "10855 South River Front Parkway",
    "city": "South Jordan",
    "state": "UT",
    "zip": "84095",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CRCT.png",
    "ipoDate": "2021-03-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]