[
  {
    "symbol": "CRH",
    "price": 55.06,
    "beta": 0.87318,
    "volAvg": 898983,
    "mktCap": 40182844381,
    "lastDiv": 1.27,
    "range": "31.22-55.3",
    "changes": 0.49,
    "companyName": "CRH plc",
    "currency": "USD",
    "cik": "0000849395",
    "isin": "US12626K2033",
    "cusip": "12626K203",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Materials",
    "website": "https://www.crh.com",
    "description": "CRH plc, through its subsidiaries, manufactures and distributes building materials. It operates in three segments: Americas Materials, Europe Materials, and Building Products. The company manufactures and supplies cement, lime, aggregates, precast, ready mixed concrete, and asphalt products; concrete masonry and hardscape products comprising pavers, blocks and kerbs, retaining walls, and related patio products; and glass and glazing products, including architectural glass, custom-engineered curtain and window walls, architectural windows, storefront systems, doors, skylights, and architectural hardware. It also offers precast concrete and polymer-based products, such as underground vaults, drainage pipes and structures, utility enclosures, and modular precast structures to the water, energy, communication, transportation, and building structures markets; and construction accessories, such as anchoring, fixing, and connection solutions, as well as lifting systems, formwork accessories, and other accessories used in construction applications. In addition, the company offers network access products, which include composite access chambers, covers, passive safety systems, retention sockets, sealants, and meter boxes; and paving and construction services. Further, it provides building and civil engineering contracting, contract surfacing, operates logistics and owned railway infrastructure; sells and distributes cement; and supplies access chambers and ducting products. It serves governments, contractors, homebuilders, homeowners, and sub-contractors. The company operates primarily in the Republic of Ireland, the United Kingdom, the rest of Europe, the United States, and internationally. CRH plc was founded in 1936 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Albert Jude Manifold FCPA, MBA, MBS",
    "sector": "Basic Materials",
    "country": "IE",
    "fullTimeEmployees": "75800",
    "phone": "353 1 404 1000",
    "address": "Stonemason’s Way",
    "city": "Dublin",
    "state": null,
    "zip": "16",
    "dcfDiff": 0.475942,
    "dcf": 46.9459,
    "image": "https://financialmodelingprep.com/image-stock/CRH.png",
    "ipoDate": "1989-07-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]