[
  {
    "symbol": "CRI",
    "price": 69.12,
    "beta": 1.233098,
    "volAvg": 796867,
    "mktCap": 2605022208,
    "lastDiv": 3,
    "range": "60.66-86.76",
    "changes": -0.25,
    "companyName": "Carter's, Inc.",
    "currency": "USD",
    "cik": "0001060822",
    "isin": "US1462291097",
    "cusip": "146229109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Apparel Retail",
    "website": "https://www.carters.com",
    "description": "Carter's, Inc., together with its subsidiaries, designs, sources, and markets branded childrenswear under the Carter's, OshKosh, Skip Hop, Child of Mine, Just One You, Simple Joys, Carter's My First Love, little planet, and other brands in the United States and internationally. The company operates through three segments: U.S. Retail, U.S. Wholesale, and International. Its Carter's products include babies and young children products, such as bodysuits, pants, dresses, knit sets, blankets, layette essentials, bibs, booties, sleep and play products, rompers, and jumpers; and OshKosh brand products comprise playclothes, such as denim apparel products with multiple wash treatments and coordinating garments, overalls, woven bottoms, knit tops, and bodysuits. The company also provides products for playtime, travel, mealtime, bathtime, and homegear, as well as kid's bags and diaper bags under the Skip Hop brand. In addition, it offers bedding, cribs, diaper bags, footwear, gift sets, hair accessories, jewelry, outerwear, paper goods, socks, shoes, swimwear, and toys. The company operates 18,800 wholesale locations, including department stores, national chain stores, and specialty stores. As of December 31, 2021, it operated 980 retail stores. The company also sells its products through its eCommerce websites, such as carters.com, oshkoshbgosh.com, oshkosh.com, and skiphop.com, as well as other international wholesale accounts and licensees. Carter's, Inc. was founded in 1865 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. Michael D. Casey",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "15500",
    "phone": "678 791 1000",
    "address": "Phipps Tower",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30326",
    "dcfDiff": 14.9112,
    "dcf": 96.2312,
    "image": "https://financialmodelingprep.com/image-stock/CRI.png",
    "ipoDate": "2003-10-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]