[
  {
    "symbol": "CRM",
    "price": 212.17,
    "beta": 1.236267,
    "volAvg": 6645864,
    "mktCap": 206653580000,
    "lastDiv": 0,
    "range": "126.34-225.0",
    "changes": 3.35,
    "companyName": "Salesforce, Inc.",
    "currency": "USD",
    "cik": "0001108524",
    "isin": "US79466L3024",
    "cusip": "79466L302",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.salesforce.com",
    "description": "Salesforce, Inc. provides customer relationship management technology that brings companies and customers together worldwide. Its Customer 360 platform empowers its customers to work together to deliver connected experiences for their customers. The company's service offerings include Sales to store data, monitor leads and progress, forecast opportunities, gain insights through analytics and relationship intelligence, and deliver quotes, contracts, and invoices; and Service that enables companies to deliver trusted and highly personalized customer service and support at scale. Its service offerings also comprise flexible platform that enables companies of various sizes, locations, and industries to build business apps to bring them closer to their customers with drag-and-drop tools; online learning platform that allows anyone to learn in-demand Salesforce skills; and Slack, a system of engagement. In addition, the company's service offerings include Marketing offering that enables companies to plan, personalize, and optimize one-to-one customer marketing journeys; and Commerce offering, which empowers brands to unify the customer experience across mobile, web, social, and store commerce points. Further, its service offerings comprise Tableau, an end-to-end analytics solution serving various enterprise use cases; and MuleSoft, an integration offering that allows its customers to unlock data across their enterprise. The company provides its service offering for customers in financial services, healthcare and life sciences, manufacturing, and other industries. It also offers professional services; and in-person and online courses to certify its customers and partners on architecting, administering, deploying, and developing its service offerings. The company provides its services through direct sales; and consulting firms, systems integrators, and other partners. Salesforce, Inc. was incorporated in 1999 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Marc R. Benioff",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "79390",
    "phone": "415 901 7000",
    "address": "Salesforce Tower",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94105",
    "dcfDiff": 14.0601,
    "dcf": 150.46,
    "image": "https://financialmodelingprep.com/image-stock/CRM.png",
    "ipoDate": "2004-06-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]