[
  {
    "symbol": "CRPJY",
    "price": 34.1294,
    "beta": 0.706896,
    "volAvg": 33,
    "mktCap": 10945162062,
    "lastDiv": 1.12,
    "range": "22.46-34.13",
    "changes": 0,
    "companyName": "China Resources Power Holdings Company Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Utilities—Independent Power Producers",
    "website": "https://www.cr-power.com",
    "description": "China Resources Power Holdings Company Limited, an investment holding company, invests in, develops, operates, and manages power plants and coal mines in the People's Republic of China. The company operates in two segments, Thermal Power and Renewable Energy. It operates and manages coal- and gas-fired power plants, wind farms, photovoltaic power plants, hydro-electric power plants, and other clean and renewable energy projects. As of December 31, 2021, the company had 37 coal-fired power plants, 141 wind farms, 31 photovoltaic power plants, 2 hydroelectric plants, and 4 gas-fired plants with total attributable operational generation capacity of 47,997 MW. It also engages in coal mining activities; and undertakes combined generation of heat and power, coal-electricity integration, and other projects. In addition, the company is involved in the distribution of energy, power sale, intelligent energy, coal mining, and other areas; and distribution network construction and operation, distributed energy resource, and other businesses. The company was founded in 2001 and is based in Wan Chai, Hong Kong. China Resources Power Holdings Company Limited is a subsidiary of CRH (Power) Limited.",
    "ceo": "Mr. Baofeng  Shi",
    "sector": "Utilities",
    "country": "HK",
    "fullTimeEmployees": "22340",
    "phone": "852 2593 7530",
    "address": "China Resources Building",
    "city": "Wan Chai",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CRPJY.png",
    "ipoDate": "2010-04-28",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]