[
  {
    "symbol": "CRRFY",
    "price": 3.84,
    "beta": 0.550191,
    "volAvg": 227756,
    "mktCap": 14118259261,
    "lastDiv": 0.12,
    "range": "2.72-4.21",
    "changes": 0.1,
    "companyName": "Carrefour SA",
    "currency": "USD",
    "cik": null,
    "isin": "US1444302046",
    "cusip": "144430204",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Grocery Stores",
    "website": "https://www.carrefour.com",
    "description": "Carrefour SA operates stores in various formats and channels in France, Spain, Italy, Belgium, Poland, Romania, Brazil, Argentina, and Taiwan. The company operates hypermarkets, supermarkets, convenience stores, cash and carry stores, and hypercash stores; e-commerce sites; and service stations. Its stores offer fresh produce; local products; consumer goods; and non-food products, including electronic and household appliances, textiles, and childcare products. The company is also involved in banking, insurance, property development, and franchise activities; the provision of travel agency services; and the rental of shopping malls. As of December 31. 2021, it operated 253 hypermarkets, 1,043 supermarkets, 4,330 convenience stores, 147 cash and carry outlets, and 26 soft discount stores in France; 457 hypermarkets, 1,926 supermarkets, 3,430 convenience stores, 12 cash and carry outlets, and 81 soft discount stores in rest of Europe; 184 hypermarkets, 151 supermarkets, 558 convenience stores, 259 cash and carry outlets, and one soft discount store in Argentina and Brazil; and 70 hypermarkets, four supermarkets, and 274 convenience stores in Taiwan, as well as 688 stores through local franchisee partners in Middle East, Africa, etc. Carrefour SA was founded in 1959 and is based in Massy, France.",
    "ceo": "Mr. Alexandre  Bompard",
    "sector": "Consumer Defensive",
    "country": "FR",
    "fullTimeEmployees": "346666",
    "phone": "33 1 64 50 50 00",
    "address": "93, avenue de Paris",
    "city": "Massy",
    "state": null,
    "zip": "91300",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CRRFY.png",
    "ipoDate": "2008-10-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]