[
  {
    "symbol": "CRSP",
    "price": 57.16,
    "beta": 1.658098,
    "volAvg": 1402585,
    "mktCap": 4511930545,
    "lastDiv": 0,
    "range": "38.94-86.95",
    "changes": 1.34,
    "companyName": "CRISPR Therapeutics AG",
    "currency": "USD",
    "cik": "0001674416",
    "isin": "CH0334081137",
    "cusip": "H17182108",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.crisprtx.com",
    "description": "CRISPR Therapeutics AG, a gene editing company, focuses on developing gene-based medicines for serious diseases using its proprietary Clustered Regularly Interspaced Short Palindromic Repeats (CRISPR)/CRISPR-associated protein 9 (Cas9) platform. Its CRISPR/Cas9 is a gene editing technology that allows for precise directed changes to genomic DNA. The company has a portfolio of therapeutic programs across a range of disease areas, including hemoglobinopathies, oncology, regenerative medicine, and rare diseases. The company's lead product candidate is CTX001, an ex vivo CRISPR gene-edited therapy for treating patients suffering from transfusion-dependent beta-thalassemia or severe sickle cell disease in which a patient's hematopoietic stem cells are engineered to produce high levels of fetal hemoglobin in red blood cells. It also develops CTX110, a donor-derived gene-edited allogeneic CAR-T investigational therapy targeting cluster of differentiation 19 positive malignancies; CTX120, a donor-derived gene-edited allogeneic CAR-T investigational therapy targeting B-cell maturation antigen for the treatment of relapsed or refractory multiple myeloma; and CTX130, a donor-derived gene-edited allogeneic CAR-T investigational therapy targeting Cluster of Differentiation 70 to treat various solid tumors and hematologic malignancies. In addition, the company develops VCTX210, a gene-edited immune-evasive stem cell-derived product candidate for the treatment of treatment of type 1 diabetes; and pursues various in vivo gene-editing programs that target the liver, lung, muscle, and central nervous system diseases. It has strategic partnerships with Bayer Healthcare LLC, Vertex Pharmaceuticals Incorporated, ViaCyte, Inc., Nkarta, Inc., and Capsida Biotherapeutics. CRISPR Therapeutics AG was incorporated in 2013 and is headquartered in Zug, Switzerland.",
    "ceo": "Dr. Samarth  Kulkarni Ph.D.",
    "sector": "Healthcare",
    "country": "CH",
    "fullTimeEmployees": "458",
    "phone": "41 41 561 32 77",
    "address": "Baarerstrasse 14",
    "city": "Zug",
    "state": null,
    "zip": "6300",
    "dcfDiff": 16.756,
    "dcf": 69.536,
    "image": "https://financialmodelingprep.com/image-stock/CRSP.png",
    "ipoDate": "2016-10-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]