[
  {
    "symbol": "CRUS",
    "price": 78.74,
    "beta": 0.967253,
    "volAvg": 610690,
    "mktCap": 4307676424,
    "lastDiv": 0,
    "range": "61.94-111.15",
    "changes": 0.12,
    "companyName": "Cirrus Logic, Inc.",
    "currency": "USD",
    "cik": "0000772406",
    "isin": "US1727551004",
    "cusip": "172755100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.cirrus.com",
    "description": "Cirrus Logic, Inc., a fabless semiconductor company, provides low-power and high-precision mixed-signal processing solutions in the United States and internationally. It offers portable products, including codecs components that integrate analog-to-digital converters (ADCs) and digital-to-analog converters (DACs) into a single integrated circuit (IC); smart codecs, a codec with digital signal processer; boosted amplifiers; digital signal processors; and SoundClear technology, which consists of a portfolio of tools, software, and algorithms that helps to enhance user experience with features, such as louder, high-fidelity sound, audio playback, voice capture, hearing augmentation, and active noise cancellation. The company's audio products are used in smartphones, tablets, wireless headsets, laptops, AR/VR headsets, home theater systems, automotive entertainment systems, and professional audio systems. It also provides high-performance mixed-signal products, such as haptic driver and sensing solutions, camera controllers, power conversion, and control ICs and fast-charging ICs used in various industrial and energy applications comprising digital utility meters, power supplies, energy control, energy measurement, and energy exploration. The company markets and sells its products through direct sales force, external sales representatives, and distributors. Cirrus Logic, Inc. was incorporated in 1984 and is headquartered in Austin, Texas.",
    "ceo": "Mr. John M. Forsyth",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1702",
    "phone": "512 851 4000",
    "address": "800 West 6th Street",
    "city": "Austin",
    "state": "TX",
    "zip": "78701",
    "dcfDiff": 9.64712,
    "dcf": 80.0529,
    "image": "https://financialmodelingprep.com/image-stock/CRUS.png",
    "ipoDate": "1989-06-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]