[
  {
    "symbol": "CRVL",
    "price": 193.4,
    "beta": 1.074295,
    "volAvg": 40777,
    "mktCap": 3315262800,
    "lastDiv": 0,
    "range": "132.48-221.82",
    "changes": -1.85,
    "companyName": "CorVel Corporation",
    "currency": "USD",
    "cik": "0000874866",
    "isin": "US2210061097",
    "cusip": "221006109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Insurance Brokers",
    "website": "https://www.corvel.com",
    "description": "CorVel Corporation provides workers' compensation, auto, liability, and health solutions for employers, third party administrators, insurance companies, and government agencies to assist them in managing the medical costs and monitoring the quality of care associated with healthcare claims. It applies technology, including artificial intelligence, machine learning, and natural language processing to enhance the managing of episodes of care and the related health care costs. The company offers network solutions services, including automated medical fee auditing, preferred provider management and reimbursement services, retrospective utilization review, facility claim review, professional review, pharmacy services, directed care services, Medicare solutions, clearinghouse services, independent medical examinations, and inpatient medical bill review. It also provides a range of patient management services, such as claims management, case management, 24/7 nurse triage, utilization management, vocational rehabilitation, and life care planning, as well as processing of claims for self-insured payors with respect to property and casualty insurance. The company was incorporated in 1987 and is headquartered in Fort Worth, Texas.",
    "ceo": "Mr. Michael G. Combs",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4444",
    "phone": "817 390 1416",
    "address": "5128 Apache Plume Road",
    "city": "Fort Worth",
    "state": "TX",
    "zip": "76109",
    "dcfDiff": 17.4311,
    "dcf": 154.089,
    "image": "https://financialmodelingprep.com/image-stock/CRVL.png",
    "ipoDate": "1991-06-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]