[
  {
    "symbol": "CSCO",
    "price": 50.87,
    "beta": 0.986619,
    "volAvg": 18848048,
    "mktCap": 207298300572,
    "lastDiv": 1.56,
    "range": "38.6-52.56",
    "changes": 0.01,
    "companyName": "Cisco Systems, Inc.",
    "currency": "USD",
    "cik": "0000858877",
    "isin": "US17275R1023",
    "cusip": "17275R102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Communication Equipment",
    "website": "https://www.cisco.com",
    "description": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. It provides infrastructure platforms, including networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities, and transport and/or store data. The company also offers collaboration products comprising unified communications, Cisco TelePresence, and conferencing, as well as the Internet of Things and analytics software. In addition, it provides security products, such as network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products. Further, the company offers a range of service and support options for its customers, including technical support and advanced services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with other companies. Cisco Systems, Inc. was incorporated in 1984 and is headquartered in San Jose, California.",
    "ceo": "Mr. Charles H. Robbins",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "83300",
    "phone": "408 526 4000",
    "address": "170 West Tasman Drive",
    "city": "San Jose",
    "state": "CA",
    "zip": "95134",
    "dcfDiff": 1.27596,
    "dcf": 49.786,
    "image": "https://financialmodelingprep.com/image-stock/CSCO.png",
    "ipoDate": "1990-02-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]