[
  {
    "symbol": "CSGP",
    "price": 89.33,
    "beta": 0.882394,
    "volAvg": 2147109,
    "mktCap": 36494789585,
    "lastDiv": 0,
    "range": "57.54-91.31",
    "changes": -0.59,
    "companyName": "CoStar Group, Inc.",
    "currency": "USD",
    "cik": "0001057352",
    "isin": "US22160N1090",
    "cusip": "22160N109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Real Estate Services",
    "website": "https://www.costargroup.com",
    "description": "CoStar Group, Inc. provides information, analytics, and online marketplace services to the commercial real estate, hospitality, residential, and related professionals industries in the United States, Canada, Europe, the Asia Pacific, and Latin America. It offers CoStar Property that provides inventory of office, industrial, retail, multifamily, hospitality, and student housing properties and land; CoStar COMPS, a robust database of comparable commercial real estate sales transactions; CoStar Market Analytics to view and report on aggregated market and submarket trends; and CoStar Tenant, an online business-to-business prospecting and analytical tool that provides tenant information. The company also provides Lease Comps and Analysis, a tool to capture, manage, and maintain lease data; CoStar Lease Analysis; Public Record, a searchable database of commercially-zoned parcels; CoStar Real Estate Manager, a real estate lease administration, portfolio management, and lease accounting compliance software solution; and CoStar Risk Analytics and CoStar Investment. In addition, it offers apartment marketing sites, such as ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, WestsideRentals.com, AFTER55.com, CorporateHousing.com, ForRentUniversity.com, Apartamentos.com, and Off Campus Partners; LoopNet Premium Lister; LoopNet Diamond, Platinum, and Gold Ads; LandsofAmerica.com, LandAndFarm.com, and LandWatch.com for rural land for-sale; BizBuySell.com, BizQuest.com, and FindaFranchise.com for operating businesses and franchises for-sale; Ten-X, an online auction platform for commercial real estate; and HomeSnap, an online and mobile software platform, as well as Homes.com, a homes for sale listings site. CoStar Group, Inc. was founded in 1987 and is headquartered in Washington, the District of Columbia.",
    "ceo": "Mr. Andrew C. Florance",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "5653",
    "phone": "202 346 6500",
    "address": "1331 L Street, NW",
    "city": "Washington",
    "state": "DC",
    "zip": "20005",
    "dcfDiff": 12.4863,
    "dcf": 90.2663,
    "image": "https://financialmodelingprep.com/image-stock/CSGP.png",
    "ipoDate": "1998-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]