[
  {
    "symbol": "CSIQ",
    "price": 37.34,
    "beta": 1.452816,
    "volAvg": 1131777,
    "mktCap": 2414161690,
    "lastDiv": 0,
    "range": "26.86-47.69",
    "changes": 0.97,
    "companyName": "Canadian Solar Inc.",
    "currency": "USD",
    "cik": "0001375877",
    "isin": "CA1366351098",
    "cusip": "136635109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Solar",
    "website": "https://www.canadiansolar.com",
    "description": "Canadian Solar Inc., together with its subsidiaries, designs, develops, manufactures, and sells solar ingots, wafers, cells, modules, and other solar power and battery storage products in Asia, the Americas, Europe, and internationally. The company operates through two segments, Canadian Solar Inc. (CSI) Solar and Global Energy. The CSI Solar segment offers standard solar modules and battery storage solutions, as well as solar system kits that are a ready-to-install packages comprising inverters, racking systems, and other accessories; and engineering, procurement, and construction (EPC) services. The Global Energy segment engages in the development, construction, maintenance, and sale of solar and battery storage projects; operation of solar power plants; and sale of electricity. This segment also provides operation and maintenance (O&M) services, including monitoring, inspections, repair, and replacement of plant equipment; and site management and administrative support services for solar projects, as well as asset management services. As of January 31, 2021, this segment had a fleet of solar power plants in operation with an aggregate capacity of approximately 445 MWp. The company serves distributors, system integrators, project developers, and installers/EPC companies. It sells its products primarily under its Canadian Solar brand name; and on an OEM basis. The company was incorporated in 2001 and is headquartered in Guelph, Canada.",
    "ceo": "Dr. Xiaohua  Qu",
    "sector": "Technology",
    "country": "CA",
    "fullTimeEmployees": "18423",
    "phone": "8651266908088",
    "address": "545 Speedvale Avenue West",
    "city": "Guelph",
    "state": "ON",
    "zip": "N1K 1E6",
    "dcfDiff": 8.38966,
    "dcf": 49.2397,
    "image": "https://financialmodelingprep.com/image-stock/CSIQ.png",
    "ipoDate": "2006-11-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]