[
  {
    "symbol": "CSTM",
    "price": 16.62,
    "beta": 2.112323,
    "volAvg": 837180,
    "mktCap": 2398299240,
    "lastDiv": 0,
    "range": "9.82-16.96",
    "changes": -0.1,
    "companyName": "Constellium SE",
    "currency": "USD",
    "cik": "0001563411",
    "isin": "FR0013467479",
    "cusip": "F21107101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aluminum",
    "website": "https://www.constellium.com",
    "description": "Constellium SE, together with its subsidiaries, engages in the design, manufacture, and sale of specialty rolled and extruded aluminum products for the packaging, aerospace, and automotive end-markets. The company operates through three segments: Packaging & Automotive Rolled Products, Aerospace & Transportation, and Automotive Structures & Industry. The Packaging & Automotive Rolled Products segment produces rolled aluminum products, including can stock and closure stock for the beverage and food industry, as well as foil stock for the flexible packaging market. It also supplies automotive body sheets and heat exchangers for the automotive market; and specialty reflective sheets. The Aerospace & Transportation segment provides rolled aluminum products, including aerospace plates, sheets, and extrusions; and aerospace wing skins, as well as plates and sheets for use in transportation, industry, and defense applications. The Automotive Structures & Industry segment offers extruded products and technologically advanced structures for the automotive industry, including crash-management systems, body structures, side impact beams, and battery enclosures; and hard and soft alloy extruded profiles for various industry applications in the automotive, engineering, rail, and other transportation end markets. This segment also provides downstream technology and services, which include pre-machining, surface treatment, research and development, and technical support services. The company sells its products directly or through distributors in France, Germany, the Czech Republic, the United Kingdom, Switzerland, and the United States, as well as Shanghai, and Seoul. Constellium SE was incorporated in 2010 and is headquartered in Paris, France.",
    "ceo": "Mr. Jean-Marc  Germain",
    "sector": "Basic Materials",
    "country": "FR",
    "fullTimeEmployees": "10800",
    "phone": "33 1 73 01 46 00",
    "address": "Washington Plaza",
    "city": "Paris",
    "state": null,
    "zip": "75008",
    "dcfDiff": 1.58046,
    "dcf": 12.9595,
    "image": "https://financialmodelingprep.com/image-stock/CSTM.png",
    "ipoDate": "2013-05-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]