[
  {
    "symbol": "CSWI",
    "price": 162.89,
    "beta": 0.775,
    "volAvg": 50717,
    "mktCap": 2526195854,
    "lastDiv": 0.76,
    "range": "99.19-164.89",
    "changes": -0.2,
    "companyName": "CSW Industrials, Inc.",
    "currency": "USD",
    "cik": "0001624794",
    "isin": "US1264021064",
    "cusip": "126402106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.cswindustrials.com",
    "description": "CSW Industrials, Inc. operates as a diversified industrial company in the United States and internationally. It operates through three segments: Contractor Solutions, Engineered Building Solutions, and Specialized Reliability Solutions. The Contractor Solutions segment provides cements, diffusers, grilles, registers, solvents, thread sealants, traps, and vents for use in HVAC/R, plumbing, general industrial, architecturally, and specified building products. The Engineered Building Solutions segment offers architectural railings and associated services; fire and smoke protection solutions; and pre-engineered and custom architectural building components for use in architecturally specified building products. The Specialized Reliability Solutions segment provides compounds, lubricants, lubricant management products, and sealants; and contamination control, industrial maintenance and repair, and operations solutions for use in energy, general industrial, mining, and railing markets. The company was incorporated in 2014 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Joseph Brooks Armes J.D.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "2400",
    "phone": "214 884 3777",
    "address": "5420 Lyndon B. Johnson Freeway",
    "city": "Dallas",
    "state": "TX",
    "zip": "75240",
    "dcfDiff": 9.63863,
    "dcf": 119.441,
    "image": "https://financialmodelingprep.com/image-stock/CSWI.png",
    "ipoDate": "2015-09-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]