[
  {
    "symbol": "CSX",
    "price": 33.59,
    "beta": 1.220774,
    "volAvg": 12270979,
    "mktCap": 68290148963,
    "lastDiv": 0.44,
    "range": "25.8-34.71",
    "changes": 0.12,
    "companyName": "CSX Corporation",
    "currency": "USD",
    "cik": "0000277948",
    "isin": "US1264081035",
    "cusip": "126408103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Railroads",
    "website": "https://www.csx.com",
    "description": "CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It transports chemicals, agricultural and food products, automotive, minerals, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. The company also offers intermodal transportation services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 19,500 route mile rail network, which serves various population centers in 23 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It also serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.",
    "ceo": "Mr. Joseph R. Hinrichs",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "22600",
    "phone": "904 359 3200",
    "address": "500 Water Street",
    "city": "Jacksonville",
    "state": "FL",
    "zip": "32202",
    "dcfDiff": 2.20291,
    "dcf": 32.2829,
    "image": "https://financialmodelingprep.com/image-stock/CSX.png",
    "ipoDate": "1980-11-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]