[
  {
    "symbol": "CTLT",
    "price": 40.33,
    "beta": 1.180985,
    "volAvg": 5095433,
    "mktCap": 7270369760,
    "lastDiv": 0,
    "range": "31.45-115.335",
    "changes": -1.39,
    "companyName": "Catalent, Inc.",
    "currency": "USD",
    "cik": "0001596783",
    "isin": "US1488061029",
    "cusip": "148806102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.catalent.com",
    "description": "Catalent, Inc., together with its subsidiaries, develops and manufactures solutions for drugs, protein-based biologics, cell and gene therapies, and consumer health products worldwide. It operates through four segments: Biologics, Softgel and Oral Technologies, Oral and Specialty Delivery, and Clinical Supply Services. The Softgel and Oral Technologies segment provides formulation, development, and manufacturing services for soft capsules for use in a range of customer products, such as prescription drugs, over-the-counter medications, dietary supplements, unit-dose cosmetics, and animal health medicinal preparations. The Biologics segment provides biologic cell-line; develops and manufactures cell therapy and viral based gene therapy; formulation, development, and manufacturing for parenteral dose forms, including vials, prefilled syringes, vials, and cartridges; and analytical development and testing services. The Oral and Specialty Delivery segment offers formulation, development, and manufacturing across a range of technologies along with integrated downstream clinical development and commercial supply solutions. This segment also offers oral delivery solutions platform comprising pre-clinical screening, formulation, analytical development, and current good manufacturing practices services. The Clinical Supply Services segment offers manufacturing, packaging, storage, distribution, and inventory management for drugs and biologics clinical trials. It also offers FastChain demand-led clinical supply services. The company serves pharmaceutical, biotechnology, and consumer health companies; and companies in other healthcare market segments, such as animal health and medical devices, as well as in cosmetics industries. Catalent, Inc. was incorporated in 2007 and is headquartered in Somerset, New Jersey.",
    "ceo": "Mr. Alessandro  Maselli",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "19000",
    "phone": "732 537 6200",
    "address": "14 Schoolhouse Road",
    "city": "Somerset",
    "state": "NJ",
    "zip": "08873",
    "dcfDiff": 6.48941,
    "dcf": 47.1606,
    "image": "https://financialmodelingprep.com/image-stock/CTLT.png",
    "ipoDate": "2014-07-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]