[
  {
    "symbol": "CTRA",
    "price": 24.47,
    "beta": 0.242605,
    "volAvg": 7319620,
    "mktCap": 18534874714,
    "lastDiv": 2.1,
    "range": "22.25-32.47",
    "changes": 0.2,
    "companyName": "Coterra Energy Inc.",
    "currency": "USD",
    "cik": "0000858470",
    "isin": "US1270971039",
    "cusip": "127097103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas E&P",
    "website": "https://www.coterra.com",
    "description": "Coterra Energy Inc., an independent oil and gas company, engages in the development, exploration and production of oil, natural gas, and natural gas liquids in the United States. It primarily focuses on the Marcellus Shale with approximately 177,000 net acres in the dry gas window of the play located in Susquehanna County, Pennsylvania. The company also holds Permian Basin properties with approximately 306,000 net acres; and Anadarko Basin properties located in Oklahoma with approximately 182,000 net acres. In addition, it operates natural gas and saltwater disposal gathering systems in Texas. The company sells its natural gas to industrial customers, local distribution companies, oil and gas marketers, major energy companies, pipeline companies, and power generation facilities. As of December 31, 2021, it had proved reserves of approximately 2,892,582 thousand barrels of oil equivalent, which include 189,429 thousand barrels of oil and other liquid hydrocarbons, 14,895 billion cubic feet of natural gas, and 220,615 thousand barrels of natural gas liquids. The company was incorporated in 1989 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Thomas E. Jorden",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "981",
    "phone": "281 589 4600",
    "address": "Three Memorial City Plaza",
    "city": "Houston",
    "state": "TX",
    "zip": "77024",
    "dcfDiff": 3.64961,
    "dcf": 28.9796,
    "image": "https://financialmodelingprep.com/image-stock/CTRA.png",
    "ipoDate": "1990-02-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]