[
  {
    "symbol": "CTSH",
    "price": 63.37,
    "beta": 1.10669,
    "volAvg": 3639467,
    "mktCap": 32158816983,
    "lastDiv": 1.16,
    "range": "51.33-70.86",
    "changes": 0.24,
    "companyName": "Cognizant Technology Solutions Corporation",
    "currency": "USD",
    "cik": "0001058290",
    "isin": "US1924461023",
    "cusip": "192446102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Information Technology Services",
    "website": "https://www.cognizant.com",
    "description": "Cognizant Technology Solutions Corporation, a professional services company, provides consulting and technology, and outsourcing services in North America, Europe, and internationally. It operates through four segments: Financial Services; Healthcare; Products and Resources; and Communications, Media and Technology. The company offers customer experience enhancement, robotic process automation, analytics, and AI services in areas, such as digital lending, fraud detection, and next generation payments; the shift towards consumerism, outcome-based contracting, digital health, delivering integrated seamless, omni-channel, and patient-centered experience; and services that drive operational improvements in areas, such as clinical development, pharmacovigilance, and manufacturing, as well as claims processing, enrollment, membership, and billing to healthcare providers and payers, and life sciences companies, including pharmaceutical, biotech, and medical device companies. It also provides solution to manufacturers, retailers and travel and hospitality companies, as well as companies providing logistics, energy and utility services; and digital content, the creation of personalized user experience, and acceleration of digital engineering services to information, media and entertainment, and communications and technology companies. The company was founded in 1994 and is headquartered in Teaneck, New Jersey.",
    "ceo": "Mr. Ravi Kumar Singisetti",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "351500",
    "phone": "201 801 0233",
    "address": "300 Frank West Burr Boulevard",
    "city": "Teaneck",
    "state": "NJ",
    "zip": "07666",
    "dcfDiff": 4.10315,
    "dcf": 61.6068,
    "image": "https://financialmodelingprep.com/image-stock/CTSH.png",
    "ipoDate": "1998-06-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]