[
  {
    "symbol": "CTVA",
    "price": 56.94,
    "beta": 0.790212,
    "volAvg": 2948998,
    "mktCap": 40477109987,
    "lastDiv": 0.6,
    "range": "50.03-68.43",
    "changes": -0.39,
    "companyName": "Corteva, Inc.",
    "currency": "USD",
    "cik": "0001755672",
    "isin": "US22052L1044",
    "cusip": "22052L104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Agricultural Inputs",
    "website": "https://www.corteva.com",
    "description": "Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and herbicides used to control weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and diseases, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. was incorporated in 2018 and is headquartered in Indianapolis, Indiana.",
    "ceo": "Mr. Charles Victor Magro B.Sc. (Chem), MBA",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "21000",
    "phone": "833 267 8382",
    "address": "9330 Zionsville Road",
    "city": "Indianapolis",
    "state": "IN",
    "zip": "46268-0735",
    "dcfDiff": 7.39659,
    "dcf": 71.2266,
    "image": "https://financialmodelingprep.com/image-stock/CTVA.png",
    "ipoDate": "2019-05-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]