[
  {
    "symbol": "CUYTY",
    "price": 9.09,
    "beta": 0.047892,
    "volAvg": 41,
    "mktCap": 4875067063,
    "lastDiv": 0.27,
    "range": "5.3-9.09",
    "changes": 0.49,
    "companyName": "Etn. Fr. Colruyt NV",
    "currency": "USD",
    "cik": null,
    "isin": "US1968501015",
    "cusip": "196850101",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Grocery Stores",
    "website": "https://www.colruytgroup.com",
    "description": "Etn. Fr. Colruyt NV, together with its subsidiaries, engages in the retail, wholesale, food service, and other activities in Belgium, France, and internationally. It operates through three segments: Retail, Wholesale and Foodservice, and Other Activities. As of June 17, 2021, the company operated 248 Colruyt stores, 145 OKay stores, 31 Bio-Planet stores, 45 Dreamland stores, 29 Dreambaby stores, and 3 Cru stores in Belgium and Luxembourg, as well as 85 Colruyt stores in France. It also operates ColliShop, a Webshop; and 209 Spar stores. In addition, the company provides fresh products, dry food, and frozen and non-food products; operates 70 ZEB stores, which sells multi-brand fashion products for ladies and men; operates MyUnderwear24, a Webshop that sells underwear and night clothing; and provides meat, wine, cheese, coffee, and bread. Further, it operates 42 DATS 24 filling stations, as well as Collect&Go, an online food market; generates and sells green power using onshore wind turbines, solar panels, and co-generation facilities; and offers print and document management services. It provides its products and services to wholesalers, commercial customers, and affiliated independent merchants, as well as hospitals, schools, care homes, the hospitality sector, etc. The company was founded in 1928 and is headquartered in Halle, Belgium.",
    "ceo": "Mr. Jef  Colruyt",
    "sector": "Consumer Defensive",
    "country": "BE",
    "fullTimeEmployees": "33000",
    "phone": "32 2 363 55 45",
    "address": "Edingensesteenweg 196",
    "city": "Halle",
    "state": null,
    "zip": "1500",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CUYTY.png",
    "ipoDate": "2012-08-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]