[
  {
    "symbol": "CVCO",
    "price": 290.44,
    "beta": 1.212323,
    "volAvg": 65209,
    "mktCap": 2519625088,
    "lastDiv": 0,
    "range": "189.42-318.0",
    "changes": -1.46,
    "companyName": "Cavco Industries, Inc.",
    "currency": "USD",
    "cik": "0000278166",
    "isin": "US1495681074",
    "cusip": "149568107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Residential Construction",
    "website": "https://www.cavco.com",
    "description": "Cavco Industries, Inc. designs, produces, and retails manufactured homes primarily in the United States. It operates in two segments, Factory-Built Housing and Financial Services. The company markets its manufactured homes under the Cavco, Fleetwood, Palm Harbor, Nationwide, Fairmont, Friendship, Chariot Eagle, Destiny, Commodore, Colony, Pennwest, R-Anell, Manorwood, and MidCountry brands. It also builds park model RVs; vacation cabins; and factory-built commercial structures, including apartment buildings, condominiums, hotels, workforce housing, schools, and housing for the United States military troops. In addition, the company produces various modular homes, which include single and multi-section ranch, split-level, and Cape Cod style homes, as well as two- and three-story homes, and multi-family units. Further, it provides conforming and non-conforming mortgages and home-only loans to purchasers of various brands of factory-built homes sold by company-owned retail stores, as well as various independent distributors, builders, communities, and developers. Additionally, the company offers property and casualty insurance to owners of manufactured homes. As of April 3, 2022, it operated 45 company-owned retail stores in Oregon, Arizona, Nevada, New Mexico, Texas, Indiana, Oklahoma, Florida, and New York. The company also distributes its homes through a network of independent distribution points in 48 states and Canada; and through planned community operators and residential developers. Cavco Industries, Inc. was founded in 1965 and is headquartered in Phoenix, Arizona.",
    "ceo": "Mr. William C. Boor",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "7000",
    "phone": "602 256 6263",
    "address": "3636 North Central Avenue",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85012",
    "dcfDiff": 35.5657,
    "dcf": 235.034,
    "image": "https://financialmodelingprep.com/image-stock/CVCO.png",
    "ipoDate": "2003-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]