[
  {
    "symbol": "CVE",
    "price": 16.58,
    "beta": 2.873496,
    "volAvg": 7593785,
    "mktCap": 31497524196,
    "lastDiv": 0.42,
    "range": "14.44-22.18",
    "changes": 0.12,
    "companyName": "Cenovus Energy Inc.",
    "currency": "USD",
    "cik": "0001475260",
    "isin": "CA15135U1093",
    "cusip": "15135U109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.cenovus.com",
    "description": "Cenovus Energy Inc., together with its subsidiaries, develops, produces, and markets crude oil, natural gas liquids, and natural gas in Canada, the United States, and the Asia Pacific region. The company operates through Oil Sands, Conventional, Offshore, Canadian Manufacturing, U.S. Manufacturing, and Retail segments. The Oil Sands segment develops and produces bitumen and heavy oil in northern Alberta and Saskatchewan. This segments Foster Creek, Christina Lake, Sunrise, and Tucker oil sands projects, as well as Lloydminster thermal and conventional heavy oil assets The Conventional segment holds assets primarily located in Elmworth-Wapiti, Kaybob-Edson, Clearwater, and Rainbow Lake operating in Alberta and British Columbia, as well as interests in various natural gas processing facilities. The offshore segment engages in the exploration and development activities. The Canadian Manufacturing segment includes the owned and operated Lloydminster upgrading and asphalt refining complex, which upgrades heavy oil and bitumen into synthetic crude oil, diesel fuel, asphalt, and other ancillary products, as well as owns and operates the Bruderheim crude-by-rail terminal and two ethanol plants. The U.S. Manufacturing segment comprises the refining of crude oil to produce diesel, gasoline, jet fuel, asphalt, and other products. The Retail segment consists of marketing of its own and third-party refined petroleum products through retail, commercial, and bulk petroleum outlets, as well as wholesale channels. Cenovus Energy Inc. was founded in 2009 and is headquartered in Calgary, Canada.",
    "ceo": "Mr. Jonathan M. McKenzie CA",
    "sector": "Energy",
    "country": "CA",
    "fullTimeEmployees": "5998",
    "phone": "14037662000",
    "address": "225, 6 Avenue South West",
    "city": "Calgary",
    "state": "AB",
    "zip": "T2P 0M5",
    "dcfDiff": 0.744821,
    "dcf": 21.1448,
    "image": "https://financialmodelingprep.com/image-stock/CVE.png",
    "ipoDate": "2009-11-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]