[
  {
    "symbol": "CVI",
    "price": 29.09,
    "beta": 1.521478,
    "volAvg": 1165733,
    "mktCap": 2924446790,
    "lastDiv": 2,
    "range": "22.6-42.21",
    "changes": 0.77,
    "companyName": "CVR Energy, Inc.",
    "currency": "USD",
    "cik": "0001376139",
    "isin": "US12662P1084",
    "cusip": "12662P108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Refining & Marketing",
    "website": "https://www.cvrenergy.com",
    "description": "CVR Energy, Inc., together with its subsidiaries, engages in the petroleum refining and nitrogen fertilizer manufacturing activities in the United States. It operates in two segments, Petroleum and Nitrogen Fertilizer. The Petroleum segment refines and markets gasoline, diesel fuel, and other refined products. It also owns and operates a coking medium-sour crude oil refinery in southeast Kansas; and a crude oil refinery in Wynnewood, Oklahoma, as well as supporting logistics assets. This segment primarily serves retailers, railroads, farm co-operatives, and other refiners/marketers. The Nitrogen Fertilizer segment owns and operates a nitrogen fertilizer plant in North America that utilizes a pet coke gasification process to produce nitrogen fertilizer products; and a nitrogen fertilizer facility in East Dubuque, Illinois that produces nitrogen fertilizers in the form of ammonia and urea ammonium nitrate (UAN). It primarily markets UAN products to agricultural customers; and ammonia products to agricultural and industrial customers. The company was founded in 1906 and is headquartered in Sugar Land, Texas. CVR Energy, Inc. is a subsidiary of Icahn Enterprises L.P.",
    "ceo": "Mr. David L. Lamp",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "1470",
    "phone": "281 207 3200",
    "address": "2277 Plaza Drive",
    "city": "Sugar Land",
    "state": "TX",
    "zip": "77479",
    "dcfDiff": 9.67463,
    "dcf": 44.0346,
    "image": "https://financialmodelingprep.com/image-stock/CVI.png",
    "ipoDate": "2007-10-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]