[
  {
    "symbol": "CVLT",
    "price": 71.91,
    "beta": 0.591197,
    "volAvg": 381483,
    "mktCap": 3162155958,
    "lastDiv": 0,
    "range": "50.26-72.44",
    "changes": 1.52,
    "companyName": "Commvault Systems, Inc.",
    "currency": "USD",
    "cik": "0001169561",
    "isin": "US2041661024",
    "cusip": "204166102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.commvault.com",
    "description": "Commvault Systems, Inc. provides data protection and information management software applications and related services in the United States and internationally. The company offers Commvault Backup and Recovery, a backup and recovery solution; Commvault Disaster Recovery, a replication and disaster recovery solution; and Commvault Complete Data Protection, a data protection solution. It also provides Commvault HyperScale X, an easy-to-deploy scale-out solution; Commvault Distributed Storage Platform that offers software-defined storage built on a hyperscale architecture; Metallic Cloud Storage service, which is the easy button to adopt secure and scalable cloud storage; and Metallic Software-as-a-Service. In addition, the company provides technology and business consulting, education, and remote managed services. Further, it sells appliances that integrate the software with hardware for use in a range of business needs and use cases; and offers professional and customer support services that include data management-as-a-service under the Metallic brand. The company sells its products and services directly through its sales force, and indirectly through its network of distributors, value-added resellers, systems integrators, corporate resellers, and original equipment manufacturers to large enterprises, small and medium sized businesses, and government agencies. It supports customers in a range of industries, including banking, insurance and financial services, government, healthcare, pharmaceuticals and medical services, technology, legal, manufacturing, utilities, and energy. Commvault Systems, Inc. was founded in 1988 and is headquartered in Tinton Falls, New Jersey.",
    "ceo": "Mr. Sanjay  Mirchandani",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2779",
    "phone": "732 870 4000",
    "address": "1 Commvault Way",
    "city": "Tinton Falls",
    "state": "NJ",
    "zip": "07724",
    "dcfDiff": 6.74512,
    "dcf": 69.9351,
    "image": "https://financialmodelingprep.com/image-stock/CVLT.png",
    "ipoDate": "2006-09-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]