[
  {
    "symbol": "CVX",
    "price": 154.92,
    "beta": 1.164436,
    "volAvg": 7726856,
    "mktCap": 291390569764,
    "lastDiv": 6.04,
    "range": "132.54-189.68",
    "changes": 1.39,
    "companyName": "Chevron Corporation",
    "currency": "USD",
    "cik": "0000093410",
    "isin": "US1667641005",
    "cusip": "166764100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.chevron.com",
    "description": "Chevron Corporation, through its subsidiaries, engages in integrated energy and chemicals operations worldwide. The company operates in two segments, Upstream and Downstream. The Upstream segment is involved in the exploration, development, production, and transportation of crude oil and natural gas; processing, liquefaction, transportation, and regasification associated with liquefied natural gas; transportation of crude oil through pipelines; and transportation, storage, and marketing of natural gas, as well as operates a gas-to-liquids plant. The Downstream segment engages in refining crude oil into petroleum products; marketing crude oil, refined products, and lubricants; manufacturing and marketing of renewable fuels; transporting crude oil and refined products by pipeline, marine vessel, motor equipment, and rail car; and manufacturing and marketing of commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives. It is also involved in the cash management and debt financing activities; insurance operations; real estate activities; and technology businesses. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is based in San Ramon, California.",
    "ceo": "Mr. Michael K. Wirth",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "43846",
    "phone": "925 842 1000",
    "address": "6001 Bollinger Canyon Road",
    "city": "San Ramon",
    "state": "CA",
    "zip": "94583-2324",
    "dcfDiff": 4.806,
    "dcf": 184.256,
    "image": "https://financialmodelingprep.com/image-stock/CVX.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]