[
  {
    "symbol": "CW",
    "price": 177.93,
    "beta": 1.24683,
    "volAvg": 142985,
    "mktCap": 6822352197,
    "lastDiv": 0.8,
    "range": "125.91-182.55",
    "changes": 1.16,
    "companyName": "Curtiss-Wright Corporation",
    "currency": "USD",
    "cik": "0000026324",
    "isin": "US2315611010",
    "cusip": "231561101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.curtisswright.com",
    "description": "Curtiss-Wright Corporation, together with its subsidiaries, provides engineered products, solutions, and services to the aerospace, defense, general industrial, and power generation markets worldwide. worldwide. It operates through three segments: Aerospace & Industrial, Defense Electronics, and Naval & Power. The Aerospace & Industrial segment offers industrial vehicle products, such as electronic throttle control devices, joysticks, and transmission shifters; sensors, controls and electro-mechanical actuation components used in commercial and military aircraft; and surface technology services, including shot peening, laser peening, and coatings. The Defense Electronics segment provides commercial off-the-shelf embedded computing board-level modules, data acquisition and flight test instrumentation equipment, integrated subsystems, instrumentation and control systems, turret aiming and stabilization products, and weapons handling systems; avionics and electronics; flight test equipment; and aircraft data management solutions. The Naval & Power segment offers hardware, pumps, pump seals, control rod drive mechanisms, valves, fastening systems, specialized containment doors, airlock hatches, spent fuel management products, and fluid sealing products for nuclear power plants and nuclear equipment manufacturers; and naval propulsion and auxiliary equipment, including coolant pumps, power-dense compact motors, generators, steam turbines, valves, and secondary propulsion systems, as well as ship repair and maintenance services primarily to the U.S. navy. Curtiss-Wright Corporation was founded in 1929 and is headquartered in Davidson, North Carolina.",
    "ceo": "Ms. Lynn M. Bamford",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "8100",
    "phone": "704 869 4600",
    "address": "130 Harbour Place Drive",
    "city": "Davidson",
    "state": "NC",
    "zip": "28036",
    "dcfDiff": 19.1961,
    "dcf": 179.516,
    "image": "https://financialmodelingprep.com/image-stock/CW.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]