[
  {
    "symbol": "CWH",
    "price": 28.75,
    "beta": 2.602816,
    "volAvg": 1053280,
    "mktCap": 1278414750,
    "lastDiv": 2.5,
    "range": "18.69-33.99",
    "changes": -0.09,
    "companyName": "Camping World Holdings, Inc.",
    "currency": "USD",
    "cik": "0001669779",
    "isin": "US13462K1097",
    "cusip": "13462K109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Auto & Truck Dealerships",
    "website": "https://www.campingworld.com",
    "description": "Camping World Holdings, Inc., through its subsidiaries, retails recreational vehicles (RVs), and related products and services. It operates in two segments, Good Sam Services and Plans; and RV and Outdoor Retail. The company provides a portfolio of services, protection plans, products, and resources in the RV industry. It also offers extended vehicle service contracts; roadside assistance plans; property and casualty insurance programs; travel assist travel protection plans; and RV and outdoor related consumer shows, as well as produces various monthly and annual RV focused consumer magazines; and operates the Coast to Coast Club. In addition, the company provides new and used RVs; vehicle financing; RV repair and maintenance services; various RV parts, equipment, supplies, and accessories, which include towing and hitching products, satellite and GPS systems, electrical and lighting products, appliances and furniture, and other products; and collision repair services comprising fiberglass front and rear cap replacement, windshield replacement, interior remodel solutions, and paint and body work. Further, it offers equipment, gears, and supplies for camping, hunting, fishing, skiing, snowboarding, bicycling, skateboarding, and marine and watersports equipment and supplies, as well as operates Good Sam Club, a membership organization that offers savings on a range of products and services and provides co-branded credit cards. As of December 31, 2021, the company operated through a network of approximately 187 retail locations in 40 states of the United States. It serves customers through dealerships, and online and e-commerce platforms. The company was founded in 1966 and is headquartered in Lincolnshire, Illinois.",
    "ceo": "Mr. Marcus A. Lemonis",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "12942",
    "phone": "847 808 3000",
    "address": "250 Parkway Drive",
    "city": "Lincolnshire",
    "state": "IL",
    "zip": "60069",
    "dcfDiff": 9.5618,
    "dcf": 33.9718,
    "image": "https://financialmodelingprep.com/image-stock/CWH.png",
    "ipoDate": "2016-10-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]