[
  {
    "symbol": "CWST",
    "price": 86.61,
    "beta": 0.930633,
    "volAvg": 310167,
    "mktCap": 4932491466,
    "lastDiv": 0,
    "range": "69.18-95.78",
    "changes": 0.01,
    "companyName": "Casella Waste Systems, Inc.",
    "currency": "USD",
    "cik": "0000911177",
    "isin": "US1474481041",
    "cusip": "147448104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Waste Management",
    "website": "https://www.casella.com",
    "description": "Casella Waste Systems, Inc., together with its subsidiaries, operates as a vertically integrated solid waste services company in the northeastern United States. It offers resource management services primarily in the areas of solid waste collection and disposal, transfer, recycling, and organics services to residential, commercial, municipal, institutional, and industrial customers. The company provides a range of non-hazardous solid waste services, including collections, transfer stations, and disposal facilities. It also markets recyclable metals, aluminum, plastics, and paper and corrugated cardboard that are processed at its facilities, as well as recyclables purchased from third parties. In addition, the company is involved in commodity brokerage operations. As of January 31, 2022, it owned and/or operated 50 solid waste collection operations, 65 transfer stations, 23 recycling facilities, 8 Subtitle D landfills, 3 landfill gas-to-energy facilities, and 1 landfill permitted to accept construction and demolition materials. Casella Waste Systems, Inc. was founded in 1975 and is headquartered in Rutland, Vermont.",
    "ceo": "Mr. John W. Casella",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "3200",
    "phone": "802 775 0325",
    "address": "25 Green Hill Lane",
    "city": "Rutland",
    "state": "VT",
    "zip": "05701",
    "dcfDiff": 4.44539,
    "dcf": 83.9054,
    "image": "https://financialmodelingprep.com/image-stock/CWST.png",
    "ipoDate": "1997-10-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]