[
  {
    "symbol": "CWT",
    "price": 51.82,
    "beta": 0.473591,
    "volAvg": 298633,
    "mktCap": 2901458802,
    "lastDiv": 1.04,
    "range": "49.63-66.12",
    "changes": 0.78,
    "companyName": "California Water Service Group",
    "currency": "USD",
    "cik": "0001035201",
    "isin": "US1307881029",
    "cusip": "130788102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Water",
    "website": "https://www.calwatergroup.com",
    "description": "California Water Service Group, through its subsidiaries, provides water utility and other related services in California, Washington, New Mexico, Hawaii, and Texas. The company is involved in the production, purchase, storage, treatment, testing, distribution, and sale of water for domestic, industrial, public, and irrigation uses, as well as for fire protection. It offers its services to approximately 494,500 customer connections in 100 California communities; approximately 6,200 water and wastewater customer connections on the islands of Maui and Hawaii; approximately 36,400 customer connections in the Tacoma, Olympia, Graham, Spanaway, Puyallup, and Gig Harbor areas; and approximately 8,600 water and wastewater customer connections in the Belen, Los Lunas, Indian Hills, and Elephant Butte areas in New Mexico. The company also engages in the provision of non-regulated water-related services, including operating of municipally owned water systems, privately owned water, and recycled water distribution systems; water system operation, meter reading, and billing services to private companies and municipalities; leasing of communication antenna sites on its properties to telecommunication companies; and billing of optional third-party insurance programs to its residential customers, as well as provides lab services. In addition, it offers wastewater collection and treatment services. The company was founded in 1926 and is headquartered in San Jose, California.",
    "ceo": "Mr. Martin A. Kropelnicki",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "1225",
    "phone": "408 367 8200",
    "address": "1720 North First Street",
    "city": "San Jose",
    "state": "CA",
    "zip": "95112-4598",
    "dcfDiff": 3.19802,
    "dcf": 65.118,
    "image": "https://financialmodelingprep.com/image-stock/CWT.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]