[
  {
    "symbol": "CWYUF",
    "price": 18.12,
    "beta": 1.15873,
    "volAvg": 1391,
    "mktCap": 3094642175,
    "lastDiv": 1.39,
    "range": "17.66-23.57",
    "changes": -0.03,
    "companyName": "SmartCentres Real Estate Investment Trust",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "REIT—Retail",
    "website": "https://www.smartcentres.com",
    "description": "SmartCentres Real Estate Investment Trust is one of Canada's largest fully integrated REITs, with a best-in-class portfolio featuring 166 strategically located properties in communities across the country. SmartCentres has approximately $10.4 billion in assets and owns 33.8 million square feet of income producing value-oriented retail space with 97.4% occupancy, on 3,500 acres of owned land across Canada. SmartCentres continues to focus on enhancing the lives of Canadians by planning and developing complete, connected, mixed-use communities on its existing retail properties. A publicly announced $11.9 billion intensification program ($5.4 billion at SmartCentres' share) represents the REIT's current major development focus on which construction is expected to commence within the next five years. This intensification program consists of rental apartments, condos, seniors' residences and hotels, to be developed under the SmartLiving banner, and retail, office, and storage facilities, to be developed under the SmartCentres banner. SmartCentres' intensification program is expected to produce an additional 59.3 million square feet (27.9 million square feet at SmartCentres' share) of space, 27.1 million square feet (12.3 million square feet at SmartCentres' share) of which has or will commence construction within next five years. From shopping centres to city centres, SmartCentres is uniquely positioned to reshape the Canadian urban and urban-suburban landscape. Included in this intensification program is the Trust's share of SmartVMC which, when completed, is expected to include approximately 11.0 million square feet of mixed-use space in Vaughan, Ontario. Construction of the first five sold-out phases of Transit City Condominiums that represent 2,789 residential units continues to progress. Final closings of the first two phases of Transit City Condominiums began ahead of budget and ahead of schedule in August 2020 and as at September 30, 2020, 766 units (representing approximately 70% of all 1,110 units in the first and second phases) had closed with the balance of units expected to close before year end. In addition, the presold 631 units in the third phase along with 22 townhomes, all of which are sold out and currently under construction, are expected to close in 2021. The fourth and fifth sold-out phases representing 1,026 units are currently under construction and are expected to close in 2023.",
    "ceo": "Mr. Mitchell  Goldhar",
    "sector": "Real Estate",
    "country": "CA",
    "fullTimeEmployees": null,
    "phone": "905-326-6400",
    "address": "3200 Highway 7",
    "city": "Vaughan",
    "state": "ON",
    "zip": "L4K 5Z5",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CWYUF.png",
    "ipoDate": "2008-06-24",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": true
  }
]