[
  {
    "symbol": "CXM",
    "price": 13.97,
    "beta": 0,
    "volAvg": 1825243,
    "mktCap": 3738832996,
    "lastDiv": 0,
    "range": "7.25-15.0",
    "changes": 0.38,
    "companyName": "Sprinklr, Inc.",
    "currency": "USD",
    "cik": "0001569345",
    "isin": "US85208T1079",
    "cusip": "85208T107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.sprinklr.com",
    "description": "Sprinklr, Inc. provides enterprise cloud software products worldwide. The company offers Unified Customer Experience Management platform, a purpose-built to analyze unstructured customer experience data, built to scale across future and modern channels, and integrates all stages of the customer journey. Its products include Modern Research that enables its customers to listen, learn from, and act on insights gleaned from modern channels; Modern Care that enables brands to listen to, route, resolve and analyze customer service issues across modern and traditional channels; Modern Marketing and Advertising enables global brands to plan, create, publish, optimize, and analyze their organic/owned marketing content and paid advertising campaigns across modern channels; and Social Engagement and Sales allows customers listen to, triage, engage, and analyze conversations across modern channels. The company also provides professional, managed, training, and consultancy services. Sprinklr, Inc. was founded in 2009 and is headquartered in New York, New York.",
    "ceo": "Mr. Ragy  Thomas",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3511",
    "phone": "917 933 7800",
    "address": "29 West 35th Street",
    "city": "New York",
    "state": "NY",
    "zip": "10001",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/CXM.png",
    "ipoDate": "2021-06-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]