[
  {
    "symbol": "CYBR",
    "price": 151.09,
    "beta": 1.069718,
    "volAvg": 485258,
    "mktCap": 6310288959,
    "lastDiv": 0,
    "range": "113.19-165.18",
    "changes": -2.9,
    "companyName": "CyberArk Software Ltd.",
    "currency": "USD",
    "cik": "0001598110",
    "isin": "IL0011334468",
    "cusip": "M2682V108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.cyberark.com",
    "description": "CyberArk Software Ltd., together with its subsidiaries, develops, markets, and sales software-based security solutions and services in the United States, Europe, the Middle East, Africa, and internationally. Its solutions include Privileged Access Manager that offers risk-based credential security and session management to protect against attacks involving privileged access; Vendor Privileged Access Manager combines Privileged Access Manager and Remote Access to provide fast, easy, and secure privileged access to third-party vendors; Endpoint Privilege Manager, a SaaS solution that secures privileges on the endpoint; and Cloud Entitlements Manager, a SaaS solution, which reduces risk that arises from excessive privileges by implementing least privilege across cloud environments. The company also offers robust Identity and Access Management as a Services, such as workforce identity, which offers adaptive multi-factor authentication (MFA), single sign-on, secure Web sessions, application gateway, identity lifecycle management, and directory services; and customer identity services that provides authentication and authorization services, MFA, directory, and user management to enable organizations to provide their customers with easy and secure access to websites and applications. In addition, it offers Secrets Manager Credential Providers to provide and manage the credentials used by third-party solutions; and Secrets Manager Conjur for cloud-native applications. The company provides its products to financial services, manufacturing, insurance, healthcare, energy and utilities, transportation, retail, technology, and telecommunications industries; and government agencies through direct sales force, as well as distributors, systems integrators, value-added resellers, and managed security service providers. CyberArk Software Ltd. was founded in 1999 and is headquartered in Petah Tikva, Israel.",
    "ceo": "Mr. Matthew Lessner Cohen",
    "sector": "Technology",
    "country": "IL",
    "fullTimeEmployees": "2768",
    "phone": "972 3 918 0000",
    "address": "9 Hapsagot Street",
    "city": "Petah Tikva",
    "state": null,
    "zip": "4951040",
    "dcfDiff": 18.421,
    "dcf": 158.231,
    "image": "https://financialmodelingprep.com/image-stock/CYBR.png",
    "ipoDate": "2014-09-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]