[
  {
    "symbol": "CYTK",
    "price": 33.5,
    "beta": 0.797183,
    "volAvg": 917133,
    "mktCap": 3203960100,
    "lastDiv": 0,
    "range": "32.32-55.8",
    "changes": -0.25,
    "companyName": "Cytokinetics, Incorporated",
    "currency": "USD",
    "cik": "0001061983",
    "isin": "US23282W6057",
    "cusip": "23282W605",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.cytokinetics.com",
    "description": "Cytokinetics, Incorporated, a late-stage biopharmaceutical company, focuses on discovering, developing, and commercializing muscle activators and inhibitors as potential treatments for debilitating diseases. The company develops small molecule drug candidates primarily engineered to impact muscle function and contractility. Its drug candidates include omecamtiv mecarbil, a novel cardiac myosin activator that is in Phase III clinical trial in patients with heart failure; and reldesemtiv, a skeletal muscle troponin activator, which is in Phase III clinical trial to treat amyotrophic lateral sclerosis and spinal muscular atrophy. The company also develops CK-136, a novel cardiac troponin activator that is in Phase I clinical trial; aficamten, a novel cardiac myosin inhibitor, which is in Phase III clinical trial for the treatment of patients with symptomatic obstructive hypertrophic cardiomyopathy; and CK-3772271, a small molecule cardiac myosin inhibitor that is in Phase I clinical trial. Cytokinetics, Incorporated has a strategic alliance with Astellas Pharma Inc. The company was incorporated in 1997 and is headquartered in South San Francisco, California.",
    "ceo": "Mr. Robert I. Blum",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "409",
    "phone": "650 624 3000",
    "address": "350 Oyster Point Boulevard",
    "city": "South San Francisco",
    "state": "CA",
    "zip": "94080",
    "dcfDiff": 1.78744,
    "dcf": 41.3326,
    "image": "https://financialmodelingprep.com/image-stock/CYTK.png",
    "ipoDate": "2004-04-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]