[
  {
    "symbol": "D",
    "price": 51.66,
    "beta": 0.457746,
    "volAvg": 3898880,
    "mktCap": 43184711647,
    "lastDiv": 2.67,
    "range": "48.48-86.28",
    "changes": -0.85,
    "companyName": "Dominion Energy, Inc.",
    "currency": "USD",
    "cik": "0000715957",
    "isin": "US25746U1097",
    "cusip": "25746U109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.dominionenergy.com",
    "description": "Dominion Energy, Inc. produces and distributes energy in the United States. The company operates through four segments: Dominion Energy Virginia, Gas Distribution, Dominion Energy South Carolina, and Contracted Assets. The Dominion Energy Virginia segment generates, transmits, and distributes regulated electricity to approximately 2.7 million residential, commercial, industrial, and governmental customers in Virginia and North Carolina. The Gas Distribution segment is involved in the regulated natural gas sales, transportation, gathering, storage, and distribution operations in Ohio, West Virginia, North Carolina, Utah, southwestern Wyoming, and southeastern Idaho that serve approximately 3.1 million residential, commercial and industrial customers. It also has nonregulated renewable natural gas facilities in operation. The Dominion Energy South Carolina segment generates, transmits, and distributes electricity to approximately 772,000 customers in the central, southern, and southwestern portions of South Carolina; and distributes natural gas to approximately 419,000 residential, commercial, and industrial customers in South Carolina. The Contracted Assets segment is involved in the nonregulated long-term contracted renewable electric generation and solar generation facility development operations; and gas transportation, LNG import, and storage operations, as well as in the liquefaction facility. As of December 31, 2021, the company's portfolio of assets included approximately 30.2 gigawatt of electric generating capacity; 10,700 miles of electric transmission lines; 78,000 miles of electric distribution lines; and 95,700 miles of gas distribution mains and related service facilities. The company was formerly known as Dominion Resources, Inc. Dominion Energy, Inc. was incorporated in 1983 and is headquartered in Richmond, Virginia.",
    "ceo": "Mr. Robert M. Blue",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "17200",
    "phone": "804-819-2000",
    "address": "120 Tredegar Street",
    "city": "Richmond",
    "state": "VA",
    "zip": "23219",
    "dcfDiff": 2.56062,
    "dcf": 59.8894,
    "image": "https://financialmodelingprep.com/image-stock/D.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]