[
  {
    "symbol": "DAL",
    "price": 46.71,
    "beta": 1.245774,
    "volAvg": 11057345,
    "mktCap": 30021218024,
    "lastDiv": 0.4,
    "range": "27.2-46.905",
    "changes": 0.62,
    "companyName": "Delta Air Lines, Inc.",
    "currency": "USD",
    "cik": "0000027904",
    "isin": "US2473617023",
    "cusip": "247361702",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Airlines",
    "website": "https://www.delta.com",
    "description": "Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Mexico City, London-Heathrow, Paris-Charles de Gaulle, and Seoul-Incheon. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app, reservations, online travel agencies, traditional brick and mortar, and other agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers, as well as aircraft charters, and management and programs. The company operates through a fleet of approximately 1,200 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.",
    "ceo": "Mr. Edward H. Bastian",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "95000",
    "phone": "404 715 2600",
    "address": "PO Box 20706",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30320-6001",
    "dcfDiff": 7.87598,
    "dcf": 46.606,
    "image": "https://financialmodelingprep.com/image-stock/DAL.png",
    "ipoDate": "2007-05-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]