[
  {
    "symbol": "DAN",
    "price": 16.39,
    "beta": 2.389788,
    "volAvg": 1589045,
    "mktCap": 2365568700,
    "lastDiv": 0.4,
    "range": "11.17-19.3",
    "changes": 0.03,
    "companyName": "Dana Incorporated",
    "currency": "USD",
    "cik": "0000026780",
    "isin": "US2358252052",
    "cusip": "235825205",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Auto Parts",
    "website": "https://www.dana.com",
    "description": "Dana Incorporated provides power-conveyance and energy-management solutions for vehicles and machinery in North America, Europe, South America, and the Asia Pacific. It operates in four segments: Light Vehicle Drive Systems, Commercial Vehicle Drive and Motion Systems, Off-Highway Drive and Motion Systems, and Power Technologies. The Light Vehicle Drive Systems segment offers axles, driveshafts, e-axles, electrodynamic and drivetrain components, and transmissions, as well as electric, hybrid, and ICE products for light trucks, sport and crossover utility vehicles, vans, and passenger cars. The Commercial Vehicle Drive and Motion Systems segment provides axles, driveshafts, e-axles, e-transmissions, electrodynamic and drivetrain components, and electric vehicle integration services, as well as software as a service for medium and heavy duty trucks, buses, and specialty vehicles. The Off-Highway Drive and Motion Systems segment offers axles, driveshafts, transmissions, planetary hub drives, e-axles and e-drives, and helical and bevel-helical gearboxes, as well as electrodynamic, hydraulic, and drivetrain components for construction, earth moving, agricultural, mining, forestry, material handling, and industrial stationary markets. The Power Technologies segment offers gaskets and sealing, cover modules, heat shields, thermal management, e-thermal management, cooling, and bipolar fuel cell plates products for light vehicle, medium/heavy vehicle, and off-highway markets. The company was formerly known as Dana Holding Corporation and changed its name to Dana Incorporated in August 2016. Dana Incorporated was founded in 1904 and is headquartered in Maumee, Ohio.",
    "ceo": "Mr. James K. Kamsickas",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "42800",
    "phone": "419 887 3000",
    "address": "3939 Technology Drive",
    "city": "Maumee",
    "state": "OH",
    "zip": "43537",
    "dcfDiff": 1.94467,
    "dcf": 19.5247,
    "image": "https://financialmodelingprep.com/image-stock/DAN.png",
    "ipoDate": "2008-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]