[
  {
    "symbol": "DANOY",
    "price": 12.05,
    "beta": 0.503065,
    "volAvg": 287174,
    "mktCap": 38653506458,
    "lastDiv": 0.44,
    "range": "9.05-13.48",
    "changes": -0.04,
    "companyName": "Danone S.A.",
    "currency": "USD",
    "cik": "0001048515",
    "isin": "US23636T1007",
    "cusip": "23636T100",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Packaged Foods",
    "website": "https://www.danone.com",
    "description": "Danone S.A. operates in the food and beverage industry in Europe, Noram, Latin America, the Asia Pacific, Africa, and the Middle East. The company operates through three segments: Essential Dairy & Plant-Based, Specialized Nutrition, and Waters. It produces and distributes yogurts; milk products; coffee creamers, drinks, and beverages; plant-based products; and ice creams, desserts, and nutritional powdered protein products under the Actimel, Activia, Alpro, Aptamil, Danette, Danio, Danonino, evian, Nutricia, Nutrilon, Volvic, as well as under the licensed brands, including International Delight, Dunkin' Donuts, and Bailey's. The company also offers specialized nutrition products for pregnant and breastfeeding mothers, infants, and young children under the Aptamil, Nutrilon, Gallia, Cow & Gate, Blédina, Bebelac, Olvarit, and Happy Family Organics brands. In addition, it provides tube feeding products under the Nutrison name; oral nutritional supplements under the Fortimel and NutriDrink names; and hypoallergenic products for children with allergies primarily under the Aptamil ProSyneo, Aptamil Pepti Syneo, and Neocate Syneo names. Further, the company offers water with natural fruit extracts, fruit juice, and vitamins under the evian, Volvic, Aqua, Mizone, Bonafont, Villavicencio, Villa del Sur, Hayat, Sirma, Fontvella, Lanjarón, Salus, Aqua d'Or, and Zywiec Zdroj brands. It distributes its products through retail chains and traditional market outlets; convenience stores; hospitals, clinics, and pharmacies; and e-commerce. The company was formerly known as Groupe Danone and changed its name to Danone S.A. in April 2009. Danone S.A. was incorporated in 1899 and is headquartered in Paris, France.",
    "ceo": "Mr. Antoine Bernard de Saint-Affrique",
    "sector": "Consumer Defensive",
    "country": "FR",
    "fullTimeEmployees": "96166",
    "phone": "33 1 44 35 20 20",
    "address": "17, Boulevard Haussmann",
    "city": "Paris",
    "state": null,
    "zip": "75009",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DANOY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]