[
  {
    "symbol": "DAR",
    "price": 60.64,
    "beta": 1.229929,
    "volAvg": 1371009,
    "mktCap": 9680448320,
    "lastDiv": 0,
    "range": "51.77-82.69",
    "changes": -0.07,
    "companyName": "Darling Ingredients Inc.",
    "currency": "USD",
    "cik": "0000916540",
    "isin": "US2372661015",
    "cusip": "237266101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaged Foods",
    "website": "https://www.darlingii.com",
    "description": "Darling Ingredients Inc. develops, produces, and sells natural ingredients from edible and inedible bio-nutrients. The company operates through three segments: Feed Ingredients, Food Ingredients, and Fuel Ingredients. It offers ingredients and customized specialty solutions for customers in the pharmaceutical, food, pet food, feed, industrial, fuel, bioenergy, and fertilizer industries. The company also collects and transforms various animal by-product streams into useable and specialty ingredients, such as collagen, edible fats, feed-grade fats, animal proteins and meals, plasma, pet food ingredients, organic fertilizers, yellow grease, fuel feedstock, green energy, natural casings, and hides. In addition, it recovers and converts used cooking oil and animal fats, and residual bakery products into valuable feed and fuel ingredients. Further, the company provides environmental services, including grease trap collection and disposal services to food service establishments. It primarily operates under the Sonac, Dar Pro, Rothsay, Rousselot, Nature Safe, CleanStar, Peptan, Cookie Meal, Bakery Feeds, Ecoson, and Rendac brand names in North America, Europe, China, South America, Australia, and internationally. The company was formerly known as Darling International Inc. and changed its name to Darling Ingredients Inc. in May 2014. Darling Ingredients Inc. was founded in 1882 and is headquartered in Irving, Texas.",
    "ceo": "Mr. Randall C. Stuewe Randy",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "14600",
    "phone": "972 717 0300",
    "address": "5601 North MacArthur Boulevard",
    "city": "Irving",
    "state": "TX",
    "zip": "75038",
    "dcfDiff": 6.06237,
    "dcf": 71.4224,
    "image": "https://financialmodelingprep.com/image-stock/DAR.png",
    "ipoDate": "1994-09-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]