[
  {
    "symbol": "DASTY",
    "price": 43.18,
    "beta": 0.690038,
    "volAvg": 40812,
    "mktCap": 56947945073,
    "lastDiv": 0.22,
    "range": "31.12-45.53",
    "changes": 0.31,
    "companyName": "Dassault Systèmes SE",
    "currency": "USD",
    "cik": null,
    "isin": "US2375451083",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Software—Application",
    "website": "https://www.3ds.com",
    "description": "Dassault Systèmes SE provides software solutions and services worldwide. It offers SOLIDWORKS design software for 3D design, electrical and printed circuit board design, product data management, simulation, manufacturing, and technical communication; CATIA, an engineering and design software for product 3D computer-aided design; GEOVIA for modeling and simulating the earth; and BIOVIA that provides the scientific community with advanced biological, chemical, and materials experiences. The company also provides SIMULIA that delivers realistic simulation applications; DELMIA, which enables global industrial operations; 3DVIA that provides 3D space planning solutions; and ENOVIA that enables to plan and track the definition of success for customer. In addition, it offers Centric PLM, a product lifecycle management software solution; 3DEXCITE, a real-time 3D visualization software; NETVIBES, which enables organizations to gather, align, and enrich big data; 3DEXPERIENCE platform that provides organizations a holistic and real-time view of their business activities and ecosystem, as well as connecting people, ideas, data, and solutions together in a single environment; and MEDIDATA, a clinical research study software that provides evidences and insights to pharmaceutical, biotech, medical device, and diagnostic companies, as well as academic researchers. Further, the company provides consulting, deployment, outcome based, and training services. It primarily serves companies in the transportation and mobility; industrial equipment; aerospace and defense; high-tech; life sciences and healthcare; energy and materials; home and lifestyle; construction, cities, and territories; consumer packaged goods and retail; marine and offshore; and business services sectors through distributors and resellers. Dassault Systèmes SE was incorporated in 1981 and is headquartered in Vélizy-Villacoublay, France.",
    "ceo": "Mr. Bernard S. Charles",
    "sector": "Technology",
    "country": "FR",
    "fullTimeEmployees": "24753",
    "phone": "33 1 61 62 61 62",
    "address": "10, Rue Marcel Dassault",
    "city": "Vélizy-Villacoublay",
    "state": null,
    "zip": "78140",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DASTY.png",
    "ipoDate": "1996-06-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]