[
  {
    "symbol": "DAVA",
    "price": 49.49,
    "beta": 1.167521,
    "volAvg": 304406,
    "mktCap": 2816500645,
    "lastDiv": 0,
    "range": "44.62-115.86",
    "changes": 0.25,
    "companyName": "Endava plc",
    "currency": "USD",
    "cik": "0001656081",
    "isin": "US29260V1052",
    "cusip": "29260V105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.endava.com",
    "description": "Endava plc provides technology services for clients in the consumer products, healthcare, mobility, and retail verticals in Europe, Latin America, North America, and internationally. The company offers technology and digital advisory services for payments and financial services, and TMT sectors; IT strategies; business analysis services; program management services; digital product strategy services; and architecture, extended reality, machine learning and artificial intelligence, product design, and user experience and visual design services. It also engages in the identifying, defining, and embedding collaborative data and analytics; and provision of automated testing, cloud native software engineering, continuous delivery, distributed agile delivery, intelligent automation, secure development, agile applications management, cloud infrastructure, DevSecOps, service delivery, smart desk, and telemetry and monitoring services. The company was founded in 2000 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. John E. Cotterell",
    "sector": "Technology",
    "country": "GB",
    "fullTimeEmployees": "11742",
    "phone": "44 20 7367 1000",
    "address": "125 Old Broad Street",
    "city": "London",
    "state": null,
    "zip": "EC2N 1AR",
    "dcfDiff": 9.74505,
    "dcf": 79.145,
    "image": "https://financialmodelingprep.com/image-stock/DAVA.png",
    "ipoDate": "2018-07-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]