[
  {
    "symbol": "DBSDY",
    "price": 93.24,
    "beta": 0.898084,
    "volAvg": 64651,
    "mktCap": 60113507812,
    "lastDiv": 4.59,
    "range": "81.68-110.1",
    "changes": 0.14,
    "companyName": "DBS Group Holdings Ltd",
    "currency": "USD",
    "cik": null,
    "isin": "US23304Y1001",
    "cusip": "23304Y100",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.dbs.com",
    "description": "DBS Group Holdings Ltd provides financial products and services in Singapore, Hong Kong, rest of Greater China, South and Southeast Asia, and internationally. It operates through Consumer Banking/Wealth Management, Institutional Banking, Treasury Markets, and Others segments. The Consumer Banking/Wealth Management segment offers banking and related financial services, including current and savings accounts, fixed deposits, loans and home finance, cards, payments, investment, and insurance products for individual customers. The Institutional Banking segment provides financial services and products for bank and non-bank financial institutions, government-linked companies, large corporates, and small and medium sized businesses. Its products and services comprise short-term working capital financing and specialized lending; cash management, trade finance, and securities and fiduciary services; treasury and markets products; and corporate finance and advisory banking, as well as capital markets solutions. The Treasury Markets segment is involved in the structuring, market-making, and trading in a range of treasury products. The Others segment offers Islamic banking services. The company was founded in 1968 and is headquartered in Singapore.",
    "ceo": "Mr. Piyush  Gupta",
    "sector": "Financial Services",
    "country": "SG",
    "fullTimeEmployees": "36000",
    "phone": "65 6878 8888",
    "address": "Tower 3",
    "city": "Singapore",
    "state": null,
    "zip": "018982",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DBSDY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]