[
  {
    "symbol": "DCCPF",
    "price": 58.175,
    "beta": 0.691187,
    "volAvg": 100,
    "mktCap": 5744618360,
    "lastDiv": 2.3,
    "range": "49.5-66.86",
    "changes": 0,
    "companyName": "DCC plc",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Oil & Gas Refining & Marketing",
    "website": "https://www.dcc.ie",
    "description": "DCC plc provides sales, marketing, and support services worldwide. The company's DCC LPG segment sells and markets liquefied petroleum gas (LPG), refrigerants, and natural gas. Its DCC Retail & Oil segment markets, sells, and retails transport and commercial fuels, heating oils, and related products and services; operates retail petrol stations; resells fuel cards; distributes oil; and provides inbound logistics, storage and filling, and outbound logistics services. This segment serves domestic, agricultural, commercial/industrial, forecourt, aviation, and marine customers. The company's DCC Healthcare segment offers products and services to healthcare providers, and health and beauty brand owners; outsourced contract manufacturing services to the health and beauty sector; nutrition products, such as vitamins and health supplements; beauty products; and product development, formulation, manufacturing, and packaging services. In addition, this segment procures and sells exempt medicinal products. Its DCC Technology segment distributes consumer technology products, including smart home products, gaming consoles, peripherals and software, wearable technology, and accessories; business and enterprise technology products, such as tablets, notebooks, and PCs; networking and security products; communication products comprising smartphones; and servers and storage products, audio visual products, printers, peripherals, cables and connectors, and consumables to retailers, resellers, and integrators. It also provides supply chain services. The company was founded in 1976 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Donal  Murphy B.Comm, BFS, MBA",
    "sector": "Energy",
    "country": "IE",
    "fullTimeEmployees": "16100",
    "phone": "353 1 279 9400",
    "address": "DCC House",
    "city": "Dublin",
    "state": null,
    "zip": "18",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DCCPF.png",
    "ipoDate": "2010-03-31",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]