[
  {
    "symbol": "DCI",
    "price": 61.8,
    "beta": 1.208098,
    "volAvg": 475145,
    "mktCap": 7492755600,
    "lastDiv": 1,
    "range": "46.98-66.96",
    "changes": -0.37,
    "companyName": "Donaldson Company, Inc.",
    "currency": "USD",
    "cik": "0000029644",
    "isin": "US2576511099",
    "cusip": "257651109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.donaldson.com",
    "description": "Donaldson Company, Inc. manufactures and sells filtration systems and replacement parts worldwide. The company operates through two segments, Engine Products and Industrial Products. Its Engine Products segment provides replacement filters for air and liquid filtration applications; air filtration systems; liquid filtration systems for fuel, lube, and hydraulic applications; exhaust and emissions systems and sensors; indicators; and monitoring systems. This segment sells its products to original equipment manufacturers (OEMs) in the construction, mining, agriculture, aerospace, defense, and transportation markets; and to independent distributors, OEM dealer networks, private label accounts, and large fleets. The company's Industrial Products segment offers dust, fume, and mist collectors; compressed air purification systems; gas and liquid filtration for food, beverage, and industrial processes; air filtration systems for gas turbines; polytetrafluoroethylene membrane-based products; and specialized air and gas filtration systems for applications, including hard disk drives, semi-conductor manufacturing and sensors, indicators, and monitoring systems. This segment sells its products to various dealers, distributors, OEMs of gas-fired turbines, and OEMs and end-users requiring air filtration solutions and replacement filters. Donaldson Company, Inc. was founded in 1915 and is headquartered in Bloomington, Minnesota.",
    "ceo": "Mr. Tod E. Carpenter",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "14000",
    "phone": "952 887 3131",
    "address": "1400 West 94th Street",
    "city": "Bloomington",
    "state": "MN",
    "zip": "55431",
    "dcfDiff": 0.217911,
    "dcf": 61.8979,
    "image": "https://financialmodelingprep.com/image-stock/DCI.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]