[
  {
    "symbol": "DD",
    "price": 69.67,
    "beta": 1.235915,
    "volAvg": 3435051,
    "mktCap": 31979713833,
    "lastDiv": 1.44,
    "range": "49.52-78.4",
    "changes": 0.47,
    "companyName": "DuPont de Nemours, Inc.",
    "currency": "USD",
    "cik": "0001666700",
    "isin": "US26614N1028",
    "cusip": "26614N102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.dupont.com",
    "description": "DuPont de Nemours, Inc. provides technology-based materials and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. It operates through three segments: Electronics & Industrial, Mobility & Materials, and Water & Protection. The Electronics & Industrial segment supplies materials and printing systems to the advanced printing industry; and materials and solutions for the fabrication of semiconductors and integrated circuits addressing front-end and back-end of the manufacturing process. This segment also provides semiconductor and advanced packaging materials; dielectric and metallization solutions for chip packaging; and silicones for light emitting diode packaging and semiconductor applications; permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, electroless, and electrolytic metallization solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for organic light emitting diode, and other display applications, as well as provides high performance parts, and specialty silicone elastomers, and lubricants. The Mobility & Materials segment provides engineering resins, silicone encapsulants, pastes, filaments, and advanced films to engineers and designers in the transportation, electronics, renewable energy, industrial, and consumer end-markets. The Water & Protection segment provides engineered products and integrated systems for worker safety, water purification and separation, transportation, energy, medical packaging and building materials. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. is headquartered in Wilmington, Delaware.",
    "ceo": "Mr. Edward D. Breen",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "23000",
    "phone": "302 774 3034",
    "address": "Building 730",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19805",
    "dcfDiff": 0.0643875,
    "dcf": 73.6144,
    "image": "https://financialmodelingprep.com/image-stock/DD.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]