[
  {
    "symbol": "DE",
    "price": 405.2,
    "beta": 1.035563,
    "volAvg": 1828524,
    "mktCap": 118801398400,
    "lastDiv": 5,
    "range": "283.81-448.4",
    "changes": -4.31,
    "companyName": "Deere & Company",
    "currency": "USD",
    "cik": "0000315189",
    "isin": "US2441991054",
    "cusip": "244199105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Farm & Heavy Construction Machinery",
    "website": "https://www.deere.com",
    "description": "Deere & Company manufactures and distributes various equipment worldwide. The company operates through four segments: Production and Precision Agriculture, Small Agriculture and Turf, Construction and Forestry, and Financial Services. The Production and Precision Agriculture segment provides mid-size tractors, combines, cotton pickers and strippers, sugarcane harvesters, harvesting front-end equipment, sugarcane loaders, pull-behind scrapers, and tillage and seeding equipment, as well as application equipment, including sprayers and nutrient management, and soil preparation machinery for grain growers. The Small Agriculture and Turf segment offers utility tractors, and related loaders and attachments; turf and utility equipment, including riding lawn equipment, commercial mowing equipment, golf course equipment, and utility vehicles, as well as implements for mowing, tilling, snow and debris handling, aerating, residential, commercial, golf, and sports turf care applications; other outdoor power products; and hay and forage equipment. This segment also resells products from other manufacturers. It serves dairy and livestock producers, crop producers, and turf and utility customers. The Construction and Forestry segment provides a range of backhoe loaders, crawler dozers and loaders, four-wheel-drive loaders, excavators, motor graders, articulated dump trucks, landscape and skid-steer loaders, milling machines, pavers, compactors, rollers, crushers, screens, asphalt plants, log skidders, log feller bunchers, log loaders and forwarders, log harvesters, and attachments; and roadbuilding equipment. The Financial Services segment finances sales and leases agriculture and turf, and construction and forestry equipment. It also offers wholesale financing to dealers of the foregoing equipment; and extended equipment warranties, as well as finances retail revolving charge accounts. Deere & Company was founded in 1837 and is headquartered in Moline, Illinois.",
    "ceo": "Mr. John C. May II",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "82200",
    "phone": "309-765-8000",
    "address": "One John Deere Place",
    "city": "Moline",
    "state": "IL",
    "zip": "61265",
    "dcfDiff": 19.0518,
    "dcf": 437.232,
    "image": "https://financialmodelingprep.com/image-stock/DE.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]