[
  {
    "symbol": "DECK",
    "price": 520.12,
    "beta": 0.907746,
    "volAvg": 445124,
    "mktCap": 13606235176,
    "lastDiv": 0,
    "range": "238.43-522.6",
    "changes": 8.08,
    "companyName": "Deckers Outdoor Corporation",
    "currency": "USD",
    "cik": "0000910521",
    "isin": "US2435371073",
    "cusip": "243537107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Footwear & Accessories",
    "website": "https://www.deckers.com",
    "description": "Deckers Outdoor Corporation, together with its subsidiaries, designs, markets, and distributes footwear, apparel, and accessories for casual lifestyle use and high-performance activities. The company offers premium footwear, apparel, and accessories under the UGG brand name; sandals, shoes, and boots under the Teva brand name; and relaxed casual shoes and sandals under the Sanuk brand name. It also provides footwear and apparel for ultra-runners and athletes under the Hoka brand name; and fashion casual footwear using other plush materials under the Koolaburra brand. The company sells its products through department stores, domestic independent action sports and outdoor specialty footwear retailers, and larger national retail chains, as well as online retailers. It also sells its products directly to consumers through its retail stores and e-commerce websites, as well as distributes its products through distributors and retailers in the United States, Europe, the Asia-Pacific, Canada, Latin America, and internationally. As of March 31, 2022, it had 149 retail stores, including 75 concept stores and 74 outlet stores worldwide. The company was founded in 1973 and is headquartered in Goleta, California.",
    "ceo": "Mr. David  Powers",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "4200",
    "phone": "805 967 7611",
    "address": "250 Coromar Drive",
    "city": "Goleta",
    "state": "CA",
    "zip": "93117",
    "dcfDiff": 31.7753,
    "dcf": 394.735,
    "image": "https://financialmodelingprep.com/image-stock/DECK.png",
    "ipoDate": "1993-10-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]