[
  {
    "symbol": "DELL",
    "price": 51.77,
    "beta": 0.973254,
    "volAvg": 4783911,
    "mktCap": 37649370524,
    "lastDiv": 1.48,
    "range": "32.9-51.92",
    "changes": 0.38,
    "companyName": "Dell Technologies Inc.",
    "currency": "USD",
    "cik": "0001571996",
    "isin": "US24703L2025",
    "cusip": "24703L202",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Computer Hardware",
    "website": "https://www.delltechnologies.com",
    "description": "Dell Technologies Inc. designs, develops, manufactures, markets, sells, and supports information technology (IT) solutions, products, and services worldwide. The company operates through three segments: Infrastructure Solutions Group (ISG), Client Solutions Group (CSG), and VMware. The ISG segment provides traditional and next-generation storage solutions; and rack, blade, tower, and hyperscale servers. This segment also offers networking products and services that help its business customers to transform and modernize their infrastructure, mobilize and enrich end-user experiences, and accelerate business applications and processes; attached software and peripherals; and support and deployment, configuration, and extended warranty services. The CSG segment provides desktops, workstations, and notebooks; displays and projectors; attached and third-party software and peripherals, as well as support and deployment, configuration, and extended warranty services. The VMware segment supports customers in the areas of hybrid and multi-cloud, modern applications, networking, security, and digital workspaces, helping customers to manage IT resource across private clouds and complex multi-cloud, multi-device environments. Dell Technologies Inc. also provides information security; and cloud software and infrastructure-as-a-service solutions that enable customers to migrate, run, and manage mission-critical applications in cloud-based IT environments. The company was formerly known as Denali Holding Inc. and changed its name to Dell Technologies Inc. in August 2016. Dell Technologies Inc. was founded in 1984 and is headquartered in Round Rock, Texas.",
    "ceo": "Mr. Michael Saul Dell",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "133000",
    "phone": "800 289 3355",
    "address": "One Dell Way",
    "city": "Round Rock",
    "state": "TX",
    "zip": "78682",
    "dcfDiff": 13.1159,
    "dcf": 53.4259,
    "image": "https://financialmodelingprep.com/image-stock/DELL.png",
    "ipoDate": "2016-08-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]