[
  {
    "symbol": "DFIHY",
    "price": 15.615,
    "beta": 0.325287,
    "volAvg": 66,
    "mktCap": 4227448700,
    "lastDiv": 0.15,
    "range": "10.82-16.52",
    "changes": 0,
    "companyName": "DFI Retail Group Holdings Limited",
    "currency": "USD",
    "cik": "0000871459",
    "isin": null,
    "cusip": "233859404",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Grocery Stores",
    "website": "https://www.dairyfarmgroup.com",
    "description": "DFI Retail Group Holdings Limited operates as a retailer in Asia. The company operates through five segments: Food, Health and Beauty, Home Furnishings, Restaurants, and Other Retailing. It primarily operates supermarkets and hypermarkets under the Wellcome, Yonghui, CS Fresh, MarketPlace, Giant, Hero, Mercato, Oliver's, 3hreesixty, San Miu, Jasons, and Lucky brands; and convenience stores under the 7-Eleven brand. The company also operates health and beauty stores under the Mannings, Guardian, and GNC brands; and home furnishings stores under the IKEA brand, as well as restaurants under the Maxim's brand. As of December 31, 2021, it operated 10,286 outlets in 12 Asian markets and territories. The company was formerly known as Dairy Farm International Holdings Limited and changed its name to DFI Retail Group Holdings Limited in May 2022. DFI Retail Group Holdings Limited was incorporated in 1886 and is based in Quarry Bay, Hong Kong. DFI Retail Group Holdings Limited is a subsidiary of Jardine Strategic Holdings Limited.",
    "ceo": "Mr. Ian James Winward McLeod",
    "sector": "Consumer Defensive",
    "country": "HK",
    "fullTimeEmployees": "216000",
    "phone": "852 2299 1888",
    "address": "Devon House",
    "city": "Quarry Bay",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DFIHY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]