[
  {
    "symbol": "DGX",
    "price": 141.92,
    "beta": 0.939084,
    "volAvg": 985677,
    "mktCap": 15896317280,
    "lastDiv": 2.84,
    "range": "120.4-158.34",
    "changes": -0.64,
    "companyName": "Quest Diagnostics Incorporated",
    "currency": "USD",
    "cik": "0001022079",
    "isin": "US74834L1008",
    "cusip": "74834L100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Diagnostics & Research",
    "website": "https://www.questdiagnostics.com",
    "description": "Quest Diagnostics Incorporated provides diagnostic testing, information, and services in the United States and internationally. The company develops and delivers diagnostic information services, such as routine testing, non-routine and advanced clinical testing, anatomic pathology testing, and other diagnostic information services. It offers diagnostic information services primarily under the Quest Diagnostics brand, as well as under the AmeriPath, Dermpath Diagnostics, ExamOne, and Quanum brands to patients, clinicians, hospitals, independent delivery networks, health plans, employers, direct contract entities, and accountable care organizations through a network of laboratories, patient service centers, phlebotomists in physician offices, call centers and mobile paramedics, nurses, and other health and wellness professionals. The company also provides risk assessment services for the life insurance industry; and healthcare organizations and clinicians robust information technology solutions. Quest Diagnostics Incorporated was founded in 1967 and is headquartered in Secaucus, New Jersey.",
    "ceo": "Mr. James E. Davis",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "40000",
    "phone": "973 520 2700",
    "address": "500 Plaza Drive",
    "city": "Secaucus",
    "state": "NJ",
    "zip": "07094",
    "dcfDiff": 7.846,
    "dcf": 153.476,
    "image": "https://financialmodelingprep.com/image-stock/DGX.png",
    "ipoDate": "1996-12-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]