[
  {
    "symbol": "DHI",
    "price": 122.2,
    "beta": 1.536971,
    "volAvg": 3006906,
    "mktCap": 41678877178,
    "lastDiv": 1,
    "range": "64.39-124.05",
    "changes": -0.85,
    "companyName": "D.R. Horton, Inc.",
    "currency": "USD",
    "cik": "0000882184",
    "isin": "US23331A1097",
    "cusip": "23331A109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Residential Construction",
    "website": "https://www.drhorton.com",
    "description": "D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 31 states and 98 markets under the names of D.R. Horton, America's Builder, Express Homes, Emerald Homes, and Freedom Homes. The company constructs and sells single-family detached homes; and attached homes, such as town homes, duplexes, and triplexes. It also provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; owns non-residential real estate, including ranch land and improvements; and owns and operates energy related assets. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.",
    "ceo": "Mr. David V. Auld",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "13237",
    "phone": "817 390 8200",
    "address": "1341 Horton Circle",
    "city": "Arlington",
    "state": "TX",
    "zip": "76011",
    "dcfDiff": 7.11362,
    "dcf": 89.4064,
    "image": "https://financialmodelingprep.com/image-stock/DHI.png",
    "ipoDate": "1992-06-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]