[
  {
    "symbol": "DHR",
    "price": 234.77,
    "beta": 0.803169,
    "volAvg": 3292596,
    "mktCap": 173236550108,
    "lastDiv": 1.08,
    "range": "221.22-303.82",
    "changes": 0.97,
    "companyName": "Danaher Corporation",
    "currency": "USD",
    "cik": "0000313616",
    "isin": "US2358511028",
    "cusip": "235851102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Diagnostics & Research",
    "website": "https://www.danaher.com",
    "description": "Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The company operates through three segments: Life Sciences, Diagnostics, and Environmental & Applied Solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, particle counting and characterization; microscopes; genomics consumables; and Gene and Cell Therapy. This segment also offers bioprocess technologies, consumables, and services; and filtration, separation, and purification technologies to the pharmaceutical and biopharmaceutical, food and beverage, medical, and life sciences companies, as well as universities, medical schools and research institutions, and various industrial manufacturers. The Diagnostics segment provides chemistry, immunoassay, microbiology, and automation systems, as well as hematology, molecular, acute care, and pathology diagnostics products. This segment offers clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The Environmental & Applied Solutions segment offers instrumentation, consumables, software, services, and disinfection systems to analyze, treat, and manage ultra-pure, potable, industrial, waste, ground, source, and ocean water in residential, commercial, industrial, and natural resource applications. This segment also provides instruments, software, services, and consumables for various color and appearance management, packaging design and quality management, packaging converting, printing, marking, coding, and traceability applications for consumer, pharmaceutical, and industrial products. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is headquartered in Washington, the District of Columbia.",
    "ceo": "Mr. Rainer M. Blair",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "79000",
    "phone": "202 828 0850",
    "address": "2200 Pennsylvania Avenue, NW",
    "city": "Washington",
    "state": "DC",
    "zip": "20037-1701",
    "dcfDiff": 2.41024,
    "dcf": 263.57,
    "image": "https://financialmodelingprep.com/image-stock/DHR.png",
    "ipoDate": "1978-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]