[
  {
    "symbol": "DIFTY",
    "price": 24.5,
    "beta": 0.347892,
    "volAvg": 3401,
    "mktCap": 6682644304,
    "lastDiv": 0.96,
    "range": "20.0-28.5",
    "changes": 0.25,
    "companyName": "Daito Trust Construction Co.,Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US23405X2099",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Real Estate—Diversified",
    "website": "https://www.kentaku.co.jp",
    "description": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through Construction, Real Estate, and Other segments. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company also engages in flexible workspace business; and management of facility reservation portal sites. The company was incorporated in 1974 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Kei  Takeuchi",
    "sector": "Real Estate",
    "country": "JP",
    "fullTimeEmployees": "17650",
    "phone": "81 3 6718 9111",
    "address": "2-16-1, Konan",
    "city": "Tokyo",
    "state": null,
    "zip": "108-8211",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DIFTY.png",
    "ipoDate": "2010-10-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": true
  }
]