[
  {
    "symbol": "DINO",
    "price": 43.9,
    "beta": 1.390492,
    "volAvg": 2595462,
    "mktCap": 8442277651,
    "lastDiv": 1.8,
    "range": "37.12-66.19",
    "changes": 0.28,
    "companyName": "HF Sinclair Corporation",
    "currency": "USD",
    "cik": "0001915657",
    "isin": null,
    "cusip": "403949100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Refining & Marketing",
    "website": "https://www.hfsinclair.com",
    "description": "HF Sinclair Corporation operates as an independent energy company. It produces and markets gasoline, diesel fuel, jet fuel, renewable diesel, specialty lubricant products, specialty chemicals, specialty and modified asphalt, and others. The company also owns and operates refineries located in Kansas, Oklahoma, New Mexico, Utah, Washington, and Wyoming; and markets its refined products principally in the Southwest United States and Rocky Mountains, Pacific Northwest, and in other neighboring Plains states. In addition, it supplies fuels to approximately 1,300 independent Sinclair-branded stations and licenses the use of the Sinclair brand at approximately 300 additional locations, as well as engages in the growing renewables business. Further, the company produces base oils and other specialized lubricants; and provides petroleum product and crude oil transportation, terminalling, storage, and throughput services to the petroleum industry. HF Sinclair Corporation was incorporated in 2021 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Timothy  Go",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "5223",
    "phone": "214 871 3555",
    "address": "2828 North Harwood",
    "city": "Dallas",
    "state": "TX",
    "zip": "75201",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DINO.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]