[
  {
    "symbol": "DINRF",
    "price": 110.225,
    "beta": 1.370498,
    "volAvg": 121,
    "mktCap": 5491166895,
    "lastDiv": 4.62,
    "range": "52.26-110.225",
    "changes": 7.725,
    "companyName": "SCREEN Holdings Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Semiconductor Equipment & Materials",
    "website": "https://www.screen.co.jp",
    "description": "SCREEN Holdings Co., Ltd. develops, manufactures, sells, and maintains semiconductor production equipment in Japan. The company offers coat/develop trackers, wafer cleaning systems, annealing systems, measurement systems, inspection systems, and advanced packaging lithography equipment. It also provides coater systems, vacuum film deposition equipment, wet processors, dryers, heaters, exposures, and laminators/de-laminators. In addition, the company offers direct imaging systems, automatic optical inspection systems, and defect verification and repair systems; automatic final visual inspection systems; and setup station. Further, it provides high-speed inkjet, label, wide format, CTP, network support, Hiragino font, and other workflow solutions; offset printing, digital book, manual, direct mail, transpromo, label production, package printing, display, and signage solutions; and artificial intelligence, text mining, augmented reality, image analysis, and congestion analysis solutions. Additionally, the company offers biosciences equipment; compact inkjet printing systems for tablets, UV inkjet printing systems for aluminum rolls, and inkjet printing systems for tablets; in-vehicle components for inspection and measurement; and lithium-ion rechargeable batteries and fuel cells. It also undertakes contract manufacturing and support, and intellectual property services related operations. The company was formerly known as Dainippon Screen Mfg. Co., Ltd. and changed its name to SCREEN Holdings Co., Ltd. in October 2014. SCREEN Holdings Co., Ltd. was incorporated in 1943 and is headquartered in Kyoto, Japan.",
    "ceo": "Mr. Toshio  Hiroe",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "5987",
    "phone": "81 75 414 7111",
    "address": "Tenjinkita-machi 1-1",
    "city": "Kyoto",
    "state": null,
    "zip": "602-8585",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DINRF.png",
    "ipoDate": "2010-05-06",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]