[
  {
    "symbol": "DIOD",
    "price": 89.99,
    "beta": 1.460915,
    "volAvg": 236716,
    "mktCap": 4114360798,
    "lastDiv": 0,
    "range": "58.52-97.45",
    "changes": -0.52,
    "companyName": "Diodes Incorporated",
    "currency": "USD",
    "cik": "0000029002",
    "isin": "US2545431015",
    "cusip": "254543101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.diodes.com",
    "description": "Diodes Incorporated designs, manufactures, and supplies application-specific standard products in the discrete, logic, analog, and mixed-signal semiconductor markets worldwide. It focuses on low pin count semiconductor devices with one or more active or passive components. The company offers discrete semiconductor products, such as MOSFET, TVS, and performance Schottky rectifiers; GPP bridges and retifiers, and performance Schottky diodes; Zener and performance Zener diodes, including tight tolerance and low operating current type; standard, fast, super-fast, and ultra-fast recovery rectifiers; bridge rectifiers; switching diodes; small signal bipolar and prebiased transistors; thyristor surge protection devices; and transient voltage suppressors. It also provides analog products, such as power management devices comprising AC-DC and DC-DC converters, USB power switches, and low dropout and linear voltage regulators; linear devices, such as operational amplifiers and comparators, current monitors, voltage references, and reset generators; LED lighting drivers; audio amplifiers; and sensor products, including hall-effect sensors and motor drivers. The company offers mixed-signal products, such as high speed mux/demux products, digital switches, interfaces, redrivers, universal level shifters/voltage translator, clock ICs, and packet switches; standard logic products comprising low-voltage complementary metaloxidesemiconductor (CMOS) and high-speed CMOS devices; ultra-low power CMOS logic products and analog switches; multichip products and co-packaged discrete, analog, and mixed-signal silicon in miniature packages; silicon and silicon epitaxial wafers; and crystals and oscillators. It sells its products to the consumer electronics, computing, communications, industrial, and automotive markets through direct sales, marketing personnel, independent sales representatives, and distributors. The company was incorporated in 1959 and is headquartered in Plano, Texas.",
    "ceo": "Dr. Keh-Shew  Lu Ph.D.",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "8257",
    "phone": "972 987 3900",
    "address": "4949 Hedgcoxe Road",
    "city": "Plano",
    "state": "TX",
    "zip": "75024",
    "dcfDiff": 2.85445,
    "dcf": 92.3944,
    "image": "https://financialmodelingprep.com/image-stock/DIOD.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]