[
  {
    "symbol": "DIS",
    "price": 88.83,
    "beta": 1.305281,
    "volAvg": 12231537,
    "mktCap": 162319056157,
    "lastDiv": 15.83588900000001,
    "range": "84.07-126.48",
    "changes": -0.23,
    "companyName": "The Walt Disney Company",
    "currency": "USD",
    "cik": "0001744489",
    "isin": "US2546871060",
    "cusip": "254687106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Entertainment",
    "website": "https://www.thewaltdisneycompany.com",
    "description": "The Walt Disney Company, together with its subsidiaries, operates as an entertainment company worldwide. It operates through two segments, Disney Media and Entertainment Distribution; and Disney Parks, Experiences and Products. The company engages in the film and episodic television content production and distribution activities, as well as operates television broadcast networks under the ABC, Disney, ESPN, Freeform, FX, Fox, National Geographic, and Star brands; and studios that produces motion pictures under the Walt Disney Pictures, Twentieth Century Studios, Marvel, Lucasfilm, Pixar, and Searchlight Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, ESPN+, Hulu, and Star+; sale/licensing of film and television content to third-party television and subscription video-on-demand services; theatrical, home entertainment, and music distribution services; staging and licensing of live entertainment events; and post-production services by Industrial Light & Magic and Skywalker Sound. In addition, the company operates theme parks and resorts, such as Walt Disney World Resort in Florida; Disneyland Resort in California; Disneyland Paris; Hong Kong Disneyland Resort; and Shanghai Disney Resort; Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney as well as Aulani, a Disney resort and spa in Hawaii; licenses its intellectual property to a third party for the operations of the Tokyo Disney Resort; and provides consumer products, which include licensing of trade names, characters, visual, literary, and other IP for use on merchandise, published materials, and games. Further, it sells branded merchandise through retail, online, and wholesale businesses; and develops and publishes books, comic books, and magazines. The Walt Disney Company was founded in 1923 and is based in Burbank, California.",
    "ceo": "Mr. Robert A. Iger",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "171600",
    "phone": "818 560 1000",
    "address": "500 South Buena Vista Street",
    "city": "Burbank",
    "state": "CA",
    "zip": "91521",
    "dcfDiff": 3.2297,
    "dcf": 106.31,
    "image": "https://financialmodelingprep.com/image-stock/DIS.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]