[
  {
    "symbol": "DISH",
    "price": 6.6,
    "beta": 1.803521,
    "volAvg": 13000612,
    "mktCap": 3515212800,
    "lastDiv": 9.766,
    "range": "5.83-20.35",
    "changes": 0.23,
    "companyName": "DISH Network Corporation",
    "currency": "USD",
    "cik": "0001001082",
    "isin": "US25470M1099",
    "cusip": "25470M109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Telecom Services",
    "website": "https://www.dish.com",
    "description": "DISH Network Corporation, together with its subsidiaries, provides pay-TV services in the United States. The company operates in two segments, Pay-TV and Wireless. It offers video services under the DISH TV brand; and programming packages that include programming through national broadcast networks, local broadcast networks, and national and regional cable networks, as well as regional and specialty sports channels, premium movie channels, and Latino and international programming packages. The company also provides access to movies and television shows through TV or Internet-connected devices; and dishanywhere.com and mobile applications on Internet-connected devices to view authorized content, search program listings, and remotely control certain features of their DVRs. In addition, it offers Sling TV services, including Sling domestic, Sling International, Sling Latino, Sling Orange, and Sling Blue services that require an Internet connection and are available on streaming-capable devices, such as streaming media devices, TVs, tablets, computers, game consoles, and phones, as well as market SLING TV services to consumers who do not subscribe to traditional satellite and cable pay-TV services. Further, the company provides wireless subscribers consumer plans with no annual service contracts, as well as monthly service plans, including high-speed data and unlimited talk and text. As of December 31, 2021, it had 10.707 million pay-TV subscribers in the United States, including 8.221 million DISH TV subscribers and 2.486 million SLING TV subscribers. The company offers receiver systems and programming through direct sales channels, as well as independent third parties, such as small retailers, direct marketing groups, local and regional consumer electronics stores, retailers, and telecommunications companies. DISH Network Corporation was founded in 1980 and is headquartered in Englewood, Colorado.",
    "ceo": "Mr. W. Erik Carlson",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "14200",
    "phone": "303 723 1000",
    "address": "9601 South Meridian Boulevard",
    "city": "Englewood",
    "state": "CO",
    "zip": "80112",
    "dcfDiff": 4.26527,
    "dcf": 18.6653,
    "image": "https://financialmodelingprep.com/image-stock/DISH.png",
    "ipoDate": "1995-06-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]