[
  {
    "symbol": "DITHF",
    "price": 3.65,
    "beta": 1.040229,
    "volAvg": 25,
    "mktCap": 5027692442,
    "lastDiv": 0.23,
    "range": "2.55-3.982",
    "changes": -0.2,
    "companyName": "DS Smith Plc",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Packaging & Containers",
    "website": "https://www.dssmith.com",
    "description": "DS Smith Plc provides packaging solutions, paper products, and recycling services worldwide. The company offers transit and transport, consumer, retail and shelf ready, online and e-retail, industrial, hazardous, multi-material, cushioning, and electrostatic discharge packaging products, as well as wrap arounds, trays, and bag-in-boxes; displays and promotional packaging products; corrugated pallets; Sheetfeeding products; packaging machine systems; and Sizzlepak, a stuffing material made of paper, folded in a zigzag shape, and cut into narrow strips, as well as provides outdoor advertising services. It also provides various recycling and waste management services, including total waste management, paper and cardboard recycling, confidential shredding, and coffee cups and plastics recycling, as well as equipment for the retail, manufacturing, print and publishing, paper mills, automotive, and public sectors. In addition, the company offers recycled corrugated case materials, specialty papers, and kraft liners, as well as related technical and supply chain services. It provides its packaging solutions for the food and drink, consumer goods, industrial, e-commerce and e-retail, and converter industries. The company was formerly known as David S. Smith (Holdings) PLC and changed its name to DS Smith Plc in 2001. DS Smith Plc was founded in 1940 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. Miles William Roberts",
    "sector": "Consumer Cyclical",
    "country": "GB",
    "fullTimeEmployees": "29584",
    "phone": "44 20 7756 1800",
    "address": "Regent’s Place",
    "city": "London",
    "state": null,
    "zip": "NW1 3AX",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DITHF.png",
    "ipoDate": "2013-12-19",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]