[
  {
    "symbol": "DKILY",
    "price": 20.12,
    "beta": 0.883908,
    "volAvg": 128695,
    "mktCap": 58888222966,
    "lastDiv": 0.16,
    "range": "13.86-21.36",
    "changes": 0.01,
    "companyName": "Daikin Industries,Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US23381B1061",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Building Products & Equipment",
    "website": "https://www.daikin.com",
    "description": "Daikin Industries, Ltd. manufactures, distributes, and sells air-conditioning and refrigeration equipment, and chemical products. The company's air-conditioning and refrigeration equipment products include room air-conditioning systems; air purifiers; heat-pump hot-water supply and room-heating systems; packaged air-conditioning systems; multiple air-conditioning systems for office buildings; air-conditioning systems for facilities and plants; absorption refrigerators; freezers; water chillers; turbo refrigerator equipment; air-handling units; air filters; industrial dust collectors; marine-type container refrigeration; and refrigerating and freezing showcases. The company's chemical products comprising fluorocarbons, fluoroplastics, fluoroelastomers, fluoropaints, fluoro coating agents, semiconductor-etching products, water and oil repellent agents, pharmaceuticals and intermediates, and dry air suppliers. It also provides oil hydraulics products, including oil hydraulic pumps and valves, cooling equipment and systems, inverter-controlled pump motors, hydrostatic transmissions, and centralized lubrication units and systems; and defense products consisting of warheads, warhead parts for guided missiles, and home-use oxygen therapy equipment. In addition, the company offers after sales services. It sells its products in Japan, the United States, China, Asia, Oceania, Europe /the Middle and Near East/Africa, and internationally. Daikin Industries, Ltd. was founded in 1924 and is headquartered in Osaka, Japan.",
    "ceo": "Mr. Masanori  Togawa",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "88698",
    "phone": "81 6 6373 4312",
    "address": "Umeda Center Building",
    "city": "Osaka",
    "state": null,
    "zip": "530-8323",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DKILY.png",
    "ipoDate": "2010-02-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]