[
  {
    "symbol": "DKL",
    "price": 55.29,
    "beta": 2.138028,
    "volAvg": 32740,
    "mktCap": 2409267279,
    "lastDiv": 4.1,
    "range": "41.8-64.47",
    "changes": -0.68,
    "companyName": "Delek Logistics Partners, LP",
    "currency": "USD",
    "cik": "0001552797",
    "isin": "US24664T1034",
    "cusip": "24664T103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.deleklogistics.com",
    "description": "Delek Logistics Partners, LP owns and operates logistics and marketing assets for crude oil, and intermediate and refined products in the United States. It operates through three segments: Pipelines and Transportation, Wholesale Marketing and Terminalling, and Investment in Pipeline Joint Ventures. The Pipelines and Transportation segment includes pipelines, trucks, and ancillary assets that provide crude oil gathering, crude oil intermediate and refined products transportation, and storage services primarily in support of the Tyler, El Dorado, and Big Spring refineries, as well as offers crude oil and other products transportation services to third parties. This segment operates approximately 400 miles of crude oil transportation pipelines; 450 miles of refined product pipelines; and approximately 900 miles of crude oil gathering, and intermediate and refined products storage tanks with an aggregate of approximately 10.2 million barrels of active shell capacity. The Wholesale Marketing and Terminalling segment provides wholesale marketing, transporting, storage, and terminalling services related to refined products to independent third parties. The Investments in Pipeline Joint Ventures Segment owns a portion of three joint ventures that have constructed separate crude oil pipeline systems and related ancillary assets, which serves third parties and subsidiaries. Delek Logistics GP, LLC serves as the general partner of the company. Delek Logistics Partners, LP was incorporated in 2012 and is headquartered in Brentwood, Tennessee. Delek Logistics Partners, LP operates as a subsidiary of Delek US Holdings, Inc.",
    "ceo": "Mr. Avigal  Soreq",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "0",
    "phone": "615 771 6701",
    "address": "7102 Commerce Way",
    "city": "Brentwood",
    "state": "TN",
    "zip": "37027",
    "dcfDiff": 4.53874,
    "dcf": 54.2687,
    "image": "https://financialmodelingprep.com/image-stock/DKL.png",
    "ipoDate": "2012-11-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]