[
  {
    "symbol": "DKNG",
    "price": 25.66,
    "beta": 1.78734,
    "volAvg": 11778724,
    "mktCap": 11851481149,
    "lastDiv": 0,
    "range": "10.694-26.645",
    "changes": -0.3,
    "companyName": "DraftKings Inc.",
    "currency": "USD",
    "cik": "0001883685",
    "isin": "US26142R1041",
    "cusip": "26142V105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Gambling",
    "website": "https://www.draftkings.com",
    "description": "DraftKings Inc. operates a digital sports entertainment and gaming company. It offers multi-channel sports betting and gaming technologies, powering sports and gaming entertainment for operators in 17 countries. The company operates iGaming through its DraftKings brand in 5 states, as well as operates Golden Nugget Online Gaming, an iGaming product and gaming brand in 3 states. Its Sportsbook is live with mobile and/or retail betting operations in the United States pursuant to regulations in 18 states. The company's daily fantasy sports product is available in 6 countries internationally with 15 distinct sports categories. In addition, it offers DraftKings Marketplace, a digital collectibles ecosystem designed for mainstream accessibility that offers curated NFT drops and supports secondary-market transactions, as well as owns Vegas Sports Information Network (VSiN), a multi-platform broadcast and content company. DraftKings Inc. was founded in 2011 and is headquartered in Boston, Massachusetts.",
    "ceo": "Mr. Jason D. Robins",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "4200",
    "phone": "617 986 6744",
    "address": "222 Berkeley Street",
    "city": "Boston",
    "state": "MA",
    "zip": "02116",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DKNG.png",
    "ipoDate": "2019-07-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]