[
  {
    "symbol": "DKS",
    "price": 135.9,
    "beta": 1.466549,
    "volAvg": 1451791,
    "mktCap": 11718887351,
    "lastDiv": 2.98,
    "range": "73.67-152.61",
    "changes": -1.97,
    "companyName": "DICK'S Sporting Goods, Inc.",
    "currency": "USD",
    "cik": "0001089063",
    "isin": "US2533931026",
    "cusip": "253393102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Retail",
    "website": "https://www.dickssportinggoods.com",
    "description": "DICK'S Sporting Goods, Inc., together with its subsidiaries, operates as a sporting goods retailer primarily in the eastern United States. The company provides hardlines, including sporting goods equipment, fitness equipment, golf equipment, and hunting and fishing gear products; apparel; and footwear and accessories. It also owns and operates Sporting Goods, Golf Galaxy, Field & Stream, Public Lands, Going Going Gone!, and other specialty concept stores; and DICK'S House of Sports and Golf Galaxy Performance Center, as well as GameChanger, a youth sports mobile application for video streaming, scorekeeping, scheduling, and communications. The company sells its product through e-commerce websites and mobile applications. As of January 29, 2022, it operated 730 DICK'S Sporting Goods stores. The company was formerly known as Dick'S Clothing and Sporting Goods, Inc. and changed its name to DICK'S Sporting Goods, Inc. in April 1999. DICK'S Sporting Goods, Inc. was incorporated in 1948 and is headquartered in Coraopolis, Pennsylvania.",
    "ceo": "Ms. Lauren R. Hobart",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "18800",
    "phone": "724 273 3400",
    "address": "345 Court Street",
    "city": "Coraopolis",
    "state": "PA",
    "zip": "15108",
    "dcfDiff": 9.24232,
    "dcf": 135.472,
    "image": "https://financialmodelingprep.com/image-stock/DKS.png",
    "ipoDate": "2002-10-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]