[
  {
    "symbol": "DLB",
    "price": 82.72,
    "beta": 1.003169,
    "volAvg": 315938,
    "mktCap": 7900264344,
    "lastDiv": 1.08,
    "range": "61.55-88.06",
    "changes": 0.42,
    "companyName": "Dolby Laboratories, Inc.",
    "currency": "USD",
    "cik": "0001308547",
    "isin": "US25659T1079",
    "cusip": "25659T107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.dolby.com",
    "description": "Dolby Laboratories, Inc. creates audio and imaging technologies that transform entertainment and communications at the cinema, DTV, transmissions and devices, mobile devices, OTT video and music services, and home entertainment devices. The company develops and licenses its audio technologies, such as AAC & HE-AAC, a digital audio codec solution used for a range of media applications.; AVC, a digital video codec with high bandwidth efficiency used in various media devices; Dolby AC-4, an digital audio coding technology that delivers new audio experiences to a range of playback devices; and Dolby Atmos technology for cinema and a range of media devices. Its audio technologies also include Dolby Digital, a digital audio coding technology that provides multichannel sound to applications; Dolby Digital Plus, a digital audio coding technology that offers audio transmission for a range of media applications and devices; Dolby TrueHD, a digital audio coding technology providing encoding for media application; Dolby Vision, an imaging technology for cinema and media devices; Dolby Voice, an audio conferencing technology; and HEVC, a digital video codec with high bandwidth efficiency to support for media devices. In addition, the company designs and manufactures digital cinema servers, cinema processors, amplifiers, loudspeakers, hardware components, video conferencing solutions, and other products for the cinema, television, broadcast, communication, and entertainment industries. Further, it offers various services to support theatrical and television production for cinema exhibition, broadcast, and home entertainment. The company serves film studios, content creators, post-production facilities, cinema operators, broadcasters, and video game designers. It sells its products directly to the end users, as well as through dealers and distributors worldwide. Dolby Laboratories, Inc. was founded in 1965 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Kevin J. Yeaman",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2336",
    "phone": "415 558 0200",
    "address": "1275 Market Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94103-1410",
    "dcfDiff": 0.162451,
    "dcf": 79.9425,
    "image": "https://financialmodelingprep.com/image-stock/DLB.png",
    "ipoDate": "2005-02-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]