[
  {
    "symbol": "DLTR",
    "price": 145.66,
    "beta": 0.68169,
    "volAvg": 2248296,
    "mktCap": 32101277935,
    "lastDiv": 0,
    "range": "128.85-175.68",
    "changes": -1.02,
    "companyName": "Dollar Tree, Inc.",
    "currency": "USD",
    "cik": "0000935703",
    "isin": "US2567461080",
    "cusip": "256746108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Discount Stores",
    "website": "https://www.dollartree.com",
    "description": "Dollar Tree, Inc. operates discount variety retail stores. It operates in two segments, Dollar Tree and Family Dollar. The Dollar Tree segment offers merchandise at the fixed price of $ 1.25. It provides consumable merchandise, including candy and food, and health and personal care, as well as everyday consumables, such as household paper and chemicals, and frozen and refrigerated food; variety merchandise comprising toys, durable housewares, gifts, stationery, party goods, greeting cards, softlines, arts and crafts supplies, and other items; and seasonal goods that include Christmas, Easter, Halloween, and Valentine's Day merchandise. As of January 29, 2022, this segment operated 8,061 stores under the Dollar Tree and Dollar Tree Canada brands, as well as 15 distribution centers in the United States and 2 distribution centers in Canada. The Family Dollar segment operates general merchandise retail discount stores that offer consumable merchandise, which comprise food and beverages, tobacco, health and personal care, household chemicals, paper products, hardware and automotive supplies, diapers, batteries, and pet food and supplies; and home products, including housewares, home décor, and giftware, as well as domestics, such as comforters, sheets, and towels. It also provides apparel and accessories merchandise comprising clothing, fashion accessories, and shoes; and seasonal and electronics merchandise that include Christmas, Easter, Halloween, and Valentine's Day merchandise, as well as personal electronics, which comprise pre-paid cellular phones and services, stationery and school supplies, and toys. As of January 29, 2022, this segment operated 8,016 stores under the Family Dollar brand; and 11 distribution centers. The company was founded in 1986 and is based in Chesapeake, Virginia.",
    "ceo": "Mr. Richard W. Dreiling",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "65025",
    "phone": "757 321 5000",
    "address": "500 Volvo Parkway",
    "city": "Chesapeake",
    "state": "VA",
    "zip": "23320",
    "dcfDiff": 19.1576,
    "dcf": 169.528,
    "image": "https://financialmodelingprep.com/image-stock/DLTR.png",
    "ipoDate": "1995-03-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]