[
  {
    "symbol": "DNB",
    "price": 11.36,
    "beta": 0.964205,
    "volAvg": 2838783,
    "mktCap": 4990891131,
    "lastDiv": 0.2,
    "range": "9.5-16.67",
    "changes": 0.06,
    "companyName": "Dun & Bradstreet Holdings, Inc.",
    "currency": "USD",
    "cik": "0001799208",
    "isin": "US26484T1060",
    "cusip": "26484T106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Financial Data & Stock Exchanges",
    "website": "https://www.dnb.com",
    "description": "Dun & Bradstreet Holdings, Inc. provides business decisioning data and analytics in North America and internationally. It offers finance and risk solutions, including D&B Finance Analytics, an online application that offers clients real time access to its information, comprehensive monitoring, and portfolio analysis; D&B Direct, an application programming interface (API) that delivers risk and financial data directly into enterprise applications for real-time credit decision making; D&B Small Business, a suite of powerful tools that allows SMBs to monitor and build their business credit file; D&B Enterprise Risk Assessment Manager, a solution for managing and automating credit decisioning and reporting; and InfoTorg, an online SaaS application. The company also provides risk and compliance solutions, such as D&B Supplier Risk Manager that provides insights to help certify, monitor, analyze, and mitigate risk across the supply chain; D&B Onboard to provide comprehensive insights into businesses to facilitate KYC/AML compliance, as well as to minimize financial, legal, and reputational risk exposure; and D&B Beneficial Ownership that offers risk intelligence on ultimate beneficial ownership. It offers sales and marketing solutions, including D&B Connect, a self-service data management platform; D&B Optimizer, an integrated data management solution; D&B Rev.Up ABX, an open and agnostic platform that aligns marketing and sales teams to deliver an optimal and coordinated buying; D&B Hoovers, a sales intelligence solution; D&B Audience Targeting, which helps clients to reach the right audiences with the right messages; D&B Visitor Intelligence that turns web visitors into leads; and D&B Direct, an API-enabled data management solution that delivers valuable customer insights into CRMs, marketing automation, and other marketing applications for on-demand business intelligence. The company was founded in 1841 and is headquartered in Jacksonville, Florida.",
    "ceo": "Mr. Anthony M. Jabbour",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "6355",
    "phone": "904 648 6350",
    "address": "5335 Gate Parkway",
    "city": "Jacksonville",
    "state": "FL",
    "zip": "32256",
    "dcfDiff": 0.756891,
    "dcf": 13.5531,
    "image": "https://financialmodelingprep.com/image-stock/DNB.png",
    "ipoDate": "2020-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]