[
  {
    "symbol": "DNBBY",
    "price": 18.39,
    "beta": 0,
    "volAvg": 117614,
    "mktCap": 28409422817,
    "lastDiv": 1.18,
    "range": "15.58-20.79",
    "changes": 0.31,
    "companyName": "DNB Bank ASA",
    "currency": "USD",
    "cik": "0001498632",
    "isin": "US23341C1036",
    "cusip": "23341C103",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.dnb.no",
    "description": "DNB Bank ASA provides financial services for retail and corporate customers in Norway and internationally. The company offers personal banking products and services, including savings and investment products; loans, such as home mortgages, and car and consumer loans; pet, home and property, travel, and personal insurance products, as well as insurance products for vehicles; retirement savings products; foreign exchange and treasury activities; and Internet and mobile banking services, as well as cards. It also provides business banking products and services comprising savings and investment products consisting of savings accounts, fixed rate deposits, exchange traded products, bonds and commercial papers, asset management, and equity services; financing, such as installment loans, overdraft facility, bank guarantees, leasing, factoring, and trade and export financing services; transaction banking services; research, commodities, bonds and commercial papers, corporate finance, debt capital market, equities, foreign exchange and interest rates, and securities services; and Internet services, including online equity trading, online FX trading, e-confirmation, equities execution, and investor and margin accounts, as well as pension services. In addition, the company provides investment banking services, such as mergers and acquisition, and equity and debt capital market services; foreign exchange, interest rates, equities, commodities, fixed income, research, private equity, and securities services; and corporate banking services. Further, it offers private banking services. The company offers its products and services to various sectors, including energy; financial institutions; healthcare; manufacturing; packaging and forest products; seafood; shipping, offshore, and logistics; and telecom, media, and technology. DNB Bank ASA was founded in 1822 and is headquartered in Oslo, Norway.",
    "ceo": "Ms. Kjerstin Rasmussen Braathen",
    "sector": "Financial Services",
    "country": "NO",
    "fullTimeEmployees": "10351",
    "phone": "47 91 50 48 00",
    "address": "Dronning Eufemias gate 30",
    "city": "Oslo",
    "state": null,
    "zip": "0191",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DNBBY.png",
    "ipoDate": "2010-10-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]