[
  {
    "symbol": "DNLI",
    "price": 29.98,
    "beta": 1.319014,
    "volAvg": 803920,
    "mktCap": 4103931980,
    "lastDiv": 0,
    "range": "21.74-39.43",
    "changes": 0.81,
    "companyName": "Denali Therapeutics Inc.",
    "currency": "USD",
    "cik": "0001714899",
    "isin": "US24823R1059",
    "cusip": "24823R105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.denalitherapeutics.com",
    "description": "Denali Therapeutics Inc., a biopharmaceutical company, discovers and develops therapeutic candidates for neurodegenerative diseases in the United States. It offers leucine-rich repeat kinase 2 (LRRK2) inhibitor product candidate, including BIIB122/DNL151, a small molecule inhibitor, which is in phase I and phase Ib clinical trials for the treatment of Parkinson's disease. The company also develops DNL310 that is in Phase I/II clinical trials for the treatment of hunter syndrome; DNL343, which is in phase 1 clinical trial the treatment of amyotrophic lateral sclerosis (ALS); AR443820/DNL788 completed a phase I clinical trial for the treatment of ALS, multiple sclerosis (MS), and Alzheimer's disease; and SAR443122/DNL758, which is in phase II clinical trial for the treatment of cutaneous lupus erythematosus. It has collaboration agreement with Takeda Pharmaceutical Company, Genentech, Inc., Sanofi, F-star Gamma Limited, F-star Biotechnologische Forschungs-Und Entwicklungsges M.B.H, F-star Biotechnology Limited, SIRION Biotech GmbH, Genzyme Corporation, Harvard University, the Michael J. Fox Foundation, and Centogene; and a research and option agreement with Secarna Pharmaceuticals GmbH & Co. KG. to develop antisense therapies in the field of neurodegenerative diseases. The company was formerly known as SPR Pharma Inc. and changed its name to Denali Therapeutics Inc. in March 2015. Denali Therapeutics Inc. was incorporated in 2013 and is headquartered in South San Francisco, California.",
    "ceo": "Dr. Ryan J. Watts Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "430",
    "phone": "650 866 8548",
    "address": "161 Oyster Point Boulevard",
    "city": "South San Francisco",
    "state": "CA",
    "zip": "94080",
    "dcfDiff": 0.317745,
    "dcf": 31.7877,
    "image": "https://financialmodelingprep.com/image-stock/DNLI.png",
    "ipoDate": "2017-12-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]