[
  {
    "symbol": "DNLMY",
    "price": 14.7,
    "beta": 1.131417,
    "volAvg": 196,
    "mktCap": 2964975418,
    "lastDiv": 0.5,
    "range": "7.87-14.9",
    "changes": 0.1,
    "companyName": "Dunelm Group plc",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Retail",
    "website": "https://www.dunelm.com",
    "description": "Dunelm Group plc retails homewares in the United Kingdom. The company offers furniture and beds products, which include bedroom, living room, dining room, and other furniture, as well as bed and mattresses, and sofas and chairs; bedding products comprising bed linen, dorma, baby and kid's bedding, and duvets, pillows and protectors; curtains and rugs; and venetian, roller, roman, vertical, and made to measure blinds. It also offers range of home decor products, such as mirrors, clocks, ornaments, pictures and frames, candle and home fragrance, flower and plants, vases, kid accessories, cushions, bean bags, and letterbox flowers, as well as housewarming, engagement, anniversary, and wedding gifts; lighting products, including ceiling and wall lights, table and desk lamps, floor lamps, and pendants and lamp shades; and paint, wallpaper, DIY and upcycling, and haberdashery products. In addition, the company provides kitchen and utility products comprising cooking, dining, electrical, utility, and pet products; towel and bathmats, and bathroom accessories, as well as furniture and decor products; storage products, such as travel and luggage, home, clothes, and kitchen storage; kids bedroom, nursery, and accessories products; outdoor products, which include garden furniture and decoration, and entreating and dining products; and trends christmas products and winter essentials. It operates through a network of 177 stores and 2 distribution centers, as well as sells its products through an online store at dunelm.com. Dunelm Group plc was founded in 1979 and is headquartered in Syston, the United Kingdom.",
    "ceo": "Mr. Nick  Wilkinson",
    "sector": "Consumer Cyclical",
    "country": "GB",
    "fullTimeEmployees": "11000",
    "phone": "44 11 6264 4400",
    "address": "Watermead Business Park",
    "city": "Syston",
    "state": null,
    "zip": "LE7 1AD",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DNLMY.png",
    "ipoDate": "2014-04-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]