[
  {
    "symbol": "DNPLY",
    "price": 14.29,
    "beta": 0.532183,
    "volAvg": 6706,
    "mktCap": 7594892184,
    "lastDiv": 0.23,
    "range": "9.44-15.88",
    "changes": 0.13,
    "companyName": "Dai Nippon Printing Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US2338063066",
    "cusip": "233806306",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Business Services",
    "website": "https://www.dnp.co.jp",
    "description": "Dai Nippon Printing Co., Ltd. primarily engages in the printing business. The company's Information Communication segment offers books and magazines; flyers and catalogs; business process outsourcing services; solar-powered outdoor LCD digital signage/universally designed touch screen multilingual signage; virtual reality products, business forms, smart cards and magnetic cards, and transparent hologram ribbons; and dye-sublimation thermal transfer printing media and thermal mass transfer printing media, dye-sublimation photo printers, photo related services, and solutions identity verification services, as well as operates hybrid bookstore network under honto brand. Its Lifestyle and Industrial Supplies segment provides packaging products comprising plant-based packaging materials, mono-material packaging materials, transparent vapor deposition films, barrier paper packaging materials, functional film complex PET bottles, PET plastic bottles, and aseptic filling systems for PET plastic bottles; living spaces products, including olefin-based sheets for flooring, antibacterial and antiviral products, exterior materials for buildings, curved resin glazing, interior coverings for railway cars; and industrial high-performance materials that include lithium-ion battery components, photovoltaic module components, lighting films, and multifunctional insulation boxes. The company's Electronics segment offers display components, such as optical and electrode films, OLED display, color filters, electronic shade, transparent screens, and OLED display-driven digital signage products; and electronic devices comprising semiconductor photomasks, master template for nanoimprinting, hard disk drive suspensions, lead frame for compact semiconductor packages, diffractive optical element, near field communication modules, and micro electro mechanical systems. Its Beverages segment produces and sells beverages. The company was founded in 1876 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Yoshinari  Kitajima",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "36542",
    "phone": "81 3 3266 2111",
    "address": "1-1, Ichigaya-Kagacho",
    "city": "Tokyo",
    "state": null,
    "zip": "162-8001",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DNPLY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]