[
  {
    "symbol": "DOCU",
    "price": 51.72,
    "beta": 0.95176,
    "volAvg": 4035877,
    "mktCap": 10466628534,
    "lastDiv": 0,
    "range": "39.57-77.24",
    "changes": 0.79,
    "companyName": "DocuSign, Inc.",
    "currency": "USD",
    "cik": "0001261333",
    "isin": "US2561631068",
    "cusip": "256163106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.DocuSign.com",
    "description": "DocuSign, Inc. provides electronic signature software in the United States and internationally. The company provides e-signature solution that enables businesses to digitally prepare, sign, act on, and manage agreements. It also offers CLM, which automates workflows across the entire agreement process; Insights that use artificial intelligence (AI) to search and analyze agreements by legal concepts and clauses; Gen for Salesforce, which allows sales representatives to automatically generate agreements with a few clicks from within Salesforce; Negotiate for Salesforce that supports for approvals, document comparisons, and version control; Analyzer, which helps customers understand what they're signing before they sign it; and CLM+ that provide AI-driven contract lifecycle management. The company provides Guided Forms, which enable complex forms to be filled via an interactive and step-by-step process; Click that supports no-signature-required agreements for standard terms and consents; Identify, a signer-identification option for checking government-issued IDs; Standards-Based Signatures, which support signatures that involve digital certificates; Payments that enables customers to collect signatures and payment; Remote Online Notary is a solution using audio-visual and identify verification technologies to enable notarization; and Monitor using advanced analytics to track DocuSign eSignature web, mobile, and API account. It offers industry-specific cloud offerings, including Rooms for Real Estate that provides a way for brokers and agents to manage the entire real estate transaction digitally; Rooms for Mortgage, which offers digital workspace to create and close mortgages; FedRAMP, an authorized version of DocuSign eSignature for U.S. federal government agencies; and life sciences modules that support compliance with the electronic signature practices. The company sells its products through direct, partner-assisted, and Web-based sales. It serves enterprise, commercial, and small businesses. The company was incorporated in 2003 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Allan C. Thygesen",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "7336",
    "phone": "415 489 4940",
    "address": "221 Main Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94105",
    "dcfDiff": 12.3296,
    "dcf": 46.9204,
    "image": "https://financialmodelingprep.com/image-stock/DOCU.png",
    "ipoDate": "2018-04-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]