[
  {
    "symbol": "DOOR",
    "price": 100.79,
    "beta": 1.754429,
    "volAvg": 128487,
    "mktCap": 2228718875,
    "lastDiv": 0,
    "range": "65.71-104.17",
    "changes": -0.91,
    "companyName": "Masonite International Corporation",
    "currency": "USD",
    "cik": "0000893691",
    "isin": "CA5753851099",
    "cusip": "575385109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.masonite.com",
    "description": "Masonite International Corporation designs, manufactures, markets, and distributes interior and exterior doors for the new construction and repair, renovation, and remodeling sectors of the residential and non-residential building construction markets worldwide. It offers molded panel, flush, stile and rail, steel, and fiberglass residential doors, as well as medium-density fiberboard (MDF) and architectural interior doors. The company also provides various door components, including interior door facings, agri-fiber and particleboard door cores, MDF and wood cut-stock components, critical door components, and mineral and particleboard door cores. It offers its products under the Masonite, Premdor, Masonite Architectural, Marshfield-Algoma, USA Wood Door, Solidor, Residor, Nicedor, Door-Stop International, Harring Doors, National Hickman, Graham-Maiman, Louisiana Millwork, Baillargeon, and BWI to remodeling contractors, builders, homeowners, retailers, dealers, lumberyards, commercial and general contractors, and architects through wholesale, retail, and direct distribution channels. The company was founded in 1925 and is headquartered in Tampa, Florida.",
    "ceo": "Mr. Howard Carl Heckes",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "10000",
    "phone": "813 877 2726",
    "address": "1242 East 5th Avenue",
    "city": "Tampa",
    "state": "FL",
    "zip": "33605",
    "dcfDiff": 1.15945,
    "dcf": 87.8806,
    "image": "https://financialmodelingprep.com/image-stock/DOOR.png",
    "ipoDate": "2009-07-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]