[
  {
    "symbol": "DORM",
    "price": 77.96,
    "beta": 0.561619,
    "volAvg": 96877,
    "mktCap": 2453268668,
    "lastDiv": 1.5,
    "range": "73.32-119.04",
    "changes": 1.68,
    "companyName": "Dorman Products, Inc.",
    "currency": "USD",
    "cik": "0000868780",
    "isin": "US2582781009",
    "cusip": "258278100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Auto Parts",
    "website": "https://www.dormanproducts.com",
    "description": "Dorman Products, Inc. supplies replacement parts and fasteners for passenger cars, light trucks, and medium- and heavy-duty trucks in the automotive aftermarket industry worldwide. It offers original equipment dealer products, such as intake and exhaust manifolds, window regulators, radiator fan assemblies, tire pressure monitor sensors, exhaust gas recirculation coolers, and complex electronics modules; fluid reservoirs, variable valve timing components, complex electronics, and integrated door lock actuators; and oil drain plugs, and wheel bolts and lug nuts. The company also provides automotive replacement parts, including door handles, keyless remotes and cases, and door hinge repairs; and heavy duty aftermarket parts for class 4-8 vehicles, such as lighting, cooling, engine management, wheel hardware, air tanks, and cab products. It offers powertrain products comprising cooling products, harmonic balancers, fluid lines and reservoirs, connectors, 4-wheel drive components, other engine, and transmission and axle components; and chassis products, such as control arms, ball joints, tie-rod ends, brake hardware and hydraulics, axle hardware, suspension arms, knuckles, links, bushings, leaf springs, other suspension, steering, and brake components. The company also provides automotive body products, including window lift motors, switches and handles, wiper, and other interior and exterior automotive body components; and hardware products comprising threaded bolts; automotive and home electrical wiring components; and other hardware assortments and merchandise. It offers its products under the OE Solutions, HELP!, OE FIX, Conduct-Tite, and HD Solutions brands through automotive aftermarket retailers, such as on-line platforms; national, regional, and local warehouse distributors; and specialty markets; salvage yards; local independent parts wholesalers; and mass merchants. The company was founded in 1918 and is headquartered in Colmar, Pennsylvania.",
    "ceo": "Mr. Kevin M. Olsen",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "3786",
    "phone": "215 997 1800",
    "address": "3400 East Walnut Street",
    "city": "Colmar",
    "state": "PA",
    "zip": "18915",
    "dcfDiff": 4.53395,
    "dcf": 88.966,
    "image": "https://financialmodelingprep.com/image-stock/DORM.png",
    "ipoDate": "1991-03-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]