[
  {
    "symbol": "DOV",
    "price": 143.35,
    "beta": 1.35176,
    "volAvg": 819011,
    "mktCap": 20047641997,
    "lastDiv": 2.02,
    "range": "114.49-160.66",
    "changes": -1.44,
    "companyName": "Dover Corporation",
    "currency": "USD",
    "cik": "0000029905",
    "isin": "US2600031080",
    "cusip": "260003108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.dovercorporation.com",
    "description": "Dover Corporation provides equipment and components, consumable supplies, aftermarket parts, software and digital solutions, and support services worldwide. The Engineered Products segment provides various equipment, component, software, solution, and services that are used in aftermarket vehicle service, solid waste handling, industrial automation, aerospace and defense, industrial winch and hoist, and fluid dispensing end-market. This segment also offers manual and power clamp, rotary and linear mechanical indexer, conveyor, pick and place unit, glove port, and manipulator, as well as end-of-arm robotic gripper, slide, and end effector. Its Clean Energy & Fueling segment offers component, equipment, and software and service solution enabling safe transport of traditional and clean fuel, and other hazardous substance along with supply chain, as well as operation of convenience retail, retail fueling, and vehicle wash establishment. The Imaging and Identification segment provides precision marking and coding; packaging intelligence; product traceability equipment; brand protection; and digital textile printing equipment, as well as related consumable, software, and service to packaged and consumer good, pharmaceutical, industrial manufacturing, fashion and apparel, and other end-market. Its Pumps and Process Solutions segment manufactures specialty pump, connector, and flow meter, fluid connecting solution, plastics and polymer processing equipment, and engineered components for rotating and reciprocating machines. The Climate & Sustainability Technologies segment manufactures refrigeration system, refrigeration display case, commercial glass refrigerator and freezer door, and brazed plate heat exchanger for industrial heating and cooling, and residential climate control applications. It sells its products directly and through a network of distributors. The company was incorporated in 1947 and is headquartered in Downers Grove, Illinois.",
    "ceo": "Mr. Richard Joseph Tobin",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "25000",
    "phone": "630 541 1540",
    "address": "3005 Highland Parkway",
    "city": "Downers Grove",
    "state": "IL",
    "zip": "60515",
    "dcfDiff": 2.0194,
    "dcf": 142.961,
    "image": "https://financialmodelingprep.com/image-stock/DOV.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]