[
  {
    "symbol": "DOW",
    "price": 52.96,
    "beta": 1.319291,
    "volAvg": 4558733,
    "mktCap": 37459402824,
    "lastDiv": 2.8,
    "range": "42.91-60.875",
    "changes": 0.39,
    "companyName": "Dow Inc.",
    "currency": "USD",
    "cik": "0001751788",
    "isin": "US2605571031",
    "cusip": "260557103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Chemicals",
    "website": "https://www.dow.com",
    "description": "Dow Inc. provides various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. It operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, and propylene and aromatics products; and polyethylene, polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubbers. The Industrial Intermediates & Infrastructure segment offers ethylene oxides, propylene oxides, propylene glycol and polyether polyols, aromatic isocyanates and polyurethane systems, coatings, adhesives, sealants, elastomers, and composites. This segment also provides caustic soda, and ethylene dichloride and vinyl chloride monomers; and cellulose ethers, redispersible latex powders, and acrylic emulsions. The Performance Materials and Coatings segment provides architectural paints and coatings, and industrial coatings that are used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper, and leather; performance silicones and specialty materials; and silicone feedstocks and intermediates. It also engages in property and casualty insurance, as well as reinsurance business. Dow Inc. was incorporated in 2018 and is headquartered in Midland, Michigan.",
    "ceo": "Mr. James R. Fitterling",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "37800",
    "phone": "989 636 1000",
    "address": "2211 H.H. Dow Way",
    "city": "Midland",
    "state": "MI",
    "zip": "48674",
    "dcfDiff": 4.81068,
    "dcf": 54.1593,
    "image": "https://financialmodelingprep.com/image-stock/DOW.png",
    "ipoDate": "2019-03-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]