[
  {
    "symbol": "DOX",
    "price": 97.17,
    "beta": 0.664788,
    "volAvg": 603685,
    "mktCap": 11684109480,
    "lastDiv": 1.74,
    "range": "78.02-97.71",
    "changes": 0.53,
    "companyName": "Amdocs Limited",
    "currency": "USD",
    "cik": "0001062579",
    "isin": "GB0022569080",
    "cusip": "G02602103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.amdocs.com",
    "description": "Amdocs Limited, through its subsidiaries, provides software and services worldwide. The company designs, develops, operates, implements, supports, and markets open and modular cloud portfolio. It provides CES21, a 5G and cloud-native microservices-based market-leading customer experience suite, that enables service providers to build, deliver, and monetize advanced services; the Commerce and Care suite for order capture, handling, and customer engagement; the Monetization suite for charging, billing, policy, and revenue management; Intelligent Networking suite with a set of modular, flexible, and open service lifecycle management capabilities for network automation journeys; MarketONE, a cloud-native business ecosystem; Digital Brands Suite, a pre-integrated digital business suite for digital telecom brands and small-scale service providers; and eSIM Cloud for service providers. It also offers AI-powered, cloud-native, and home operating systems; data intelligence solutions and applications; media services for media publishers, TV networks, and video streaming and service providers; end-to-end application development and maintenance services; and ongoing services. In addition, the company provides a line of services designed for various stages of a service provider's lifecycle includes design, delivery, quality engineering, operations, systems integration, mobile network services, consulting, and content services; managed services comprising application development, modernization and maintenance, IT and infrastructure services, testing and professional services that are designed to assist customers in the selection, implementation, operation, management, and maintenance of IT systems. It serves to the communications, cable and satellite, entertainment, and media industry service providers, as well as mobile virtual network operators and directory publishers. Amdocs Limited was founded in 1988 and is headquartered in Saint Louis, Missouri.",
    "ceo": "Mr. Joshua  Sheffer",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "31000",
    "phone": "314 212 7000",
    "address": "625 Maryville Centre Drive",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63141",
    "dcfDiff": 0.395457,
    "dcf": 89.9845,
    "image": "https://financialmodelingprep.com/image-stock/DOX.png",
    "ipoDate": "1998-06-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]