[
  {
    "symbol": "DRS",
    "price": 16.98,
    "beta": 0,
    "volAvg": 842941,
    "mktCap": 4431780000,
    "lastDiv": 0,
    "range": "7.51-17.5",
    "changes": 0.15,
    "companyName": "Leonardo DRS, Inc.",
    "currency": "USD",
    "cik": "0001833756",
    "isin": null,
    "cusip": null,
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Aerospace & Defense",
    "website": "https://www.leonardodrs.com",
    "description": "Leonardo DRS, Inc., together with its subsidiaries, provides defense products and technologies in the land, air, sea, space, cyber and security, and commercial domains for military applications. It operates in two segments, Advanced Sensing and Computing, and Integrated Mission Systems. The company offers advanced sensor technologies, including infrared systems and sensors for threat detection and situational awareness; uncooled infrared systems and brownout solutions; airborne, ground vehicle mounted, and dismounted soldier electronic warfare (EW) systems; and EW software and training systems, and intelligence solutions. It also provides computing systems for ground vehicles, ships, and submarines; network and data distribution applications; sensor systems; and networked computing infrastructure on military platform. In addition, the company offers force protection systems, such as solutions for counter-unmanned aerial systems, short-range air defense systems, and active protection systems; and power control, distribution, conversion, and propulsion systems, as well as hybrid electric drive propulsion systems, energy storage, gas turbine packages, nuclear instrumentation and controls, and thermal management and refrigeration equipment. It serves the U.S. military, aerospace and defense prime contractors, government intelligence agencies, and international military customers. The company was founded in 1969 and is based in Arlington, Virginia.",
    "ceo": "Mr. William J. Lynn III",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "6400",
    "phone": "703 416 8000",
    "address": "2345 Crystal Drive",
    "city": "Arlington",
    "state": "VA",
    "zip": "22202",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DRS.png",
    "ipoDate": "1985-06-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]