[
  {
    "symbol": "DRVN",
    "price": 25.76,
    "beta": 0.824074,
    "volAvg": 572722,
    "mktCap": 4316345600,
    "lastDiv": 0,
    "range": "23.35-35.45",
    "changes": -0.01,
    "companyName": "Driven Brands Holdings Inc.",
    "currency": "USD",
    "cik": "0001804745",
    "isin": "US26210V1026",
    "cusip": "26210V102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Auto & Truck Dealerships",
    "website": "https://www.drivenbrands.com",
    "description": "Driven Brands Holdings Inc., together with its subsidiaries, provides automotive services to retail and commercial customers in the United States, Canada, and internationally. The company offers various services, such as paint, collision, glass, vehicle repair, car wash, oil change, and maintenance services. It also distributes automotive parts, including radiators, air conditioning components, and exhaust products to automotive repair shops, auto parts stores, body shops, and other auto repair outlets; windshields and glass accessories through a network of distribution centers; and consumable products, such as oil filters and wiper blades, as well as provides training services to repair and maintenance, and paint and collision shops. The company sells its products and services under the Take 5 Oil Change, IMO, CARSTAR, ABRA, Fix Auto, Maaco, Meineke, Uniban, 1-800-Radiator & A/C, PH Vitres D'Autos, Spire Supply, and Automotive Training Institute names. As of December 25, 2021, it operated 4,412 company-operated, franchised, and independently-operated stores. Driven Brands Holdings Inc. was founded in 1972 and is headquartered in Charlotte, North Carolina.",
    "ceo": "Mr. Jonathan G. Fitzpatrick",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "11000",
    "phone": "704 377 8855",
    "address": "440 South Church Street",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28202",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DRVN.png",
    "ipoDate": "2021-01-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]