[
  {
    "symbol": "DSDVY",
    "price": 102.82,
    "beta": 1.040996,
    "volAvg": 19022,
    "mktCap": 44049835117,
    "lastDiv": 0.47,
    "range": "56.02-103.23",
    "changes": 1.14,
    "companyName": "DSV A/S",
    "currency": "USD",
    "cik": null,
    "isin": "US26251A1088",
    "cusip": "26251A108",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Integrated Freight & Logistics",
    "website": "https://www.dsv.com",
    "description": "DSV A/S provides transport and logistics services in Europe, the Middle East, Africa, North America, South America, Asia, Australia, and the Pacific. It operates through three segments: Air & Sea, Road, and Solutions. The company offers air freight, air freight compliance and carrier, and rail freight services; sea freight, and sea freight compliance and carrier services, as well as freight containers. It also provides road freight services, such as part and full loads, groupage, specialized transport, express, and online and document handling services; and workshops. In addition, the company offers logistics solutions for automotive, consumer products, healthcare, high-tech, and industrial sectors; and inventory management solutions. Further, it provides project transport services, such as industrial projects, renewable energy, government logistics, ship charter, and air charter services; and courier and warehousing services. The company was formerly known as DSV Panalpina A/S and changed its name to DSV A/S in September 2021. DSV A/S was incorporated in 1976 and is headquartered in Hedehusene, Denmark.",
    "ceo": "Mr. Jens Bjorn Andersen",
    "sector": "Industrials",
    "country": "DK",
    "fullTimeEmployees": "74613",
    "phone": "45 43 20 30 40",
    "address": "Hovedgaden 630",
    "city": "Hedehusene",
    "state": null,
    "zip": "2640",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DSDVY.png",
    "ipoDate": "2018-02-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]