[
  {
    "symbol": "DSEY",
    "price": 8.38,
    "beta": 2.152317,
    "volAvg": 2055779,
    "mktCap": 2719972087,
    "lastDiv": 0,
    "range": "3.95-8.41",
    "changes": -0.01,
    "companyName": "Diversey Holdings, Ltd.",
    "currency": "USD",
    "cik": "0001831617",
    "isin": "KYG289231030",
    "cusip": "G28923103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Personal Services",
    "website": "https://www.diversey.com",
    "description": "Diversey Holdings, Ltd., through its subsidiaries, provides infection prevention and cleaning solutions worldwide. It operates in two segments, Institutional, and Food & Beverage. The Institutional segment offers products, solutions, equipment, and machines, including infection prevention and personal care products, floor and building care chemicals, kitchen and mechanical ware wash chemicals and machines, dosing and dispensing equipment, and floor care machines, as well as engineering, consulting, and training services related to productivity management, water and energy management, and risk management. This segment serves customers in the healthcare, education, food service, retail and grocery, hospitality, and building service contractors industries. The Food & Beverage segment provides a range of products, solutions, equipment, and machines, such as chemical products, engineering and equipment solutions, knowledge-based services, training through its Diversey Hygiene Academy, and water treatment. This segment serves customers in the brewing, beverage, dairy, processed foods, pharma, and agriculture industries. Diversey Holdings, Ltd. was founded in 1923 and is headquartered in Fort Mill, South Carolina.",
    "ceo": "Mr. Philip Robert Wieland",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "9000",
    "phone": "803 746 2200",
    "address": "1300 Altura Road",
    "city": "Fort Mill",
    "state": "SC",
    "zip": "29708",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DSEY.png",
    "ipoDate": "2021-03-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]