[
  {
    "symbol": "DSGX",
    "price": 77.87,
    "beta": 0.87061,
    "volAvg": 163382,
    "mktCap": 6625023860,
    "lastDiv": 0,
    "range": "60.68-82.02",
    "changes": 0.87,
    "companyName": "The Descartes Systems Group Inc.",
    "currency": "USD",
    "cik": "0001050140",
    "isin": "CA2499061083",
    "cusip": "249906108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.descartes.com",
    "description": "The Descartes Systems Group Inc. provides cloud-based logistics and supply chain management business process solutions that focuses on enhancing the productivity, performance, and security of logistics-intensive businesses worldwide. Its Logistics Technology platform offers a range of modular, cloud-based, and interoperable web and wireless logistics management applications, which unites a community of logistics-focused parties, allowing them to transact business. The company provides a suite of solutions that include routing, mobile and telematics; transportation management and e-commerce enablement; customs and regulatory compliance; trade data; global logistics network services; and broker and forwarder enterprise systems. It offers its customers to use its modular, software-as-a-service, and data solutions to route, schedule, track, and measure delivery resources; plan, allocate, and execute shipments; rate, audit, and pay transportation invoices; access and analyze global trade data; research and perform trade tariff and duty calculations; file customs and security documents for imports and exports; and various other logistics processes. The company also provides cloud-based ecommerce warehouse management solutions; consulting, implementation, and training services; and maintenance and support services. It primarily focuses on serving transportation providers, logistics service providers, and distribution-intensive companies, as well as manufacturers, retailers, distributors, and mobile business service providers. The company was incorporated in 1981 and is headquartered in Waterloo, Canada.",
    "ceo": "Mr. Edward J. Ryan B.A., BA",
    "sector": "Technology",
    "country": "CA",
    "fullTimeEmployees": "1334",
    "phone": "15197468110",
    "address": "120 Randall Drive",
    "city": "Waterloo",
    "state": "ON",
    "zip": "N2V 1C6",
    "dcfDiff": 2.05393,
    "dcf": 70.1561,
    "image": "https://financialmodelingprep.com/image-stock/DSGX.png",
    "ipoDate": "1999-01-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]