[
  {
    "symbol": "DT",
    "price": 51.2,
    "beta": 1.094563,
    "volAvg": 2894527,
    "mktCap": 14897971200,
    "lastDiv": 0,
    "range": "31.54-52.99",
    "changes": 0.71,
    "companyName": "Dynatrace, Inc.",
    "currency": "USD",
    "cik": "0001773383",
    "isin": "US2681501092",
    "cusip": "268150109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.dynatrace.com",
    "description": "Dynatrace, Inc. provides a software intelligence platform for dynamic multi-cloud environments. It operates Dynatrace, a software intelligence platform, which provides application and microservices monitoring, runtime application security, infrastructure monitoring, digital experience monitoring, business analytics, and cloud automation. Its platform allows its customers to modernize and automate IT operations, develop and release software, and enhance user experiences. The company also offers implementation, consulting, and training services. Dynatrace, Inc. markets its products through a combination of direct sales team and a network of partners, including resellers, system integrators, and managed service providers. It serves customers in various industries comprising banking, insurance, retail, manufacturing, travel, and software. The company operates in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. Dynatrace, Inc. was founded in 2005 and is headquartered in Waltham, Massachusetts.",
    "ceo": "Mr. Rick M. McConnell",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "4180",
    "phone": "781 530 1000",
    "address": "1601 Trapelo Road",
    "city": "Waltham",
    "state": "MA",
    "zip": "02451",
    "dcfDiff": 0.161482,
    "dcf": 38.4015,
    "image": "https://financialmodelingprep.com/image-stock/DT.png",
    "ipoDate": "2019-08-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]