[
  {
    "symbol": "DTEGY",
    "price": 21.86,
    "beta": 0.570114,
    "volAvg": 355046,
    "mktCap": 108703225498,
    "lastDiv": 0.77,
    "range": "16.77-25.55",
    "changes": 0.025,
    "companyName": "Deutsche Telekom AG",
    "currency": "USD",
    "cik": null,
    "isin": "US2515661054",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.telekom.com",
    "description": "Deutsche Telekom AG, together with its subsidiaries, provides integrated telecommunication services. The company operates through five segments: Germany, United States, Europe, Systems Solutions, and Group Development. It offers fixed-network services, including voice and data communication services based on fixed-network and broadband technology; and sells terminal equipment and other hardware products, as well as services to resellers. The company also provides mobile voice and data services to consumers and business customers; sells mobile devices and other hardware products; and sells mobile services to resellers and to companies that purchases and markets network services to third parties, such as mobile virtual network operators. In addition, it offers internet services; internet-based TV products and services; and information and communication technology systems for multinational corporations and public sector institutions with an infrastructure of data centers and networks under the T-Systems brand, as well as call center services. The company has 242 million mobile customers and 22 million broadband customers, as well as 27 million fixed-network lines. Deutsche Telekom AG has a collaboration with VMware, Inc. on cloud-based open and intelligent virtual RAN platform to bring agility to radio access networks for existing LTE and future 5G networks; and partnership with Microsoft to deliver high-performance cloud computing experiences. The company was founded in 1995 and is headquartered in Bonn, Germany.",
    "ceo": "Mr. Timotheus  Hottges",
    "sector": "Communication Services",
    "country": "DE",
    "fullTimeEmployees": "207789",
    "phone": "49 228 181 88880",
    "address": "Friedrich-Ebert-Allee 140",
    "city": "Bonn",
    "state": null,
    "zip": "53113",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DTEGY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]