[
  {
    "symbol": "DTM",
    "price": 48.33,
    "beta": 0.808698,
    "volAvg": 687929,
    "mktCap": 4682703366,
    "lastDiv": 2.76,
    "range": "45.105-61.12",
    "changes": 0.32,
    "companyName": "DT Midstream, Inc.",
    "currency": "USD",
    "cik": "0001842022",
    "isin": "US23345M1071",
    "cusip": "23345M107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.dtmidstream.com",
    "description": "DT Midstream, Inc. provides integrated natural gas services in the United States. The company operates through two segments, Pipeline and Gathering. It develops, owns, and operates an integrated portfolio of interstate pipelines, intrastate pipelines, storage systems, lateral pipelines, gathering systems, related treatment plants, and compression and surface facilities. The company engages in the transportation and storage of natural gas for intermediate and end user customers; and collecting natural gas from points at or near customers' wells for delivery to plants for processing, to gathering pipelines for gathering, or to pipelines for transportation, as well as offers compression, dehydration, gas treatment, water impoundment, water storage, water transportation, and sand mining services. It serves natural gas producers, local distribution companies, electric power generators, industrials, and national marketers. The company was incorporated in 2021 and is headquartered in Detroit, Michigan.",
    "ceo": "Mr. David J. Slater",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "362",
    "phone": "313 402 8532",
    "address": "500 Woodward Avenue",
    "city": "Detroit",
    "state": "MI",
    "zip": "48226-1279",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DTM.png",
    "ipoDate": "2021-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]