[
  {
    "symbol": "DUK",
    "price": 89.1,
    "beta": 0.432394,
    "volAvg": 2977661,
    "mktCap": 68665096051,
    "lastDiv": 4.02,
    "range": "83.76-113.67",
    "changes": -1.42,
    "companyName": "Duke Energy Corporation",
    "currency": "USD",
    "cik": "0001326160",
    "isin": "US26441C2044",
    "cusip": "26441C204",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.duke-energy.com",
    "description": "Duke Energy Corporation, together with its subsidiaries, operates as an energy company in the United States. It operates through three segments: Electric Utilities and Infrastructure, Gas Utilities and Infrastructure, and Commercial Renewables. The Electric Utilities and Infrastructure segment generates, transmits, distributes, and sells electricity in the Carolinas, Florida, and the Midwest; and uses coal, hydroelectric, natural gas, oil, renewable generation, and nuclear fuel to generate electricity. It also engages in the wholesale of electricity to municipalities, electric cooperative utilities, and load-serving entities. This segment serves approximately 8.2 million customers in 6 states in the Southeast and Midwest regions of the United States covering a service territory of approximately 91,000 square miles; and owns approximately 50,259 megawatts (MW) of generation capacity. The Gas Utilities and Infrastructure segment distributes natural gas to residential, commercial, industrial, and power generation natural gas customers; and owns, operates, and invests in pipeline transmission and natural gas storage facilities. It has approximately 1.6 million customers, including 1.1 million customers in North Carolina, South Carolina, and Tennessee, as well as 550,000 customers in southwestern Ohio and northern Kentucky. The Commercial Renewables segment acquires, owns, develops, builds, and operates wind and solar renewable generation projects, including nonregulated renewable energy and energy storage services to utilities, electric cooperatives, municipalities, and corporate customers. It has 23 wind, 178 solar, and 2 battery storage facilities, as well as 71 fuel cell locations with a capacity of 3,554 MW across 22 states. The company was formerly known as Duke Energy Holding Corp. and changed its name to Duke Energy Corporation in April 2005. The company was founded in 1904 and is headquartered in Charlotte, North Carolina.",
    "ceo": "Ms. Lynn J. Good",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "27859",
    "phone": "704 382 3853",
    "address": "526 South Church Street",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28202-1803",
    "dcfDiff": 4.07523,
    "dcf": 97.5048,
    "image": "https://financialmodelingprep.com/image-stock/DUK.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]