[
  {
    "symbol": "DV",
    "price": 38.5,
    "beta": 0.823184,
    "volAvg": 1312650,
    "mktCap": 6402088000,
    "lastDiv": 0,
    "range": "20.38-38.52",
    "changes": 0.7,
    "companyName": "DoubleVerify Holdings, Inc.",
    "currency": "USD",
    "cik": "0001819928",
    "isin": "US25862V1052",
    "cusip": "25862V105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.doubleverify.com",
    "description": "DoubleVerify Holdings, Inc. provides a software platform for digital media measurement, data, and analytics in the United States and internationally. Its solutions provide advertisers unbiased data analytics that enable advertisers to increase the effectiveness, quality and return on their digital advertising investments. The company's solutions include DV Authentic Ad, a metric of digital media quality, which evaluates the existence of fraud, brand safety, viewability, and geography for each digital ad; DV Authentic Attention solution that provides exposure and engagement predictive analytics to drive campaign performance; and Custom Contextual solution, which allows advertisers to match their ads to relevant content to maximize user engagement and drive campaign performance. Its solutions also comprise DV Publisher suite, a solution for digital publishers to manage revenue and increase inventory yield by improving video delivery, identifying lost or unfilled sales, and aggregate data across all inventory sources; and DV Pinnacle, a service and analytics platform user interface that allows its customers to adjust and deploy controls for their media plan and track campaign performance metrics across channels, formats, and devices. The company's software solutions are integrated in the digital advertising ecosystem, including programmatic platforms, connected TV, social media channels, and digital publishers. It serves brands, publishers, and other supply-side customers covering various industry verticals, including consumer packaged goods, financial services, telecommunications, technology, automotive, and healthcare. The company was founded in 2008 and is headquartered in New York, New York.",
    "ceo": "Mr. Mark S. Zagorski",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "902",
    "phone": "212 631 2111",
    "address": "233 Spring Street",
    "city": "New York",
    "state": "NY",
    "zip": "10013",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DV.png",
    "ipoDate": "2021-04-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]