[
  {
    "symbol": "DVA",
    "price": 97.64,
    "beta": 0.931338,
    "volAvg": 632098,
    "mktCap": 8855948000,
    "lastDiv": 0,
    "range": "65.28-103.0",
    "changes": 1.71,
    "companyName": "DaVita Inc.",
    "currency": "USD",
    "cik": "0000927066",
    "isin": "US23918K1088",
    "cusip": "23918K108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Care Facilities",
    "website": "https://www.davita.com",
    "description": "DaVita Inc. provides kidney dialysis services for patients suffering from chronic kidney failure. The company operates kidney dialysis centers and provides related lab services in outpatient dialysis centers. It also provides outpatient, hospital inpatient, and home-based hemodialysis services; owns clinical laboratories that provide routine laboratory tests for dialysis and other physician-prescribed laboratory tests for ESRD patients; and management and administrative services to outpatient dialysis centers. In addition, the company provides disease management services to 16,000 patients in risk-based integrated care arrangements and 7,000 patients in other integrated care arrangements; vascular access services; clinical research programs; physician services; and comprehensive kidney care services. As of December 31, 2021, it provided dialysis and administrative services in the United States through a network of 2,815 outpatient dialysis centers serving approximately 203,100 patients; and operated 339 outpatient dialysis centers located in 10 countries outside of the United States serving approximately 39,900 patients. Further, the company provides acute inpatient dialysis services in approximately 850 hospitals and related laboratory services in the United States. The company was formerly known as DaVita HealthCare Partners Inc. and changed its name to DaVita Inc. in September 2016. DaVita Inc. was incorporated in 1994 and is headquartered in Denver, Colorado.",
    "ceo": "Mr. Javier J. Rodriguez",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "70000",
    "phone": "720 631 2100",
    "address": "2000 16th Street",
    "city": "Denver",
    "state": "CO",
    "zip": "80202",
    "dcfDiff": 5.84892,
    "dcf": 75.3011,
    "image": "https://financialmodelingprep.com/image-stock/DVA.png",
    "ipoDate": "1995-10-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]