[
  {
    "symbol": "DWAHY",
    "price": 26.41,
    "beta": 0.514176,
    "volAvg": 27114,
    "mktCap": 17317592244,
    "lastDiv": 0.96,
    "range": "18.86-27.35",
    "changes": -0.02,
    "companyName": "Daiwa House Industry Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US2340622065",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Real Estate—Development",
    "website": "https://www.daiwahouse.co.jp",
    "description": "Daiwa House Industry Co., Ltd. engages in the construction business worldwide. It operates through Single-Family Houses; Rental Housing; Condominiums; Existing Homes; Commercial Facilities; Logistics, Business and Corporate Facilities; and Other Businesses segments. The company constructs single-family houses; rents houses; develops, manages, and sells condominiums; purchases, renovates, and resells existing homes; develops commercial facilities; develops and constructs logistics, business, and corporate facilities; and provides real estate agency services. It also manufactures steel and timber housing parts; offers ground survey and reinforcement services; and constructs retail and wholesale, medical and nursing care, office and factory, urban development and industrial park, energy, environmental greening, agriculture, parking and carsharing, and public-private partnership facilities. In addition, the company operates resort hotels and golf courses, business and city hotels, fitness clubs and aesthetic salons, and home centers; provides robotics technologies for use in hospitals, care facilities, factories, and construction sites; manages private homes for the elderly and assisted-living residential facilities for seniors; and offers parking, advertising, travel agency, information technology, and credit card and insurance agency services. Daiwa House Industry Co., Ltd. was incorporated in 1947 and is headquartered in Osaka, Japan.",
    "ceo": "Mr. Keiichi  Yoshii",
    "sector": "Real Estate",
    "country": "JP",
    "fullTimeEmployees": "48831",
    "phone": "81 6 6346 2111",
    "address": "3-3-5 Umeda",
    "city": "Osaka",
    "state": null,
    "zip": "530-8241",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/DWAHY.png",
    "ipoDate": "1996-02-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]