[
  {
    "symbol": "DXC",
    "price": 26.06,
    "beta": 1.965845,
    "volAvg": 1855448,
    "mktCap": 5491337348,
    "lastDiv": 14.259245000000004,
    "range": "22.11-31.99",
    "changes": -0.1,
    "companyName": "DXC Technology Company",
    "currency": "USD",
    "cik": "0001688568",
    "isin": "US23355L1061",
    "cusip": "23355L106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.dxc.technology",
    "description": "DXC Technology Company, together with its subsidiaries, provides information technology services and solutions primarily in North America, Europe, Asia, and Australia. It operates in two segments, Global Business Services (GBS) and Global Infrastructure Services (GIS). The GBS segment offers a portfolio of analytics services and extensive partner ecosystem that help its customers to gain rapid insights, automate operations, and accelerate their digital transformation journeys; and software engineering, consulting, and data analytics solutions that enable businesses to run and manage their mission-critical functions, transform their operations, and develop new ways of doing business. It also uses various technologies and methods to accelerate the creation, modernization, delivery, and maintenance of secure applications allowing customers to innovate faster while reducing risk, time to market, and total cost of ownership. In addition, this segment offers business process services, which include integration and optimization of front and back office processes, and agile process automation. The GIS segment adapts legacy apps to cloud, migrate the right workloads, and securely manage their multi-cloud environments; and offers security solutions help predict attacks, proactively respond to threats, and ensure compliance, as well as to protect data, applications, and infrastructure. It also provides IT outsourcing services to help customers securely and cost-effectively run mission-critical systems and IT infrastructure. In addition, this segment offers workplace services to fit its customer's employee, business, and IT needs from intelligent collaboration; and modern device management, digital support services, and mobility services. DXC Technology Company is headquartered in Ashburn, Virginia.",
    "ceo": "Mr. Michael J. Salvino",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "130000",
    "phone": "703 245 9600",
    "address": "20408 Bashan Drive",
    "city": "Ashburn",
    "state": "VA",
    "zip": "20147",
    "dcfDiff": 10.9239,
    "dcf": 39.1939,
    "image": "https://financialmodelingprep.com/image-stock/DXC.png",
    "ipoDate": "1981-12-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]