[
  {
    "symbol": "DXCM",
    "price": 126.42,
    "beta": 1.144718,
    "volAvg": 2448429,
    "mktCap": 49004943120,
    "lastDiv": 0,
    "range": "72.41-134.14",
    "changes": 2.92,
    "companyName": "DexCom, Inc.",
    "currency": "USD",
    "cik": "0001093557",
    "isin": "US2521311074",
    "cusip": "252131107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Devices",
    "website": "https://www.dexcom.com",
    "description": "DexCom, Inc., a medical device company, focuses on the design, development, and commercialization of continuous glucose monitoring (CGM) systems in the United States and internationally. The company provides its systems for use by people with diabetes, as well as for use by healthcare providers. Its products include DexCom G6, an integrated CGM system for diabetes management; Dexcom Real-Time API, which enables invited third-party developers to integrate real-time CGM data into their digital health applications and devices; Dexcom ONE, that is designed to replace finger stick blood glucose testing for diabetes treatment decisions; and Dexcom Share, a remote monitoring system. The company's products candidature comprises Dexcom G7, a next generation G7 CGM system. DexCom, Inc. has a collaboration and license agreement with Verily Life Sciences LLC and Verily Ireland Limited to develop blood-based or interstitial glucose monitoring products. The company markets its products directly to endocrinologists, physicians, and diabetes educators. DexCom, Inc. was incorporated in 1999 and is headquartered in San Diego, California.",
    "ceo": "Mr. Kevin Ronald Sayer",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "7500",
    "phone": "858 200 0200",
    "address": "6340 Sequence Drive",
    "city": "San Diego",
    "state": "CA",
    "zip": "92121",
    "dcfDiff": 16.4077,
    "dcf": 123.128,
    "image": "https://financialmodelingprep.com/image-stock/DXCM.png",
    "ipoDate": "2005-04-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]