[
  {
    "symbol": "E",
    "price": 27.92,
    "beta": 1.175478,
    "volAvg": 296658,
    "mktCap": 46411138140,
    "lastDiv": 2.76,
    "range": "20.38-32.21",
    "changes": 0.06,
    "companyName": "Eni S.p.A.",
    "currency": "USD",
    "cik": "0001002242",
    "isin": "US26874R1086",
    "cusip": "26874R108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.eni.com",
    "description": "Eni S.p.A. engages in the exploration, development, and production of crude oil and natural gas. It operates through Exploration & Production; Global Gas & LNG Portfolio; Refining & Marketing and Chemicals; Plenitude and Power; and Corporate and Other activities segments. The Exploration & Production segment is involved in the research, development, and production of oil, condensates and natural gas; and forestry conservation and CO2 capture and storage projects. The Global Gas & LNG Portfolio segment engages in the supply and wholesale of natural gas by pipeline, international transport; and purchase and marketing of LNG. The Refining & Marketing and Chemicals segment is involved in the processing, supply, distribution, and marketing of fuels and chemicals. The Eni gas e luce, Power & Renewables segment engages in the retail sales of gas, electricity, and related activities, as well as in the production and wholesale of electricity produced by thermoelectric and renewable plants. As of December 31, 2021, it had net proved reserves of 6,628 million barrels of oil equivalent; and installed operational capacity of 4.5 GW. The company was founded in 1953 and is headquartered in Rome, Italy.",
    "ceo": "Mr. Claudio  Descalzi",
    "sector": "Energy",
    "country": "IT",
    "fullTimeEmployees": "32188",
    "phone": "39 06 59821",
    "address": "Piazzale Enrico Mattei 1",
    "city": "Rome",
    "state": "RM",
    "zip": "00144",
    "dcfDiff": 1.64079,
    "dcf": 32.5108,
    "image": "https://financialmodelingprep.com/image-stock/E.png",
    "ipoDate": "1995-11-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]