[
  {
    "symbol": "EADSY",
    "price": 35.56,
    "beta": 1.65977,
    "volAvg": 192693,
    "mktCap": 112236253983,
    "lastDiv": 0.5,
    "range": "20.91-36.13",
    "changes": 0.14,
    "companyName": "Airbus SE",
    "currency": "USD",
    "cik": "0001378580",
    "isin": "US0092791005",
    "cusip": "009279100",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Aerospace & Defense",
    "website": "https://www.airbus.com",
    "description": "Airbus SE engages in the designing, manufacturing, and delivering aerospace products, services, and solutions worldwide. It operates through three segments: Airbus, Airbus Helicopters, and Airbus Defence and Space. The Airbus segment develops, manufactures, markets, and sells commercial jet aircraft of approximately 100 seats; and regional turboprop aircraft and aircraft components, as well as provides aircraft conversion and related services. The Airbus Helicopters segment engages in the development, manufacturing, marketing, and sale of civil and military helicopters; and provision of helicopter related services. The Airbus Defence and Space segment designs, develops, delivers, and supports military aircraft, such as combat, mission, transport, tanker aircraft, and their associated services; and offers unmanned aerial systems. This segment also offers civil and defense space systems for telecommunications, earth observations, navigation, science, and orbital systems; missile systems; and space launcher systems, as well as services around data processing from platforms, secure communication, and cyber security. The company was formerly known as Airbus Group SE and changed its name to Airbus SE in April 2017. Airbus SE was incorporated in 1998 and is based in Leiden, the Netherlands.",
    "ceo": "Mr. Guillaume M.J.D Faury",
    "sector": "Industrials",
    "country": "NL",
    "fullTimeEmployees": "137715",
    "phone": "31 71 524 5600",
    "address": "Mendelweg 30",
    "city": "Leiden",
    "state": null,
    "zip": "2333 CS",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/EADSY.png",
    "ipoDate": "2007-01-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]