[
  {
    "symbol": "EBC",
    "price": 12.08,
    "beta": 0.672216,
    "volAvg": 970561,
    "mktCap": 2130042240,
    "lastDiv": 0.4,
    "range": "9.93-21.54",
    "changes": 0.06,
    "companyName": "Eastern Bankshares, Inc.",
    "currency": "USD",
    "cik": "0001810546",
    "isin": "US27627N1054",
    "cusip": "27627N105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.easternbank.com",
    "description": "Eastern Bankshares, Inc. operates as the bank holding company for Eastern Bank that provides banking products and services primarily to retail, commercial, and small business customers. It operates in two segments, Banking Business and Insurance Agency Business. The company provides interest-bearing and non interest-bearing checking deposits, money market deposits, savings deposits, and time certificates of deposits, as well as debit and credit cards. It also offers commercial and industrial loans, commercial real estate and construction loans, small business loans, residential real estate loans, home equity, and lines of credit, as well as other consumer loans comprising unsecured personal lines of credit, overdraft protection, automobile loans, home improvement loans, airplane loans, and other personal loans. In addition, the company provides cash reserves, cash management, merchant, escrow express, government banking, international banking, interest on lawyers trust accounts, retirement planning, and business telephone banking services, as well as products and services for not-for-profit and healthcare. Further, it offers trust and investment products and services; community development and asset-based lending services; financial planning, portfolio management, wealth management, private banking, and fiduciary products; online, mobile, and telephone banking services; and automated lock box collection and account reconciliation services, as well as various insurance products. As of December 31, 2021, the company operated 105 branch offices in eastern Massachusetts and southern New Hampshire; and 23 non-branch offices in eastern Massachusetts, one office in New Hampshire, and one office in Rhode Island. Eastern Bankshares, Inc. was founded in 1818 and is headquartered in Boston, Massachusetts.",
    "ceo": "Mr. Robert F. Rivers",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2100",
    "phone": "800 327 8376",
    "address": "265 Franklin Street",
    "city": "Boston",
    "state": "MA",
    "zip": "02110",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/EBC.png",
    "ipoDate": "2020-10-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]