[
  {
    "symbol": "EC",
    "price": 10.33,
    "beta": 0.802397,
    "volAvg": 1990875,
    "mktCap": 21236724065,
    "lastDiv": 3.31,
    "range": "8.59-12.35",
    "changes": 0.08,
    "companyName": "Ecopetrol S.A.",
    "currency": "USD",
    "cik": "0001444406",
    "isin": "US2791581091",
    "cusip": "279158109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.ecopetrol.com.co",
    "description": "Ecopetrol S.A. operates as an integrated energy company. The company operates through four segments: Exploration and Production; Transport and Logistics; Refining, Petrochemical and Biofuels; and Electric Power Transmission and Toll Roads Concessions. It engages in the exploration and production of oil and gas; transportation of crude oil, motor fuels, fuel oil, and other refined products, including diesel, jet, and biofuels; processing and refining crude oil; distribution of natural gas and LPG; sale of refined and petrochemical products; supplying of electric power transmission services; design, development, construction, operation, and maintenance of road and energy infrastructure projects; and supplying of information technology and telecommunications services. As of December 31, 2021, the company had approximately 9,127 kilometers of crude oil and multi-purpose pipelines. It also produces and commercializes polypropylene resins and compounds, and masterbatches; and offers industrial service sales to customers and specialized management services. It has operations in Colombia, the United States, Asia, Central America and the Caribbean, Europe, South America, and internationally. The company was formerly known as Empresa Colombiana de Petróleos and changed its name to Ecopetrol S.A. in June 2003. Ecopetrol S.A. was incorporated in 1948 and is based in Bogotá, Colombia.",
    "ceo": "Mr. Ricardo Roa Barragan",
    "sector": "Energy",
    "country": "CO",
    "fullTimeEmployees": "18903",
    "phone": "57 310 315 8600",
    "address": "Carrera 13 No. 36 - 24",
    "city": "Bogotá",
    "state": null,
    "zip": null,
    "dcfDiff": 7075.79,
    "dcf": 7087.07,
    "image": "https://financialmodelingprep.com/image-stock/EC.png",
    "ipoDate": "2008-09-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]