[
  {
    "symbol": "ECIFY",
    "price": 2.55,
    "beta": 0.842528,
    "volAvg": 25530,
    "mktCap": 53149905408,
    "lastDiv": 0.13,
    "range": "1.47-2.63",
    "changes": 0,
    "companyName": "Electricité de France S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US2850391036",
    "cusip": "285039103",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Utilities—Diversified",
    "website": "https://www.edf.fr",
    "description": "Electricité de France S.A., an integrated energy company, engages in the power generation, transmission, distribution, supply, and trading activities in France, the United Kingdom, Italy, and internationally. The company generates electricity through nuclear, fossil fuel, hydro, solar, wind, biomass, biogas, thermal, and cogeneration plants. It also manages low and medium-voltage public electricity distribution networks; operates, maintains, and develops high-voltage and very-high-voltage electricity transmission networks; and services and produces equipment and fuel for nuclear reactors. In addition, the company is involved in commodity trading activities; and the provision of energy services, including district heating services, thermal energy services, etc. It serves approximately 38.5 million customers, including small businesses, local authorities, and industrial and residential customers. The company was founded in 1946 and is headquartered in Paris, France. Electricité de France S.A. was formerly a subsidiary of The EDF Group.",
    "ceo": "Mr. Luc  Rémont",
    "sector": "Utilities",
    "country": "FR",
    "fullTimeEmployees": "165028",
    "phone": "33 1 40 42 22 22",
    "address": "22-30, avenue de Wagram",
    "city": "Paris",
    "state": null,
    "zip": "75008",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ECIFY.png",
    "ipoDate": "2010-01-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]