[
  {
    "symbol": "ECL",
    "price": 181.08,
    "beta": 1.007042,
    "volAvg": 1038598,
    "mktCap": 51557277231,
    "lastDiv": 2.12,
    "range": "131.04-183.28",
    "changes": 0.17,
    "companyName": "Ecolab Inc.",
    "currency": "USD",
    "cik": "0000031462",
    "isin": "US2788651006",
    "cusip": "278865100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.ecolab.com",
    "description": "Ecolab Inc. provides water, hygiene, and infection prevention solutions and services in the United States and internationally. The company operates through Global Industrial, Global Institutional & Specialty, and Global Healthcare & Life Sciences segments. The Global Industrial segment offers water treatment and process applications, and cleaning and sanitizing solutions to manufacturing, food and beverage processing, transportation, chemical, metals and mining, power generation, pulp and paper, commercial laundry, petroleum, refining, and petrochemical industries. The Global Institutional & Specialty segment provides specialized cleaning and sanitizing products to the foodservice, hospitality, lodging, government and education, and retail industries. Its Global Healthcare & Life Sciences segment offers specialized cleaning and sanitizing products to the healthcare, personal care, and pharmaceutical industries, such as infection prevention and surgical solutions, and end-to-end cleaning and contamination control solutions under the Ecolab, Microtek, and Anios brand names. The company's Other segment offers pest elimination services to detect, eliminate, and prevent pests, such as rodents and insects in restaurants, food and beverage processors, educational and healthcare facilities, hotels, quick service restaurant and grocery operations, and other institutional and commercial customers. This segment also provides colloidal silica for binding and polishing applications in semiconductor, catalyst, and aerospace component manufacturing, as well as chemical industries; and products and services that manage wash process through custom designed programs, premium products, dispensing equipment, water and energy management, and reduction, as well as real time data management. It sells its products through field sales and corporate account personnel, distributors, and dealers. The company was founded in 1923 and is headquartered in Saint Paul, Minnesota.",
    "ceo": "Mr. Christophe  Beck",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "47000",
    "phone": "800 232 6522",
    "address": "1 Ecolab Place",
    "city": "Saint Paul",
    "state": "MN",
    "zip": "55102-2233",
    "dcfDiff": 2.7651,
    "dcf": 149.565,
    "image": "https://financialmodelingprep.com/image-stock/ECL.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]