[
  {
    "symbol": "ED",
    "price": 90.11,
    "beta": 0.373591,
    "volAvg": 1869003,
    "mktCap": 31226719400,
    "lastDiv": 3.24,
    "range": "78.1-102.21",
    "changes": -1.87,
    "companyName": "Consolidated Edison, Inc.",
    "currency": "USD",
    "cik": "0001047862",
    "isin": "US2091151041",
    "cusip": "209115104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.conedison.com",
    "description": "Consolidated Edison, Inc., through its subsidiaries, engages in the regulated electric, gas, and steam delivery businesses in the United States. It offers electric services to approximately 3.5 million customers in New York City and Westchester County; gas to approximately 1.1 million customers in Manhattan, the Bronx, parts of Queens, and Westchester County; and steam to approximately 1,555 customers in parts of Manhattan. The company also supplies electricity to approximately 0.3 million customers in southeastern New York and northern New Jersey; and gas to approximately 0.1 million customers in southeastern New York. In addition, it operates 533 circuit miles of transmission lines; 15 transmission substations; 64 distribution substations; 87,564 in-service line transformers; 3,924 pole miles of overhead distribution lines; and 2,291 miles of underground distribution lines, as well as 4,350 miles of mains and 377,971 service lines for natural gas distribution. Further, the company owns, operates, and develops renewable and energy infrastructure projects; and provides energy-related products and services to wholesale and retail customers, as well as invests in electric and gas transmission projects. It primarily sells electricity to industrial, commercial, residential, and government customers. The company was founded in 1823 and is based in New York, New York.",
    "ceo": "Mr. Timothy P. Cawley",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "14319",
    "phone": "212 460 4600",
    "address": "4 Irving Place",
    "city": "New York",
    "state": "NY",
    "zip": "10003",
    "dcfDiff": 2.04147,
    "dcf": 96.9515,
    "image": "https://financialmodelingprep.com/image-stock/ED.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]