[
  {
    "symbol": "EDR",
    "price": 23.73,
    "beta": 0.893983,
    "volAvg": 2847716,
    "mktCap": 7118359100,
    "lastDiv": 0,
    "range": "18.58-26.26",
    "changes": 0.03,
    "companyName": "Endeavor Group Holdings, Inc.",
    "currency": "USD",
    "cik": "0001766363",
    "isin": "US29260Y1091",
    "cusip": "29258Y103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Entertainment",
    "website": "https://www.endeavorco.com",
    "description": "Endeavor Group Holdings, Inc. operates as an entertainment, sports, and content company in the United States, the United Kingdom, and internationally. It operates in three segments: Owned Sports Properties, Events, Experiences & Rights, and Representation. The Owned Sports Properties segment operates a portfolio of sports properties, including Ultimate Fighting Championship, Professional Bull Rider, Euroleague, and Diamond Baseball Holdings, that license broadcast and other intellectual property rights and operate exclusive live events. The Events, Experiences & Rights segment provides services to a portfolio of live events, including sporting events, fashion, art fairs and music, culinary, and lifestyle festivals. This segment also owns and operates the IMG Academy, an academic and sports training institution; and produces and distributes sports video programming. The Representation segment offers services to a diverse group of talent across entertainment, sports, and fashion, such as actors, directors, writers, athletes, models, musicians, and other artists in various mediums comprising film, television, art, books, and live events. This segment provides brand strategy, marketing, advertising, public relations, analytics, digital, activation, and experiential services to corporate and other clients; intellectual property licensing services to a portfolio of entertainment, sports, and consumer product brands; and content development, production, financing, sales, and advisory services for television properties, documentaries, feature films, and podcasts. The company was founded in 1898 and is based in Beverly Hills, California.",
    "ceo": "Mr. Ariel Zev Emanuel",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "11000",
    "phone": "310 285 9000",
    "address": "9601 Wilshire Boulevard",
    "city": "Beverly Hills",
    "state": "CA",
    "zip": "90210",
    "dcfDiff": 5.27413,
    "dcf": 27.3641,
    "image": "https://financialmodelingprep.com/image-stock/EDR.png",
    "ipoDate": "2021-04-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]