[
  {
    "symbol": "EDU",
    "price": 39.74,
    "beta": 0.602464,
    "volAvg": 1704327,
    "mktCap": 6753336120,
    "lastDiv": 1.5000000000000002,
    "range": "17.01-46.74",
    "changes": -0.01,
    "companyName": "New Oriental Education & Technology Group Inc.",
    "currency": "USD",
    "cik": "0001372920",
    "isin": "US6475811070",
    "cusip": "647581206",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Education & Training Services",
    "website": "https://www.neworiental.org",
    "description": "New Oriental Education & Technology Group Inc. provides private educational services under the New Oriental brand in the People's Republic of China. It operates through K-12 AST, Test Preparation and Other Courses; Online Education; and Others segments. The company offers test preparation courses to students taking language and entrance exams used by educational institutions in the United States, the People's Republic of China, and the Commonwealth countries; and after-school tutoring courses for middle and high school students to enhance their exam scores, as well as for children to teach English. It also provides language training courses, including English, as well as other foreign languages, such as German, Japanese, French, Korean, Italian, and Spanish; operates a full-time private primary and secondary school in Yangzhou seeking a full curriculum with a focus on English; develops and edits educational materials for language training and test preparation; and offers online education programs that include college, K-12, and pre-school education. In addition, the company offers overseas studies consulting and overseas study tour services. As of May 31, 2021, it offered educational programs, services, and products to students through a network of 122 schools, 1,547 learning centers, and 11 bookstores, as well as through its online learning platforms. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
    "ceo": "Mr. Chenggang  Zhou",
    "sector": "Consumer Defensive",
    "country": "CN",
    "fullTimeEmployees": "46653",
    "phone": "86 10 6090 8000",
    "address": "No. 6 Hai Dian Zhong Street",
    "city": "Beijing",
    "state": null,
    "zip": "100080",
    "dcfDiff": 15.8341,
    "dcf": 28.0959,
    "image": "https://financialmodelingprep.com/image-stock/EDU.png",
    "ipoDate": "2006-09-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]