[
  {
    "symbol": "EEFT",
    "price": 114.64,
    "beta": 1.336267,
    "volAvg": 266190,
    "mktCap": 5689216352,
    "lastDiv": 0,
    "range": "71.6-121.55",
    "changes": 0.46,
    "companyName": "Euronet Worldwide, Inc.",
    "currency": "USD",
    "cik": "0001029199",
    "isin": "US2987361092",
    "cusip": "298736109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.euronetworldwide.com",
    "description": "Euronet Worldwide, Inc. provides payment and transaction processing and distribution solutions to financial institutions, agents, retailers, merchants, content providers, and individual consumers worldwide. The company's Electronic Fund Transfer Processing segment provides electronic payment solutions, including automated teller machine (ATM) cash withdrawal and deposit services, ATM network participation, outsourced ATM and point-of-sale (POS) management solutions, credit and debit card outsourcing, card issuing, and merchant acquiring services. It also offers ATM and POS currency conversion, ATM surcharge, advertising, customer relationship management, mobile top-up, bill payment, fraud management, foreign remittance and cardless payout, banknote recycling, and tax-refund services; and integrated electronic financial transaction software solutions, as well as delivers non-cash products. This segment operates a network of 42,713 ATMs and approximately 438,000 POS terminals. Its epay segment distributes and processed prepaid mobile airtime and other electronic payment products; and provides payment processing services for various prepaid products, cards, and services, as well as vouchers and physical gift fulfillment, and gift card distribution and processing services. This segment operates a network of approximately 775,000 POS terminals. The company's Money Transfer segment offers consumer-to-consumer and account-to-account money transfer, customers bill payment, check cashing, foreign currency exchange, mobile top-up, and cash management and foreign currency risk management services, as well as payment alternatives, such as money orders and prepaid debit cards. This segment operates a network of approximately 510,000 money transfer locations. The company was formerly known as Euronet Services, Inc. and changed its name to Euronet Worldwide, Inc. in August 2001. Euronet Worldwide, Inc. was founded in 1994 and is headquartered in Leawood, Kansas.",
    "ceo": "Mr. Michael J. Brown M.Sc., MSc",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "9500",
    "phone": "913 327 4200",
    "address": "11400 Tomahawk Creek Parkway",
    "city": "Leawood",
    "state": "KS",
    "zip": "66211-2672",
    "dcfDiff": 11.2561,
    "dcf": 122.896,
    "image": "https://financialmodelingprep.com/image-stock/EEFT.png",
    "ipoDate": "1997-03-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]