[
  {
    "symbol": "EFX",
    "price": 232.63,
    "beta": 1.454929,
    "volAvg": 727366,
    "mktCap": 28530673720,
    "lastDiv": 1.56,
    "range": "145.98-234.76",
    "changes": 3.89,
    "companyName": "Equifax Inc.",
    "currency": "USD",
    "cik": "0000033185",
    "isin": "US2944291051",
    "cusip": "294429105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Consulting Services",
    "website": "https://www.equifax.com",
    "description": "Equifax Inc. provides information solutions and human resources business process automation outsourcing services for businesses, governments, and consumers. The company operates through three segments: Workforce Solutions, U.S. Information Solutions (USIS), and International. The Workforce Solutions segment offers employment, income, criminal history, and social security number verification services, as well as payroll-based transaction, employment tax management, and identity theft protection products. The USIS segment provides consumer and commercial information services, such as credit information and credit scoring, credit modeling and portfolio analytics, locate, fraud detection and prevention, identity verification, and other consulting; mortgage services; financial marketing services; identity management services; credit monitoring products; and online information, decisioning technology solutions, as well as portfolio management, mortgage reporting, and consumer credit information services. The International segment offers information service products, which include consumer and commercial services, such as credit and financial information, and credit scoring and modeling; and credit and other marketing products and services, as well as offers information, technology, and other services to support debt collections and recovery management. The company serves customers in financial services, mortgage, employers, consumer, commercial, telecommunication, retail, automotive, utility, brokerage, healthcare, and insurance industries, as well as state, federal, and local governments. It operates in the United States, Canada, Australia, New Zealand, India, the United Kingdom, Spain, Portugal, Argentina, Chile, Costa Rica, Ecuador, El Salvador, Honduras, Mexico, Paraguay, Peru, Uruguay, Brazil, the Republic of Ireland, Russia, Cambodia, Malaysia, Singapore, and the United Arab Emirates. The company was founded in 1899 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. Mark W. Begor",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "14000",
    "phone": "404 885 8000",
    "address": "1550 Peachtree Street, NW",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30309",
    "dcfDiff": 19.832,
    "dcf": 198.408,
    "image": "https://financialmodelingprep.com/image-stock/EFX.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]