[
  {
    "symbol": "EHC",
    "price": 66.85,
    "beta": 0.959859,
    "volAvg": 689146,
    "mktCap": 6700776600,
    "lastDiv": 0.6,
    "range": "44.31981-66.94",
    "changes": 0.47,
    "companyName": "Encompass Health Corporation",
    "currency": "USD",
    "cik": "0000785161",
    "isin": "US29261A1007",
    "cusip": "29261A100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Care Facilities",
    "website": "https://www.encompasshealth.com",
    "description": "Encompass Health Corporation provides facility-based and home-based post-acute healthcare services in the United States. The company operates in two segments, Inpatient Rehabilitation, and Home Health and Hospice. The Inpatient Rehabilitation segment provides specialized rehabilitative treatment on an inpatient and outpatient basis to patients who are recovering from conditions, such as stroke and other neurological disorders, cardiac and pulmonary conditions, brain and spinal cord injuries, complex orthopedic conditions, and amputations. The Home Health and Hospice segment provides home health and hospice services primarily in the Southeast and Texas. Its home health services include a range of Medicare-certified home nursing services to adult patients in need of care comprising skilled nursing, medical social work, and home health aide services, as well as physical, occupational, speech therapy, and others. This segment's hospice services comprise in-home services to terminally ill patients and their families. As of June 1, 2022, it operated 149 hospitals, 252 home health locations, and 99 hospice locations in 42 states and Puerto Rico. The company was formerly known as HealthSouth Corporation and changed its name to Encompass Health Corporation in January 2018. Encompass Health Corporation was founded in 1983 and is based in Birmingham, Alabama.",
    "ceo": "Mr. Mark J. Tarr",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "35900",
    "phone": "205 967 7116",
    "address": "9001 Liberty Parkway",
    "city": "Birmingham",
    "state": "AL",
    "zip": "35242",
    "dcfDiff": 4.9809,
    "dcf": 56.4091,
    "image": "https://financialmodelingprep.com/image-stock/EHC.png",
    "ipoDate": "1986-09-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]