[
  {
    "symbol": "EKTAY",
    "price": 7.48,
    "beta": 1.015325,
    "volAvg": 3582,
    "mktCap": 2970038720,
    "lastDiv": 0.23,
    "range": "4.68-8.65",
    "changes": 0.04,
    "companyName": "Elekta AB (publ)",
    "currency": "USD",
    "cik": null,
    "isin": "US28617Y1010",
    "cusip": "28617Y101",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.elekta.com",
    "description": "Elekta AB (publ), a medical technology company, provides clinical solutions for treating cancer and brain disorders worldwide. The company offers Versa HD, a brain metastases solution; Elekta Unity, a MR-Linac technology; Elekta Harmony, a linear accelerator; Elekta Infinity for treating a range of patients with simple-to-complex radiotherapy needs; Elekta Synergy, a digital accelerator for advanced image-guided radiation therapy; treatment management solutions; automated and integrated quality assurance solutions; and hardware and software motion management technology. It also provides MOSAIQ Plaza for multidisciplinary cancer care; Elekta Axis Cloud, a managed hosting service; Elekta Studio, an image-guided brachytherapy solution; ImagingRing, a mobile CT scanner; Oncentra Brachy, a smart tool that facilitate repetitive tasks; Venezia applicator that enables the radiation oncologist to treat locally advanced cervical cancer; Elekta Flexitron afterloader for enabling the precise execution of all steps in the workflow; and Geneva, an applicator for cervical cancer treatment. In addition, the company offers Leksell Gamma Knife Icon for personalized radiation treatment; Leksell Gamma Knife Perfexion, a tool for neurosurgeons; Leksell Gamma Knife Lightning for accelerated radiosurgery. Further, it provides neurosurgery products comprising Leksell Vantage Stereotactic System for intracranial neurosurgery; and Leksell Stereotactic System or minimally invasive stereotactic neurosurgery. The company was incorporated in 1972 and is headquartered in Stockholm, Sweden.",
    "ceo": "Mr. Gustaf  Salford",
    "sector": "Healthcare",
    "country": "SE",
    "fullTimeEmployees": "4700",
    "phone": "46 8 58 72 54 00",
    "address": "Kungstensgatan 18",
    "city": "Stockholm",
    "state": null,
    "zip": "103 93",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/EKTAY.png",
    "ipoDate": "2009-03-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]