[
  {
    "symbol": "EL",
    "price": 193.87,
    "beta": 1.022183,
    "volAvg": 2311240,
    "mktCap": 69291657147,
    "lastDiv": 2.64,
    "range": "175.05-284.45",
    "changes": -2.6,
    "companyName": "The Estée Lauder Companies Inc.",
    "currency": "USD",
    "cik": "0001001250",
    "isin": "US5184391044",
    "cusip": "518439104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Household & Personal Products",
    "website": "https://www.elcompanies.com",
    "description": "The Estée Lauder Companies Inc. manufactures, markets, and sells skin care, makeup, fragrance, and hair care products worldwide. The company offers a range of skin care products, including moisturizers, serums, cleansers, toners, body care, exfoliators, acne care and oil correctors, facial masks, cleansing devices, and sun care products; and makeup products, such as lipsticks, lip glosses, mascaras, foundations, eyeshadows, nail polishes, and powders, as well as compacts, brushes, and other makeup tools. It also provides fragrance products in various forms comprising eau de parfum sprays and colognes, as well as lotions, powders, creams, candles, and soaps; and hair care products that include shampoos, conditioners, styling products, treatment, finishing sprays, and hair color products, as well as sells ancillary products and services. The company offers its products under Estée Lauder, Aramis, Clinique, Lab Series, Origins, M·A·C, Bobbi Brown, La Mer, Aveda, Jo Malone London, Bumble and bumble, Darphin, Smashbox, Le Labo, Editions de Parfums Frédéric Malle, GLAMGLOW, By Kilian, BECCA, Too Faced, Dr. Jart+, DECIEM, and The Ordinary brands. It also holds license arrangements for Tommy Hilfiger, Donna Karan New York, DKNY, Michael Kors, and Ermenegildo Zegna brands. The company sells its products through department stores, specialty-multi retailers, upscale perfumeries and pharmacies, and salons and spas; freestanding stores; its own and authorized retailer websites; third-party online malls; stores in airports; and in-flight and duty-free shops. The company was founded in 1946 and is headquartered in New York, New York.",
    "ceo": "Mr. Fabrizio  Freda",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "44730",
    "phone": "212 572 4200",
    "address": "767 Fifth Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10153",
    "dcfDiff": 38.4045,
    "dcf": 232.386,
    "image": "https://financialmodelingprep.com/image-stock/EL.png",
    "ipoDate": "1995-11-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]