[
  {
    "symbol": "EME",
    "price": 179.36,
    "beta": 1.084859,
    "volAvg": 459624,
    "mktCap": 8527796752,
    "lastDiv": 0.72,
    "range": "98.48-180.85",
    "changes": -0.52,
    "companyName": "EMCOR Group, Inc.",
    "currency": "USD",
    "cik": "0000105634",
    "isin": "US29084Q1004",
    "cusip": "29084Q100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Engineering & Construction",
    "website": "https://www.emcorgroup.com",
    "description": "EMCOR Group, Inc. provides electrical and mechanical construction, and facilities services primarily in the United States and the United Kingdom. It offers design, integration, installation, starts-up, operation, and maintenance services related to electrical power transmission, distribution, and generation systems; energy solutions; premises electrical and lighting systems; process instrumentation in the refining, chemical processing, and food processing industries; low-voltage systems, such as fire alarm, security, and process control systems; voice and data communications systems; roadway and transit lighting, signaling, and fiber optic lines; heating, ventilation, air conditioning, refrigeration, and geothermal solutions; clean-room process ventilation systems; fire protection and suppression systems; plumbing, process, and high-purity piping systems; controls and filtration systems; water and wastewater treatment systems; central plant heating and cooling systems; crane and rigging services; millwright services; and steel fabrication, erection, and welding services. The company also provides building services that cover commercial and government site-based operations and maintenance; facility management, maintenance, and services; outage services to utilities and industrial plants; military base operations support services; mobile mechanical maintenance and services; services for indoor air quality; floor care and janitorial services; landscaping, lot sweeping, and snow removal services; vendor management and call center services; installation and support for building systems; program development, management, and maintenance for energy systems; technical consulting and diagnostic services; infrastructure and building projects; small modification and retrofit projects; and other building services. It offers industrial services to oil, gas, and petrochemical industries. EMCOR Group, Inc. was incorporated in 1987 and is headquartered in Norwalk, Connecticut.",
    "ceo": "Mr. Anthony J. Guzzi",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "35500",
    "phone": "203 849 7800",
    "address": "301 Merritt Seven",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06851-1092",
    "dcfDiff": 23.3944,
    "dcf": 169.974,
    "image": "https://financialmodelingprep.com/image-stock/EME.png",
    "ipoDate": "1995-01-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]