[
  {
    "symbol": "EMN",
    "price": 82.48,
    "beta": 1.517253,
    "volAvg": 915851,
    "mktCap": 9827656960,
    "lastDiv": 3.16,
    "range": "69.91-102.18",
    "changes": 0.77,
    "companyName": "Eastman Chemical Company",
    "currency": "USD",
    "cik": "0000915389",
    "isin": "US2774321002",
    "cusip": "277432100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.eastman.com",
    "description": "Eastman Chemical Company operates as a specialty materials company in the United States and internationally. The company's Additives & Functional Products segment offers hydrocarbon and rosin resins; organic acid-based solutions; amine derivative-based building blocks; metam-based soil fumigants, thiram and ziram based fungicides, and plant growth regulators; specialty coalescent, specialty and commodity solvents, paint additives, and specialty polymers; heat transfer and aviation fluids; insoluble sulfur and anti-degradant rubber additives; and performance resins. It serves transportation, personal care, wellness, food, feed, agriculture, building and construction, water treatment, energy, consumables, durables, and electronics markets. Its Advanced Materials segment provides copolyesters, cellulosic biopolymers, cellulose esters, polyvinyl butyral (PVB) sheets, and window and protective films, and aftermarket applied film products for value-added end uses in the transportation, durables, electronics, building and construction, medical and pharma, and consumables markets. The company's Chemical Intermediates segment offers methylamines and salts higher amines and solvents; Olefin and acetyl derivatives, ethylene, and commodity solvents; and primary non-phthalate and phthalate plasticizers, and niche non- phthalate plasticizers to the industrial chemicals and processing, building and construction, health and wellness, and agrochemicals. Its Fibers segment provides cellulose acetate tow, triacetin, cellulose acetate flake, acetic acid, and acetic anhydride for use in filtration media primarily cigarette filters; natural and solution dyed acetate yarns for use in consumables, and health and wellness markets; and wet-laid nonwoven media, specialty and engineered papers, and cellulose acetate fibers for transportation, industrial, agriculture and mining, and aerospace markets. Eastman Chemical Company was founded in 1920 and is headquartered in Kingsport, Tennessee.",
    "ceo": "Mr. Mark J. Costa",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "14500",
    "phone": "423 229 2000",
    "address": "200 South Wilcox Drive",
    "city": "Kingsport",
    "state": "TN",
    "zip": "37662",
    "dcfDiff": 1.19263,
    "dcf": 88.0126,
    "image": "https://financialmodelingprep.com/image-stock/EMN.png",
    "ipoDate": "1993-12-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]