[
  {
    "symbol": "EMR",
    "price": 89.35,
    "beta": 1.389436,
    "volAvg": 3245956,
    "mktCap": 51063527859,
    "lastDiv": 2.08,
    "range": "72.41-99.65",
    "changes": -0.28,
    "companyName": "Emerson Electric Co.",
    "currency": "USD",
    "cik": "0000032604",
    "isin": "US2910111044",
    "cusip": "291011104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.emerson.com",
    "description": "Emerson Electric Co., a technology and engineering company, provides various solutions for customers in industrial, commercial, and residential markets in the Americas, Asia, the Middle East, Africa, and Europe. The company operates through Automation Solutions, and Commercial & Residential Solutions segments. The Automation Solutions segment offers measurement and analytical instrumentation, industrial valves and equipment, and process control software and systems. It serves oil and gas, refining, chemicals, power generation, life sciences, food and beverage, automotive, pulp and paper, metals and mining, and municipal water supplies markets. The Commercial & Residential Solutions segment offers residential and commercial heating and air conditioning products, such as reciprocating and scroll compressors; system protector and flow control devices; standard, programmable, and Wi-Fi thermostats; monitoring equipment and electronic controls for gas and electric heating systems; gas valves for furnaces and water heaters; ignition systems for furnaces; sensors and thermistors for home appliances; and temperature sensors and controls. It also provides reciprocating, scroll, and screw compressors; precision flow controls; system diagnostics and controls; and environmental control systems. In addition, this segment offers air conditioning, refrigeration, and lighting control technologies, as well as facility design and product management, site commissioning, facility monitoring, and energy modeling services; tools for professionals and homeowners; and appliance solutions. Emerson Electric Co. was incorporated in 1890 and is headquartered in Saint Louis, Missouri.",
    "ceo": "Mr. Surendralal Lanca Karsanbhai",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "85500",
    "phone": "314 553 2000",
    "address": "8000 West Florissant Avenue",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63136",
    "dcfDiff": 9.1516,
    "dcf": 98.5816,
    "image": "https://financialmodelingprep.com/image-stock/EMR.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]