[
  {
    "symbol": "ENB",
    "price": 36.72,
    "beta": 0.912938,
    "volAvg": 3231611,
    "mktCap": 74346247250,
    "lastDiv": 2.62,
    "range": "35.02-45.21",
    "changes": -0.02,
    "companyName": "Enbridge Inc.",
    "currency": "USD",
    "cik": "0000895728",
    "isin": "CA29250N1050",
    "cusip": "29250N105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.enbridge.com",
    "description": "Enbridge Inc. operates as an energy infrastructure company. The company operates through five segments: Liquids Pipelines, Gas Transmission and Midstream, Gas Distribution and Storage, Renewable Power Generation, and Energy Services. The Liquids Pipelines segment operates pipelines and related terminals to transport various grades of crude oil and other liquid hydrocarbons in Canada and the United States. The Gas Transmission and Midstream segment invests in natural gas pipelines, and gathering and processing facilities in Canada and the United States. The Gas Distribution and Storage segment is involved in natural gas utility operations serving residential, commercial, and industrial customers in Ontario, as well as natural gas distribution and energy transportation activities in Quebec. The Renewable Power Generation segment operates power generating assets, such as wind, solar, geothermal, and waste heat recovery facilities; and transmission assets in North America and Europe. The Energy Services segment provides energy marketing services to refiners, producers, and other customers; and physical commodity marketing and logistical services in Canada and the United States. The company was formerly known as IPL Energy Inc. and changed its name to Enbridge Inc. in October 1998. Enbridge Inc. was founded in 1949 and is headquartered in Calgary, Canada.",
    "ceo": "Mr. Gregory Lorne Ebel",
    "sector": "Energy",
    "country": "CA",
    "fullTimeEmployees": "11100",
    "phone": "14032313900",
    "address": "200, Fifth Avenue Place",
    "city": "Calgary",
    "state": "AB",
    "zip": "T2P 3L8",
    "dcfDiff": 0.498417,
    "dcf": 40.3416,
    "image": "https://financialmodelingprep.com/image-stock/ENB.png",
    "ipoDate": "1984-03-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]