[
  {
    "symbol": "ENIC",
    "price": 3.36,
    "beta": 0.69452,
    "volAvg": 1165462,
    "mktCap": 4647988961,
    "lastDiv": 0.34,
    "range": "0.981-3.48",
    "changes": -0.07,
    "companyName": "Enel Chile S.A.",
    "currency": "USD",
    "cik": "0001659939",
    "isin": "US29278D1054",
    "cusip": "29278D105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.enel.cl",
    "description": "Enel Chile S.A., an electricity utility company, engages in the generation, transmission, and distribution of electricity in Chile. The company operates through Generation Business and Distribution Business segments. It generates electricity through various sources, such as hydroelectric, thermal, wind, solar, and geothermal power plants. As of December 31, 2021, it had 8,054 megawatts of gross installed capacity, as well as distributed electricity to approximately 2.0 million customers with 2,105 square kilometers of transmission lines in 33 municipalities of the Santiago metropolitan region. The company also engages in the sale and transportation of natural gas; and provision of construction works, engineering, and consulting services. It serves residential, commercial, industrial, governmental, and other customers. The company was formerly known as Enersis Chile S.A. and changed its name to Enel Chile S.A. in October 2016. The company was incorporated in 2016 and is headquartered in Santiago, Chile. Enel Chile S.A. is a subsidiary of Enel S.p.A.",
    "ceo": "Mr. Fabrizio  Barderi",
    "sector": "Utilities",
    "country": "CL",
    "fullTimeEmployees": "2140",
    "phone": "56 22 353 4400",
    "address": "Santa Rosa 76",
    "city": "Santiago de Chile",
    "state": null,
    "zip": "8330099",
    "dcfDiff": 0.34,
    "dcf": 1.95,
    "image": "https://financialmodelingprep.com/image-stock/ENIC.png",
    "ipoDate": "2016-04-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]