[
  {
    "symbol": "ENOV",
    "price": 63.11,
    "beta": 2.096478,
    "volAvg": 424272,
    "mktCap": 3439267804,
    "lastDiv": 0,
    "range": "43.88-66.71",
    "changes": -0.45,
    "companyName": "Enovis Corporation",
    "currency": "USD",
    "cik": "0001420800",
    "isin": null,
    "cusip": "194014502",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.enovis.com",
    "description": "Enovis Corporation operates as a medical technology company worldwide. It develops, manufactures, and distributes medical device products used by orthopedic specialists, surgeons, primary care physicians, pain management specialists, physical therapists, podiatrists, chiropractors, athletic trainers, and other healthcare professionals to treat patients with musculoskeletal conditions resulting from degenerative diseases, deformities, traumatic events, and sports related injuries. It offers rigid and soft orthopedic bracings, hot and cold therapy products, bone growth stimulators, vascular therapy systems and compression garments, therapeutic shoes and inserts, electrical stimulators used for pain management, and physical therapy products; and a suite of reconstructive joint products for the hip, knee, shoulder, elbow, foot, ankle, and finger. Enovis Corporation sells its products through independent distributors, such as healthcare professionals, consumer retail stores, and pharmacies; and directly under the DJO brand. The company was formerly known as Colfax Corporation. Enovis Corporation is headquartered in Wilmington, Delaware.",
    "ceo": "Mr. Matthew L. Trerotola",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "6800",
    "phone": "302 252 9190",
    "address": "2711 Centerville Road",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19808",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ENOV.png",
    "ipoDate": "2008-05-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]