[
  {
    "symbol": "ENR",
    "price": 32.97,
    "beta": 1.005281,
    "volAvg": 505779,
    "mktCap": 2356586931,
    "lastDiv": 1.2,
    "range": "24.81-37.89",
    "changes": 0.06,
    "companyName": "Energizer Holdings, Inc.",
    "currency": "USD",
    "cik": "0001632790",
    "isin": "US29272W1099",
    "cusip": "29272W109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electrical Equipment & Parts",
    "website": "https://www.energizerholdings.com",
    "description": "Energizer Holdings, Inc., together with its subsidiaries, manufactures, markets, and distributes household batteries, specialty batteries, and lighting products worldwide. It offers lithium, alkaline, carbon zinc, nickel metal hydride, zinc air, and silver oxide batteries under the Energizer and Eveready brands, as well as primary, rechargeable, specialty, and hearing aid batteries. The company also provides headlights, lanterns, and children's and area lights, as well as flash lights under the Energizer, Eveready, Rayovac, Hard Case, Dolphin, Varta, and WeatherReady brands. In addition, it licenses the Energizer and Eveready brands to companies developing consumer solutions in gaming, automotive batteries, portable power for critical devices, LED light bulbs, generators, power tools, household light bulbs, and other lighting products. Further, the company designs and markets automotive fragrance and appearance products, including protectants, wipes, tire and wheel care products, glass cleaners, leather care products, air fresheners, and washes to clean, shine, refresh, and protect interior and exterior automobile surfaces under the brand names of Armor All, Nu Finish, Refresh Your Car!, LEXOL, Eagle One, California Scents, Driven, and Bahama & Co; STP branded fuel and oil additives, functional fluids, and other performance chemical products; and do-it-yourself automotive air conditioning recharge products under the A/C PRO brand name, as well as other refrigerant and recharge kits, sealants, and accessories. It sells its products through direct sales force, distributors, and wholesalers; and through various retail and business-to-business channels, including mass merchandisers, club, electronics, food, home improvement, dollar store, auto, drug, hardware, e-commerce, convenience, sporting goods, hobby/craft, office, industrial, medical, and catalog. Energizer Holdings, Inc. was incorporated in 2015 and is headquartered in Saint Louis, Missouri.",
    "ceo": "Mr. Mark S. LaVigne",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5500",
    "phone": "314 985 2000",
    "address": "533 Maryville University Drive",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63141",
    "dcfDiff": 0.0925624,
    "dcf": 36.3774,
    "image": "https://financialmodelingprep.com/image-stock/ENR.png",
    "ipoDate": "2015-06-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]