[
  {
    "symbol": "ENS",
    "price": 105.68,
    "beta": 1.353169,
    "volAvg": 247617,
    "mktCap": 4328589392,
    "lastDiv": 0.7,
    "range": "55.6-107.44",
    "changes": -0.04,
    "companyName": "EnerSys",
    "currency": "USD",
    "cik": "0001289308",
    "isin": "US29275Y1029",
    "cusip": "29275Y102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electrical Equipment & Parts",
    "website": "https://www.enersys.com",
    "description": "EnerSys provides various stored energy solutions for industrial applications worldwide. It operates in three segments: Energy Systems, Motive Power, and Specialty. The company offers uninterruptible power systems applications for computer and computer-controlled systems, as well as telecommunications systems; switchgear and electrical control systems used in industrial facilities and electric utilities, large-scale energy storage, and energy pipelines; integrated power solutions and services to broadband, telecom, renewable, and industrial customers; and thermally managed cabinets and enclosures for electronic equipment and batteries. It also provides motive power products that are used to provide power for electric industrial forklifts used in manufacturing, warehousing, and other material handling applications. In addition, the company offers mining equipment, diesel locomotive starting, and other rail equipment. Further, it provides specialty batteries for starting, lighting, and ignition applications in transportation; and energy solutions for satellites, military aircraft, submarines, ships, and other tactical vehicles, as well as medical and security systems. Additionally, the company offers battery chargers, power equipment, battery accessories, and outdoor cabinet enclosures, as well as related after-market and customer-support services for industrial batteries. The company sells its products through a network of distributors, independent representatives, and internal sales forces. The company was formerly known as Yuasa, Inc. and changed its name to EnerSys in January 2001. EnerSys was incorporated in 2000 and is headquartered in Reading, Pennsylvania.",
    "ceo": "Mr. David M. Shaffer",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "11350",
    "phone": "610 208 1991",
    "address": "2366 Bernville Road",
    "city": "Reading",
    "state": "PA",
    "zip": "19605",
    "dcfDiff": 4.91758,
    "dcf": 85.1076,
    "image": "https://financialmodelingprep.com/image-stock/ENS.png",
    "ipoDate": "2004-08-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]