[
  {
    "symbol": "ENSG",
    "price": 94.04,
    "beta": 0.993661,
    "volAvg": 307514,
    "mktCap": 5264810592,
    "lastDiv": 0.23,
    "range": "71.72-102.26",
    "changes": 0.64,
    "companyName": "The Ensign Group, Inc.",
    "currency": "USD",
    "cik": "0001125376",
    "isin": "US29358P1012",
    "cusip": "29358P101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Care Facilities",
    "website": "https://ensigngroup.net",
    "description": "The Ensign Group, Inc. provides health care services in the post-acute care continuum and other ancillary businesses. The company operates in two segments, Skilled Services and Real Estate. The company offers skilled services, which include short and long-term nursing care services for patients with chronic conditions, prolonged illness, and the elderly; and physical, occupational, and speech therapies and other rehabilitative and healthcare services. It also provides standard services, such as room and board, special nutritional programs, social, recreational, entertainment, and other services. In addition, the company offers senior living, as well as mobile diagnostics services; leases real estate properties; and provides other ancillary services consisting of digital x-ray, ultrasound, electrocardiogram, laboratory, sub-acute, and patient transportation services to people in their homes or at long-term care facilities. As of April 4, 2022, it operated 252 healthcare facilities in Arizona, California, Colorado, Idaho, Iowa, Kansas, Nebraska, Nevada, South Carolina, Texas, Utah, Washington, and Wisconsin. The company was incorporated in 1999 and is based in San Juan Capistrano, California.",
    "ceo": "Mr. Barry R. Port",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "29900",
    "phone": "949 487 9500",
    "address": "29222 Rancho Viejo Road",
    "city": "San Juan Capistrano",
    "state": "CA",
    "zip": "92675",
    "dcfDiff": 6.60236,
    "dcf": 97.9824,
    "image": "https://financialmodelingprep.com/image-stock/ENSG.png",
    "ipoDate": "2007-11-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]