[
  {
    "symbol": "ENTG",
    "price": 107.99,
    "beta": 1.252464,
    "volAvg": 1709867,
    "mktCap": 16164482286,
    "lastDiv": 0.4,
    "range": "61.75-114.47",
    "changes": -1.1,
    "companyName": "Entegris, Inc.",
    "currency": "USD",
    "cik": "0001101302",
    "isin": "US29362U1043",
    "cusip": "29362U104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductor Equipment & Materials",
    "website": "https://www.entegris.com",
    "description": "Entegris, Inc. develops, manufactures, and supplies microcontamination control products, specialty chemicals, and advanced materials handling solutions in North America, Taiwan, China, South Korea, Japan, Europe, and Southeast Asia. It operates in three segments: Specialty Chemicals and Engineered Materials (SCEM); Microcontamination Control (MC); and Advanced Materials Handling (AMH). The SCEM segment offers high-performance and high-purity process chemistries, gases, and materials, as well as delivery systems to support semiconductor and other advanced manufacturing processes. The MC segment provides solutions to filter and purify critical liquid chemistries and gases used in semiconductor manufacturing processes and other high-technology industries. The AMH segment develops solutions to monitor, protect, transport, and deliver critical liquid chemistries, wafers, and other substrates for application in the semiconductor, life sciences, and other high-technology industries. The company's customers include logic and memory semiconductor device manufacturers, semiconductor equipment makers, gas and chemical manufacturing companies, and wafer grower companies; and flat panel display equipment makers, panel manufacturers, and manufacturers of hard disk drive components and devices, as well as their related ecosystems. It also serves manufacturers and suppliers in the solar industries, electrical discharge machining customers, glass and glass container manufacturers, aerospace manufacturers, and manufacturers of biomedical implantation devices. Entegris, Inc. was founded in 1966 and is headquartered in Billerica, Massachusetts.",
    "ceo": "Mr. Bertrand  Loy",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "9000",
    "phone": "978 436 6500",
    "address": "129 Concord Road",
    "city": "Billerica",
    "state": "MA",
    "zip": "01821",
    "dcfDiff": 6.81443,
    "dcf": 74.0056,
    "image": "https://financialmodelingprep.com/image-stock/ENTG.png",
    "ipoDate": "2000-07-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]