[
  {
    "symbol": "ENV",
    "price": 58,
    "beta": 1.233802,
    "volAvg": 418770,
    "mktCap": 3155437800,
    "lastDiv": 3.12,
    "range": "41.72-69.22",
    "changes": -0.02,
    "companyName": "Envestnet, Inc.",
    "currency": "USD",
    "cik": "0001337619",
    "isin": "US29404K1060",
    "cusip": "29404K106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.envestnet.com",
    "description": "Envestnet, Inc., together with its subsidiaries, provides wealth management software and services in the United States and internationally. It operates through Envestnet Wealth Solutions and Envestnet Data & Analytics segments. The company's product and services include Envestnet | Enterprise, which provides an end-to-end open architecture wealth management platform, as well as offers data aggregation and reporting, data analytics, and digital advice capabilities; Envestnet | Tamarac that provides trading, rebalancing, portfolio accounting, performance reporting, and client relationship management software; and Envestnet | MoneyGuide that provides goals-based financial planning solutions to the financial services industry. It also provides Envestnet | Retirement Solutions, which offer a suite of services for advisor-sold retirement plans; and Envestnet | Portfolio Management Consultants that provide research and consulting services to assist advisors in creating investment solutions for their clients, and portfolio overlay and tax optimization services, as well as data aggregation and data intelligence platform, which offers cloud-based innovation for digital financial services. Envestnet, Inc. was founded in 1999 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. William C. Crager",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3429",
    "phone": "312 827 2800",
    "address": "35 East Wacker Drive",
    "city": "Chicago",
    "state": "IL",
    "zip": "60601",
    "dcfDiff": 2.46906,
    "dcf": 63.8809,
    "image": "https://financialmodelingprep.com/image-stock/ENV.png",
    "ipoDate": "2010-07-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]