[
  {
    "symbol": "EPAM",
    "price": 227.85,
    "beta": 1.56338,
    "volAvg": 674364,
    "mktCap": 13193768175,
    "lastDiv": 0,
    "range": "197.99-462.99",
    "changes": -1.23,
    "companyName": "EPAM Systems, Inc.",
    "currency": "USD",
    "cik": "0001352010",
    "isin": "US29414B1044",
    "cusip": "29414B104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.epam.com",
    "description": "EPAM Systems, Inc. provides digital platform engineering and software development services worldwide. The company offers engineering services, including requirements analysis and platform selection, customization, cross-platform migration, implementation, and integration; infrastructure management services, such as software development, testing, and maintenance with private, public, and mobile infrastructures for application, database, network, server, storage, and systems operations management, as well as monitoring, incident notification, and resolution services; and maintenance and support services. It also provides operation solutions comprising integrated engineering practices and smart automation; and optimization solutions that include software application testing, test management, automation, and consulting services to enable customers enhance their existing software testing and quality assurance practices, as well as other testing services that identify threats and close loopholes to protect its customers' business systems from information loss. In addition, the company offers business, experience, technology, data, and technical advisory consulting services; and digital and service design solutions, which comprise strategy, design, creative, and program management services, as well as physical product development, such as artificial intelligence, robotics, and virtual reality. It serves the financial services, travel and consumer, software and hi-tech, business information and media, life sciences and healthcare, and other industries. The company was founded in 1993 and is headquartered in Newtown, Pennsylvania.",
    "ceo": "Mr. Arkadiy  Dobkin",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "59300",
    "phone": "267 759 9000",
    "address": "41 University Drive",
    "city": "Newtown",
    "state": "PA",
    "zip": "18940",
    "dcfDiff": 18.355,
    "dcf": 359.785,
    "image": "https://financialmodelingprep.com/image-stock/EPAM.png",
    "ipoDate": "2012-02-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]