[
  {
    "symbol": "EPC",
    "price": 40.88,
    "beta": 0.958802,
    "volAvg": 417451,
    "mktCap": 2091968592,
    "lastDiv": 0.6,
    "range": "33.65-46.13",
    "changes": -1.2,
    "companyName": "Edgewell Personal Care Company",
    "currency": "USD",
    "cik": "0001096752",
    "isin": "US28035Q1022",
    "cusip": "28035Q102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Household & Personal Products",
    "website": "https://edgewell.com",
    "description": "Edgewell Personal Care Company, together with its subsidiaries, manufactures and markets personal care products worldwide. It operates through three segments: Wet shave, Sun and Skin care, and Feminine care. The Wet Shave segment provides razor systems, such as razor handles and refillable blades, and disposable shave products for men and women under the Schick, Wilkinson Sword, Edge, Skintimate, Shave Guard, and Personna brands. The Sun and Skin Care segment provides general protection, sport, kids, baby, tanning and after sun products under the Banana Boat and Hawaiian Tropic brands, as well as antibacterial hand wipes, alcohol sanitizing wipes, and hand sanitizer gels under the Wet Ones brand; and skin care products for men under the Bulldog and Jack Black brands, and skin care and grooming products under the Cremo brand. The Feminine Care segment provides tampons under the Playtex Gentle Glide 360°, Playtex Sport, Playtex and o.b. brands; and markets pads and liners under the Stayfree and Carefree brands. The company was formerly known as Energizer Holdings, Inc. and changed its name to Edgewell Personal Care Company in June 2015. Edgewell Personal Care Company was founded in 1772 and is headquartered in Shelton, Connecticut.",
    "ceo": "Mr. Rod R. Little",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "7000",
    "phone": "203 944 5500",
    "address": "6 Research Drive",
    "city": "Shelton",
    "state": "CT",
    "zip": "06484",
    "dcfDiff": 8.68116,
    "dcf": 49.8212,
    "image": "https://financialmodelingprep.com/image-stock/EPC.png",
    "ipoDate": "2000-03-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]