[
  {
    "symbol": "EPD",
    "price": 26.22,
    "beta": 1.051408,
    "volAvg": 4243367,
    "mktCap": 57015654298,
    "lastDiv": 1.96,
    "range": "22.9-27.36",
    "changes": 0.14,
    "companyName": "Enterprise Products Partners L.P.",
    "currency": "USD",
    "cik": "0001061219",
    "isin": "US2937921078",
    "cusip": "293792107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.enterpriseproducts.com",
    "description": "Enterprise Products Partners L.P. provides midstream energy services to producers and consumers of natural gas, natural gas liquids (NGLs), crude oil, petrochemicals, and refined products. The company operates through four segments: NGL Pipelines & Services, Crude Oil Pipelines & Services, Natural Gas Pipelines & Services, and Petrochemical & Refined Products Services. The NGL Pipelines & Services segment offers natural gas processing and related NGL marketing services. It operates 19 natural gas processing facilities located in Colorado, Louisiana, Mississippi, New Mexico, Texas, and Wyoming; NGL pipelines; NGL fractionation facilities; NGL and related product storage facilities; and NGL marine terminals. The Crude Oil Pipelines & Services segment operates crude oil pipelines; and crude oil storage and marine terminals, which include a fleet of 255 tractor-trailer tank trucks that are used to transport crude oil. It also engages in crude oil marketing activities. The Natural Gas Pipelines & Services segment operates natural gas pipeline systems to gather, treat, and transport natural gas. It leases underground salt dome natural gas storage facilities in Napoleonville, Louisiana; owns an underground salt dome storage cavern in Wharton County, Texas; and markets natural gas. The Petrochemical & Refined Products Services segment operates propylene fractionation and related marketing activities; butane isomerization complex and related deisobutanizer operations; and octane enhancement and high purity isobutylene production facilities. It also operates refined products pipelines and terminals; and ethylene export terminals, as well as provides refined products marketing and marine transportation services. The company was founded in 1968 and is headquartered in Houston, Texas.",
    "ceo": "Mr. A. James Teague",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "7300",
    "phone": "713 381 6500",
    "address": "1100 Louisiana Street",
    "city": "Houston",
    "state": "TX",
    "zip": "77002-5227",
    "dcfDiff": 0.538869,
    "dcf": 25.9911,
    "image": "https://financialmodelingprep.com/image-stock/EPD.png",
    "ipoDate": "1998-07-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]