[
  {
    "symbol": "EQH",
    "price": 26.59,
    "beta": 1.404577,
    "volAvg": 3512993,
    "mktCap": 9468247183,
    "lastDiv": 0.88,
    "range": "21.89-33.245",
    "changes": 0.03,
    "companyName": "Equitable Holdings, Inc.",
    "currency": "USD",
    "cik": "0001333986",
    "isin": "US29452E1010",
    "cusip": "29452E101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Diversified",
    "website": "https://www.equitableholdings.com",
    "description": "Equitable Holdings, Inc., together with its consolidated subsidiaries, operates as a diversified financial services company worldwide. The company operates through four segments: Individual Retirement, Group Retirement, Investment Management and Research, and Protection Solutions. The Individual Retirement segment offers a suite of variable annuity products primarily to affluent and high net worth individuals. The Group Retirement segment provides tax-deferred investment and retirement services or products to plans sponsored by educational entities, municipalities, and not-for-profit entities, as well as small and medium-sized businesses. The Investment Management and Research segment offers diversified investment management, research, and related solutions to various clients through institutional, retail, and private wealth management channels; and distributes its institutional research products and solutions. The Protection Solutions segment provides various variable universal life, indexed universal life, and term life products to help affluent and high net worth individuals, as well as small and medium-sized business owners; and a suite of life, short- and long-term disability, dental, and vision insurance products to small and medium-size businesses. The company was formerly known as AXA Equitable Holdings, Inc. and changed its name to Equitable Holdings, Inc. in January 2020. Equitable Holdings, Inc. was founded in 1859 and is based in New York, New York.",
    "ceo": "Mr. Mark  Pearson",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "12300",
    "phone": "212 554 1234",
    "address": "1290 Avenue Of The Americas",
    "city": "New York",
    "state": "NY",
    "zip": "10104",
    "dcfDiff": 11.8833,
    "dcf": 43.1133,
    "image": "https://financialmodelingprep.com/image-stock/EQH.png",
    "ipoDate": "2018-05-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]