[
  {
    "symbol": "ERFSF",
    "price": 64.074,
    "beta": 0.576628,
    "volAvg": 1437,
    "mktCap": 12347572392,
    "lastDiv": 1.09,
    "range": "54.75-83.53",
    "changes": 0.79,
    "companyName": "Eurofins Scientific SE",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Diagnostics & Research",
    "website": "https://www.eurofins.com",
    "description": "Eurofins Scientific SE, together with its subsidiaries, provides various analytical testing and laboratory services worldwide. The company offers a portfolio of approximately 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability, and purity of various products. It provides services such as agro-science, including biological assessment, consumer and human, and environmental safety, product chemistry, regulatory consultancy, and seed services; agro testing; assurance, such as product inspection, auditing, certification, training and consultation of food, consumer products, and healthcare and cosmetics; biopharma, and clinical diagnostics. In addition, the company offers consumer product testing, which include product compliance and audit, testing, certifications and approvals, inspections, training courses, and digital media and cyber security for various industries; cosmetics and personal care; environment testing, including water, air, soil, waste, and other products testing; and food and feed testing that include allergen, GMO, grain, meat, nano material, pesticides, and residual DNA testing. Further, it offers audit and certification, authenticity, carbohydrates, consulting, dioxins and POPs, food irradiation, labelling, law, heavy metals, identity preservation, mealtime, molecular and microbiology, mycotoxins, nutritional analyses, organic containments, packaging/migration, radioactivity, rapidest, sensorsy and consumer research, trainings, veterinary drug residues, and vitamins services. Additionally, the company provides forensic, genomic, maritime, materials and engineering, REACH, and technologies services. It operates approximately 900 laboratories in 54 countries. The company was founded in 1987 and is headquartered in Luxembourg City, Luxembourg.",
    "ceo": "Dr. Gilles G. Martin Ph.D.",
    "sector": "Healthcare",
    "country": "LU",
    "fullTimeEmployees": "61379",
    "phone": "352 26 18 53 20",
    "address": "23 Val Fleuri",
    "city": "Luxembourg City",
    "state": null,
    "zip": "1526",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ERFSF.png",
    "ipoDate": "2010-04-26",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]