[
  {
    "symbol": "ERJ",
    "price": 15.02,
    "beta": 1.009246,
    "volAvg": 1633541,
    "mktCap": 2758438140,
    "lastDiv": 15.010000000000005,
    "range": "7.91-17.14",
    "changes": 0.47,
    "companyName": "Embraer S.A.",
    "currency": "USD",
    "cik": "0001355444",
    "isin": "US29082A1079",
    "cusip": "29082A107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.embraer.com",
    "description": "Embraer S.A. designs, develops, manufactures, and sells aircrafts and systems in Brazil, North America, Latin America, the Asia Pacific, Brazil, Europe, and internationally. It operates through Commercial Aviation; Defense and Security; Executive Jets; Service & Support; and Other segments. The Commercial Aviation segment designs, develops, and manufactures a variety of commercial aircrafts. The Defense and Security segment engages in the research, development, production, modification, and support for military defense and security aircraft; and offers a range of products and integrated solutions that include radars and special space systems, as well as information and communications systems comprising command, control, communications, computer, intelligence, surveillance, and reconnaissance systems. The Executive Jets segment develops, produces, and sells executive jets. It also leases Legacy 600 and Legacy 650 executive jets in the super midsize and large categories; Legacy 450 and Legacy 500 executive jets in the midlight and midsize categories; Phenom family executive jets in the entry jet and light jet categories; Lineage 1000, an ultra-large executive jet; and Praetor 500 and Praetor 600, disruptive executive jets in the midsize and super midsize categories. The Service & Support segment offers after-service solutions, support, and maintenance, repair, and overhaul services for commercial, executive, and defense aircrafts; provides aircraft components and engines; and supplies steel and composite aviation structures to various aircraft manufacturers. The Other segment is involved in the supply of fuel systems, structural parts, and mechanical and hydraulic systems; and production of agricultural crop-spraying aircraft. The company was formerly known as Embraer-Empresa Brasileira de Aeronáutica S.A. and changed its name to Embraer S.A. in November 2010. Embraer S.A. was incorporated in 1969 and is headquartered in São Paulo, Brazil.",
    "ceo": "Mr. Francisco Gomes Neto",
    "sector": "Industrials",
    "country": "BR",
    "fullTimeEmployees": "18872",
    "phone": "55 11 3040 6874",
    "address": "Eldorado Business Tower",
    "city": "São Paulo",
    "state": "SP",
    "zip": "05425-070",
    "dcfDiff": 7.85915,
    "dcf": 20.6691,
    "image": "https://financialmodelingprep.com/image-stock/ERJ.png",
    "ipoDate": "2000-07-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]