[
  {
    "symbol": "ESAB",
    "price": 65.01,
    "beta": 0,
    "volAvg": 223017,
    "mktCap": 3913250946,
    "lastDiv": 0.24,
    "range": "32.12-66.51",
    "changes": 0.33,
    "companyName": "ESAB Corporation",
    "currency": "USD",
    "cik": "0001877322",
    "isin": "US29605J1060",
    "cusip": "29605J106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Metal Fabrication",
    "website": null,
    "description": "ESAB Corporation formulates, develops, manufactures, and supplies consumable products and equipment for use in cutting, joining, and automated welding, as well as gas control equipment. Its comprehensive range of welding consumables includes electrodes, cored and solid wires, and fluxes using a range of specialty and other materials; and cutting consumables, including electrodes, nozzles, shields, and tips. The company's fabrication technology equipment ranges from portable welding machines to large customized automated cutting and welding systems. It also offers a range of digital software and solutions to help its customers increase their productivity, remotely monitor their welding operations, and digitize their documentation. The company sells its products under the ESAB brand to various end markets, including general industry, construction, infrastructure, transportation, energy, renewable energy, and medical and life sciences. It offers its products through independent distributors and direct salespeople. ESAB Corporation was incorporated in 2021 and is based in Wilmington, Delaware.",
    "ceo": "Mr. Shyam P. Kambeyanda",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "9000",
    "phone": "301-323-9099",
    "address": "909 Rose Avenue",
    "city": "North Bethesda",
    "state": "MD",
    "zip": "20852",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ESAB.png",
    "ipoDate": "2022-03-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]