[
  {
    "symbol": "ESE",
    "price": 104.01,
    "beta": 1.120774,
    "volAvg": 105845,
    "mktCap": 2679099981,
    "lastDiv": 0.32,
    "range": "63.93-104.01",
    "changes": 1.42,
    "companyName": "ESCO Technologies Inc.",
    "currency": "USD",
    "cik": "0000866706",
    "isin": "US2963151046",
    "cusip": "296315104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.escotechnologies.com",
    "description": "ESCO Technologies Inc. produces and supplies engineered products and systems for industrial and commercial markets worldwide. It operates through Aerospace & Defense, Utility Solutions Group, and RF Shielding and Test segments. The Aerospace & Defense segment designs and manufactures filtration products, including hydraulic filter elements and fluid control devices used in commercial aerospace applications; filter mechanisms used in micro-propulsion devices for satellites; and custom designed filters for manned aircraft and submarines. It also designs, develops, and manufactures elastomeric-based signature reduction solutions for U.S. naval vessels; and mission-critical bushings, pins, sleeves, and precision-tolerance machined components for landing gear, rotor heads, engine mounts, flight controls, and actuation systems for the aerospace and defense industries. The Utility Solutions Group segment provides diagnostic testing solutions that enable electric power grid operators to assess the integrity of high-voltage power delivery equipment; and decision support tools for the renewable energy industry, primarily wind and solar. The RF Shielding and Test segment designs and manufactures RF test and secure communication facilities, acoustic test enclosures, RF and magnetically shielded rooms, RF measurement systems, and broadcast and recording studios; and RF absorptive materials and filters, active compensation systems, antennas, antenna masts, turntables, electric and magnetic probes, RF test cells, proprietary measurement software, and other test accessories to perform various tests. It also provides services, such as calibration for antennas and field probes, chamber certification, field surveys, customer training, and various product tests. The company distributes its products through a network of distributors, sales representatives, direct sales teams, and in-house sales personnel. The company was incorporated in 1990 and is based in St. Louis, Missouri.",
    "ceo": "Mr. Bryan H. Sayler",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2894",
    "phone": "314 213 7200",
    "address": "9900A Clayton Road",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63124-1186",
    "dcfDiff": 1.05421,
    "dcf": 95.2842,
    "image": "https://financialmodelingprep.com/image-stock/ESE.png",
    "ipoDate": "1990-10-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]