[
  {
    "symbol": "ESI",
    "price": 18.79,
    "beta": 1.310563,
    "volAvg": 1272151,
    "mktCap": 4536281800,
    "lastDiv": 0.32,
    "range": "15.31-21.9",
    "changes": -0.1,
    "companyName": "Element Solutions Inc",
    "currency": "USD",
    "cik": "0001590714",
    "isin": "US28618M1062",
    "cusip": "28618M106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://elementsolutionsinc.com",
    "description": "Element Solutions Inc operates as a specialty chemicals company in the United States, China, and internationally. The company operates in two segments, Electronics, and Industrial & Specialty. The Electronics segment researches, formulates, and sells specialty chemicals and materials for various types of electronics hardware products. This segment also supplies solder technologies, fluxes, cleaners, and other attachment materials for the electronics assembly industry; proprietary liquid chemical processes to manufacture printed circuit boards; and advanced copper interconnects, die attachment, wafer bump processes, and photomask technologies for integrated circuit fabrication and semiconductor packaging. It primarily serves mobile communications, computers, automobiles, and aerospace equipment industries. The Industrial & Specialty segment provides industrial solutions, which include chemical systems that protect and decorate metal and plastic surfaces; consumable chemicals that enable printing image transfer on flexible packaging materials; and chemistries used in water-based hydraulic control fluids for offshore energy production applications. It serves aerospace, automotive, construction, consumer electronics, consumer packaged goods, and oil and gas production end markets. The company was formerly known as Platform Specialty Products Corporation and changed its name to Element Solutions Inc in January 2019. Element Solutions Inc was founded in 1785 and is headquartered in Fort Lauderdale, Florida.",
    "ceo": "Mr. Benjamin  Gliklich",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "5300",
    "phone": "561 207 9600",
    "address": "500 East Broward Boulevard",
    "city": "Fort Lauderdale",
    "state": "FL",
    "zip": "33394",
    "dcfDiff": 0.0589516,
    "dcf": 20.141,
    "image": "https://financialmodelingprep.com/image-stock/ESI.png",
    "ipoDate": "2013-10-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]