[
  {
    "symbol": "ESLOY",
    "price": 94.97,
    "beta": 0.903065,
    "volAvg": 37316,
    "mktCap": 85692382220,
    "lastDiv": 1.74,
    "range": "66.6-102.69",
    "changes": 1.19,
    "companyName": "EssilorLuxottica Société anonyme",
    "currency": "USD",
    "cik": "0001085922",
    "isin": "US2972842007",
    "cusip": "297284200",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.essilorluxottica.com",
    "description": "EssilorLuxottica Société anonyme designs, manufactures, and distributes ophthalmic lenses, frames, and sunglasses in North America, Europe, Latin America, Asia, Oceania, and Africa. It operates in five segments: Wholesale, Retail, Lenses and Optical Instruments, Equipment, and Sunglasses and Readers. The Wholesale segment engages in the manufacture and wholesale distribution of luxury and sports eyewear. The Retail segment retails luxury and sports eyewear. The Lenses and Optical Instruments segment offers lenses and small equipment, including Varilux progressive lenses; Crizal antireflective, anti-smudge, and antistatic lenses; Transitions photochromic lenses; Eyezen lenses for users of computers, tablets, smartphones, and other connected devices; Xperio polarized sun lenses; and Nikon and Kodak corrective lens brands. It also provides lens edging and mounting instruments for opticians and prescription laboratories; optometry instruments for eye care professionals, schools, occupational medicine centers, military, and other institutions; and Transitions Signature Gen 8 photochromic lens, as well as develops solutions for online sales of optical products. The Equipment segment offers digital surfacing machines and lens coating machines to prescription laboratories, integrated optical chains, and lens manufacturers. The Sunglasses and Readers segment provides non-prescription sunglasses and reading glasses under the Foster Grant, Gargoyles, Magnivision, Corinne McCormack, Monkey Monkey, Ryders Eyewear, and SolarShield brands; Reebok, Steve Madden, Betsey Johnson, Nine West, Dockers, French Connection, Ironman, Rawlings, Bodyglove, Panama Jack, Marvel, and Disney; Bolon, Molsion, Qina, and Prosun brands; and Mujosh and Aojo brands. It has a network of 490 prescription laboratories and edging-mounting facilities. The company was formerly known as Essilor International Société Anonyme and changed its name to EssilorLuxottica Société anonyme in October 2018. EssilorLuxottica Société anonyme was founded in 1849 and is headquartered in Paris, France.",
    "ceo": "Mr. Francesco  Milleri",
    "sector": "Healthcare",
    "country": "FR",
    "fullTimeEmployees": "154029",
    "phone": "33 1 49 77 42 16",
    "address": "1-5 rue Paul CEzanne",
    "city": "Paris",
    "state": null,
    "zip": "75008",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ESLOY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]