[
  {
    "symbol": "ESLT",
    "price": 209.28,
    "beta": -0.076712,
    "volAvg": 24341,
    "mktCap": 9281065728,
    "lastDiv": 2,
    "range": "162.01-244.59",
    "changes": 0.71,
    "companyName": "Elbit Systems Ltd.",
    "currency": "USD",
    "cik": "0001027664",
    "isin": "IL0010811243",
    "cusip": "M3760D101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Aerospace & Defense",
    "website": "https://www.elbitsystems.com",
    "description": "Elbit Systems Ltd. develops and supplies a portfolio of airborne, land, and naval systems and products for the defense, homeland security, and commercial aviation applications primarily in Israel. The company offers military aircraft and helicopter systems; commercial aviation systems and aerostructures; unmanned aircraft systems; electro-optic, night vision, and countermeasures systems; naval systems; land vehicle systems; munitions, such as precision munitions for land, air, and sea applications; command, control, communications, computer, intelligence, surveillance and reconnaissance, and cyber systems; electronic warfare and signal intelligence systems; and other commercial activities. It also manufactures and sells data links and radio communication systems and equipment, and cyber intelligence, autonomous, and homeland security solutions; laser systems and products; guided rocket systems; and armored vehicle and other platforms survivability and protection systems, as well as provides various training and support services. The company markets its systems and products as a prime contractor or subcontractor to various governments and companies. It also has operations in the United States, Europe, Latin America, the Asia-Pacific, and internationally. The company was incorporated in 1966 and is based in Haifa, Israel.",
    "ceo": "Mr. Bezhalel  Machlis",
    "sector": "Industrials",
    "country": "IL",
    "fullTimeEmployees": "18407",
    "phone": "972 77 294 6663",
    "address": "Advanced Technology Center",
    "city": "Haifa",
    "state": null,
    "zip": "3100401",
    "dcfDiff": 30.5976,
    "dcf": 195.608,
    "image": "https://financialmodelingprep.com/image-stock/ESLT.png",
    "ipoDate": "1996-11-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]