[
  {
    "symbol": "ESMT",
    "price": 18.72,
    "beta": 0,
    "volAvg": 509701,
    "mktCap": 3121447680,
    "lastDiv": 0,
    "range": "15.01-22.65",
    "changes": 0.08,
    "companyName": "EngageSmart, Inc.",
    "currency": "USD",
    "cik": "0001863105",
    "isin": "US29283F1030",
    "cusip": "29283F103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.engagesmart.com",
    "description": "EngageSmart, Inc. provides Software-as-a-Service based customer engagement software and integrated payment solutions. It operates through two segments, Enterprise Solutions and SMB (small and medium sized business) Solutions. The company offers SimplePractice, an end-to-end practice management and electronic health record platform for health and wellness professionals to manage their practices; and InvoiceCloud, an electronic bill presentment and payment solution that helps government, utility, and financial services customers to digitize billing, client communications, and collections. It also provides HealthPay24, a patient engagement and payment platform that helps health systems, physician groups, dental practices, and medical billers to drive patient self-pay collections; and DonorDrive, a fundraising software platform that helps non-profits, healthcare organizations, and higher education institutions produce virtual events, launch branded donation campaigns, and create peer-to-peer fundraising experiences. The company was formerly known as EngageSmart, LLC. and changed its name to EngageSmart, Inc. in June 2021. EngageSmart, Inc. was incorporated in 2018 and is headquartered in Braintree, Massachusetts.",
    "ceo": "Mr. Robert Paul Bennett",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "971",
    "phone": "781 848 3733",
    "address": "30 Braintree Hill Office Park",
    "city": "Braintree",
    "state": "MA",
    "zip": "02184",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ESMT.png",
    "ipoDate": "2021-09-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]