[
  {
    "symbol": "ESTC",
    "price": 65.16,
    "beta": 1.048229,
    "volAvg": 1187493,
    "mktCap": 6345990783,
    "lastDiv": 0,
    "range": "46.18-91.3",
    "changes": 1.51,
    "companyName": "Elastic N.V.",
    "currency": "USD",
    "cik": "0001707753",
    "isin": "NL0013056914",
    "cusip": "N14506104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.elastic.co",
    "description": "Elastic N.V., a search company, delivers technology solutions designed to run in public or private clouds in multi-cloud environments. It primarily offers Elastic Stack, a set of software products that ingest and store data from various sources and formats, as well as perform search, analysis, and visualization. The company's Elastic Stack product portfolio comprises Elasticsearch, a distributed, real-time search and analytics engine, and data store for various types of data, including textual, numerical, geospatial, structured, and unstructured; Kibana, a user interface, management, and configuration interface for the Elastic Stack; Beats, a single-purpose data shippers for sending data from edge machines to Elasticsearch or Logstash; Elastic Agent that offers integrated host protection and central management services; and Logstash, a data processing pipeline for ingesting data into Elasticsearch or other storage systems. It also provides software solutions on the Elastic Stack that address cases, including app search, workplace search, logging, metrics, application performance management, and synthetic monitoring. The company's platform solutions provide new capabilities that helps users to combine the benefits of the Elastic Stack. The company was incorporated in 2012 and is headquartered in Mountain View, California.",
    "ceo": "Mr. Ashutosh  Kulkarni",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2886",
    "phone": "650 458 2620",
    "address": "800 West El Camino Real",
    "city": "Mountain View",
    "state": "CA",
    "zip": "94040",
    "dcfDiff": 2.62612,
    "dcf": 61.9761,
    "image": "https://financialmodelingprep.com/image-stock/ESTC.png",
    "ipoDate": "2018-10-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]