[
  {
    "symbol": "ET",
    "price": 12.74,
    "beta": 1.712676,
    "volAvg": 9335348,
    "mktCap": 40019525612,
    "lastDiv": 1.23,
    "range": "9.15-13.67",
    "changes": 0.1,
    "companyName": "Energy Transfer LP",
    "currency": "USD",
    "cik": "0001276187",
    "isin": "US29273V1008",
    "cusip": "29273V100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://energytransfer.com",
    "description": "Energy Transfer LP provides energy-related services. The company owns and operates approximately 11,600 miles of natural gas transportation pipeline, and three natural gas storage facilities in Texas and two natural gas storage facilities located in the state of Texas and Oklahoma; and 19,830 miles of interstate natural gas pipeline. It also sells natural gas to electric utilities, independent power plants, local distribution and other marketing companies, and industrial end-users. The company owns and operates natural gas gathering and natural gas liquid (NGL) pipeline, processing plant, and treating and conditioning facilities in Texas, New Mexico, West Virginia, Pennsylvania, Ohio, Oklahoma, Arkansas, Kansas, and Louisiana; natural gas gathering, oil pipeline, and oil stabilization facilities in South Texas; and a natural gas gathering system in Ohio, as well as transport and supplies water to natural gas producer in Pennsylvania. It owns approximately 5,215 miles of NGL pipeline; NGL and propane fractionation facilities; NGL storage facilities with working storage capacity of approximately 50 million barrels (MMBbls); and other NGL storage assets and terminal with an aggregate storage capacity of approximately 17 MMBbls. The company provides crude oil transportation, terminalling, acquisition, and marketing activities; and sells and distributes gasoline, middle distillate, and motor fuels and other petroleum product. It offers natural gas compression service; carbon dioxide and hydrogen sulfide removal, natural gas cooling, dehydration, and British thermal unit management service; and manages coal and natural resources properties, as well as sells standing timber, leases coal-related infrastructure facilities, collects oil and gas royalty, and generate electrical power. The company was formerly known as Energy Transfer Equity, L.P. and changed its name to Energy Transfer LP in October 2018. The company was founded in 1996 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Marshall S. McCrea III",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "12565",
    "phone": "214 981 0700",
    "address": "8111 Westchester Drive",
    "city": "Dallas",
    "state": "TX",
    "zip": "75225",
    "dcfDiff": 1.07735,
    "dcf": 12.2826,
    "image": "https://financialmodelingprep.com/image-stock/ET.png",
    "ipoDate": "2006-02-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]