[
  {
    "symbol": "ETR",
    "price": 95.77,
    "beta": 0.651056,
    "volAvg": 1243129,
    "mktCap": 20250279956,
    "lastDiv": 4.28,
    "range": "94.16-122.46",
    "changes": -3.03,
    "companyName": "Entergy Corporation",
    "currency": "USD",
    "cik": "0000065984",
    "isin": "US29364G1031",
    "cusip": "29364G103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.entergy.com",
    "description": "Entergy Corporation, together with its subsidiaries, engages in the production and retail distribution of electricity in the United States. The company operates in two segments, Utility and Entergy Wholesale Commodities. The Utility segment generates, transmits, distributes, and sells electric power in portions of Arkansas, Louisiana, Mississippi, and Texas, including the City of New Orleans; and distributes natural gas. The Entergy Wholesale Commodities segment engages in the ownership, operation, and decommissioning of nuclear power plants; and ownership of interests in non-nuclear power plants that sell electric power to wholesale customers, as well as provides services to other nuclear power plant owners. It generates electricity through gas, nuclear, coal, hydro, and solar power sources. The company sells energy to retail power providers, utilities, electric power co-operatives, power trading organizations, and other power generation companies. The company's power plants have approximately 26,000 megawatts (MW) of electric generating capacity, which include 6,000 MW of nuclear power. It delivers electricity to 3 million utility customers in Arkansas, Louisiana, Mississippi, and Texas. The company was founded in 1913 and is headquartered in New Orleans, Louisiana.",
    "ceo": "Mr. Andrew S. Marsh",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "12000",
    "phone": "504 576 4000",
    "address": "639 Loyola Avenue",
    "city": "New Orleans",
    "state": "LA",
    "zip": "70113",
    "dcfDiff": 6.53085,
    "dcf": 115.241,
    "image": "https://financialmodelingprep.com/image-stock/ETR.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]