[
  {
    "symbol": "ETRN",
    "price": 9.38,
    "beta": 1.946374,
    "volAvg": 8004167,
    "mktCap": 4063256615,
    "lastDiv": 0.6,
    "range": "4.6-9.9",
    "changes": 0.11,
    "companyName": "Equitrans Midstream Corporation",
    "currency": "USD",
    "cik": "0001747009",
    "isin": "US2946001011",
    "cusip": "294600101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.equitransmidstream.com",
    "description": "Equitrans Midstream Corporation owns, operates, acquires, and develops natural gas gathering, transmission and storage, and water services assets in the Appalachian Basin. It operates through three segments: Gathering System, Transmission and Storage System, and Water Service System. The Gathering System segment include 1,130 miles of high-pressure gathering lines with compression of approximately 485,000 horsepower and multiple interconnect points; and approximately 910 miles of Federal Energy Regulatory Commission (FERC) low-pressure gathering lines. The Transmission and Storage System segment comprises 950 miles of FERC regulated interstate pipeline that connects to seven interstate pipelines and local distribution companies. The Water Service System segment include two independent systems comprised approximately 200 miles of pipeline that deliver fresh water from the Monongahela River, the Ohio River, local reservoirs, and various regional waterways. Equitrans Midstream Corporation was incorporated in 2018 and is headquartered in Canonsburg, Pennsylvania.",
    "ceo": "Mr. Thomas F. Karam",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "766",
    "phone": "724 271 7600",
    "address": "2200 Energy Drive",
    "city": "Canonsburg",
    "state": "PA",
    "zip": "15317",
    "dcfDiff": 0.861485,
    "dcf": 8.09149,
    "image": "https://financialmodelingprep.com/image-stock/ETRN.png",
    "ipoDate": "2018-10-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]