[
  {
    "symbol": "ETSY",
    "price": 87.45,
    "beta": 1.991197,
    "volAvg": 3354212,
    "mktCap": 10787132400,
    "lastDiv": 0,
    "range": "70.46-149.91",
    "changes": -0.04,
    "companyName": "Etsy, Inc.",
    "currency": "USD",
    "cik": "0001370637",
    "isin": "US29786A1060",
    "cusip": "29786A106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Retail",
    "website": "https://www.etsy.com",
    "description": "Etsy, Inc. operates two-sided online marketplaces that connect buyers and sellers primarily in the United States, the United Kingdom, Germany, Canada, Australia, France, and India. Its primary marketplace is Etsy.com that connects artisans and entrepreneurs with various consumers. The company also offers Reverb, a musical instrument marketplace; Depop, a fashion resale marketplace; and Elo7, a Brazil-based marketplace for handmade and unique items. In addition, it offers various seller services, including Etsy Payments, a payment processing service; Etsy Ads, an advertising platform; and Shipping Labels, which allows sellers in the United States, Canada, the United Kingdom, Australia, and India to purchase discounted shipping labels. Further, the company provides various seller tools, including Shop Manager dashboard, a centralized hub for Etsy sellers to track orders, manage inventory, view metrics and statistics, and have conversations with their customers; and Sell on Etsy, an application to enable enhanced onboarding and video uploading. Additionally, it offers Etsy seller analytics pages that provides insights regarding traffic acquisition for their shops; Targeted Offers, a sales and promotions tool, and social media tool; and accounting and bookkeeping services. The company also provides educational resources comprising blog posts, video tutorials, Etsy Seller Handbook, Etsy.com online forums, and insights; Etsy Teams, a platform to build personal relationships with other Etsy sellers; and a Star Seller program. As of December 31, 2021, it connected a total of 7.5 million active sellers to 96.3 million active buyers; and had 120 million items for sale. The company was formerly known as Indieco, Inc changed its name to Etsy, Inc. in June 2006. Etsy, Inc. was founded in 2005 and is headquartered in Brooklyn, New York.",
    "ceo": "Mr. Joshua G. Silverman",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "2790",
    "phone": "718 880 3660",
    "address": "117 Adams Street",
    "city": "Brooklyn",
    "state": "NY",
    "zip": "11201",
    "dcfDiff": 17.5411,
    "dcf": 120.259,
    "image": "https://financialmodelingprep.com/image-stock/ETSY.png",
    "ipoDate": "2015-04-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]