[
  {
    "symbol": "EVCM",
    "price": 11.67,
    "beta": 0,
    "volAvg": 225858,
    "mktCap": 2193201543,
    "lastDiv": 0,
    "range": "5.87-13.47",
    "changes": 0.05,
    "companyName": "EverCommerce Inc.",
    "currency": "USD",
    "cik": "0001853145",
    "isin": "US29977X1054",
    "cusip": "29977X105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.evercommerce.com",
    "description": "EverCommerce Inc., together with its subsidiaries, engages in providing integrated software-as-a-service solutions for service-based small and medium sized businesses in the United States and internationally. The company's solutions include business management software, including route-based dispatching, medical practice management, and gym member management solutions; billing and payment solutions that comprise e-invoicing, mobile payments, and integrated payment processing; customer engagement applications, which include reputation management and messaging solutions; and marketing technology solutions that cover websites, hosting, and digital lead generation. It also provides EverPro suite of solutions in home services; EverHealth suite of solutions within health services; and EverWell suite of solutions in fitness and wellness services. In addition, the company offers professional services, including implementation, configuration, installation, or training services. It serves home service professionals, such as home improvement contractors and home maintenance technicians; physician practices and therapists in the health services industry; and personal trainers and salon owners in the fitness and wellness sectors. The company was formerly known as PaySimple Holdings, Inc. and changed its name to EverCommerce Inc. in December 2020. The company was incorporated in 2016 and is headquartered in Denver, Colorado.",
    "ceo": "Mr. Eric  Remer",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2300",
    "phone": "720 647 4948",
    "address": "3601 Walnut Street",
    "city": "Denver",
    "state": "CO",
    "zip": "80205",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/EVCM.png",
    "ipoDate": "2021-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]