[
  {
    "symbol": "EVH",
    "price": 30.7,
    "beta": 1.540845,
    "volAvg": 1189353,
    "mktCap": 3458907600,
    "lastDiv": 0,
    "range": "21.832-39.779",
    "changes": 1.22,
    "companyName": "Evolent Health, Inc.",
    "currency": "USD",
    "cik": "0001628908",
    "isin": "US30050B1017",
    "cusip": "30050B101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Health Information Services",
    "website": "https://www.evolenthealth.com",
    "description": "Evolent Health, Inc., a healthcare company, through its subsidiary, Evolent Health LLC, provides clinical and administrative solutions to payers and providers in the United States. It operates in two segments, Evolent Health Services and Clinical Solutions. The Evolent Health Services segment provides an integrated administrative and clinical platform for health plan administration and population health management. It offers financial and administrative management services, such as health plan services, risk management, analytics and reporting, and leadership and management; and Identifi, a proprietary technology system that aggregates and analyzes data, manages care workflows, and engages patients, population health performance that delivers patient-centric cost-effective care. The Clinical Solutions segment offers specialty care management services support a range of specialty care delivery stakeholders during their transition from fee-for-service to value-based care, independent of their stage of maturation and specific market dynamics in oncology and cardiology; and holistic total cost of care improvement. The company was founded in 2011 and is headquartered in Arlington, Virginia.",
    "ceo": "Mr. Seth Barrie Blackley",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "5100",
    "phone": "571 389 6000",
    "address": "800 North Glebe Road",
    "city": "Arlington",
    "state": "VA",
    "zip": "22203",
    "dcfDiff": 1.38613,
    "dcf": 29.8839,
    "image": "https://financialmodelingprep.com/image-stock/EVH.png",
    "ipoDate": "2015-06-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]