[
  {
    "symbol": "EVR",
    "price": 121.94,
    "beta": 1.502464,
    "volAvg": 405500,
    "mktCap": 4676057568,
    "lastDiv": 3.04,
    "range": "78.67-137.42",
    "changes": 1.97,
    "companyName": "Evercore Inc.",
    "currency": "USD",
    "cik": "0001360901",
    "isin": "US29977A1051",
    "cusip": "29977A105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.evercore.com",
    "description": "Evercore Inc., together with its subsidiaries, operates as an independent investment banking advisory firm in the United States, Europe, Latin America, and internationally. It operates through two segments, Investment Banking and Investment Management. The Investment Banking segment offers strategic advisory services, such as mergers and acquisitions, strategic, defense, and shareholder advisory, special committee assignments, and transaction structuring; Capital Markets Advisory, including equity capital markets, restructuring, debt advisory, private placement advisory, market risk management and hedging, private capital advisory, and private funds; and research, sales, and trading professionals services on a content-led platform to its institutional investor clients. The Investment Management segment provides wealth management services to high-net-worth individuals, foundations, and endowments; and manages financial assets for institutional investors. The company was formerly known as Evercore Partners Inc. and changed its name to Evercore Inc. in August 2017. Evercore Inc. was founded in 1995 and is headquartered in New York, New York.",
    "ceo": "Mr. John S. Weinberg",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2135",
    "phone": "212 857 3100",
    "address": "55 East 52nd Street",
    "city": "New York",
    "state": "NY",
    "zip": "10055",
    "dcfDiff": 1.76682,
    "dcf": 125.993,
    "image": "https://financialmodelingprep.com/image-stock/EVR.png",
    "ipoDate": "2006-08-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]