[
  {
    "symbol": "EWBC",
    "price": 51.57,
    "beta": 1.391901,
    "volAvg": 1501535,
    "mktCap": 7295092200,
    "lastDiv": 1.92,
    "range": "33.86-80.98",
    "changes": -0.07,
    "companyName": "East West Bancorp, Inc.",
    "currency": "USD",
    "cik": "0001069157",
    "isin": "US27579R1041",
    "cusip": "27579R104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Diversified",
    "website": "https://www.eastwestbank.com",
    "description": "East West Bancorp, Inc. operates as the bank holding company for East West Bank that provides a range of personal and commercial banking services to businesses and individuals. It operates through three segments: Consumer and Business Banking, Commercial Banking, and Other. The company accepts various deposit products, such as personal and business checking and savings accounts, money market, and time deposits. Its loan products include mortgage and home equity, commercial and residential real estate, working capital lines of credit, construction, trade finance, letters of credit, commercial business, affordable housing loans, asset-based lending, asset-backed finance, project finance, and equipment financing, as well as financing services to clients needing a financial bridge to facilitate their business transactions between the United States and China. The company also provides various wealth management, treasury management, foreign exchange, and interest rate and commodity risk hedging services; and mobile and online banking services. As of January 27, 2022, it operated approximately 120 locations in the United States and China; full-service branches in Hong Kong, Shanghai, Shantou, and Shenzhen; and representative offices in Beijing, Chongqing, Guangzhou, Taipei, and Xiamen. East West Bancorp, Inc. was incorporated in 1998 and is headquartered in Pasadena, California.",
    "ceo": "Mr. Dominic  Ng",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3200",
    "phone": "626 768 6000",
    "address": "135 North Los Robles Avenue",
    "city": "Pasadena",
    "state": "CA",
    "zip": "91101",
    "dcfDiff": 24.9033,
    "dcf": 100.843,
    "image": "https://financialmodelingprep.com/image-stock/EWBC.png",
    "ipoDate": "1999-02-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]