[
  {
    "symbol": "EXAS",
    "price": 94.455,
    "beta": 1.391197,
    "volAvg": 1889453,
    "mktCap": 17046766881,
    "lastDiv": 0,
    "range": "29.27-99.01",
    "changes": -0.045,
    "companyName": "Exact Sciences Corporation",
    "currency": "USD",
    "cik": "0001124140",
    "isin": "US30063P1057",
    "cusip": "30063P105",
    "exchange": "NASDAQ Capital Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Diagnostics & Research",
    "website": "https://www.exactsciences.com",
    "description": "Exact Sciences Corporation provides cancer screening and diagnostic test products in the United States and internationally. The company offers Cologuard, a non-invasive stool-based DNA screening test to detect DNA and hemoglobin biomarkers associated with colorectal cancer and pre-cancer. It also provides Oncotype DX, a gene expression tests for breast, prostate, and colon cancers; Oncotype Test, a tissue test delivering tumor profiling to aid therapy selection for patients with advanced, metastatic, refractory, or recurrent cancer; Oncotype DX AR-V7 Nucleus Detect Test, a liquid-based test for advanced stage prostate cancer; Oncomap ExTra, that provides a complete biological picture of certain refractory, rare, or aggressive cancers; and Covid-19 testing services. The company's pipeline products focus on enhancing the Cologuard test's performance characteristics and developing blood and other fluid-based tests. It has license agreements with MAYO Foundation for Medical Education and Research; and Hologic, Inc. Exact Sciences Corporation was incorporated in 1995 and is headquartered in Madison, Wisconsin.",
    "ceo": "Mr. Kevin T. Conroy",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "6300",
    "phone": "608 284 5700",
    "address": "5505 Endeavor Lane",
    "city": "Madison",
    "state": "WI",
    "zip": "53719",
    "dcfDiff": 23.3089,
    "dcf": 44.1711,
    "image": "https://financialmodelingprep.com/image-stock/EXAS.png",
    "ipoDate": "2001-02-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]