[
  {
    "symbol": "EXC",
    "price": 40.09,
    "beta": 0.610915,
    "volAvg": 6422917,
    "mktCap": 39872272172,
    "lastDiv": 1.44,
    "range": "35.19-47.23",
    "changes": -0.73,
    "companyName": "Exelon Corporation",
    "currency": "USD",
    "cik": "0001109357",
    "isin": "US30161N1019",
    "cusip": "30161N101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.exeloncorp.com",
    "description": "Exelon Corporation, a utility services holding company, engages in the energy generation, delivery, and marketing businesses in the United States and Canada. It owns nuclear, fossil, wind, hydroelectric, biomass, and solar generating facilities. The company also sells electricity to wholesale and retail customers; and sells natural gas, renewable energy, and other energy-related products and services. Additionally, it is involved in the purchase and regulated retail sale of electricity and natural gas; and transmission and distribution of electricity, and distribution of natural gas to retail customers. Further, the company offers support services, including legal, human resources, information technology, financial, supply management, accounting, engineering, customer operations, distribution and transmission planning, asset management, system operations, and power procurement services. It serves distribution utilities, municipalities, cooperatives, and financial institutions, as well as commercial, industrial, governmental, and residential customers. Exelon Corporation was incorporated in 1999 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Calvin G. Butler Jr.",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "19063",
    "phone": "800 483 3220",
    "address": "10 South Dearborn Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60680-5379",
    "dcfDiff": 1.78388,
    "dcf": 39.9061,
    "image": "https://financialmodelingprep.com/image-stock/EXC.png",
    "ipoDate": "1973-05-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]