[
  {
    "symbol": "EXEL",
    "price": 18.99,
    "beta": 0.67676,
    "volAvg": 2697679,
    "mktCap": 6183846478,
    "lastDiv": 0,
    "range": "14.87-22.47",
    "changes": -0.14,
    "companyName": "Exelixis, Inc.",
    "currency": "USD",
    "cik": "0000939767",
    "isin": "US30161Q1040",
    "cusip": "30161Q104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.exelixis.com",
    "description": "Exelixis, Inc., an oncology-focused biotechnology company, focuses on the discovery, development, and commercialization of new medicines to treat cancers in the United States. The company's products include CABOMETYX tablets for the treatment of patients with advanced renal cell carcinoma who received prior anti-angiogenic therapy; and COMETRIQ capsules for the treatment of patients with progressive and metastatic medullary thyroid cancer. Its CABOMETYX and COMETRIQ are derived from cabozantinib, an inhibitor of multiple tyrosine kinases, including MET, AXL, RET, and VEGF receptors. The company also offers COTELLIC, an inhibitor of MEK as a combination regimen to treat advanced melanoma; and MINNEBRO, an oral non-steroidal selective blocker of the mineralocorticoid receptor for the treatment of hypertension in Japan. In addition, it is developing XL092, an oral tyrosine kinase inhibitor that targets VEGF receptors, MET, AXL, MER, and other kinases implicated in growth and spread of cancer; XB002, an antibody-drug conjugate composed of human mAb against tissue factor (TF) for the treatment of advanced solid tumors; XL102, an orally bioavailable cyclin-dependent kinase 7 (CDK7) inhibitor for the treatment of advanced or metastatic solid tumors; and XB002 for the treatment of non-hodgkin's lymphoma. Exelixis, Inc. has research collaborations and license agreements with Ipsen Pharma SAS; Takeda Pharmaceutical Company Ltd.; F. Hoffmann-La Roche Ltd.; Redwood Bioscience, Inc.; R.P. Scherer Technologies, LLC; Catalent Pharma Solutions, Inc.; NBE Therapeutics AG; Aurigene Discovery Technologies Limited; Iconic Therapeutics, Inc.; Invenra, Inc.; StemSynergy Therapeutics, Inc.; Genentech, Inc.; Bristol-Myers Squibb Company; and Daiichi Sankyo Company, Limited. The company was formerly known as Exelixis Pharmaceuticals, Inc. and changed its name to Exelixis, Inc. in February 2000. Exelixis, Inc. was incorporated in 1994 and is headquartered in Alameda, California.",
    "ceo": "Dr. Michael M. Morrissey Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "1223",
    "phone": "650 837 7000",
    "address": "1851 Harbor Bay Parkway",
    "city": "Alameda",
    "state": "CA",
    "zip": "94502",
    "dcfDiff": 1.3597,
    "dcf": 18.8297,
    "image": "https://financialmodelingprep.com/image-stock/EXEL.png",
    "ipoDate": "2000-04-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]