[
  {
    "symbol": "EXLS",
    "price": 148.9,
    "beta": 1.017253,
    "volAvg": 258024,
    "mktCap": 4950433630,
    "lastDiv": 0,
    "range": "138.83-191.18",
    "changes": -0.88,
    "companyName": "ExlService Holdings, Inc.",
    "currency": "USD",
    "cik": "0001297989",
    "isin": "US3020811044",
    "cusip": "302081104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Information Technology Services",
    "website": "https://www.exlservice.com",
    "description": "ExlService Holdings, Inc. operates as a data analytics, and digital operations and solutions company in the United States and internationally. It operates through Insurance, Healthcare, Analytics, and Emerging Business segments. The company provides digital operations and solutions and analytics-driven services across the insurance industry in areas, such as claims processing, premium and benefit administration, agency management, account reconciliation, policy research, underwriting support, new business acquisition, policy servicing, premium audit, surveys, billing and collection, commercial and residential survey, and customer service using digital technology, artificial intelligence, machine learning, and advanced automation; digital customer acquisition services using a software-as-a-service delivery model through LifePRO and LISS platforms; subrogation services; and Subrosource software platform, an end-to-end subrogation platform. It also offers CareRadius, an integrated care management offering; and health care services related to care management, utilization management, disease management, payment integrity, revenue optimization and customer engagement to healthcare payers, providers, pharmacy benefit managers, and life sciences organizations. Further, it offers predictive and prescriptive analytics in the areas of customer acquisition and lifecycle management, risk underwriting and pricing, operational effectiveness, credit and operational risk monitoring and governance, payment integrity and care management, and data management. The company was founded in 1999 and is headquartered in New York, New York.",
    "ceo": "Mr. Rohit  Kapoor",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "45400",
    "phone": "212 277 7100",
    "address": "320 Park Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10022",
    "dcfDiff": 18.765,
    "dcf": 188.775,
    "image": "https://financialmodelingprep.com/image-stock/EXLS.png",
    "ipoDate": "2006-10-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]