[
  {
    "symbol": "EXP",
    "price": 181.96,
    "beta": 1.304577,
    "volAvg": 334050,
    "mktCap": 6438727384,
    "lastDiv": 1,
    "range": "101.98-182.01",
    "changes": 1.93,
    "companyName": "Eagle Materials Inc.",
    "currency": "USD",
    "cik": "0000918646",
    "isin": "US26969P1084",
    "cusip": "26969P108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Materials",
    "website": "https://www.eaglematerials.com",
    "description": "Eagle Materials Inc., through its subsidiaries, produces and supplies heavy construction materials and light building materials in the United States. It operates through Cement, Concrete and Aggregates, Gypsum Wallboard, and Recycled Paperboard segments. The company engages in the mining of limestone for the manufacture, production, distribution, and sale of Portland cement; grinding and sale of slag; and mining of gypsum for the manufacture and sale of gypsum wallboards used to finish the interior walls and ceilings in residential, commercial, and industrial structures. It also manufactures and sells recycled paperboard to gypsum wallboard industry and other paperboard converters, as well as containerboard and lightweight packaging grades. In addition, the company engages in the sale of ready-mix concrete; and mining, extracting, production, and sale of aggregates, including crushed stones, sand, and gravel. Its products are used in commercial and residential construction; public construction projects; and projects to build, expand, and repair roads and highways. The company was formerly known as Centex Construction Products, Inc. and changed its name to Eagle Materials, Inc. in January 2004. Eagle Materials Inc. was founded in 1963 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Michael R. Haack",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "2400",
    "phone": "214 432 2000",
    "address": "5960 Berkshire Lane",
    "city": "Dallas",
    "state": "TX",
    "zip": "75225",
    "dcfDiff": 9.42761,
    "dcf": 131.682,
    "image": "https://financialmodelingprep.com/image-stock/EXP.png",
    "ipoDate": "1994-04-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]