[
  {
    "symbol": "EXPD",
    "price": 118.98,
    "beta": 0.98345,
    "volAvg": 1256595,
    "mktCap": 18179192160,
    "lastDiv": 1.38,
    "range": "86.08-120.44",
    "changes": 0.6,
    "companyName": "Expeditors International of Washington, Inc.",
    "currency": "USD",
    "cik": "0000746515",
    "isin": "US3021301094",
    "cusip": "302130109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Integrated Freight & Logistics",
    "website": "https://www.expeditors.com",
    "description": "Expeditors International of Washington, Inc. provides logistics services in the Americas, North Asia, South Asia, Europe, the Middle East, Africa, and India. The company offers airfreight services, such as air freight consolidation and forwarding; ocean freight and ocean services, including ocean freight consolidation, direct ocean forwarding, and order management; customs brokerage, intra-continental ground transportation and delivery, and warehousing and distribution services; and customs clearance, purchase order management, vendor consolidation, time-definite transportation services, temperature-controlled transit, cargo insurance, specialized cargo monitoring and tracking, and other supply chain solutions. It also provides optimization, trade compliance, consulting, cargo security, and solutions. In addition, it acts as a freight consolidator or as an agent for the airline, which carries the shipment. Further, the company provides ancillary services that include preparation of shipping and customs documentation, packing, crating, insurance services, negotiation of letters of credit, and the preparation of documentation to comply with local export laws. Its customers include retailing and wholesaling, electronics, technology, and industrial and manufacturing companies. Expeditors International of Washington, Inc. was incorporated in 1979 and is headquartered in Seattle, Washington.",
    "ceo": "Mr. Jeffrey S. Musser",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "19900",
    "phone": "206 674 3400",
    "address": "1015 Third Avenue",
    "city": "Seattle",
    "state": "WA",
    "zip": "98104",
    "dcfDiff": 15.9246,
    "dcf": 123.645,
    "image": "https://financialmodelingprep.com/image-stock/EXPD.png",
    "ipoDate": "1984-09-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]