[
  {
    "symbol": "EXPE",
    "price": 108.33,
    "beta": 1.603169,
    "volAvg": 2587185,
    "mktCap": 16046380058,
    "lastDiv": 24.325000000000003,
    "range": "82.39-124.95",
    "changes": 0.24,
    "companyName": "Expedia Group, Inc.",
    "currency": "USD",
    "cik": "0001324424",
    "isin": "US30212P3038",
    "cusip": "30212P303",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Travel Services",
    "website": "https://www.expediagroup.com",
    "description": "Expedia Group, Inc. operates as an online travel company in the United States and internationally. The company operates through Retail, B2B, and trivago segments. Its brand portfolio include Brand Expedia, a full-service online travel brand with localized websites; Hotels.com for marketing and distributing lodging accommodations; Vrbo, an online marketplace for the alternative accommodations; Orbitz, Travelocity, and CheapTickets travel websites; ebookers, an online EMEA travel agent for travelers an array of travel options; Hotwire, which offers travel booking services; CarRentals.com, an online car rental booking service; Classic Vacations, a luxury travel specialist; and Expedia Cruise, a provider of advice for travelers booking cruises. The company's brand portfolio also comprise Expedia Partner Solutions, a business-to-business brand that provides travel and non-travel vertical, which includes corporate travel management, airlines, travel agents, online retailers and financial institutions; and Egencia that provides corporate travel management services. In addition, its brand portfolio consists of Trivago, a hotel metasearch website, which send referrals to online travel companies and travel service providers from hotel metasearch websites; and Expedia Group Media solutions. Further, the company provides online travel services through its Wotif.com, lastminute.com.au, travel.com.au, Wotif.co.nz, and lastminute.co.nz brands; loyalty programs; hotel accommodations and alternative accommodations; and advertising and media services. It serves leisure and corporate travelers. The company was formerly known as Expedia, Inc. and changed its name to Expedia Group, Inc. in March 2018. Expedia Group, Inc. was founded in 1996 and is headquartered in Seattle, Washington.",
    "ceo": "Mr. Peter Maxwell Kern",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "16500",
    "phone": "206 481 7200",
    "address": "1111 Expedia Group Way West",
    "city": "Seattle",
    "state": "WA",
    "zip": "98119",
    "dcfDiff": 6.51009,
    "dcf": 122.69,
    "image": "https://financialmodelingprep.com/image-stock/EXPE.png",
    "ipoDate": "2005-07-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]