[
  {
    "symbol": "EXPGY",
    "price": 37.79,
    "beta": 0.515325,
    "volAvg": 67940,
    "mktCap": 34734829055,
    "lastDiv": 0.55,
    "range": "28.03-38.71",
    "changes": 0.45,
    "companyName": "Experian plc",
    "currency": "USD",
    "cik": "0001376891",
    "isin": "US30215C1018",
    "cusip": "30215C101",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Consulting Services",
    "website": "https://www.experianplc.com",
    "description": "Experian plc, together with its subsidiaries, operates as a technology company. The company operates through two segments, Business-to-Business and Consumer Services. It provides data services to identify and understand the customers, as well as to manage the risks related with lending. The company also offers analytical and decision tools that enhance businesses to manage their customers, minimize the risk of fraud, comply with legal requirements, and automate decisions and processes. In addition, it provides financial education, free access to Experian credit reports and scores, online educational tools, and applications to manage their financial position, access credit offers, and protect themselves from identity fraud. The company serves customers in financial service, direct-to-consumer, health, retail, automotive, software and professional services, telecommunications and utility, insurance, media and technology, government and public, and other sectors. It operates in North America, Latin America, the United Kingdom, Ireland, Europe, the Middle East, Africa, and the Asia Pacific. The company was formerly known as Experian Group Limited and changed its name to Experian plc in July 2008. Experian plc was founded in 1826 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Brian J. Cassin",
    "sector": "Industrials",
    "country": "IE",
    "fullTimeEmployees": "22000",
    "phone": "353 1 846 9100",
    "address": "Newenham House",
    "city": "Dublin",
    "state": null,
    "zip": "17",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/EXPGY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]