[
  {
    "symbol": "EXPI",
    "price": 20.47,
    "beta": 2.704577,
    "volAvg": 1242935,
    "mktCap": 3140957740,
    "lastDiv": 0.18,
    "range": "9.96-21.61",
    "changes": 1,
    "companyName": "eXp World Holdings, Inc.",
    "currency": "USD",
    "cik": "0001495932",
    "isin": "US30212W1009",
    "cusip": "30212W100",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Real Estate Services",
    "website": "https://expworldholdings.com",
    "description": "eXp World Holdings, Inc., together with its subsidiaries, provides cloud-based real estate brokerage services for residential homeowners and homebuyers. The company facilitates buyers to search real-time property listings and sellers to list their properties through its various platforms; and offers buyers and sellers with access to a network of professionals, consumer-centric agents, and brokers. It is also involved in building 3D virtual worlds for work, education, and events; and focused on agent website and consumer real estate portal technology. In addition, the company operates SUCCESS print magazine, SUCCESS.com portal, SUCCESS newsletters, podcasts, digital training courses, and affiliated social media accounts across platforms. Further, it provides marketing, training, and other support services to its brokers and agents through proprietary technology enabled services, as well as technology and support services contracted to third parties. eXp World Holdings, Inc. operates in the United States, Canada, the United Kingdom, Australia, South Africa, India, Portugal, France, Mexico, Puerto Rico, Brazil, Italy, Hong Kong, Colombia, Spain, Israel, Panama, and Germany. The company was formerly known as eXp Realty International Corporation and changed its name to eXp World Holdings, Inc. in May 2016. eXp World Holdings, Inc. was incorporated in 2008 and is based in Bellingham, Washington.",
    "ceo": "Mr. Glenn Darrel Sanford",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "2016",
    "phone": "360 685 4206",
    "address": "2219 Rimland Drive",
    "city": "Bellingham",
    "state": "WA",
    "zip": "98226",
    "dcfDiff": 4.7258,
    "dcf": 12.1242,
    "image": "https://financialmodelingprep.com/image-stock/EXPI.png",
    "ipoDate": "2018-02-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]