[
  {
    "symbol": "EXPO",
    "price": 92.07,
    "beta": 0.634859,
    "volAvg": 261411,
    "mktCap": 4680387657,
    "lastDiv": 1.04,
    "range": "85.27-112.75",
    "changes": -1.66,
    "companyName": "Exponent, Inc.",
    "currency": "USD",
    "cik": "0000851520",
    "isin": "US30214U1025",
    "cusip": "30214U102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Consulting Services",
    "website": "https://www.exponent.com",
    "description": "Exponent, Inc., together with its subsidiaries, operates as a science and engineering consulting company worldwide. It operates in two segments, Engineering and Other Scientific, and Environmental and Health. The Engineering and Other Scientific segment provides services in the areas of biomechanics, biomedical engineering and sciences, buildings and structures, civil engineering, construction consulting, data sciences, electrical engineering and computer science, human factors, materials and corrosion engineering, mechanical engineering, polymer science and materials chemistry, thermal sciences, and vehicle engineering. The Environmental and Health segment offers services in the areas of chemical regulation and food safety, ecological and biological sciences, environmental and earth sciences, and health sciences. The company offers approximately 90 technical disciplines to solve pressing and complicated challenges facing stakeholders. It serves clients in chemical, construction, consumer products, energy, food, beverage and nutrition, government, life sciences, insurance, manufacturing, technology, industrial equipment, transportation, and other sectors of the economy. The company was formerly known as The Failure Group, Inc. and changed its name to Exponent, Inc. in 1998. Exponent, Inc. was founded in 1967 and is headquartered in Menlo Park, California.",
    "ceo": "Dr. Catherine Ford Corrigan P.E., Ph.D.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "1052",
    "phone": "650 326 9400",
    "address": "149 Commonwealth Drive",
    "city": "Menlo Park",
    "state": "CA",
    "zip": "94025",
    "dcfDiff": 6.00895,
    "dcf": 107.169,
    "image": "https://financialmodelingprep.com/image-stock/EXPO.png",
    "ipoDate": "1990-08-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]