[
  {
    "symbol": "EXTR",
    "price": 24.23,
    "beta": 1.975,
    "volAvg": 1812037,
    "mktCap": 3125597310,
    "lastDiv": 0,
    "range": "8.58-25.13",
    "changes": 1.42,
    "companyName": "Extreme Networks, Inc.",
    "currency": "USD",
    "cik": "0001078271",
    "isin": "US30226D1063",
    "cusip": "30226D106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Communication Equipment",
    "website": "https://www.extremenetworks.com",
    "description": "Extreme Networks, Inc. provides software-driven networking solutions worldwide. It designs, develops, and manufactures wired and wireless network infrastructure equipment; and develops software for network management, policy, analytics, security, and access controls. The company offers ExtremeCloud IQ, an ML/AI powered, wired, and wireless cloud network management solution that offers advanced visibility and control over users, devices, and applications; ExtremeCloud IQ  Site Engine that provides task automation, access control, granular visibility with real-time analytics and multi-vendor device management; and ExtremeCloud IQ Essentials offers WIPS, location services, IoT, and guest management services. It also provides wireless access point products; ExtremeSwitching portfolio that includes access edge products that offer physical presentations along with options to deliver Ethernet or convergence-friendly Power-over-Ethernet (POE), including high-power universal POE; aggregation/core switches designed to address aggregation, top-of-rack, and campus core environments; and data center switches and routers. In addition, the company offers cloud native platforms and applications for service providers; and customer support and services. It markets and sells its products through distributors, resellers, and field sales organizations to healthcare, education, government, manufacturing, retail, and hospitality markets. Extreme Networks, Inc. was incorporated in 1996 and is headquartered in Morrisville, North Carolina.",
    "ceo": "Mr. Edward B. Meyercord III",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2643",
    "phone": "408 579 2800",
    "address": "2121 RDU Center Drive",
    "city": "Morrisville",
    "state": "NC",
    "zip": "27560",
    "dcfDiff": 3.43386,
    "dcf": 20.9439,
    "image": "https://financialmodelingprep.com/image-stock/EXTR.png",
    "ipoDate": "1999-04-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]