[
  {
    "symbol": "F",
    "price": 14.79,
    "beta": 1.554929,
    "volAvg": 59853682,
    "mktCap": 58123516800,
    "lastDiv": 0.6,
    "range": "10.61-16.68",
    "changes": 0.38,
    "companyName": "Ford Motor Company",
    "currency": "USD",
    "cik": "0000037996",
    "isin": "US3453708600",
    "cusip": "345370860",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Auto Manufacturers",
    "website": "https://www.ford.com",
    "description": "Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.",
    "ceo": "Mr. James D. Farley Jr.",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "173000",
    "phone": "313 322 3000",
    "address": "One American Road",
    "city": "Dearborn",
    "state": "MI",
    "zip": "48126-1899",
    "dcfDiff": 5.8499,
    "dcf": 19.1199,
    "image": "https://financialmodelingprep.com/image-stock/F.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]