[
  {
    "symbol": "FA",
    "price": 14.83,
    "beta": 0,
    "volAvg": 326653,
    "mktCap": 2169035800,
    "lastDiv": 0,
    "range": "10.07-15.885",
    "changes": 0.2,
    "companyName": "First Advantage Corporation",
    "currency": "USD",
    "cik": "0001210677",
    "isin": "US31846B1089",
    "cusip": "31846B108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Specialty Business Services",
    "website": "https://fadv.com",
    "description": "First Advantage Corporation provides technology solutions for screening, verifications, safety, and compliance related to human capital worldwide. It offers pre-onboarding products and solutions, such as criminal background checks, drug/health screening, extended workforce screening, FBI channeling, identity checks and biometric fraud mitigation tools, education/work history verification, driver records and compliance, healthcare credentials, executive screening, and other screening products. The company also provides post-onboarding solutions, including criminal records monitoring, healthcare sanctions, motor vehicle records, social media screening, and global sanctions and licenses; and fleet/vehicle compliance, hiring tax credits and incentives, resident/tenant screening, and investigative research. Its products and solutions are used by personnel in recruiting, human resources, risk, compliance, vendor management, safety, and/or security in global enterprises, mid-sized, and small companies. The company was formerly known as Fastball Intermediate, Inc. and changed its name to First Advantage Corporation in March 2021. First Advantage Corporation was founded in 2003 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. Scott  Staples",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5800",
    "phone": "888 314 9761",
    "address": "1 Concourse Parkway NE",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30328",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FA.png",
    "ipoDate": "2021-06-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]