[
  {
    "symbol": "FAST",
    "price": 58.06,
    "beta": 1.170774,
    "volAvg": 3137290,
    "mktCap": 33154697591,
    "lastDiv": 1.4,
    "range": "43.73-59.27",
    "changes": -0.4,
    "companyName": "Fastenal Company",
    "currency": "USD",
    "cik": "0000815556",
    "isin": "US3119001044",
    "cusip": "311900104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Industrial Distribution",
    "website": "https://www.fastenal.com",
    "description": "Fastenal Company, together with its subsidiaries, engages in the wholesale distribution of industrial and construction supplies in the United States, Canada, Mexico, North America, and internationally. It offers fasteners, and related industrial and construction supplies under the Fastenal name. The company's fastener products include threaded fasteners, bolts, nuts, screws, studs, and related washers, which are used in manufactured products and construction projects, as well as in the maintenance and repair of machines. It also offers miscellaneous supplies and hardware, including pins, machinery keys, concrete anchors, metal framing systems, wire ropes, strut products, rivets, and related accessories. The company serves the manufacturing market comprising original equipment manufacturers; maintenance, repair, and operations; and non-residential construction market, which includes general, electrical, plumbing, sheet metal, and road contractors. It also serves farmers, truckers, railroads, mining companies, schools, and retail trades; and oil exploration, production, and refinement companies, as well as federal, state, and local governmental entities. The company distributes its products through a network of 3,209 in-market locations and 15 distribution centers. Fastenal Company was founded in 1967 and is headquartered in Winona, Minnesota.",
    "ceo": "Mr. Daniel L. Florness",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "20262",
    "phone": "507 454 5374",
    "address": "2001 Theurer Boulevard",
    "city": "Winona",
    "state": "MN",
    "zip": "55987-1500",
    "dcfDiff": 2.20914,
    "dcf": 52.4591,
    "image": "https://financialmodelingprep.com/image-stock/FAST.png",
    "ipoDate": "1987-08-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]