[
  {
    "symbol": "FBP",
    "price": 12.03,
    "beta": 1.120422,
    "volAvg": 1377890,
    "mktCap": 2162861574,
    "lastDiv": 0.56,
    "range": "10.18-16.4",
    "changes": -0.03,
    "companyName": "First BanCorp.",
    "currency": "USD",
    "cik": "0001057706",
    "isin": "PR3186727065",
    "cusip": "318672706",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.1firstbank.com",
    "description": "First BanCorp. operates as a bank holding company for FirstBank Puerto Rico that provides various financial services for retail, commercial, and institutional clients. The company operates through six segments: Commercial and Corporate Banking, Mortgage Banking, Consumer (Retail) Banking, Treasury and Investments, United States Operations, and Virgin Islands Operations. The Commercial and Corporate Banking segment offers commercial loans, including commercial real estate and construction loans and floor plan financings; and other products, such as cash management and business management services. The Mortgage Banking segment engages in the origination, sale, and servicing of various residential mortgage loans; acquisition and sale of mortgages in the secondary markets; and purchase of mortgage loans from other local banks and mortgage bankers. The Consumer (Retail) Banking segment provides auto, boat, credit card, and personal loans; lines of credit; deposit products comprising interest bearing and non-interest bearing checking and savings accounts, individual retirement accounts, and retail certificates of deposit (CDs); and finance leasing and insurance agency services. The Treasury and Investments segment offers funding and liquidity management services. The United States Operations segment provides checking, savings, and money market accounts, as well as retail CDs; traditional commercial and industrial, and commercial real estate loans; and internet banking, cash management, remote deposit capture, and automated clearing house, and transactions services. The Virgin Islands Operations segment is involved in consumer, commercial lending, and deposit-taking activities. The company operates 64 branches in Puerto Rico, 8 branches in the U.S. Virgin Islands and British Virgin Islands, and 11 branches in the state of Florida. First BanCorp. was founded in 1948 and is headquartered in San Juan, Puerto Rico.",
    "ceo": "Mr. Aurelio  Aleman-Bermudez",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3133",
    "phone": "787 729 8200",
    "address": "1519 Ponce de Leon Ave.",
    "city": "San Juan",
    "state": "PR",
    "zip": "00908-0146",
    "dcfDiff": 13.3323,
    "dcf": 26.7823,
    "image": "https://financialmodelingprep.com/image-stock/FBP.png",
    "ipoDate": "1987-01-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]