[
  {
    "symbol": "FCN",
    "price": 184.99,
    "beta": 0.274647,
    "volAvg": 233035,
    "mktCap": 6285923202,
    "lastDiv": 1.1634555979259475,
    "range": "140.09-205.63",
    "changes": -1.95,
    "companyName": "FTI Consulting, Inc.",
    "currency": "USD",
    "cik": "0000887936",
    "isin": "US3029411093",
    "cusip": "302941109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Consulting Services",
    "website": "https://www.fticonsulting.com",
    "description": "FTI Consulting, Inc. provides business advisory services to manage change, mitigate risk, and resolve disputes worldwide. The company operates through five segments: Corporate Finance & Restructuring, Forensic and Litigation Consulting, Economic Consulting, Technology, and Strategic Communications. Its Corporate Finance & Restructuring segment provides business transformation, transactions, and turnaround and restructuring services. The company's Forensic and Litigation Consulting segment offers. construction and environmental solution, data and analytics, dispute, health solution, and risk and investigation services. Its Economic Consulting segment provides. antitrust and competition economic, financial economic, and international arbitration services. The company's Technology segment offers corporate legal operation; e-discovery and expertise; and information governance, privacy, and security services. Its Strategic Communications segment provides corporate reputation, financial communication, and public affairs services. The company serves aerospace and defense, agriculture, airlines and aviation, automotive and industrial, construction, energy, power and products, environmental solutions, financial services, healthcare and life sciences, hospitality, gaming and leisure, insurance, mining, private equity, public sector, real estate, retail and consumer products, telecom, media and technology, and transportation and logistics industries. The company was founded in 1982 and is headquartered in Washington, District of Columbia.",
    "ceo": "Mr. Steven H. Gunby J.D.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "7794",
    "phone": "202 312 9100",
    "address": "555 12th Street NW",
    "city": "Washington",
    "state": "DC",
    "zip": "20004",
    "dcfDiff": 25.4309,
    "dcf": 183.671,
    "image": "https://financialmodelingprep.com/image-stock/FCN.png",
    "ipoDate": "1996-05-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]