[
  {
    "symbol": "FELE",
    "price": 100.25,
    "beta": 0.972887,
    "volAvg": 179075,
    "mktCap": 4630868300,
    "lastDiv": 0.9,
    "range": "69.0-102.01",
    "changes": 0.14,
    "companyName": "Franklin Electric Co., Inc.",
    "currency": "USD",
    "cik": "0000038725",
    "isin": "US3535141028",
    "cusip": "353514102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.franklin-electric.com",
    "description": "Franklin Electric Co., Inc., together with its subsidiaries, designs, manufactures, and distributes water and fuel pumping systems worldwide. It operates through three segments: Water Systems, Fueling Systems, and Distribution. The Water Systems segment offers submersible motors, pumps, drives, electronic controls, water treatment systems, monitoring devices, and related parts and equipment. Its motors and pumps are used principally for pumping clean water and wastewater in various residential, agricultural, municipal, and industrial applications; and manufactures electronic drives and controls that are used in motors for controlling functionality, as well as provides protection from various hazards, such as electrical surges, over-heating, and dry wells or tanks. The Fueling Systems segment provides pumps, pipes, sumps, fittings, vapor recovery components, electronic controls, monitoring devices, and related parts and equipment primarily for use in fueling system applications. This segment serves other energy markets, such as power reliability systems, as well as includes electronic devices for online monitoring of the power utility, hydroelectric, and telecommunication and data center infrastructure. The Distribution segment sells to and provides presale support and specifications to the installing contractors. It sells products produced by the Water Systems segment. The company sells its products to wholesale and retail distributors, specialty distributors, original equipment manufacturers, industrial and petroleum equipment distributors, and oil and utility companies through its employee sales force and independent manufacturing representatives. Franklin Electric Co., Inc. was founded in 1944 and is headquartered in Fort Wayne, Indiana.",
    "ceo": "Mr. Gregg C. Sengstack",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "6500",
    "phone": "260 824 2900",
    "address": "9255 Coverdale Road",
    "city": "Fort Wayne",
    "state": "IN",
    "zip": "46809",
    "dcfDiff": 1.41199,
    "dcf": 85.918,
    "image": "https://financialmodelingprep.com/image-stock/FELE.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]