[
  {
    "symbol": "FFBC",
    "price": 20.58,
    "beta": 1.054225,
    "volAvg": 330633,
    "mktCap": 1958289900,
    "lastDiv": 0.92,
    "range": "17.99-26.72",
    "changes": 0.03,
    "companyName": "First Financial Bancorp.",
    "currency": "USD",
    "cik": "0000708955",
    "isin": "US3202091092",
    "cusip": "320209109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.bankatfirst.com",
    "description": "First Financial Bancorp. operates as the bank holding company for First Financial Bank that provides commercial banking and related services to individuals and businesses in Ohio, Indiana, Kentucky, and Illinois. The company accepts various deposit products, such as interest-bearing and noninterest-bearing accounts, time deposits, and cash management services for commercial customers. It also provides real estate loans secured by residential property, such as one to four family residential housing units or commercial property comprising owner-occupied and/or investor income producing real estate consisting of apartments, shopping centers, or office buildings; commercial and industrial loans for various purposes, including inventory, receivables, and equipment; consumer loans comprising new and used vehicle loans, second mortgages on residential real estate, and unsecured loans; and home equity lines of credit. In addition, the company offers commercial financing to the insurance industry, registered investment advisors, certified public accountants, indirect auto finance companies, and restaurant franchisees. Further, it provides a range of trust and wealth management services; and lease and equipment financing services. As of December 31, 2021, the company operated 139 full service banking centers, 29 of which are leased facilities. It operates 62 banking centers in Ohio, three banking centers in Illinois, 62 banking centers in Indiana, and 12 banking centers in Kentucky. First Financial Bancorp. was founded in 1863 and is headquartered in Cincinnati, Ohio.",
    "ceo": "Mr. Archie M. Brown Jr.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2066",
    "phone": "877 322 9530",
    "address": "255 East Fifth Street",
    "city": "Cincinnati",
    "state": "OH",
    "zip": "45202",
    "dcfDiff": 5.81615,
    "dcf": 30.0761,
    "image": "https://financialmodelingprep.com/image-stock/FFBC.png",
    "ipoDate": "1983-12-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]