[
  {
    "symbol": "FFIN",
    "price": 28.11,
    "beta": 0.734859,
    "volAvg": 607932,
    "mktCap": 4012168635,
    "lastDiv": 0.72,
    "range": "25.01-47.26",
    "changes": -0.07,
    "companyName": "First Financial Bankshares, Inc.",
    "currency": "USD",
    "cik": "0000036029",
    "isin": "US32020R1095",
    "cusip": "32020R109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.ffin.com",
    "description": "First Financial Bankshares, Inc., through its subsidiaries, provides commercial banking products and services in Texas. The company accepts checking, savings and money market accounts, and time deposits; commercial and industrial, municipal, agricultural, construction and development, farm, non-owner occupied and owner-occupied commercial real estate, residential, and consumer auto and non-auto loans to businesses, professional individuals, and farm and ranch operations. It also provides drive-in and night deposit, remote deposit capture, internet and mobile banking, payroll cards, transmitting funds, and other customary commercial banking services, as well as automated teller machines and safe deposit facilities. In addition, the company offers personal trust services, including wealth management, administration of estates, testamentary trusts, revocable and irrevocable trusts, and agency accounts; and securities brokerage services, as well as administer retirements and employee benefits accounts, such as 401(k) profit-sharing plans and IRAs. Further, the company provides asset management and technology services. As of December 31, 2021, it had 78 financial centers across Texas. First Financial Bankshares, Inc. was founded in 1890 and is headquartered in Abilene, Texas.",
    "ceo": "Mr. F. Scott Dueser",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1400",
    "phone": "325 627 7155",
    "address": "400 Pine Street",
    "city": "Abilene",
    "state": "TX",
    "zip": "79601",
    "dcfDiff": 5.25822,
    "dcf": 40.1982,
    "image": "https://financialmodelingprep.com/image-stock/FFIN.png",
    "ipoDate": "1993-11-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]