[
  {
    "symbol": "FFIV",
    "price": 144.82,
    "beta": 1.084507,
    "volAvg": 603964,
    "mktCap": 8756975760,
    "lastDiv": 0,
    "range": "127.05-174.38",
    "changes": -1.53,
    "companyName": "F5, Inc.",
    "currency": "USD",
    "cik": "0001048695",
    "isin": "US3156161024",
    "cusip": "315616102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.f5.com",
    "description": "F5, Inc. provides multi-cloud application security and delivery solutions for the security, performance, and availability of network applications, servers, and storage systems. The company's multi-cloud application security and delivery solutions enable its customers to develop, deploy, operate, secure, and govern applications in any architecture, from on-premises to the public cloud. It offers application security and delivery products, including BIG-IP appliances and VIPRION chassis and related software modules and software-only Virtual Editions; Local Traffic Manager and DNS Services; Advanced Firewall Manager and Policy Enforcement Manager that leverage the unique performance characteristics of its hardware and software architecture; Application Security Manager and Access Policy Manager; NGINX Plus and NGINX Controller; Shape Defense and Enterprise Defense; Secure Web Gateway, and Silverline DDoS and Application security offerings; and online fraud and abuse prevention solutions. The company also provides a range of professional services, including consulting, training, installation, maintenance, and other technical support services. F5, Inc. sells its products to large enterprise businesses, public sector institutions, governments, and service providers through distributors, value-added resellers, managed service providers, and systems integrators in the Americas, Europe, the Middle East, Africa, and the Asia Pacific region. It has partnerships with public cloud providers, such as Amazon Web Services, Microsoft Azure, and Google Cloud Platform. The company was formerly known as F5 Networks, Inc. and changed its name to F5, Inc. in November 2021. F5, Inc. was incorporated in 1996 and is headquartered in Seattle, Washington.",
    "ceo": "Mr. Francois  Locoh-Donou",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "6736",
    "phone": "206 272 5555",
    "address": "801 5th Avenue",
    "city": "Seattle",
    "state": "WA",
    "zip": "98104-1663",
    "dcfDiff": 14.4856,
    "dcf": 162.256,
    "image": "https://financialmodelingprep.com/image-stock/FFIV.png",
    "ipoDate": "1999-06-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]