[
  {
    "symbol": "FGETF",
    "price": 11.75,
    "beta": 1.598084,
    "volAvg": 0,
    "mktCap": 2842888953,
    "lastDiv": 5.166055,
    "range": "9.2-13.29",
    "changes": 0,
    "companyName": "Flight Centre Travel Group Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Travel Services",
    "website": "https://www.fctgl.com",
    "description": "Flight Centre Travel Group Limited provides travel retailing services for the leisure and corporate sectors in Australia, New Zealand, Americas, Europe, the Middle East, Africa, Asia, and internationally. The company offers leisure travel services for the niche sectors, as well as mass, youth, premium, and cruise markets; and corporate travel services for organizations of various sizes across industries, as well as supplies products to its national and international network, or travel retail outlets. It also provides tour operations, hotel management, and destination management services. In addition, the company offers other travel related services, including foreign currency exchange and travel academies; recruitment marketing and bike retailing; and employee benefit services. It provides its services primarily under the Flight Centre brand, as well as other travel brands, such as Student Flights, Travel Associates, Liberty Travel, Infinity Holidays, GOGO Vacations, FCm Travel Solutions, Corporate Traveller, Stage and Screen, and cievents. The company was formerly known as Flight Centre Limited and changed its name to Flight Centre Travel Group Limited in November 2013. Flight Centre Travel Group Limited was incorporated in 1987 and is headquartered in South Brisbane, Australia.",
    "ceo": "Mr. Graham F. Turner",
    "sector": "Consumer Cyclical",
    "country": "AU",
    "fullTimeEmployees": "10257",
    "phone": "61 7 3083 0088",
    "address": "275 Grey Street",
    "city": "South Brisbane",
    "state": "QLD",
    "zip": "4101",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FGETF.png",
    "ipoDate": "2010-08-26",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]