[
  {
    "symbol": "FHB",
    "price": 17.91,
    "beta": 1.009154,
    "volAvg": 1012320,
    "mktCap": 2285262270,
    "lastDiv": 1.04,
    "range": "15.08-28.278",
    "changes": -0.33,
    "companyName": "First Hawaiian, Inc.",
    "currency": "USD",
    "cik": "0000036377",
    "isin": "US32051X1081",
    "cusip": "32051X108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.fhb.com",
    "description": "First Hawaiian, Inc. operates as a bank holding company for First Hawaiian Bank that provides a range of banking services to consumer and commercial customers in the United States. It operates through three segments: Retail Banking, Commercial Banking, and Treasury and Other. The company accepts various deposit products, including checking and savings accounts, and other deposit accounts. It also provides residential and commercial mortgage loans, home equity lines of credit, automobile loans and leases, personal lines of credit, installment loans, and small business loans and leases, as well as commercial lease and auto dealer financing. In addition, the company offers personal installment, credit card, individual investment and financial planning, insurance protection, trust and estate, private banking, retirement planning, treasury, and merchant processing services. It operates a network of 54 branches, which include 49 in Hawaii, 3 in Guam, and 2 in Saipan. The company was formerly known as BancWest Corporation and changed its name to First Hawaiian, Inc. in April 2016. First Hawaiian, Inc. was founded in 1858 and is headquartered in Honolulu, Hawaii.",
    "ceo": "Mr. Robert Scott Harrison",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2100",
    "phone": "808 525 7000",
    "address": "999 Bishop Street",
    "city": "Honolulu",
    "state": "HI",
    "zip": "96813",
    "dcfDiff": 9.0626,
    "dcf": 35.8126,
    "image": "https://financialmodelingprep.com/image-stock/FHB.png",
    "ipoDate": "2016-08-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]