[
  {
    "symbol": "FHI",
    "price": 35.15,
    "beta": 1.033802,
    "volAvg": 1139770,
    "mktCap": 3146283530,
    "lastDiv": 1.12,
    "range": "30.3-45.55",
    "changes": -0.01,
    "companyName": "Federated Hermes, Inc.",
    "currency": "USD",
    "cik": "0001056288",
    "isin": "US3142111034",
    "cusip": "314211103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.federatedinvestors.com",
    "description": "Federated Hermes, Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides its services to individuals, including high net worth individuals, banking or thrift institutions, investment companies, pension and profit sharing plans, pooled investment vehicles, charitable organizations, state or municipal government entities, and registered investment advisors. Through its subsidiaries, it manages separate client-focused equity, fixed income, balanced and money market mutual funds along with separate client-focused equity, fixed income, money market, and balanced portfolios. Through its subsidiaries, the firm invests in the public equity and fixed income markets across the globe. It invests in growth and value stocks of small-cap, mid-cap, and large-cap companies. The firm makes its fixed income investments in ultra-short, short-term, and intermediate-term mortgage-backed, U.S. Government, U.S. corporate, high yield, and municipal securities. It employs both fundamental and quantitative analysis to make its equity investments. Federated Hermes, Inc. was founded in 1955 and is based in Pittsburgh, Pennsylvania with additional offices in New York City and London, United Kingdom.",
    "ceo": "Mr. John Christopher Donahue",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2000",
    "phone": "412 288 1900",
    "address": "Federated Investors Tower",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15222",
    "dcfDiff": 0.989929,
    "dcf": 39.6699,
    "image": "https://financialmodelingprep.com/image-stock/FHI.png",
    "ipoDate": "1998-05-14",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]