[
  {
    "symbol": "FHN",
    "price": 11.15,
    "beta": 0.911971,
    "volAvg": 12708072,
    "mktCap": 5996603443,
    "lastDiv": 0.6,
    "range": "8.99-24.92",
    "changes": -0.08,
    "companyName": "First Horizon Corporation",
    "currency": "USD",
    "cik": "0000036966",
    "isin": "US3205171057",
    "cusip": "320517105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.firsthorizon.com",
    "description": "First Horizon Corporation operates as the bank holding company for First Horizon Bank that provides various financial services. The company operates through three segments: Regional Banking, Specialty Banking, and Corporate. It offers general banking services for consumers, businesses, financial institutions, and governments. The company also underwrites bank-eligible securities and other fixed-income securities eligible for underwriting by financial subsidiaries; sells loans and derivatives; and offers advisory services. In addition, it offers various services, such as mortgage banking; title insurance and loan-closing; brokerage; correspondent banking; nationwide check clearing and remittance processing; trust, fiduciary, and agency; equipment finance; and investment and financial advisory services. Further, the company sells mutual fund and retail insurance products; and credit cards. It operates approximately 500 banking offices in 22 states under the First Horizon Bank brand; and 400 banking centers in 12 states under the FHN Financial brand in the United States. The company was formerly known as First Horizon National Corporation and changed its name to First Horizon Corporation in November 2020. First Horizon Corporation was founded in 1864 and is headquartered in Memphis, Tennessee.",
    "ceo": "Mr. D. Bryan Jordan",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "7300",
    "phone": "901 523 4444",
    "address": "165 Madison Avenue",
    "city": "Memphis",
    "state": "TN",
    "zip": "38103",
    "dcfDiff": 29.5199,
    "dcf": 54.1899,
    "image": "https://financialmodelingprep.com/image-stock/FHN.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]