[
  {
    "symbol": "FI",
    "price": 122.95,
    "beta": 0.857394,
    "volAvg": 3703946,
    "mktCap": 75898266467,
    "lastDiv": 0,
    "range": "87.8-123.81",
    "changes": 0.55,
    "companyName": "Fiserv, Inc.",
    "currency": "USD",
    "cik": "0000798354",
    "isin": null,
    "cusip": null,
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.fiserv.com",
    "description": "Fiserv, Inc., together with its subsidiaries, provides payment and financial services technology worldwide. The company operates through Acceptance, Fintech, and Payments segments. The Acceptance segment provides point-of-sale merchant acquiring and digital commerce services; mobile payment services; security and fraud protection products; Carat, an omnichannel commerce solution; Clover, a cloud-based point-of-sale and business management platform; and Clover Connect, an independent software vendors platform. This segment distributes through various channels, including direct sales teams, strategic partnerships with agent sales forces, independent software vendors, financial institutions, and other strategic partners. The Fintech segment offers customer deposit and loan accounts, as well as manages an institution's general ledger and central information files. This segment also provides digital banking, financial and risk management, professional services and consulting, item processing and source capture, and other products and services. The Payments segment offers card transactions, such as debit, credit, and prepaid card processing and services; security and fraud protection products; card production; print services; and various network services, as well as non-card digital payment software and services, including bill payment, account-to-account transfers, person-to-person payments, electronic billing, and security and fraud protection products. It serves business, banks, credit unions, other financial institutions, merchants, and corporate clients. Fiserv, Inc. was incorporated in 1984 and is headquartered in Brookfield, Wisconsin.",
    "ceo": "Mr. Frank J. Bisignano",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "41000",
    "phone": "262 879 5000",
    "address": "255 Fiserv Drive",
    "city": "Brookfield",
    "state": "WI",
    "zip": "53045",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FI.png",
    "ipoDate": "1986-09-25",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]