[
  {
    "symbol": "FIBK",
    "price": 24.13,
    "beta": 0.842253,
    "volAvg": 785311,
    "mktCap": 2518592880,
    "lastDiv": 1.88,
    "range": "21.03-46.34",
    "changes": 0.36,
    "companyName": "First Interstate BancSystem, Inc.",
    "currency": "USD",
    "cik": "0000860413",
    "isin": "US32055Y2019",
    "cusip": "32055Y201",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.fibk.com",
    "description": "First Interstate BancSystem, Inc. operates as the bank holding company for First Interstate Bank that provides range of banking products and services in the United States. It offers various traditional depository products, including checking, savings, and time deposits; and repurchase agreements primarily for commercial and municipal depositors. The company also offers real estate loans comprising commercial real estate, construction, residential, agricultural, and other real estate loans; consumer loans comprising direct personal loans, credit card loans and lines of credit, and indirect loans; variable and fixed rate commercial loans for small and medium-sized manufacturing, wholesale, retail, and service businesses for working capital needs and business expansions; and agricultural loans. In addition, it provides a range of trust, employee benefit, investment management, insurance, agency, and custodial services to individuals, businesses, and nonprofit organizations. Further, the company offers marketing, credit review, loan servicing, credit cards issuance and servicing, mortgage loan sales and servicing, indirect consumer loan purchasing and processing, loan collection services, and other operational services, as well as online and mobile banking services. It serves individuals, businesses, municipalities, and other entities in various industries, including agriculture, construction, education, energy, governmental services, healthcare, hospitality, housing, mining, professional services, real estate development, retail, technology, tourism, and wholesale trade. As of December 31, 2021, it operated 147 banking offices, including detached drive-up facilities in communities across Idaho, Montana, Oregon, South Dakota, Washington, and Wyoming. The company was incorporated in 1971 and is headquartered in Billings, Montana.",
    "ceo": "Mr. Kevin P. Riley",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3783",
    "phone": "406 255 5311",
    "address": "401 North 31st Street",
    "city": "Billings",
    "state": "MT",
    "zip": "59116-0918",
    "dcfDiff": 48.3929,
    "dcf": 82.0129,
    "image": "https://financialmodelingprep.com/image-stock/FIBK.png",
    "ipoDate": "2010-03-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]