[
  {
    "symbol": "FICO",
    "price": 787.84,
    "beta": 1.260563,
    "volAvg": 206354,
    "mktCap": 19690563904,
    "lastDiv": 1.4533290000000023,
    "range": "389.84-815.64",
    "changes": 12.3,
    "companyName": "Fair Isaac Corporation",
    "currency": "USD",
    "cik": "0000814547",
    "isin": "US3032501047",
    "cusip": "303250104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.fico.com",
    "description": "Fair Isaac Corporation develops analytic, software, and data management products and services that enable businesses to automate, enhance, and connect decisions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates through two segments, Scores and Software. The Software segment offers pre-configured decision management solution designed for various business problems or processes, such as marketing, account origination, customer management, customer engagement, fraud detection, financial crimes compliance, collection, and marketing, as well as associated professional services. This segment also provides FICO Platform, a modular software offering designed to support advanced analytic and decision use cases, as well as stand-alone analytic and decisioning software that can be configured by customers to address a wide range of business use cases. The Scores segment provides business-to-business scoring solutions and services for consumers that give clients access to analytics to be integrated into their transaction streams and decision-making processes, as well as business-to-consumer scoring solutions comprising myFICO.com subscription offerings. Fair Isaac Corporation markets its products and services primarily through its direct sales organization and indirect channels, as well as online. The company was formerly known as Fair Isaac & Company, Inc. and changed its name to Fair Isaac Corporation in July 1992. Fair Isaac Corporation was founded in 1956 and is headquartered in Bozeman, Montana.",
    "ceo": "Mr. William J. Lansing",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3320",
    "phone": "406 982 7276",
    "address": "5 West Mendenhall",
    "city": "Bozeman",
    "state": "MT",
    "zip": "59715",
    "dcfDiff": 72.0835,
    "dcf": 588.167,
    "image": "https://financialmodelingprep.com/image-stock/FICO.png",
    "ipoDate": "1987-07-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]