[
  {
    "symbol": "FINMY",
    "price": 5.63,
    "beta": 1.317624,
    "volAvg": 6401,
    "mktCap": 6477934570,
    "lastDiv": 0.08,
    "range": "3.32-6.45",
    "changes": 0.07,
    "companyName": "Leonardo S.p.a.",
    "currency": "USD",
    "cik": null,
    "isin": "US52660W1018",
    "cusip": "52660W101",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Aerospace & Defense",
    "website": "https://www.leonardocompany.com/en/home",
    "description": "Leonardo S.p.a., an industrial and technological company, engages in the helicopters, defense electronics and security systems, aeronautics, space, and other businesses in Italy, the United Kingdom, rest of Europe, the United States, and internationally. The company offers a range of helicopters for battlefield, combat, maritime, training, executive and private transport, medical and rescue, security, energy, and utility services, as well as provides support and training services. It also provides trainers, fighters, multi-mission transport, and multi-mission surveillance aircraft; command and controls, radars and sensors, optronics, communication systems, electronic warfare, avionics, air traffic management, and defense systems; and cyber security and resilience, critical communications, digitalization, and monitoring. In addition, the company offers geoinformation, satellite communications, ground systems, navigation, and satellite operations; interplanetary probes and orbiting modules; and robotics and drilling, electro-optics, laser transmitters, atomic clocks, photovoltaic panels, power distributors and amplifiers, attitude sensors, and orbital micropropulsion. Further, it engages in the production and assembly of major structural composite and metallic components for commercial and military aircraft, helicopters, and unmanned aircraft, as well as provides automation of airport baggage handling, mail sorting centers, and courier logistics hubs. The company was formerly known as Leonardo  Finmeccanica S.p.a. and changed its name to Leonardo S.p.a. in January 2017. Leonardo S.p.a. was founded in 1948 and is headquartered in Rome, Italy.",
    "ceo": "Mr. Roberto  Cingolani",
    "sector": "Industrials",
    "country": "IT",
    "fullTimeEmployees": "51627",
    "phone": "39 06 324731",
    "address": "Piazza Monte Grappa n. 4",
    "city": "Rome",
    "state": "RM",
    "zip": "00195",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FINMY.png",
    "ipoDate": "2010-01-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]