[
  {
    "symbol": "FINN",
    "price": 13275,
    "beta": 0.286267,
    "volAvg": 61,
    "mktCap": 1543258575,
    "lastDiv": 120,
    "range": "12125.0-14399.0",
    "changes": 225,
    "companyName": "First National of Nebraska, Inc.",
    "currency": "USD",
    "cik": null,
    "isin": "US3357201082",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.fnni.com",
    "description": "First National of Nebraska, Inc. operates as the bank holding company for First National Bank of Omaha that provides various banking products and services. The company offers checking, savings, and individual retirement accounts; certificates of deposit; and credit cards. It also provides personal loans and lines of credit; auto loans; mortgage loans; home equity lines of credit and loans; small business loans and lines of credit; small business administration loans; and commercial lending solutions. In addition, the company offers treasury management, debt consolidation, financial planning, retirement planning, wealth management, merchant, and payroll services; and personal, commercial, and farm insurance products. Further, it provides solutions for agribusiness, commercial real estate, healthcare, transportation, and correspondent banking; investment services, such as capital market and institutional asset management; and digital banking services. First National of Nebraska, Inc. was founded in 1857 and is headquartered in Omaha, Nebraska.",
    "ceo": "Mr. Clarkson D. Lauritzen",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": null,
    "phone": "402 602 3777",
    "address": "1620 Dodge Street",
    "city": "Omaha",
    "state": "NE",
    "zip": "68197",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FINN.png",
    "ipoDate": "1994-04-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]