[
  {
    "symbol": "FIS",
    "price": 53.1,
    "beta": 0.829225,
    "volAvg": 5195766,
    "mktCap": 31458139200,
    "lastDiv": 2.08,
    "range": "48.57-105.16",
    "changes": 0.68,
    "companyName": "Fidelity National Information Services, Inc.",
    "currency": "USD",
    "cik": "0001136893",
    "isin": "US31620M1062",
    "cusip": "31620M106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.fisglobal.com",
    "description": "Fidelity National Information Services, Inc. provides technology solutions for merchants, banks, and capital markets firms worldwide. It operates through Merchant Solutions, Banking Solutions, and Capital Market Solutions segments. The Merchant Solutions segment offers enterprise acquiring, software-led small- to medium-sized businesses acquiring, and global e-commerce solutions. The Banking Solutions segment provides core processing and ancillary applications; digital solutions, including Internet, mobile, and e-banking; fraud, risk management, and compliance solutions; electronic funds transfer and network services; card and retail payment solutions; wealth and retirement solutions; and item processing and output services. The Capital Market Solutions segment offers securities processing and finance, global trading, asset management and insurance, and corporate liquidity solutions. Fidelity National Information Services, Inc. was founded in 1968 and is headquartered in Jacksonville, Florida.",
    "ceo": "Ms. Stephanie L. Ferris",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "69000",
    "phone": "904 438 6000",
    "address": "601 Riverside Avenue",
    "city": "Jacksonville",
    "state": "FL",
    "zip": "32204",
    "dcfDiff": 10.5643,
    "dcf": 64.7657,
    "image": "https://financialmodelingprep.com/image-stock/FIS.png",
    "ipoDate": "2001-06-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]