[
  {
    "symbol": "FJTSY",
    "price": 25.51,
    "beta": 0.995402,
    "volAvg": 53624,
    "mktCap": 24022691082,
    "lastDiv": 0.34,
    "range": "20.78-29.22",
    "changes": 0.13,
    "companyName": "Fujitsu Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US3595903044",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Information Technology Services",
    "website": "https://www.fujitsu.com",
    "description": "Fujitsu Limited operates as an information and communication technology company in Japan and internationally. The company operates through three segments: Technology Solutions, Ubiquitous Solutions, and Device Solutions. The company offers multi cloud and hybrid IT services; assessment and consultative services; SAP landscape transformation services; new workplace; datacentre products comprising integrated systems, storage solutions, servers, network switches, and infrastructure management; workplace products including personal computers, workstations, thin clients, displays, and peripheral devices; consumption based IT services; installation and implementation services; and hardware, software, and infrastructure support services, as well as electronic devices, air conditioning products, and network solutions. It also provides cyber security solutions, including cyber security consulting, managed security servies, and security operation and advanced threat centers; internet of things, artificial intelligence platform and solutions; and software products comprising FUJITSU Software Infrastructure Manager and FUJITSU Software ServerView Suite. Further, the company offers electronic components, such as semiconductor packages and batteries. It serves automotive, manufacturing, retail, financial services, transport, telecommunications, healthcare, and energy and utilities industries; the public sectors; and services providers. Fujitsu Limited was founded in 1923 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Takahito  Tokita",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "124216",
    "phone": "81 3 6252 2220",
    "address": "Shiodome City Center",
    "city": "Tokyo",
    "state": null,
    "zip": "105-7123",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FJTSY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]