[
  {
    "symbol": "FLEX",
    "price": 26.66,
    "beta": 1.446126,
    "volAvg": 4373143,
    "mktCap": 11824082813,
    "lastDiv": 0,
    "range": "13.63-27.32",
    "changes": 0.2,
    "companyName": "Flex Ltd.",
    "currency": "USD",
    "cik": "0000866374",
    "isin": "SG9999000020",
    "cusip": "Y2573F102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Electronic Components",
    "website": "https://www.flex.com",
    "description": "Flex Ltd. provides design, engineering, manufacturing, and supply chain services and solutions to original equipment manufacturers in Asia, the Americas, and Europe. It operates through three segments: Flex Agility Solutions (FAS), Flex Reliability Solutions (FRS), and Nextracker. The company provides cross-industry technologies, including human-machine interface, internet of things platforms, power, sensor fusion, and smart audio. It also offers integrated solar tracker and software solutions used in utility-scale and ground-mounted distributed generation solar projects. In addition, the company provides value-added design and engineering services; and systems assembly and manufacturing services that include enclosures, testing services, and materials procurement and inventory management services. Further, it offers chargers for smartphones and tablets; adapters for notebooks and gaming systems; power supplies for the server, storage, and networking markets; and power solutions, such as switchgear, busway, power distribution, modular power systems, and monitoring solutions and services. Additionally, the company provides after-market and forward supply chain logistics services to computing, consumer digital, infrastructure, industrial, mobile, automotive, and medical industries; and reverse logistics and repair solutions, including returns management, exchange programs, complex repair, asset recovery, recycling, and e-waste management. It serves to cloud, communications, enterprise, automotive, industrial, consumer devices, lifestyle, healthcare, and energy industries. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was incorporated in 1990 and is based in Singapore.",
    "ceo": "Ms. Revathi  Advaithi",
    "sector": "Technology",
    "country": "SG",
    "fullTimeEmployees": "172108",
    "phone": "65 6876 9899",
    "address": "2 Changi South Lane",
    "city": "Singapore",
    "state": null,
    "zip": "486123",
    "dcfDiff": 2.40064,
    "dcf": 25.9406,
    "image": "https://financialmodelingprep.com/image-stock/FLEX.png",
    "ipoDate": "1994-03-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]