[
  {
    "symbol": "FLNC",
    "price": 25.76,
    "beta": 0,
    "volAvg": 1410648,
    "mktCap": 4521317456,
    "lastDiv": 0,
    "range": "8.11-29.55",
    "changes": 1.09,
    "companyName": "Fluence Energy, Inc.",
    "currency": "USD",
    "cik": "0001868941",
    "isin": "US34379V1035",
    "cusip": "34379V103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Utilities—Renewable",
    "website": "https://fluenceenergy.com",
    "description": "Fluence Energy, Inc. provides energy storage products and services, and artificial intelligence enabled digital applications for renewables and storage applications worldwide. The company sells energy storage products with integrated hardware, software, and digital intelligence, as well as engineering and delivery services to support the deployment of its storage products; operational and maintenance, and energy storage-as-a-service; and digital applications and solutions. Its energy storage products include Gridstack, a grid-scale industrial strength energy storage product; Sunstack for optimizing solar capture and delivery; and Edgestack, a commercial energy storage product that discharges when needed to flatten a facility's energy load profile. The company serves utilities, developers, and commercial and industrial customers. Fluence Energy, Inc. was founded in 2018 and is headquartered in Arlington, Virginia. Fluence Energy, Inc. is a joint venture of Siemens Aktiengesellschaft and The AES Corporation.",
    "ceo": "Mr. Julian Jose Nebreda Marquez",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "967",
    "phone": "833 358 3623",
    "address": "4601 Fairfax Drive",
    "city": "Arlington",
    "state": "VA",
    "zip": "22203",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FLNC.png",
    "ipoDate": "2021-10-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]