[
  {
    "symbol": "FLR",
    "price": 28.93,
    "beta": 2.301056,
    "volAvg": 1595375,
    "mktCap": 4143846179,
    "lastDiv": 10.709999999999999,
    "range": "21.68-38.2",
    "changes": -0.2,
    "companyName": "Fluor Corporation",
    "currency": "USD",
    "cik": "0001124198",
    "isin": "US3434121022",
    "cusip": "343412102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Engineering & Construction",
    "website": "https://www.fluor.com",
    "description": "Fluor Corporation provides engineering, procurement, and construction (EPC); fabrication and modularization; operation and maintenance; asset integrity; and project management services worldwide. It operates through four segments: Energy Solutions, Urban Solutions, Mission Solutions, and Other. The Energy Solutions provides solutions to the energy transition markets, including asset decarbonization, carbon capture, renewable fuels, waste-to-energy, green chemicals, hydrogen, nuclear power, and other low-carbon energy sources. It also provides consulting services, including feasibility studies, process assessments, and project finance structuring; and a range of services for small modular reactor technologies, as well as operation support services for nuclear power facilities and managing waste. This segment serves the oil, gas, and petrochemical industries. The Urban Solutions segment offers EPC and project management services to the infrastructure, advanced technologies, life sciences, and mining and metals industries. This segment also provides staffing services to the company and third-party clients with technical, professional, and craft resources on a contract or permanent placement basis. The Mission Solutions offers technical solutions to the U.S. and other governments. It also delivers solutions for nuclear security and operation, nuclear waste management, and laboratory management; and operation and maintenance, logistics, EPC, and life support solutions for mission-critical facilities across U.S. military service organizations. This segment offers site management, environmental remediation, and decommissioning for nuclear remediation at governmental facilities, as well as services to commercial nuclear clients. The Other segment researches, develops, licenses, and commercializes small modular nuclear reactor technology. It also provides unionized management and construction services. The company was founded in 1912 and is headquartered in Irving, Texas.",
    "ceo": "Mr. David Edward Constable B.Sc.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "39576",
    "phone": "469 398 7000",
    "address": "6700 Las Colinas Boulevard",
    "city": "Irving",
    "state": "TX",
    "zip": "75039",
    "dcfDiff": 11.7437,
    "dcf": 49.1637,
    "image": "https://financialmodelingprep.com/image-stock/FLR.png",
    "ipoDate": "2000-12-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]