[
  {
    "symbol": "FLS",
    "price": 36.42,
    "beta": 1.632746,
    "volAvg": 861019,
    "mktCap": 4776446580,
    "lastDiv": 0.8,
    "range": "23.89-38.86",
    "changes": -0.18,
    "companyName": "Flowserve Corporation",
    "currency": "USD",
    "cik": "0000030625",
    "isin": "US34354P1057",
    "cusip": "34354P105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.flowserve.com",
    "description": "Flowserve Corporation designs, develops, manufactures, distributes, and services industrial flow management equipment in the United States, Europe, the Middle East, Africa, Asia, and internationally. It operates in two segments, Flowserve Pump Division (FPD) and Flow Control Division (FCD). The FPD segment offers custom and pre-configured pumps and pump systems, mechanical seals, auxiliary systems, replacement parts, upgrades, and related aftermarket services, including installation and commissioning services, seal systems spare parts, repairs, advanced diagnostics, re-rate and upgrade solutions, retrofit programs, and machining and asset management solutions, as well as manufactures a gas-lubricated mechanical seal for use in high-speed compressors for gas pipelines. The FCD segment provides engineered and industrial valve and automation solutions, including isolation and control valves, actuation, controls, and related equipment, as well as equipment maintenance services for flow control systems, including advanced diagnostics, repair, installation, commissioning, retrofit programs, and field machining capabilities. This segment's products are used to control, direct, and manage the flow of liquids, gases, and fluids. The company primarily serves oil and gas, chemical and pharmaceuticals, power generation, and water management markets, as well as general industries, including mining and ore processing, pulp and paper, food and beverage, and other smaller applications. The company distributes its products through direct sales, distributors, and sales representatives. Flowserve Corporation was incorporated in 1912 and is headquartered in Irving, Texas.",
    "ceo": "Mr. Robert Scott Rowe",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "16000",
    "phone": "972 443 6500",
    "address": "5215 North O'Connor Boulevard",
    "city": "Irving",
    "state": "TX",
    "zip": "75039",
    "dcfDiff": 2.96443,
    "dcf": 36.3544,
    "image": "https://financialmodelingprep.com/image-stock/FLS.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]