[
  {
    "symbol": "FLT",
    "price": 245.88,
    "beta": 1.203521,
    "volAvg": 527995,
    "mktCap": 18154353096,
    "lastDiv": 0,
    "range": "161.69-246.95",
    "changes": 0.21,
    "companyName": "FLEETCOR Technologies, Inc.",
    "currency": "USD",
    "cik": "0001175454",
    "isin": "US3390411052",
    "cusip": "339041105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.fleetcor.com",
    "description": "FLEETCOR Technologies, Inc. provides digital payment solutions for businesses to control purchases and make payments. It offers corporate payments solutions, such as accounts payable automation; Virtual Card, which provides a single-use card number for a specific amount usable within a defined timeframe; Cross-Border that is used by its customers to pay international vendors, foreign office and personnel expenses, capital expenditures, and profit repatriation and dividends; and purchasing cards and travel and entertainment cards for its customers to analyze and manage their corporate spending. The company also provides employee expense management solutions, including fuel solutions to businesses and government entities that operate vehicle fleets, as well as to oil and leasing companies, and fuel marketers; lodging solutions to businesses that have employees who travel overnight for work purposes, as well as to airlines and cruise lines to accommodate traveling crews and stranded passengers; and electronic toll payments solutions to businesses and consumers in the form of radio frequency identification tags affixed to vehicles' windshields. In addition, it offers gift card program management and processing services in plastic and digital forms that include card design, production and packaging, delivery and fulfillment, card and account management, transaction processing, promotion development and management, website design and hosting, program analytics, and card distribution channel management. Further, it provides other products consisting of payroll cards, vehicle maintenance service solution, long-haul transportation solution, prepaid food vouchers or cards, and prepaid transportation cards and vouchers. The company serves business, merchant, consumer, and payment network customers in North America, Brazil, and Internationally. The company was founded in 1986 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. Ronald F. Clarke",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "9900",
    "phone": "770 449 0479",
    "address": "3280 Peachtree Road",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30305",
    "dcfDiff": 2.67695,
    "dcf": 207.027,
    "image": "https://financialmodelingprep.com/image-stock/FLT.png",
    "ipoDate": "2010-12-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]