[
  {
    "symbol": "FN",
    "price": 125.55,
    "beta": 1.128873,
    "volAvg": 408111,
    "mktCap": 4557100905,
    "lastDiv": 0,
    "range": "77.67-140.18",
    "changes": -0.8,
    "companyName": "Fabrinet",
    "currency": "USD",
    "cik": "0001408710",
    "isin": "KYG3323L1005",
    "cusip": "345370860",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electronic Components",
    "website": "https://www.fabrinet.com",
    "description": "Fabrinet provides optical packaging and precision optical, electro-mechanical, and electronic manufacturing services in North America, the Asia-Pacific, and Europe. The company offers a range of advanced optical and electro-mechanical capabilities in the manufacturing process, including process design and engineering, supply chain management, manufacturing, printed circuit board assembly, advanced packaging, integration, final assembly, and testing. Its products include switching products, including reconfigurable optical add-drop multiplexers, optical amplifiers, modulators, and other optical components and modules that enable network managers to route voice, video, and data communications traffic through fiber optic cables at various wavelengths, speeds, and over various distances. The company's products also comprise tunable lasers, transceivers, and transponders; and active optical cables, which provide high-speed interconnect capabilities for data centers and computing clusters, as well as Infiniband, Ethernet, fiber channel, and optical backplane connectivity. In addition, it provides solid state, diode-pumped, gas, and fiber lasers used in semiconductor processing, biotechnology and medical device, metrology, and material processing industries; and differential pressure, micro-gyro, fuel, and other sensors used in automobiles, as well as non-contact temperature measurement sensors for the medical industry. Further, the company designs and fabricates application-specific crystals, lenses, prisms, mirrors, laser components, and substrates; and other custom and standard borosilicate, clear fused quartz, and synthetic fused silica glass products. It serves original equipment manufacturers of optical communication components, modules and sub-systems, industrial lasers, automotive components, medical devices, and sensors. The company was incorporated in 1999 and is based in George Town, the Cayman Islands.",
    "ceo": "Mr. Seamus  Grady",
    "sector": "Technology",
    "country": "KY",
    "fullTimeEmployees": "14235",
    "phone": "6625249600",
    "address": "One Nexus Way",
    "city": "Grand Cayman",
    "state": null,
    "zip": "KY1-9005",
    "dcfDiff": 7.75734,
    "dcf": 136.257,
    "image": "https://financialmodelingprep.com/image-stock/FN.png",
    "ipoDate": "2010-06-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]