[
  {
    "symbol": "FNB",
    "price": 11.21,
    "beta": 1.082746,
    "volAvg": 2424551,
    "mktCap": 4047549681,
    "lastDiv": 0.48,
    "range": "10.09-14.71",
    "changes": -0.08,
    "companyName": "F.N.B. Corporation",
    "currency": "USD",
    "cik": "0000037808",
    "isin": "US3025201019",
    "cusip": "302520101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.fnb-online.com",
    "description": "F.N.B. Corporation, a financial holding company, provides a range of financial services primarily to consumers, corporations, governments, and small- to medium-sized businesses. The company operates through three segments: Community Banking, Wealth Management, and Insurance. It offers commercial banking solutions, including corporate and small business banking, investment real estate financing, business credit, capital market, and lease financing services. The company also provides consumer banking products and services, such as deposit products, mortgage and consumer lending services, and mobile and online banking services; and wealth management services comprising personal and corporate fiduciary services comprising administration of decedent and trust estates; securities brokerage and investment advisory services, mutual funds, and annuities; and commercial and personal insurance, and reinsurance products, as well as mezzanine financing options for small- to medium-sized businesses. As of December 31, 2021, it operated 334 banking offices in Pennsylvania, Ohio, Maryland, West Virginia, North Carolina, South Carolina, Washington, D.C., and Virginia. F.N.B. Corporation was founded in 1864 and is headquartered in Pittsburgh, Pennsylvania.",
    "ceo": "Mr. Vincent J. Delie Jr.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4018",
    "phone": "800 555 5455",
    "address": "One North Shore Center",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15212",
    "dcfDiff": 10.897,
    "dcf": 24.647,
    "image": "https://financialmodelingprep.com/image-stock/FNB.png",
    "ipoDate": "1986-09-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]