[
  {
    "symbol": "FOLD",
    "price": 12.54,
    "beta": 0.797183,
    "volAvg": 2587833,
    "mktCap": 3568583040,
    "lastDiv": 0,
    "range": "9.1-13.84",
    "changes": 0.37,
    "companyName": "Amicus Therapeutics, Inc.",
    "currency": "USD",
    "cik": "0001178879",
    "isin": "US03152W1099",
    "cusip": "03152W109",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://amicusrx.com",
    "description": "Amicus Therapeutics, Inc., a biotechnology company, focuses on discovering, developing, and delivering medicines for rare diseases. Its commercial product and product candidates include Galafold, an oral precision medicine for the treatment of adults with a confirmed diagnosis of Fabry disease and an amenable galactosidase alpha gene variant based on in vitro assay data. It also develops AT-GAA, a novel treatment paradigm for Pompe disease; enzyme replacement therapies for Pompe diseases; CLN3, which is in Phase 1/2 clinical study to evaluate the safety and efficacy of a single intrathecal administration of an AAV serotype AT-GTX-502 gene therapy in patients with CLN3; and CDKL5, a gene on the X-chromosome encoding the CDKL5 protein that regulates the expression of essential proteins for normal brain development. The company has collaboration and license agreements with Nationwide Children's Hospital; University of Pennsylvania; and GlaxoSmithKline. Amicus Therapeutics, Inc. was incorporated in 2002 and is headquartered in Philadelphia, Pennsylvania.",
    "ceo": "Mr. Bradley L. Campbell M.B.A.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "484",
    "phone": "215 921 7600",
    "address": "3675 Market Street",
    "city": "Philadelphia",
    "state": "PA",
    "zip": "19104",
    "dcfDiff": 1.07662,
    "dcf": 11.7534,
    "image": "https://financialmodelingprep.com/image-stock/FOLD.png",
    "ipoDate": "2007-05-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]