[
  {
    "symbol": "FORM",
    "price": 32.61,
    "beta": 1.219366,
    "volAvg": 427296,
    "mktCap": 2515668971,
    "lastDiv": 0,
    "range": "18.15-41.0",
    "changes": 1.15,
    "companyName": "FormFactor, Inc.",
    "currency": "USD",
    "cik": "0001039399",
    "isin": "US3463751087",
    "cusip": "346375108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.formfactor.com",
    "description": "FormFactor, Inc. designs, manufactures, and sells probe cards, analytical probes, probe stations, metrology systems, thermal systems, and cryogenic systems to semiconductor companies and scientific institutions. It operates in two segments, Probe Cards and Systems. The company offers probe cards to test various semiconductor device types, including systems on a chip products, mobile application processors, microprocessors, microcontrollers, and graphic processors, as well as radio frequency, analog, mixed signal, image sensor, electro-optical, dynamic random access memory, NAND flash memory, and NOR flash memory devices; and analytical probes, which are used for a range of applications, including device characterization, electrical simulation model development, failure analysis, and prototype design debugging for universities, research institutions, semiconductor integrated device manufacturers, semiconductor foundries, and fabless semiconductor companies. It also provides probing systems for semiconductor design engineers to capture and analyze accurate data; surface metrology systems for the development, production, and quality control of semiconductor products; thermal subsystems, such as thermal chucks and other test systems used in probe stations and other applications; and precision cryogenic instruments, semiconductor tests, and measurement systems. In addition, the company offers on-site probe card maintenance and service training, seminars, and telephone support services. The company markets and sells its products through direct sales force, manufacturers' representatives, and distributors in the United States, Taiwan, South Korea, China, Japan, Europe, rest of Asia-Pacific, and internationally. FormFactor, Inc. was incorporated in 1993 and is headquartered in Livermore, California.",
    "ceo": "Dr. Michael D. Slessor",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2105",
    "phone": "925 290 4000",
    "address": "7005 Southfront Road",
    "city": "Livermore",
    "state": "CA",
    "zip": "94551",
    "dcfDiff": 4.4485,
    "dcf": 24.0915,
    "image": "https://financialmodelingprep.com/image-stock/FORM.png",
    "ipoDate": "2003-06-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]