[
  {
    "symbol": "FOUR",
    "price": 64.17,
    "beta": 1.24156,
    "volAvg": 1436983,
    "mktCap": 5359799378,
    "lastDiv": 0,
    "range": "29.39-76.4",
    "changes": 2.51,
    "companyName": "Shift4 Payments, Inc.",
    "currency": "USD",
    "cik": "0001794669",
    "isin": "US82452J1097",
    "cusip": "82452J109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.shift4.com",
    "description": "Shift4 Payments, Inc. provides integrated payment processing and technology solutions in the United States. It provides omni-channel card acceptance and processing solutions, including credit, debit, contactless card, Europay, Mastercard and visa, QR Pay, and mobile wallets, as well as alternative payment methods; merchant acquiring; proprietary omni-channel gateway; complementary software integrations; integrated and mobile point-of-sale (POS) solutions; security and risk management solutions; reporting and analytical tools; and web-store design, hosting, shopping cart management, and fulfillment integration, as well as tokenization, payment device and chargeback management, fraud prevention, and gift card solutions. The company also offers VenueNext that provides mobile ordering, countertop POS, and self-service kiosk services, as well as digital wallet to facilitate food and beverage, merchandise, and loyalty for stadium and entertainment venues; and Shift4Shop, which offers eCommerce solutions, including website builder, shopping cart, product catalog, order management, marketing, search engine optimization, secure hosting, and mobile webstores. In addition, it provides Lighthouse, a cloud-based business intelligence tool that includes customer engagement, social media management, online reputation management, scheduling, and product pricing, as well as reporting and analytics; SkyTab, a hybrid-cloud-based integrated POS solution; SkyTab Mobile, a mobile payment solution; and marketplace technology for integrations into third-party applications. Further, the company offers merchant management, training and education, marketing management, and incentives tracking solutions. Additionally, it provides merchant underwriting, onboarding and activation, training, risk management, and support services; and software integrations and compliance management, and partner support and services. The company was founded in 1999 and is headquartered in Allentown, Pennsylvania.",
    "ceo": "Mr. Jared  Isaacman",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2300",
    "phone": "888 276 2108",
    "address": "2202 North Irving Street",
    "city": "Allentown",
    "state": "PA",
    "zip": "18109",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FOUR.png",
    "ipoDate": "2020-06-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]