[
  {
    "symbol": "FOX",
    "price": 32.09,
    "beta": 0.861308,
    "volAvg": 1269503,
    "mktCap": 16796837476,
    "lastDiv": 0.5,
    "range": "26.35-34.42",
    "changes": -0.06,
    "companyName": "Fox Corporation",
    "currency": "USD",
    "cik": "0001754301",
    "isin": "US35137L2043",
    "cusip": "35137L204",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Entertainment",
    "website": "https://www.foxcorporation.com",
    "description": "Fox Corporation operates as a news, sports, and entertainment company in the United States (U.S.). The company operates through Cable Network Programming; Television; and Other, Corporate and Eliminations segments. The Cable Network Programming segment produces and licenses news, business news, and sports content for distribution through traditional and virtual multi-channel video programming distributors (MVPDs) and other digital platforms, primarily in the U.S. It operates FOX News, a national cable news channel; FOX Business, a business news national cable channel; FS1 and FS2 multi-sport national networks; FOX Sports Racing, a video programming service that comprises motor sports programming; FOX Soccer Plus, a video programming network for live soccer and rugby competitions; FOX Deportes, a Spanish-language sports programming service; and Big Ten Network, a national video programming service. The Television segment acquires, produces, markets, and distributes programming. It operates The FOX Network, a national television broadcast network that broadcasts sports programming and entertainment; Tubi, an advertising-supported video-on-demand service; Fox Alternative Entertainment, a full-service production studio that develops and produces unscripted and alternative programming; MyNetworkTV, a programming distribution service; and Blockchain Creative Labs, which is focuses on the creation, distribution and monetization of Web3 content. This segment owns and operates 29 broadcast television stations. The Other, Corporate and Eliminations segment owns the FOX Studios Lot that provides production and post-production services, including 15 sound stages, two broadcast studios, theaters and screening rooms, editing rooms, and other television and film production facilities in Los Angeles, California. The company was incorporated in 2018 and is based in New York, New York.",
    "ceo": "Mr. Lachlan Keith Murdoch",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "10600",
    "phone": "212 852 7000",
    "address": "1211 Avenue of the Americas",
    "city": "New York",
    "state": "NY",
    "zip": "10036",
    "dcfDiff": 7.11244,
    "dcf": 38.7324,
    "image": "https://financialmodelingprep.com/image-stock/FOX.png",
    "ipoDate": "2019-03-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]