[
  {
    "symbol": "FOXF",
    "price": 104.2,
    "beta": 1.822887,
    "volAvg": 256966,
    "mktCap": 4407972600,
    "lastDiv": 0,
    "range": "73.05-127.54",
    "changes": -0.7,
    "companyName": "Fox Factory Holding Corp.",
    "currency": "USD",
    "cik": "0001424929",
    "isin": "US35138V1026",
    "cusip": "35138V102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Auto Parts",
    "website": "https://www.ridefox.com",
    "description": "Fox Factory Holding Corp. designs, engineers, manufactures, and markets ride dynamics products worldwide. The company offers mid-end and high-end front fork and rear suspension products for mountain bikes, road bikes, and e-bikes; and powered vehicle products for side-by-side vehicles, on-road vehicles with and without off-road capabilities, off-road vehicles and trucks, all-terrain vehicles, snowmobiles, and specialty vehicles and applications, such as military, motorcycles, and commercial trucks. It also provides mountain and road bike wheels, and other performance cycling components, including cranks, chain rings, pedals, bars, stems, and seat posts, as well as sells aftermarket products to dealers and distributors. The company offers powered vehicles under the FOX, BDS Suspension, Zone Offroad, JKS Manufacturing, RT Pro UTV, 4x4 Posi-Lok, Ridetech, Tuscany, Outside Van, and SCA brands; and mountain bikes and road bikes under the FOX, Race Face, Easton Cycling, and Marzocchi brands. Fox Factory Holding Corp. was incorporated in 2007 and is headquartered in Duluth, Georgia.",
    "ceo": "Mr. Michael C. Dennison",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "4400",
    "phone": "831 274 6500",
    "address": "2055 Sugarloaf Circle",
    "city": "Duluth",
    "state": "GA",
    "zip": "30097",
    "dcfDiff": 5.70872,
    "dcf": 108.571,
    "image": "https://financialmodelingprep.com/image-stock/FOXF.png",
    "ipoDate": "2013-08-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]