[
  {
    "symbol": "FRFHF",
    "price": 750.1,
    "beta": 0.908128,
    "volAvg": 6722,
    "mktCap": 18549147890,
    "lastDiv": 10,
    "range": "439.8-765.0",
    "changes": -2.89,
    "companyName": "Fairfax Financial Holdings Limited",
    "currency": "USD",
    "cik": "0000915191",
    "isin": null,
    "cusip": "303901102",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.fairfax.ca",
    "description": "Fairfax Financial Holdings Limited, through its subsidiaries, provides property and casualty insurance and reinsurance, and investment management services in the United States, Canada, Asia, and internationally. The company operates through Insurance and Reinsurance, Run-off, and Non-Insurance Companies segments. It insures against losses to property from fire, explosion, earthquake, windstorm, flood, boiler explosion, machinery breakdown, and construction defects, as well as underwrites automobile, commercial and personal property, and crop insurance. The company also offers workers' compensation, employer's liability, accident and health, medical malpractice, professional liability, and umbrella coverage insurance products; marine, aerospace, surety risk, and other risks and liabilities insurance products; and reinsurance products. In addition, it retails home improvement goods, toys and baby products, golf equipment, sports apparel and accessories, housewares and home décors, and tableware and gifts; invests in retail business; and owns and operates holiday resorts. Further, the company provides integrated travel and travel-related financial services; originates, processes, and distributes pulses and staple foods; creates, produces, and distributes entertainment content; and provision of pet medical insurance and database services, as well as media and marketing solutions. The company was formerly known as Markel Financial Holdings Limited and changed its name to Fairfax Financial Holdings Limited in 1987. Fairfax Financial Holdings Limited was incorporated in 1951 and is headquartered in Toronto, Canada.",
    "ceo": "Mr. V. Prem Watsa",
    "sector": "Financial Services",
    "country": "CA",
    "fullTimeEmployees": "47040",
    "phone": "416 367 4941",
    "address": "95 Wellington Street West",
    "city": "Toronto",
    "state": "ON",
    "zip": "M5J 2N7",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FRFHF.png",
    "ipoDate": "2002-12-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]