[
  {
    "symbol": "FRRVY",
    "price": 31.1,
    "beta": 0.88659,
    "volAvg": 6182,
    "mktCap": 23429091607,
    "lastDiv": 4.581602999999999,
    "range": "21.9-33.57",
    "changes": -0.24,
    "companyName": "Ferrovial, S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US3154371039",
    "cusip": "315437103",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Infrastructure Operations",
    "website": "https://www.ferrovial.com",
    "description": "Ferrovial, S.A., together with its subsidiaries, operates as an infrastructure and mobility operator in the United States, Poland, Spain, the United Kingdom, Canada, and internationally. The company engages in the design and construction of various public and private works; and development, finance, and operation of toll roads. Its construction activities include highways, tunnels, railways, bridges and viaducts, airports, intelligent toll systems, port and airport infrastructures, buildings, energy restoration, aqueducts, water treatment plants, desalination plants, digesters, thermal drying plants, chimneys and silos, caissons, storage tanks, solar power towers, oil facilities, and other construction. The company is also involved in the operation and maintenance services of urban and industrial waste water treatment plants, and water treatment and desalination plants. In addition, it develops, manufactures, and markets asphalt and bitumen products; develops, finances, and operates airports; provides integrated solutions for the development and management of electrical transmission networks; provides mobility services, including ZITY, an electric carsharing service application; undertakes engineering works; and sells hydraulic equipment. The company was founded in 1952 and is based in Madrid, Spain.",
    "ceo": "Mr. Ignacio Madridejos Fernandez",
    "sector": "Industrials",
    "country": "ES",
    "fullTimeEmployees": "24191",
    "phone": "34 91 586 25 00",
    "address": "Calle Príncipe de Vergara 135",
    "city": "Madrid",
    "state": null,
    "zip": "28002",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FRRVY.png",
    "ipoDate": "2010-06-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]