[
  {
    "symbol": "FRTAF",
    "price": 25,
    "beta": 0.814559,
    "volAvg": 4,
    "mktCap": 2972525000,
    "lastDiv": 1.82,
    "range": "20.24-26.0",
    "changes": 0,
    "companyName": "freenet AG",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.freenet-group.de",
    "description": "freenet AG provides telecommunications, radio and multimedia, mobile communications, mobile Internet, and digital lifestyle services in Germany. It provides a portfolio of services and products primarily in the areas of mobile voice and data services. The Mobile Communications segment offers mobile communications services, such as marketing of mobile communications services, which include voice and data services from the mobile communications network operators; sells and distributes mobile communications devices, as well as offers additional services for mobile data communications and digital lifestyle; and planning, construction, installation, and maintenance services for WiFi networks. The TV and Media segment provides services to end users in the field of DVB-T2 and IPTV; and planning, project management, installation, operation, service, and marketing services for broadcast-related solutions for business clients in the radio and media sectors. The Other/Holding segment offers portal services, such as e-commerce/advertising services; payment services; various digital products and entertainment formats for downloading and displaying, as well as use on mobile devices; communication development solutions, IT solutions, and other services; and voice and data services. The company provides its services under the mobilcom debitel, GRAVIS, MEDIA BROADCAST, klarmobile.de, freenet ENERGY, vitrado.de, FUNK, freenet BASICS, freenet MOBILE, freenet VIDEO, freenet.de, freenet FLEX, freenet TV, waipu.tv, CARMADA, The Cloud, and freenet Business brands. It operates approximately 520 mobilcom-debitel shops and 40 GRAVIS stores. The company sells its products through approximately 400 electronics stores, as well as online platforms. freenet AG was founded in 2005 and is headquartered in Büdelsdorf, Germany.",
    "ceo": "Mr. Christoph  Vilanek",
    "sector": "Communication Services",
    "country": "DE",
    "fullTimeEmployees": "3675",
    "phone": "49 4331 69 1000",
    "address": "Hollerstrasse 126",
    "city": "Büdelsdorf",
    "state": null,
    "zip": "24782",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FRTAF.png",
    "ipoDate": "2014-01-15",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]