[
  {
    "symbol": "FSK",
    "price": 19.02,
    "beta": 1.464788,
    "volAvg": 992291,
    "mktCap": 5326855016,
    "lastDiv": 2.8,
    "range": "16.7-22.57",
    "changes": 0.13,
    "companyName": "FS KKR Capital Corp.",
    "currency": "USD",
    "cik": "0001422183",
    "isin": "US3026352068",
    "cusip": "302635206",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.fskkradvisor.com",
    "description": "FS KKR Capital Corp. is a business development company specializing in investments in debt securities. It provides customized credit solutions to private middle market U.S. companies. It invest primarily in the senior secured debt and, to a lesser extent, the subordinated debt of private middle market U.S. companies. It seeks to purchase interests in loans through secondary market transactions or directly from the target companies as primary market investments. It also seeks to invest in first lien senior secured loans, second lien secured loans and, to a lesser extent, subordinated loans, or mezzanine loans. In connection with the debt investments, the firm also receives equity interests such as warrants or options as additional consideration. It also seek to purchase minority interests in the form of common or preferred equity in our target companies, either in conjunction with one of the debt investments or through a co-investment with a financial sponsor. Additionally, on an opportunistic basis, the fund may also invest in corporate bonds and similar debt securities. The fund does not seek to invest in start-up companies, turnaround situations, or companies with speculative business plans. It seeks to invest in small and middle-market companies based in United States. The fund seeks to invest in firms with annual revenue between $10 million to $2.5 billion. It focus on providing customized one-stop credit solutions to private upper middle market companies with annual EBITDA of $50 million to $100 million at the time of investment. It seeks to exit from securities by selling them in a privately negotiated over- the- counter market. For any investments that are not able to be sold within the secondary market, the firm seeks to exit such investments through repayment, an initial public offering of equity securities, merger, sale or recapitalization.",
    "ceo": "Mr. Michael Craig Forman J.D.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": null,
    "phone": "215 220 6651",
    "address": "201 Rouse Boulevard",
    "city": "Philadelphia",
    "state": "PA",
    "zip": "19112",
    "dcfDiff": 74.9092,
    "dcf": 94.7692,
    "image": "https://financialmodelingprep.com/image-stock/FSK.png",
    "ipoDate": "2014-04-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]