[
  {
    "symbol": "FSLY",
    "price": 15.68,
    "beta": 1.2954,
    "volAvg": 3144996,
    "mktCap": 1991360000,
    "lastDiv": 0,
    "range": "7.15-18.28",
    "changes": 0.38,
    "companyName": "Fastly, Inc.",
    "currency": "USD",
    "cik": "0001517413",
    "isin": "US31188V1008",
    "cusip": "31188V100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.fastly.com",
    "description": "Fastly, Inc. operates an edge cloud platform for processing, serving, and securing its customer's applications in the United States, the Asia Pacific, Europe, and internationally. The edge cloud is a category of Infrastructure as a Service that enables developers to build, secure, and deliver digital experiences at the edge of the internet. It is a programmable platform designed for web and application delivery. The company offers Compute@Edge; developer hub that includes solution library patterns and recipes, API and language references, change logs, and Fastly Fiddle solutions; device detection and geolocation, edge dictionaries, edge access control lists, and edge authentication services; full site delivery services, such as dynamic site acceleration, origin shield, instant purge, surrogate keys, real-time logging and stats, cloud optimizer, programmatic control, edge databases, content compression, reliability, and modern protocols and performance services; and streaming solutions and services, including live streaming, media shield, and origin connect. It also provides edge security solutions, such as DDoS protection and cloud, edge web application firewall (WAF), transport layer security (TLS), platform TLS, and compliance services; unified web application and API protection solutions that includes runtime self-application protection, advanced rate limiting, API and ATO protection, account takeover protection, bot protection, and next generation WAF. In addition, the company offers edge applications, such as load balancers and image optimizers; video on demand; and managed edge delivery services. It serves customers operating in digital publishing, media and entertainment, technology, online retail, travel and hospitality, and financial services industries. The company was formerly known as SkyCache, Inc. and changed its name to Fastly, Inc. in May 2012. Fastly, Inc. was incorporated in 2011 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Todd  Nightingale",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1112",
    "phone": "844 432 7859",
    "address": "475 Brannan Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94107",
    "dcfDiff": 0.719033,
    "dcf": 9.83097,
    "image": "https://financialmodelingprep.com/image-stock/FSLY.png",
    "ipoDate": "2019-05-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]