[
  {
    "symbol": "FSNUY",
    "price": 6.81,
    "beta": 1.082375,
    "volAvg": 34764,
    "mktCap": 15342589609,
    "lastDiv": 0.25,
    "range": "4.79-7.97",
    "changes": 0.11,
    "companyName": "Fresenius SE & Co. KGaA",
    "currency": "USD",
    "cik": null,
    "isin": "US35804M1053",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Medical Care Facilities",
    "website": "https://www.fresenius.com",
    "description": "Fresenius SE & Co. KGaA, a health care company, provides products and services for dialysis, hospitals, and outpatient medical care. It operates through four segments: Fresenius Medical Care, Fresenius Kabi, Fresenius Helios, and Fresenius Vamed. The Fresenius Medical Care segment offers products and services for patients with chronic kidney failure. This segment provides dialyzers, hemodialysis machines, and related disposable products, as well as dialysis-related services. The Fresenius Kabi segment engages in the therapy and care of therapy and care ill patients. This segment offers IV drugs, including intravenously administered generic drugs for oncology, anesthetics, analgesics, anti-infectives, and critical care; parenteral and enteral nutrition products; infusion solutions and blood volume substitutes for infusion therapy; biosimilars, a biological medicine for autoimmune and oncology diseases; medical devices and disposal used to administer IV generic drugs, infusion therapies, and clinical nutrition products; and transfusion products for collection of blood components and corporeal therapies. The Fresenius Helios segment operates 90 hospitals, approximately 130 outpatient clinics, and 6 prevention centers in Germany; and 49 hospitals, 88 outpatient clinics, and approximately 300 risk prevention centers in Spain. This segment also provides services in the field of fertility treatments through 33 clinics and additional 39 sites across 10 countries on 3 continents. The Fresenius Vamed segment manages projects and offers services for hospitals and other health care facilities. This segment provides project development, planning, and turnkey construction services, as well as maintenance, technical management, and operational management services. The company was formerly known as Fresenius SE and changed its name to Fresenius SE & Co. KGaA in January 2011. Fresenius SE & Co. KGaA was founded in 1912 and is headquartered in Bad Homburg vor der Höhe, Germany.",
    "ceo": "Mr. Michael  Sen",
    "sector": "Healthcare",
    "country": "DE",
    "fullTimeEmployees": "313812",
    "phone": "49 6172 608 2487",
    "address": "Else-Kroener-Strasse 1",
    "city": "Bad Homburg vor der Höhe",
    "state": null,
    "zip": "61352",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FSNUY.png",
    "ipoDate": "2012-05-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]