[
  {
    "symbol": "FSS",
    "price": 63.05,
    "beta": 1.067957,
    "volAvg": 290841,
    "mktCap": 3839007315,
    "lastDiv": 0.4,
    "range": "33.99-63.44",
    "changes": 0.03,
    "companyName": "Federal Signal Corporation",
    "currency": "USD",
    "cik": "0000277509",
    "isin": "US3138551086",
    "cusip": "313855108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Pollution & Treatment Controls",
    "website": "https://www.federalsignal.com",
    "description": "Federal Signal Corporation, together with its subsidiaries, designs, manufactures, and supplies a suite of products and integrated solutions for municipal, governmental, industrial, and commercial customers in the United States, Canada, Europe, and internationally. It operates through Environmental Solutions Group, and Safety and Security Systems Group. The Environmental Solutions Group segment offers a range of street sweepers, safe-digging trucks ,sewer cleaners, industrial vacuum loaders, vacuum, and hydro-excavation trucks; road-marking, line-removal and waterblasting equipment, dump truck bodies, trailers, and metal extraction support equipment under the Elgin, Vactor, Guzzler, TRUVAC, Westech, Jetstream, Mark Rite Lines, Ox Bodies, Crysteel, J-Craft, Duraclass, Rugby, Travis, OSW, NTE, WTB, Ground Force, Bucks, and Switch-N-Go brand names. It also offers refuse and recycling collection vehicles, camera systems, ice resurfacing equipment, and snow-removal equipment, as well as safety, and security systems. In addition, this segment engages in the sale of parts, service and repair, equipment rental, and training activities. The Safety and Security Systems Group segment provides systems and products for community alerting, emergency vehicles, first responder interoperable communications, and industrial communications. Its products include vehicle lightbars and sirens, industrial signaling equipment, public warning systems, general alarm systems, and public address systems. This segment sells its products under the Federal Signal, Federal Signal VAMA, and Victor brand names. The company sells its products through wholesaler, distributor, independent manufacturer representative, original equipment manufacturer, and direct sales force, as well as independent foreign distributor. Federal Signal Corporation was founded in 1901 and is headquartered in Oak Brook, Illinois.",
    "ceo": "Ms. Jennifer L. Sherman",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "4100",
    "phone": "630 954 2000",
    "address": "1415 West 22nd Street",
    "city": "Oak Brook",
    "state": "IL",
    "zip": "60523",
    "dcfDiff": 3.6017,
    "dcf": 49.8583,
    "image": "https://financialmodelingprep.com/image-stock/FSS.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]