[
  {
    "symbol": "FSV",
    "price": 148.85,
    "beta": 1.004329,
    "volAvg": 56303,
    "mktCap": 6632577380,
    "lastDiv": 0.9,
    "range": "112.44-151.38",
    "changes": -0.48,
    "companyName": "FirstService Corporation",
    "currency": "USD",
    "cik": "0001637810",
    "isin": "CA33767E2024",
    "cusip": "33767E202",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Real Estate Services",
    "website": "https://www.firstservice.com",
    "description": "FirstService Corporation, together with its subsidiaries, provides residential property management and other essential property services to residential and commercial customers in the United States and Canada. The company operates in two segments, FirstService Residential and FirstService Brands. The FirstService Residential segment offers property management services for private residential communities, such as condominiums, co-operatives, homeowner associations, master-planned communities, active adult and lifestyle communities, and various other residential developments. This segment also provides a range of ancillary services, including on-site staffing for building engineering and maintenance, full-service swimming pool and amenity management, and security and concierge/front desk; and financial services comprising cash management, other banking transaction-related, and specialized property insurance brokerage. In addition, this segment offers energy management solutions and advisory services, and resale processing services. The FirstService Brands segment operates and provides essential property services to residential and commercial customers, through five franchise networks; and company-owned locations, including 20 California Closets, 12 Paul Davis Restoration, and 1 CertaPro Painters locations. It provides residential and commercial restoration, painting, and floor coverings design and installation services; custom-designed and installed closet, and home storage solutions; home inspection services; and fire protection and related services. This segment offers its services primarily under the Paul Davis Restoration, First Onsite Restoration, Century Fire Protection, CertaPro Painters, California Closets, Pillar to Post Home Inspectors, and Floor Coverings International brand names. FirstService Corporation was founded in 1989 and is headquartered in Toronto, Canada.",
    "ceo": "Mr. D. Scott Patterson",
    "sector": "Real Estate",
    "country": "CA",
    "fullTimeEmployees": "27000",
    "phone": "14169609500",
    "address": "1255 Bay Street",
    "city": "Toronto",
    "state": "ON",
    "zip": "M5R 2A9",
    "dcfDiff": 14.2889,
    "dcf": 128.651,
    "image": "https://financialmodelingprep.com/image-stock/FSV.png",
    "ipoDate": "2015-06-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]