[
  {
    "symbol": "FTAI",
    "price": 29.96,
    "beta": 1.911267,
    "volAvg": 1385177,
    "mktCap": 2987874848,
    "lastDiv": 1.2,
    "range": "14.29-30.49",
    "changes": 0.66,
    "companyName": "Fortress Transportation and Infrastructure Investors LLC",
    "currency": "USD",
    "cik": "0001590364",
    "isin": "US34960P1012",
    "cusip": "34960P101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Rental & Leasing Services",
    "website": "https://www.ftandi.com",
    "description": "Fortress Transportation and Infrastructure Investors LLC owns and acquires infrastructure and related equipment for the transportation of goods and people in Africa, Asia, Europe, North America, and South America. It operates through three segments: Aviation Leasing, Jefferson Terminal, and Ports and Terminals. The Aviation Leasing segment leases aircraft and aircraft engines. As of December 31, 2020, this segment owned and managed 264 aviation assets, including 78 commercial aircraft and 186 engines. The Jefferson Terminal segment engages in the development of a multi-modal crude oil and refined products handling terminal in Beaumont, Texas; and ownership of various other assets for the transportation and processing of crude oil and related products. The Ports and Terminals segment operates Repauno, a 1,630 acre deep-water port located along the Delaware River; and Long Ridge, which is a 1,660 acre multi-modal port located along the Ohio River. The company also owns and leases offshore energy equipment and shipping containers. It serves operators of transportation and infrastructure networks comprising airlines, offshore energy service providers, energy providers, and shipping lines. The company is externally managed by FIG LLC, an affiliate of Fortress Investment Group LLC. Fortress Transportation and Infrastructure Investors LLC was founded in 2011 and is headquartered in New York, New York.",
    "ceo": "Mr. Joseph P. Adams Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "40",
    "phone": "212 798 6100",
    "address": "1345 Avenue of the Americas",
    "city": "New York",
    "state": "NY",
    "zip": "10105",
    "dcfDiff": 2.86582,
    "dcf": 19.7242,
    "image": "https://financialmodelingprep.com/image-stock/FTAI.png",
    "ipoDate": "2015-05-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]