[
  {
    "symbol": "FTI",
    "price": 15.9,
    "beta": 1.755281,
    "volAvg": 5388537,
    "mktCap": 7020851827,
    "lastDiv": 2.1324389999999998,
    "range": "5.48-16.03",
    "changes": 0.03,
    "companyName": "TechnipFMC plc",
    "currency": "USD",
    "cik": "0001681459",
    "isin": "GB00BDSFG982",
    "cusip": "G87110105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Equipment & Services",
    "website": "https://www.technipfmc.com",
    "description": "TechnipFMC plc engages in the oil and gas projects, technologies, and systems and services businesses in Europe, Central Asia, North and Latin America, the Asia Pacific, Africa, and the Middle East. The Subsea segment engages in the design, engineering, procurement, manufacturing, fabrication, installation, and life of field services for subsea systems, subsea field infrastructure, and subsea pipe systems used in oil and gas production and transportation. It provides subsea production and processing systems; subsea umbilicals, risers, and flowlines; vessels; and Subsea Studio for optimizing the development, execution, and operation of current and future subsea fields. This segment also offers well and asset services; research, engineering, manufacturing, and supply chain; and product management services. The Surface Technologies segment designs, manufactures, and services products and systems used in land and shallow water exploration and production of crude oil and natural gas. This segment offers drilling and completion systems; surface wellheads and production trees systems; iComplete, a digitally enabled pressure control system; fracturing tree and manifold systems; pressure pumping; well service pumps; well control, safety and integrity systems, multiphase meter modules, in-line separation and processing systems, and standard pumps; flowback and well testing services; skid systems; automation and digital systems; and flow measurement and automation solutions. It also offers planning, testing and installation, commissioning, operations, replacement and upgrade, maintenance, storage, preservation, intervention, integrity, decommissioning, and abandonment; and supplies flexible lines and flowline products and services. TechnipFMC plc has a strategic alliance with Talos Energy Inc. to develop and deliver technical and commercial solutions to Carbon Capture and Storage projects. The company was founded in 1884 and is based in Newcastle Upon Tyne, the United Kingdom.",
    "ceo": "Mr. Douglas J. Pferdehirt",
    "sector": "Energy",
    "country": "GB",
    "fullTimeEmployees": "20301",
    "phone": "44 19 1295 0303",
    "address": "Hadrian House",
    "city": "Newcastle upon Tyne",
    "state": null,
    "zip": "EC4M 8AP",
    "dcfDiff": 0.994308,
    "dcf": 14.7443,
    "image": "https://financialmodelingprep.com/image-stock/FTI.png",
    "ipoDate": "2001-06-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]