[
  {
    "symbol": "FTS",
    "price": 42.43,
    "beta": 0.195286,
    "volAvg": 579112,
    "mktCap": 20557335000,
    "lastDiv": 1.67,
    "range": "34.76-48.23",
    "changes": -0.38,
    "companyName": "Fortis Inc.",
    "currency": "USD",
    "cik": "0001666175",
    "isin": "CA3495531079",
    "cusip": "349553107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.fortisinc.com",
    "description": "Fortis Inc. operates as an electric and gas utility company in Canada, the United States, and the Caribbean countries. It generates, transmits, and distributes electricity to approximately 438,000 retail customers in southeastern Arizona; and 100,000 retail customers in Arizona's Mohave and Santa Cruz counties with an aggregate capacity of 3,485 megawatts (MW), including 53 MW of solar capacity and 252 MV of wind capacity. The company also sells wholesale electricity to other entities in the western United States; owns gas-fired and hydroelectric generating capacity totaling 65 MW; and distributes natural gas to approximately 1,065,000 residential, commercial, and industrial customers in British Columbia, Canada. In addition, it owns and operates the electricity distribution system that serves approximately 577,000 customers in southern and central Alberta; owns 4 hydroelectric generating facilities with a combined capacity of 225 MW; and provides operation, maintenance, and management services to five hydroelectric generating facilities. Further, the company distributes electricity in the island portion of Newfoundland and Labrador with an installed generating capacity of 143 MW; and on Prince Edward Island with a generating capacity of 130 MW. Additionally, it provides integrated electric utility service to approximately 68,000 customers in Ontario; approximately 272,000 customers in Newfoundland and Labrador; approximately 32,000 customers on Grand Cayman, Cayman Islands; and approximately 16,000 customers on certain islands in Turks and Caicos. The company also holds long-term contracted generation assets in Belize consisting of 3 hydroelectric generating facilities with a combined capacity of 51 MW; and the Aitken Creek natural gas storage facility. It also owns and operates approximately 90,200 circuit Kilometers (km) of distribution lines; and approximately 50,500 km of natural gas pipelines. Fortis Inc. was founded in 1885 and is headquartered in St. John's, Canada.",
    "ceo": "Mr. David Gerard Hutchens",
    "sector": "Utilities",
    "country": "CA",
    "fullTimeEmployees": "9200",
    "phone": "17097372800",
    "address": "Fortis Place",
    "city": "Saint John's",
    "state": "NF",
    "zip": "A1E 0E4",
    "dcfDiff": 1.2721,
    "dcf": 39.8479,
    "image": "https://financialmodelingprep.com/image-stock/FTS.png",
    "ipoDate": "2010-01-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]