[
  {
    "symbol": "FUJIY",
    "price": 59.535,
    "beta": 0.307662,
    "volAvg": 21182,
    "mktCap": 23878892197,
    "lastDiv": 0.85,
    "range": "44.3-64.49",
    "changes": -0.075,
    "companyName": "FUJIFILM Holdings Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US35958N1072",
    "cusip": "359586302",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Business Equipment & Supplies",
    "website": "https://holdings.fujifilm.com",
    "description": "FUJIFILM Holdings Corporation develops, manufactures, sells, and services imaging, healthcare, materials, and business innovation solutions worldwide. The company's Healthcare segment provides products and services, such as medical devices, biomedical contract development and manufacturing organization, pharmaceutical, regenerative medicine, and cosmetics and supplements in the three areas of prevention, diagnosis, and treatment. Its Materials segment offers inkjet digital presses and printing plates for printing industries, as well as industrial inkjet-related products and inkjet heads; storage media and archiving services to save and manage digital data volumes; and materials for industrials, including display and touch panel, semiconductor and image sensor, and functional film materials. The company's Business Innovation segment provides devices and services used in offices, including digital multifunction devices, printers, software, and cloud services; workflow solutions for printing companies and others in the graphical communications sector; and document services tailored to diverse business formats and roles, including system integration, business process outsourcing, and others. Its Imaging segment offers color films, instant cameras, developing and printing systems, color papers, and photo printing services; and TV and cinema lenses, surveillance cameras, industrial lenses for production line inspection, and projectors. FUJIFILM Holdings Corporation was incorporated in 1934 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Teiichi  Goto",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "75474",
    "phone": "81 3 6271 1111",
    "address": "7-3, Akasaka 9-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "107-0052",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FUJIY.png",
    "ipoDate": "1981-03-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]