[
  {
    "symbol": "FUL",
    "price": 64.64,
    "beta": 1.524647,
    "volAvg": 307533,
    "mktCap": 3479487168,
    "lastDiv": 0.82,
    "range": "57.36-81.41",
    "changes": 0.28,
    "companyName": "H.B. Fuller Company",
    "currency": "USD",
    "cik": "0000039368",
    "isin": "US3596941068",
    "cusip": "359694106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.hbfuller.com",
    "description": "H.B. Fuller Company, together with its subsidiaries, formulates, manufactures, and markets adhesives, sealants, coatings, polymers, tapes, encapsulants, additives, and other specialty chemical products worldwide. The company operates through three segments: Hygiene, Health and Consumable Adhesives; Engineering Adhesives; and Construction Adhesives. The Hygiene, Health and Consumable Adhesives segment produces and supplies specialty industrial adhesives such as, thermoplastic, thermoset, reactive, and water-based and solvent-based products for applications in various markets, including food and beverage containers, flexible packaging, consumer goods, package integrity and re-enforcement, and non-durable goods; corrugation, folding carton, tape and label, paper converting, envelopes, books, multi-wall bags, sacks, and tissue and towel; disposable diapers, feminine care, and medical garments; and health and beauty. The Engineering Adhesives segment produces and supplies high performance industrial adhesives such as reactive, light cure, two-part liquids, silicone, polyurethane, film, and fast cure products to the appliances and filters, windows, doors and wood flooring, and textile, transportation, electronics, medical, clean energy, aerospace and defense, appliance, heavy machinery, and insulating glass markets. The Construction Adhesives segment provides products used for tile setting, commercial roofing, heating, ventilation, and air conditioning and insulation applications, as well as caulks and sealants for the consumer market and professional trade. The company sells its products directly through distributors and retailers. H.B. Fuller Company was founded in 1887 and is headquartered in Saint Paul, Minnesota.",
    "ceo": "Ms. Celeste Beeks Mastin",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "7000",
    "phone": "651-236-5900",
    "address": "1200 Willow Lake Boulevard",
    "city": "Saint Paul",
    "state": "MN",
    "zip": "55110-5101",
    "dcfDiff": 9.78755,
    "dcf": 78.1275,
    "image": "https://financialmodelingprep.com/image-stock/FUL.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]