[
  {
    "symbol": "FULT",
    "price": 12.15,
    "beta": 0.777112,
    "volAvg": 1931461,
    "mktCap": 2010691253,
    "lastDiv": 0.64,
    "range": "9.64-18.91",
    "changes": -0.06,
    "companyName": "Fulton Financial Corporation",
    "currency": "USD",
    "cik": "0000700564",
    "isin": "US3602711000",
    "cusip": "360271100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.fultonbank.com",
    "description": "Fulton Financial Corporation operates as a financial holding company that provides consumer and commercial banking products and services. It accepts various checking accounts and savings deposit products, certificates of deposit, and individual retirement accounts. The company also offers secured consumer loans, including home equity loans and lines of credit, automobile loans, personal lines of credit, and checking account overdraft protection; construction and jumbo residential mortgage loans; and commercial lending products comprising commercial real estate, commercial and industrial, and construction loans, as well as equipment lease financing loans. In addition, it provides letters of credit, cash management services, and traditional deposit products; and wealth management services, including investment management, trust, brokerage, insurance, and investment advisory services. Further, the company owns passive investments, as well as trust preferred securities; and sells various life insurance products. It provides its products and services through traditional financial center banking, as well as through a network of automated teller machines, telephone banking, mobile banking, and online banking. The company operated branches in Pennsylvania, Maryland, Delaware, New Jersey, and Virginia. Fulton Financial Corporation was incorporated in 1882 and is headquartered in Lancaster, Pennsylvania.",
    "ceo": "Mr. Curtis J. Myers",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3300",
    "phone": "717 291 2411",
    "address": "One Penn Square",
    "city": "Lancaster",
    "state": "PA",
    "zip": "17604",
    "dcfDiff": 3.16111,
    "dcf": 19.3411,
    "image": "https://financialmodelingprep.com/image-stock/FULT.png",
    "ipoDate": "1985-09-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]