[
  {
    "symbol": "FUN",
    "price": 39.88,
    "beta": 1.469014,
    "volAvg": 206172,
    "mktCap": 2046948676,
    "lastDiv": 1.2,
    "range": "37.58-47.95",
    "changes": -0.64,
    "companyName": "Cedar Fair, L.P.",
    "currency": "USD",
    "cik": "0000811532",
    "isin": "US1501851067",
    "cusip": "150185106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Leisure",
    "website": "https://www.cedarfair.com",
    "description": "Cedar Fair, L.P. owns and operates amusement and water parks, and complementary resort facilities in the United States and Canada. Its amusement parks include Cedar Point located on Lake Erie between Cleveland and Toledo in Sandusky, Ohio; Knott's Berry Farm near Los Angeles, California; Canada's Wonderland near Toronto, Ontario; Kings Island near Cincinnati, Ohio; Carowinds in Charlotte, North Carolina; Kings Dominion situated near Richmond, Virginia; California's Great America located in Santa Clara, California; Dorney Park in Pennsylvania; Worlds of Fun located in Kansas City, Missouri; Valleyfair situated near Minneapolis/St. Paul, Minnesota; Michigan's Adventure situated near Muskegon, Michigan; Schlitterbahn Waterpark & Resort New Braunfels in New Braunfels, Texas; and Schlitterbahn Waterpark Galveston in Galveston, Texas. The company also owns and operates the Castaway Bay Indoor Waterpark Resort, Hotel Breakers, Cedar Point's Express Hotel, and Sawmill Creek Resort. As of December 31, 2021, the company operated 13 amusement parks. The company was founded in 1983 and is headquartered in Sandusky, Ohio.",
    "ceo": "Mr. Richard A. Zimmerman",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "4400",
    "phone": "419 626 0830",
    "address": "One Cedar Point Drive",
    "city": "Sandusky",
    "state": "OH",
    "zip": "44870-5259",
    "dcfDiff": 4.66984,
    "dcf": 46.8098,
    "image": "https://financialmodelingprep.com/image-stock/FUN.png",
    "ipoDate": "1987-04-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]