[
  {
    "symbol": "FUPBY",
    "price": 8.95,
    "beta": 0.953639,
    "volAvg": 6854,
    "mktCap": 4893448157,
    "lastDiv": 0.29,
    "range": "5.894-10.64",
    "changes": -0.49,
    "companyName": "Fuchs Petrolub SE",
    "currency": "USD",
    "cik": null,
    "isin": "US35952Q1067",
    "cusip": "35952Q106",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Chemicals",
    "website": "https://www.fuchs.com/group",
    "description": "Fuchs Petrolub SE develops, produces, and sells lubricants and related specialties worldwide. The company offers automotive lubricants, such as biodegradable lubricants, central and mobile hydraulic oils, dry coatings, engine and gear oils, motorcycle/two wheelers, and service fluids, as well as various oils for agriculture sector. It also provides industrial lubricants, including chain lubricants, compressor oils, dry coatings, gear oils, hydraulic oils, machine oils, open gear lubricants, rapidly biodegradable lubricants, refrigeration oils, release agents, slideways oils, industrial oils, textile machine oils, and turbine oils. In addition, the company offers lubricating greases comprising assembly pastes, biodegradable greases, food grade greases, long-life greases, pastes for extreme temperatures, perfluorinated pastes, and wheel bearing greases, as well as gear boxes, greases for central lubricating system, extreme temperature, machine tools, plain and roller bearings, rail vehicles, spray cans or rattle cans, and solid lubricants. Further, it provides metal processing lubricants, including cleaners, corrosion preventives, cutting and grinding, forming lubricants, and quenching oils; and special application lubricants for application equipment, chain, dry coatings, food and beverage, gears, sugar processing, railway traffic, plain and roller bearings, glass manufacturing process, hot forming, maintenance, open gears, pastes, release agents, other specialties, special greases, and wind power plants. Additionally, the company offers open gear and surface coating services. Fuchs Petrolub SE was founded in 1931 and is based in Mannheim, Germany.",
    "ceo": "Mr. Stefan Rudolf Fuchs",
    "sector": "Basic Materials",
    "country": "DE",
    "fullTimeEmployees": "6120",
    "phone": "49 621 3802 0",
    "address": "Friesenheimer Strasse 17",
    "city": "Mannheim",
    "state": null,
    "zip": "68169",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/FUPBY.png",
    "ipoDate": "2015-06-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]