[
  {
    "symbol": "FWRD",
    "price": 104.7,
    "beta": 1.125704,
    "volAvg": 161262,
    "mktCap": 2717865420,
    "lastDiv": 0.96,
    "range": "84.85-117.57",
    "changes": 0.88,
    "companyName": "Forward Air Corporation",
    "currency": "USD",
    "cik": "0000912728",
    "isin": "US3498531017",
    "cusip": "349853101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Integrated Freight & Logistics",
    "website": "https://www.forwardaircorp.com",
    "description": "Forward Air Corporation, together with its subsidiaries, operates as an asset-light freight and logistics company in the United States and Canada. It operates in two segments, Expedited Freight and Intermodal. The Expedited Freight segment provides expedited regional, inter-regional, and national less-than-truckload services; local pick-up and delivery services; and other services, which include final mile, truckload, shipment consolidation and deconsolidation, warehousing, customs brokerage, and other handling. This segment also offers expedited truckload brokerage, dedicated fleet, and high security and temperature-controlled logistics services. The Intermodal segment provides intermodal container drayage services; and contract, and container freight station warehouse and handling services. It serves freight forwarders, third-party logistics companies, integrated air cargo carriers and passenger, passenger and cargo airlines, steamship lines, and retailers. Forward Air Corporation was founded in 1981 and is headquartered in Greeneville, Tennessee.",
    "ceo": "Mr. Thomas  Schmitt",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "4155",
    "phone": "423 636 7000",
    "address": "Building N",
    "city": "Greeneville",
    "state": "TN",
    "zip": "37745",
    "dcfDiff": 5.73076,
    "dcf": 111.291,
    "image": "https://financialmodelingprep.com/image-stock/FWRD.png",
    "ipoDate": "1993-11-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]