[
  {
    "symbol": "G",
    "price": 36.81,
    "beta": 1.22183,
    "volAvg": 1454970,
    "mktCap": 6778598604,
    "lastDiv": 0.55,
    "range": "35.75-48.85",
    "changes": -0.05,
    "companyName": "Genpact Limited",
    "currency": "USD",
    "cik": "0001398659",
    "isin": "BMG3922B1072",
    "cusip": "G3922B107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.genpact.com",
    "description": "Genpact Limited provides business process outsourcing and information technology (IT) services in India, rest of Asia, North and Latin America, and Europe. It operates through three segments: Banking, Capital Markets and Insurance; Consumer Goods, Retail, Life Sciences and Healthcare; and High Tech, Manufacturing and Services. The company offers CFO advisory services; and environmental, social, and governance (ESG) services, such as data management, carbon accounting, human rights assessment, sustainability diligence, and ESG reporting. It also provides finance and accounting services, which include accounts payable, such as document management, invoice processing, approval and resolution management, and travel and expense processing; invoice-to-cash services, including customer master data management, credit and contract management, fulfillment, billing, collections, and dispute management services; record to report services comprising accounting, treasury, tax, product cost accounting, and closing and reporting services; financial planning and analysis consisting of budgeting, forecasting, and business performance reporting; and enterprise risk and compliance services, including operational risks and controls. In addition, the company provides supply chain advisory services, and after-sales services; sourcing and procurement services comprising direct and indirect strategic sourcing, category management, spend analytics, procurement operation, and master data management; and sales and commercial services, including campaign, order, and dispute management, lead generation, pricing, and promotion optimization. Further, it offers IT services, which comprise end-user computing support, infrastructure management, application production support, and database management services; and transformation services that include digital solutions, consulting services, and analytics services and solutions. The company was founded in 1997 and is based in Hamilton, Bermuda.",
    "ceo": "Mr. Nallicheri Vaidyanathan Tyagarajan",
    "sector": "Technology",
    "country": "BM",
    "fullTimeEmployees": "119100",
    "phone": "14412952244",
    "address": "Canon's, Court",
    "city": "Hamilton",
    "state": null,
    "zip": "HM 12",
    "dcfDiff": 1.15421,
    "dcf": 48.0542,
    "image": "https://financialmodelingprep.com/image-stock/G.png",
    "ipoDate": "2007-08-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]