[
  {
    "symbol": "GBCI",
    "price": 30.86,
    "beta": 0.776408,
    "volAvg": 831346,
    "mktCap": 3421448200,
    "lastDiv": 1.32,
    "range": "26.77-59.7",
    "changes": -0.41,
    "companyName": "Glacier Bancorp, Inc.",
    "currency": "USD",
    "cik": "0000868671",
    "isin": "US37637Q1058",
    "cusip": "37637Q105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.glacierbancorp.com",
    "description": "Glacier Bancorp, Inc. operates as the bank holding company for Glacier Bank that provides commercial banking services to individuals, small to medium-sized businesses, community organizations, and public entities in the United States. It offers non-interest bearing deposit and interest bearing deposit accounts, such as negotiable order of withdrawal and demand deposit accounts, savings accounts, money market deposit accounts, fixed rate certificates of deposit, negotiated-rate jumbo certificates, and individual retirement accounts. The company also provides construction and permanent loans on residential real estate; consumer land or lot acquisition loans; unimproved land and land development loans; and residential builder guidance lines comprising pre-sold and spec-home construction, and lot acquisition loans. In addition, it offers commercial real estate loans to purchase, construct, and finance commercial real estate properties; consumer loans secured by real estate, automobiles, or other assets; paycheck protection program loans; home equity loans consisting of junior lien mortgages, and first and junior lien lines of credit secured by owner-occupied 1-4 family residences; and agriculture loans. Further, the company provides mortgage origination and loan servicing services. It has 224 locations, including 188 branches and 36 loan or administration offices in 75 counties within 8 states comprising Montana, Idaho, Utah, Washington, Wyoming, Colorado, Arizona, and Nevada. The company was founded in 1955 and is headquartered in Kalispell, Montana.",
    "ceo": "Mr. Randall M. Chesler",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3390",
    "phone": "406 756 4200",
    "address": "49 Commons Loop",
    "city": "Kalispell",
    "state": "MT",
    "zip": "59901-2679",
    "dcfDiff": 15.8906,
    "dcf": 61.3006,
    "image": "https://financialmodelingprep.com/image-stock/GBCI.png",
    "ipoDate": "1984-03-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]