[
  {
    "symbol": "GDDY",
    "price": 73.74,
    "beta": 0.973239,
    "volAvg": 1346429,
    "mktCap": 11370855480,
    "lastDiv": 0,
    "range": "64.65-85.32",
    "changes": 2.49,
    "companyName": "GoDaddy Inc.",
    "currency": "USD",
    "cik": "0001609711",
    "isin": "US3802371076",
    "cusip": "380237107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.godaddy.com",
    "description": "GoDaddy Inc. engages in the design and development of cloud-based technology products in the United States and internationally. The company provides domain name registration product that enables to engage customers at the initial stage of establishing a digital identity. It also offers shared Website hosting products that provide various applications and products, such as web analytics, Secure Sockets Layer certificates, and WordPress; Website hosting on virtual private servers and virtual dedicated servers products, which allows customers to select the server configuration suited for their applications, requirements, and growth; managed hosting products to set up, monitor, maintain, secure, and patch software and servers for customers; and security products, a suite of tools designed to help secure customers' online presence. In addition, the company provides presence products, such as Websites + Marketing, a do-it-yourself mobile-optimized online tool that enables customers to build websites and e-commerce enabled online stores; a range of marketing tools and services designed to help businesses acquire and engage customers, and create content, as well as search engine optimization that helps customers get their websites found on search sites; and social media management services. Further, it offers business application products, such as Microsoft Office 365, email accounts, email marketing, and Internet-based telephony services; online store capabilities that allows customers to transact business directly on their websites; GoDaddy Payments, a payment facilitator; and point-of-sale (POS) devices, as well as software for POS. The company serves small businesses, individuals, organizations, developers, designers, and domain investors. GoDaddy Inc. was incorporated in 2014 and is headquartered in Tempe, Arizona.",
    "ceo": "Mr. Amanpal Singh Bhutani",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "6875",
    "phone": "480 505 8800",
    "address": "2155 East GoDaddy Way",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85284",
    "dcfDiff": 1.81123,
    "dcf": 80.3888,
    "image": "https://financialmodelingprep.com/image-stock/GDDY.png",
    "ipoDate": "2015-03-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]