[
  {
    "symbol": "GECFF",
    "price": 99.805,
    "beta": 1.116858,
    "volAvg": 15,
    "mktCap": 7368004320,
    "lastDiv": 5.67,
    "range": "68.1-120.75",
    "changes": 0,
    "companyName": "Gecina Société anonyme",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "REIT—Office",
    "website": "https://www.gecina.fr",
    "description": "Gecina operates innovative and sustainable living spaces. The Group owns, manages and develops Europe's leading office portfolio, with nearly 97% located in the Paris Region, and a portfolio of residential assets and student residences, with over 9,000 apartments. These portfolios are valued at 20 billion euros at end-June 2020. Gecina has firmly established its focus on innovation and its human approach at the heart of its strategy to create value and deliver on its purpose: Empowering shared human experiences at the heart of our sustainable spaces. For our 100,000 clients, this ambition is supported by our client-centric brand YouFirst. It is also positioned at the heart of UtilesEnsemble, our label setting out our commitment to the environment, to people and to the quality of life in cities. Gecina is a French real estate investment trust (SIIC) listed on Euronext Paris, and is part of the SBF 120, CAC Next 20, CAC Large 60, Euronext 100, FTSE4Good, DJSI Europe and World, Stoxx Global ESG Leaders and Vigeo indices. In 2020, Gecina was awarded the maximum A rating in the CDP climate change rankings.",
    "ceo": "Mr. Benat  Ortega",
    "sector": "Real Estate",
    "country": "FR",
    "fullTimeEmployees": "478",
    "phone": "33 1 40 40 50 50",
    "address": "16 rue des capucines",
    "city": "Paris",
    "state": null,
    "zip": "75084",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/GECFF.png",
    "ipoDate": "2012-05-15",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]