[
  {
    "symbol": "GEHC",
    "price": 77.19,
    "beta": 0,
    "volAvg": 2968488,
    "mktCap": 35096517012,
    "lastDiv": 0.12,
    "range": "53.0-87.83",
    "changes": 0.12,
    "companyName": "GE HealthCare Technologies Inc.",
    "currency": "USD",
    "cik": "0001932393",
    "isin": null,
    "cusip": null,
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Health Information Services",
    "website": "https://www.gehealthcare.com",
    "description": "GE HealthCare Technologies Inc. engages in the development, manufacture, and marketing of products, services, and complementary digital solutions used in the diagnosis, treatment, and monitoring of patients in the United States, Canada, Europe, the Middle East, Africa, China, Taiwan, Mongolia, Hong Kong, and internationally. The company operates through four segments: Imaging, Ultrasound, Patient Care Solutions, and Pharmaceutical Diagnostics. The Imaging segment offers molecular imaging, computed tomography (CT) scanning, magnetic resonance (MR) imaging, image-guided therapy, and X-ray systems, as well as women's health products. The Ultrasound segment provides screening, diagnosis, treatment, and monitoring of certain diseases through radiology and primary care, women's health, cardiovascular, and point of care and handheld ultrasound solutions, as well as surgical visualization and guidance products. The Patient Care Solutions segment involved in the provision of medical devices, consumable products, services, and digital solutions through patient monitoring, anesthesia delivery and respiratory care, diagnostic cardiology, and maternal infant care products. The Pharmaceutical Diagnostics supplies diagnostic agents, including CT, angiography and X-ray, MR, single-photon emission computed tomography, positron emission tomography, and ultrasound to the radiology and nuclear medicine industry. The segment also provides contrast media pharmaceuticals, administered to a patient prior to certain diagnostic scans to increase the visibility of tissues or structures during imaging exams; and molecular imaging agents, or radiopharmaceuticals, which are molecular tracers labeled with radioisotopes that are injected into a patient prior to a diagnostic imaging scan. The company was incorporated in 2022 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Peter J. Arduini",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "50000",
    "phone": "617 443 3400",
    "address": "500 West Monroe Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60661",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/GEHC.png",
    "ipoDate": "2022-12-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]