[
  {
    "symbol": "GEN",
    "price": 18.27,
    "beta": 1.066901,
    "volAvg": 4439395,
    "mktCap": 11706886316,
    "lastDiv": 0.5,
    "range": "15.45-26.83",
    "changes": -0.19,
    "companyName": "Gen Digital Inc.",
    "currency": "USD",
    "cik": "0000849399",
    "isin": null,
    "cusip": null,
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.gendigital.com",
    "description": "Gen Digital Inc. provides cyber safety solutions for consumers in the United States, Canada, Latin America, Europe, the Middle East, Africa, the Asia Pacific, and Japan. It offers Norton 360, an integrated platform provides extensive cyber safety coverage and a subscription service providing protection for PCs, Macs, and mobile devices against malware, viruses, adware, ransomware, and other online threats on various platforms; and Norton and LifeLock identity theft protection solution that offers monitoring, alerts, and restoration services to its customers. The company also provides Norton Secure VPN solution, which enhances security and online privacy by providing an encrypted data tunnel; Privacy Monitor Assistant, an on-demand, white glove service where agents help members delete personal information from data brokers online; Home Title Protect product that detects fraud and notifies members; and Avira Security, a consumer-focused portfolio of cybersecurity and privacy solutions. It offers Dark Web Monitoring product, which looks for personal information of its Norton 360 members on the Dark Web; and Social Media Monitoring solution that helps to keep customers' social media accounts safer by monitoring them for account takeovers, risky activity, and inappropriate content. The company also provides AntiTrack product, which helps to keep personal information and browsing activity private by blocking trackers and disguising digital fingerprints online; and Online Reputation Management solution that manages online search results, personal branding, and digital privacy. It markets and sells its products and related services through retailers, telecom service providers, hardware original equipment manufacturers, and employee benefit providers, as well as e-commerce platform. The company was formerly known as NortonLifeLock Inc. and changed its name to Gen Digital Inc. in November 2022. Gen Digital Inc. was founded in 1982 and is based in Tempe, Arizona.",
    "ceo": "Mr. Vincent  Pilette",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3700",
    "phone": "650 527 8000",
    "address": "60 East Rio Salado Parkway",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85281",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/GEN.png",
    "ipoDate": "1989-06-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]