[
  {
    "symbol": "GFF",
    "price": 40.04,
    "beta": 1.502464,
    "volAvg": 537880,
    "mktCap": 2290496208,
    "lastDiv": 0.5,
    "range": "25.59-43.74",
    "changes": 0.81,
    "companyName": "Griffon Corporation",
    "currency": "USD",
    "cik": "0000050725",
    "isin": "US3984331021",
    "cusip": "398433102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Conglomerates",
    "website": "https://www.griffon.com",
    "description": "Griffon Corporation, through its subsidiaries, provides consumer and professional, and home and building products in the United States, Europe, Canada, Australia, and internationally. Its Consumer and Professional Products segment manufactures and markets long-handled tools and landscaping products for homeowners and professionals; wood and wire closet organization, general living storage, and wire garage storage products to home center retail chains, mass merchandisers, and direct-to builder professional installers; wheelbarrows and lawn carts; snow, striking, and hand tools; planters and lawn accessories; garden hoses; and pruners, loppers, shears, and other tools, as well as cleaning products for professional, home, and industrial use. The company's Home & Building Products segment manufactures and markets residential and commercial garage doors for professional dealers and various home center retail chains; and rolling steel door and grille products for commercial, industrial, institutional, and retail uses. It sells its products under the True Temper, AMES, ClosetMaid, Clopay, Ideal, Holmes, CornellCookson, Garant, Harper, UnionTools, Westmix, Cyclone, Southern Patio, Northcote Pottery, Nylex, Hills, Kelkay, Tuscan Path, La Hacienda, Kelso, Dynamic Design, Apta, Quatro Design, Razor-Back, Jackson, Darby, Trojan, Supercraft, NeverLeak, Maximum Load, SuperSlide, ShelfTrack, MasterSuite, Suite Symphony, ExpressShelf, Style+, and SpaceCreations brand names. The company was formerly known as Instrument Systems Corporation and changed its name to Griffon Corporation in June 1992. Griffon Corporation was founded in 1959 and is headquartered in New York, New York.",
    "ceo": "Mr. Ronald J. Kramer",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "6200",
    "phone": "212 957 5000",
    "address": "712 Fifth Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10019",
    "dcfDiff": 0.189129,
    "dcf": 39.9391,
    "image": "https://financialmodelingprep.com/image-stock/GFF.png",
    "ipoDate": "1973-05-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]