[
  {
    "symbol": "GGB",
    "price": 5.15,
    "beta": 1.251712,
    "volAvg": 6445114,
    "mktCap": 9002148582,
    "lastDiv": 0.65,
    "range": "3.752381-6.342857",
    "changes": -0.14,
    "companyName": "Gerdau S.A.",
    "currency": "USD",
    "cik": "0001073404",
    "isin": "US3737371050",
    "cusip": "373737105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Steel",
    "website": "https://www2.gerdau.com",
    "description": "Gerdau S.A. provides steel products and services. The company operates through Brazil Business, North America Business, South America Business, and Special Steel Business segments. It offers semi-finished products, including billets, blooms, and slabs; common long rolled products, such as rebars, wire rods, merchant bars, light shapes, and profiles to the construction and manufacturing industries; finished industrial products, including commercial rolled-steel bars, and light profiles and wires; agricultural products that include stakes and smooth wire products; and drawn products comprises barbed and barbless fence wires, galvanized wires, fences, concrete reinforcing wire meshes, nails, and clamps. The company also produces special steel products used in auto parts, light and heavy vehicles, and agricultural machinery, as well as the oil and gas, wind energy, machinery and equipment, mining and rail, and other markets. In addition, it offers flat products, including hot rolled coils and heavy plates; and resells flat steel products, as well as mines and produces iron ore. It sells its products through independent distributors, direct sales from the mills, and through its retail network. The company was founded in 1901 and is based in Sao Paulo, Brazil.",
    "ceo": "Mr. Gustavo Werneck Da Cunha",
    "sector": "Basic Materials",
    "country": "BR",
    "fullTimeEmployees": "30000",
    "phone": "55 11 3094 6300",
    "address": "Av. Dra. Ruth Cardoso, 8,501",
    "city": "São Paulo",
    "state": "SP",
    "zip": "05425-070",
    "dcfDiff": 1.7792,
    "dcf": 8.1292,
    "image": "https://financialmodelingprep.com/image-stock/GGB.png",
    "ipoDate": "1999-03-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]