[
  {
    "symbol": "GGG",
    "price": 84.75,
    "beta": 0.788732,
    "volAvg": 936720,
    "mktCap": 14266815000,
    "lastDiv": 0.94,
    "range": "56.76-86.3",
    "changes": -1.03,
    "companyName": "Graco Inc.",
    "currency": "USD",
    "cik": "0000042888",
    "isin": "US3841091040",
    "cusip": "384109104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.graco.com",
    "description": "Graco Inc. designs, manufactures, and markets systems and equipment used to move, measure, control, dispense, and spray fluid and powder materials worldwide. The company's Industrial segment offers proportioning systems to spray polyurethane foam and polyurea coatings; equipment that pumps, meters, mixes and dispenses sealant, adhesive, and composite materials; and gel-coat equipment, chop and wet-out systems, resin transfer molding systems and applicators, and precision dispensing solutions. It also provides liquid finishing equipment; paint circulating and supply pumps; paint circulating advanced control systems; plural component coating proportioners; spare parts and accessories; and powder finishing products to coat powder finishing on metals under the Gema and SAT brands. The company's Process segment offers pumps to move and dispense chemicals, water, wastewater, petroleum, food, lubricants, and other fluids; pressure valves used in the oil and natural gas industry, other industrial processes, and research facilities; and chemical injection pumping solutions for injection of chemicals into producing oil wells and pipelines. It also supplies pumps, hose reels, meters, valves, and accessories for fast oil change facilities, service garages, fleet service centers, automobile dealerships, auto parts stores, truck builders, and heavy equipment service centers; and systems, components, and accessories for the automatic lubrication of bearings, gears, and generators in industrial and commercial equipment, compressors, turbines, and on- and off-road vehicles. The company's Contractor segment offers sprayers to apply paint to walls and other structures; and viscous coatings to roofs, as well as markings on roads, parking lots, athletic fields, and floors. It sells its products through distributors, original equipment manufacturers, and home center channels; and directly to end-users. The company was incorporated in 1926 and is headquartered in Minneapolis, Minnesota.",
    "ceo": "Mr. Mark W. Sheahan",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "4000",
    "phone": "612 623 6000",
    "address": "88-11th Avenue Northeast",
    "city": "Minneapolis",
    "state": "MN",
    "zip": "55413",
    "dcfDiff": 6.59206,
    "dcf": 73.8021,
    "image": "https://financialmodelingprep.com/image-stock/GGG.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]