[
  {
    "symbol": "GH",
    "price": 36.76,
    "beta": 0.799662,
    "volAvg": 2207793,
    "mktCap": 4306066400,
    "lastDiv": 0,
    "range": "20.67-62.75",
    "changes": -0.1,
    "companyName": "Guardant Health, Inc.",
    "currency": "USD",
    "cik": "0001576280",
    "isin": "US40131M1099",
    "cusip": "40131M109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Diagnostics & Research",
    "website": "https://guardanthealth.com",
    "description": "Guardant Health, Inc., a precision oncology company, provides blood tests, data sets, and analytics in the United States and internationally. The company offers Guardant360, Guardant360 LDT, Guardant360 CDx, and GuardantOMNI liquid biopsy-based tests for advanced stage cancer; and GuardantINFORM, an in-silico research platform that comprise a clinical-genomic liquid biopsy dataset of advanced cancer patients. It is also developing LUNAR-2 test for the early detection of colorectal cancer in asymptomatic individuals eligible; and GuardantConnect, an integrated software-based solution for clinical and biopharmaceutical customers seeking to connect patients tested with the Guardant360 assay with actionable alterations with potentially relevant clinical trials. In addition, the company offers Guardant Reveal Test for neoadjuvant and adjuvant treatment selection in early-stage cancer patients; Guardant360 tissue genotyping product; and Guardant-19 for use in the detection of the novel coronavirus. Further, it offers development services, including companion diagnostic development and regulatory approval, clinical study setup, monitoring and maintenance, testing development and support, and kits fulfillment related services to biopharmaceutical companies and medical institutions. The company was incorporated in 2011 and is headquartered in Redwood City, California.",
    "ceo": "Dr. Helmy  Eltoukhy Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "1793",
    "phone": "855 698 8887",
    "address": "505 Penobscot Drive",
    "city": "Redwood City",
    "state": "CA",
    "zip": "94063",
    "dcfDiff": 21.5581,
    "dcf": 53.0331,
    "image": "https://financialmodelingprep.com/image-stock/GH.png",
    "ipoDate": "2018-10-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]