[
  {
    "symbol": "GIB",
    "price": 103.29,
    "beta": 0.825396,
    "volAvg": 145362,
    "mktCap": 24311985284,
    "lastDiv": 0,
    "range": "72.23-106.32",
    "changes": 0.13,
    "companyName": "CGI Inc.",
    "currency": "USD",
    "cik": "0001061574",
    "isin": "CA12532H1047",
    "cusip": "12532H104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.cgi.com",
    "description": "CGI Inc., together with its subsidiaries, provides information technology (IT) and business process services in Canada; Western, Southern, Central, and Eastern Europe; Australia; Scandinavia; Finland, Poland, and Baltics; the United States; the United Kingdom; and the Asia Pacific. Its services include the management of IT and business outsourcing, systems integration and consulting, and software solutions selling activities. The company also offers application development, integration and maintenance, testing, portfolio management, and modernization services; business consulting; and a suite of business process services designed to address the needs of specific industries, as well as IT infrastructure services. It serves clients operating in government, banking and capital market, health, utility, communication and media, oil and gas, retail, consumer and services, space, manufacturing, insurance, life sciences, retail and consumer service, and transportation and logistics sectors. The company was formerly known as CGI Group Inc. and changed its name to CGI Inc. in January 2019. CGI Inc. was founded in 1976 and is headquartered in Montreal, Canada.",
    "ceo": "Mr. George D. Schindler",
    "sector": "Technology",
    "country": "CA",
    "fullTimeEmployees": "91000",
    "phone": "15148413200",
    "address": "1350 RenE-LEvesque Boulevard West",
    "city": "Montreal",
    "state": "QC",
    "zip": "H3G 1T4",
    "dcfDiff": 6.27387,
    "dcf": 91.2139,
    "image": "https://financialmodelingprep.com/image-stock/GIB.png",
    "ipoDate": "1998-10-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]