[
  {
    "symbol": "GIL",
    "price": 31.7,
    "beta": 1.460798,
    "volAvg": 563541,
    "mktCap": 5650461600,
    "lastDiv": 0.74,
    "range": "25.67-34.33",
    "changes": 0.28,
    "companyName": "Gildan Activewear Inc.",
    "currency": "USD",
    "cik": "0001061894",
    "isin": "CA3759161035",
    "cusip": "375916103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Apparel Manufacturing",
    "website": "https://gildancorp.com",
    "description": "Gildan Activewear Inc. manufactures and sells various apparel products in the United States, North America, Europe, Asia-Pacific, and Latin America. It provides various activewear products, including T-shirts, fleece tops and bottoms, and sports shirts under the Gildan, Gildan Performance, Gildan Hammer, Comfort Colors, American Apparel, Alstyle, and GoldToe brands. The company also offers hosiery products comprising athletic; dress; and casual, liner, therapeutic, and workwear socks, as well as sheer pantyhose, tights, and leggings under the Gildan, Under Armour, GoldToe, PowerSox, Signature Gold by Goldtoe, Peds, MediPeds, Therapy Plus, All Pro, Secret, Silks, Secret Silky, and American Apparel brands. In addition, it provides men's and boys' underwear products, and ladies panties under the Gildan and Gildan Platinum brands; and ladies' shapewear, intimates, and accessories under the Secret and Secret Silky brands. The company sells its products to wholesale distributors, screen printers, and embellishers, as well as to retailers and lifestyle brand companies. The company was formerly known as Textiles Gildan Inc. and changed its name to Gildan Activewear Inc. in March 1995. Gildan Activewear Inc. was founded in 1946 and is headquartered in Montreal, Canada.",
    "ceo": "Mr. Glenn J. Chamandy",
    "sector": "Consumer Cyclical",
    "country": "CA",
    "fullTimeEmployees": "47000",
    "phone": "15147352023",
    "address": "600 de Maisonneuve Boulevard West",
    "city": "Montreal",
    "state": "QC",
    "zip": "H3A 3J2",
    "dcfDiff": 1.22286,
    "dcf": 29.1271,
    "image": "https://financialmodelingprep.com/image-stock/GIL.png",
    "ipoDate": "1998-06-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]