[
  {
    "symbol": "GILD",
    "price": 76.18,
    "beta": 0.40669,
    "volAvg": 5508395,
    "mktCap": 95023124219,
    "lastDiv": 3,
    "range": "59.27-89.74",
    "changes": 0.17,
    "companyName": "Gilead Sciences, Inc.",
    "currency": "USD",
    "cik": "0000882095",
    "isin": "US3755581036",
    "cusip": "375558103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.gilead.com",
    "description": "Gilead Sciences, Inc., a biopharmaceutical company, discovers, develops, and commercializes medicines in the areas of unmet medical need in the United States, Europe, and internationally. The company provides Biktarvy, Genvoya, Descovy, Odefsey, Truvada, Complera/ Eviplera, Stribild, and Atripla products for the treatment of HIV/AIDS; Veklury, an injection for intravenous use, for the treatment of coronavirus disease 2019; and Epclusa, Harvoni, Vosevi, Vemlidy, and Viread for the treatment of liver diseases. It also offers Yescarta, Tecartus, Trodelvy, and Zydelig products for the treatment of hematology, oncology, and cell therapy patients. In addition, the company provides Letairis, an oral formulation for the treatment of pulmonary arterial hypertension; Ranexa, an oral formulation for the treatment of chronic angina; and AmBisome, a liposomal formulation for the treatment of serious invasive fungal infections. Gilead Sciences, Inc. has collaboration agreements with Arcus Biosciences, Inc.; Pionyr Immunotherapeutics Inc.; Tizona Therapeutics, Inc.; Tango Therapeutics, Inc.; Jounce Therapeutics, Inc.; Galapagos NV; Janssen Sciences Ireland Unlimited Company; Japan Tobacco, Inc.; Gadeta B.V.; Bristol-Myers Squibb Company; Dragonfly Therapeutics, Inc.; and Merck & Co, Inc. The company was incorporated in 1987 and is headquartered in Foster City, California.",
    "ceo": "Mr. Daniel P.  O'Day",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "17000",
    "phone": "650 574 3000",
    "address": "333 Lakeside Drive",
    "city": "Foster City",
    "state": "CA",
    "zip": "94404",
    "dcfDiff": 4.8498,
    "dcf": 88.5798,
    "image": "https://financialmodelingprep.com/image-stock/GILD.png",
    "ipoDate": "1992-01-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]