[
  {
    "symbol": "GLOB",
    "price": 178.93,
    "beta": 1.398591,
    "volAvg": 533387,
    "mktCap": 7592840871,
    "lastDiv": 0,
    "range": "135.405-240.0",
    "changes": -0.97,
    "companyName": "Globant S.A.",
    "currency": "USD",
    "cik": "0001557860",
    "isin": "LU0974299876",
    "cusip": "L44385109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.globant.com",
    "description": "Globant S.A. operates as a technology services company worldwide. It offers e-commerce, new distribution capabilities, augmented revenue management, hyper connected operation, and conversational user experience services through reinvention studios; digital lending, commercial effectiveness, finance, sustainability, regulation analytic, transformation and post-merger integration, and payment and open banking services; and game and graphic engineering, UI and UX design, game as a service, DevOps, and online services, as well as high tech tools. The company also provides smart farming, image diagnosis, healthcare interoperability, genomics data processing, telemedicine and medical device, research and development, and precision medicine services; media and entertainment, and travel and hospitality services; cloud transformation advice, building cloud environment, moving workloads to the cloud, cloud support and operation, chaos engineering, and site reliability engineering services; and data strategies, insights, data platforms, MLOps, and data as a product services. In addition, it offers agile delivery, blockchain, business and cultural hacking, conversational interface, cybersecurity, design, digital sales and marketing, enterprise applications, internet of thing, metaverse, process optimization, quality engineering, salesforce, smart venue, UI engineering, and sustainable business solutions. Further, the company provides smart underwriting, monitoring, and digital collection services; digital experience platforms; product strategy, management, and delivery services; and strategic architecture consulting, platforms evolution, and augmented composable solutions. Additionally, it operates augmented coding and testing, StarMeUp, PagoChat, ShopChat, and Walmeric platforms. The company was formerly known as IT Outsourcing S.L. and changed its name to Globant S.A. in December 2012. Globant S.A. was founded in 2003 and is based in Luxembourg.",
    "ceo": "Mr. Martin  Migoya",
    "sector": "Technology",
    "country": "LU",
    "fullTimeEmployees": "26000",
    "phone": "352 20 301 596",
    "address": "37A Avenue J.F. Kennedy",
    "city": "Luxembourg City",
    "state": null,
    "zip": "1855",
    "dcfDiff": 24.6654,
    "dcf": 188.605,
    "image": "https://financialmodelingprep.com/image-stock/GLOB.png",
    "ipoDate": "2014-07-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]