[
  {
    "symbol": "GLPEY",
    "price": 5.78,
    "beta": 0.900766,
    "volAvg": 56356,
    "mktCap": 9422671785,
    "lastDiv": 0.27,
    "range": "4.36-7.004",
    "changes": 0.03,
    "companyName": "Galp Energia, SGPS, S.A.",
    "currency": "USD",
    "cik": "0001385535",
    "isin": "US3640971053",
    "cusip": "364097105",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.galp.com",
    "description": "Galp Energia, SGPS, S.A. operates as an integrated energy operator in Portugal and internationally. The company operates through four segments: Upstream, Industrial & Energy Management, Commercial, and Renewables and New Business. The Upstream segment engages in the exploration, development, and production of hydrocarbons primarily in Brazil, Mozambique, and Angola. The Industrial & Energy Management segment owns refineries in Portugal, as well as is involved in activities related to energy management of oil products, gas, and electricity. This segment also provides storage and transportation infrastructure for oil and gas products, as well as engages in the sale of electricity to the grid in Portugal and Spain. The Commercial segment is involved in the areas of retail to final business-to-business and business to consumer customers of oil, gas, and electricity. The Renewables and New Business segment is involved in the development of solar and wind power generation projects in Portugal and Spain. In addition, it produces biodiesel, biofuel, and green hydrogen; and operates 1,480 service stations and 1,186 electric mobility charging points. Further, the company engages in the reinsurance business. The company was formerly known as Galp  Petróleos e Gás de Portugal, SGPS, S.A. and changed its name to Galp Energia, SGPS, S.A. in September 2000. Galp Energia, SGPS, S.A. was incorporated in 1999 and is headquartered in Lisbon, Portugal.",
    "ceo": "Mr. Filipe Crisóstomo Silva",
    "sector": "Energy",
    "country": "PT",
    "fullTimeEmployees": "6715",
    "phone": "351 21 724 2500",
    "address": "Rua TomAs da Fonseca - Torre A",
    "city": "Lisbon",
    "state": null,
    "zip": "1600-209",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/GLPEY.png",
    "ipoDate": "2012-08-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]