[
  {
    "symbol": "GLPG",
    "price": 40.3,
    "beta": 0.05977,
    "volAvg": 207777,
    "mktCap": 2655653130,
    "lastDiv": 0,
    "range": "36.17-58.04",
    "changes": -0.62,
    "companyName": "Galapagos NV",
    "currency": "USD",
    "cik": "0001421876",
    "isin": "US36315X1019",
    "cusip": "36315X101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.glpg.com",
    "description": "Galapagos NV, an integrated biopharmaceutical company, engages in the discovery, development, and commercialization of various medicines for high unmet medical need. Its pipeline products include filgotinib, a JAK1 inhibitor that is in various phases of clinical trials for the treatment of rheumatoid arthritis, Crohn's disease, ulcerative colitis, small bowel CD, fistulizing CD, ankylosing spondylitis, psoriatic arthritis, and uveitis. The company's pipeline products also comprise GLPG1972 that has completed Phase 2b trial for treating osteoarthritis; Toledo molecules, including GLPG3970, GLPG4399, and GLPG4876 for inflammation; and GLPG4716 and Ziritaxestat to treat idiopathic pulmonary fibrosis. In addition, its other pipeline products include GLPG2737, a cystic fibrosis transmembrane conductance regulator that is in Phase 2 clinical trials to treat patients with autosomal dominant polycystic kidney disease; and GLPG0555, a JAK1 inhibitor, which is in Phase 1b for treatment of patients with osteoarthritis. The company has collaboration agreements with Gilead Sciences, Inc.; AbbVie S.à r.l.; and Novartis Pharma AG. Galapagos NV was incorporated in 1999 and is headquartered in Mechelen, Belgium.",
    "ceo": "Dr. Paulus A. Stoffels M.D., Ph.D.",
    "sector": "Healthcare",
    "country": "BE",
    "fullTimeEmployees": "1338",
    "phone": "32 1 534 29 00",
    "address": "Generaal De Wittelaan L11 A3",
    "city": "Mechelen",
    "state": null,
    "zip": "2800",
    "dcfDiff": 30.3772,
    "dcf": 74.5672,
    "image": "https://financialmodelingprep.com/image-stock/GLPG.png",
    "ipoDate": "2012-02-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]