[
  {
    "symbol": "GMAB",
    "price": 37.4,
    "beta": 0.683524,
    "volAvg": 377288,
    "mktCap": 24412850598,
    "lastDiv": 0,
    "range": "31.03-47.5",
    "changes": -0.16,
    "companyName": "Genmab A/S",
    "currency": "USD",
    "cik": "0001434265",
    "isin": "US3723032062",
    "cusip": "372303206",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.genmab.com",
    "description": "Genmab A/S develops antibody therapeutics for the treatment of cancer and other diseases primarily in Denmark. The company markets DARZALEX, a human monoclonal antibody for the treatment of patients with multiple myeloma (MM); teprotumumab for the treatment of thyroid eye disease; ofatumurnab, a human monoclonal antibody to treat chronic lymphocytic leukemia (CLL) and multiple sclerosis; and Amivantamab for advanced or metastatic gastric or esophageal cancer and NSCLC. Its products include daratumumab to treat MM, non-MM blood cancers, and AL amyloidosis; GEN1047; tisotumab vedotin for treating cervical, ovarian, and solid cancers; DuoBody-PD-L1x4-1BB, and DuoBody-CD40x4-1BB for treating solid tumors; Epcoritamab for relapsed/refractory diffuse large B-cell lymphoma and chronic lymphocytic leukemia; and HexaBody-CD38 and DuoHexaBody-CD37 for treating hematological malignancies. The company's also develops products, which is in Phase 2 comprise Teclistamab for vaso-occlusive crises; Camidanlumab tesirine to treat hodgkin lymphoma and solid tumors; JNJ-64007957 and JNJ-64407564 to treat MM; PRV-015 for treating celiac disease; Mim8 for treating haemophilia A; and Lu AF82422 for treating multiple system atrophy disease. In addition, it has approximately 20 active pre-clinical programs. The company has a commercial license and collaboration agreement with Seagen Inc. to co-develop tisotumab vedotin. It also has a collaboration agreement with CureVac AG for the research and development of differentiated mRNA-based antibody products; AbbVie for the development of epcoritamab; and collaborations with BioNTech, Janssen, Novo Nordisk A/S, BliNK Biomedical SAS, and Bolt Biotherapeutics, Inc. Genmab A/S was founded in 1999 and is headquartered in Copenhagen, Denmark.",
    "ceo": "Dr. Jan G.J. van de Winkel Ph.D.",
    "sector": "Healthcare",
    "country": "DK",
    "fullTimeEmployees": "1846",
    "phone": "45 70 20 27 28",
    "address": "Kalvebod Brygge 43",
    "city": "Copenhagen",
    "state": null,
    "zip": "1560",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/GMAB.png",
    "ipoDate": "2009-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]