[
  {
    "symbol": "GME",
    "price": 24.98,
    "beta": -0.23169,
    "volAvg": 3939309,
    "mktCap": 7612680180,
    "lastDiv": 2.3900000000000006,
    "range": "15.41-47.99",
    "changes": 1.4,
    "companyName": "GameStop Corp.",
    "currency": "USD",
    "cik": "0001326380",
    "isin": "US36467W1099",
    "cusip": "36467W109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Retail",
    "website": "https://www.gamestop.com",
    "description": "GameStop Corp., a specialty retailer, provides games and entertainment products through its e-commerce properties and various stores in the United States, Canada, Australia, and Europe. The company sells new and pre-owned gaming platforms; accessories, such as controllers, gaming headsets, virtual reality products, and memory cards; new and pre-owned gaming software; and in-game digital currency, digital downloadable content, and full-game downloads. It also sells collectibles comprising licensed merchandise primarily related to the gaming, television, and movie industries, as well as pop culture themes. As of January 29, 2022, the company operated 4,573 stores and ecommerce sites under the GameStop, EB Games, and Micromania brands; and 50 pop culture themed stores that sell collectibles, apparel, gadgets, electronics, toys, and other retail products under the Zing Pop Culture brand, as well as offers Game Informer, a print and digital video game publication featuring reviews of new releases, previews of the big titles on the horizon, and coverage of the latest developments in the gaming industry. The company was formerly known as GSC Holdings Corp. GameStop Corp. was founded in 1996 and is headquartered in Grapevine, Texas.",
    "ceo": "Mr. Ryan  Cohen",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "11000",
    "phone": "817 424 2000",
    "address": "625 Westport Parkway",
    "city": "Grapevine",
    "state": "TX",
    "zip": "76051",
    "dcfDiff": 26.0315,
    "dcf": 48.8515,
    "image": "https://financialmodelingprep.com/image-stock/GME.png",
    "ipoDate": "2002-02-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]