[
  {
    "symbol": "GMED",
    "price": 58.49,
    "beta": 1.054929,
    "volAvg": 1221956,
    "mktCap": 5985515543,
    "lastDiv": 0,
    "range": "50.92-80.04",
    "changes": 0.17,
    "companyName": "Globus Medical, Inc.",
    "currency": "USD",
    "cik": "0001237831",
    "isin": "US3795772082",
    "cusip": "379577208",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.globusmedical.com",
    "description": "Globus Medical, Inc., a medical device company, develops and commercializes healthcare solutions for patients with musculoskeletal disorders in the United States and internationally. It offers spine products, such as traditional fusion implants comprising pedicle screw and rod systems, plating systems, intervertebral spacers, and corpectomy devices for treating degenerative, deformity, tumors, and trauma conditions; treatment options for motion preservation technologies that consist of dynamic stabilization, total disc replacement, and interspinous distraction devices; interventional pain management solutions to treat vertebral compression fractures; and regenerative biologic products comprising of allografts and synthetic alternatives. The company also offers products for the treatment of orthopedic trauma, including fracture plates, compression screws, intramedullary nails, and external fixation systems; and hip and knee joint solutions, including modular hip stems and acetabular cups, as well as posterior stabilizing and cruciate retaining knee arthroplasty implants. In addition, it distributes human cell, tissue, and cellular and tissue-based products. Globus Medical, Inc. was incorporated in 2003 and is headquartered in Audubon, Pennsylvania.",
    "ceo": "Mr. Daniel T. Scavilla",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "2600",
    "phone": "610 930 1800",
    "address": "2560 General Armistead Avenue",
    "city": "Audubon",
    "state": "PA",
    "zip": "19403",
    "dcfDiff": 5.15681,
    "dcf": 70.7032,
    "image": "https://financialmodelingprep.com/image-stock/GMED.png",
    "ipoDate": "2012-08-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]