[
  {
    "symbol": "GMS",
    "price": 70.02,
    "beta": 1.844014,
    "volAvg": 341737,
    "mktCap": 2854967472,
    "lastDiv": 0,
    "range": "38.31-72.18",
    "changes": -0.98,
    "companyName": "GMS Inc.",
    "currency": "USD",
    "cik": "0001600438",
    "isin": "US36251C1036",
    "cusip": "36251C103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.gms.com",
    "description": "GMS Inc. distributes wallboard, ceilings, steel framing and complementary construction products in the United States and Canada. The company offers ceilings products, including suspended mineral fibers, soft fibers, and metal ceiling systems primarily used in offices, hotels, hospitals, retail facilities, schools, and various other commercial and institutional buildings. It also provides steel framing products, such as steel tracks, studs, and various other steel products used to frame the interior walls of a commercial or institutional building; and insulation, lumber and other wood products, ready-mix joint compound, and various other interior construction products, as well as ancillary products comprising tools, fasteners, and safety products. In addition, the company distributes acoustical ceilings, steel framing, insulation, and related building products, as well as commercial and residential building materials. It serves professional contractors and homebuilders. As of April 30, 2022, the company operated 300 branches across 44 states and the District of Columbia, as well as 6 provinces in Canada. It also operates a network of approximately 300 distribution centers. GMS Inc. was founded in 1971 and is headquartered in Tucker, Georgia.",
    "ceo": "Mr. John C. Turner Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "7007",
    "phone": "800 392 4619",
    "address": "100 Crescent Centre Parkway",
    "city": "Tucker",
    "state": "GA",
    "zip": "30084",
    "dcfDiff": 3.92674,
    "dcf": 53.0333,
    "image": "https://financialmodelingprep.com/image-stock/GMS.png",
    "ipoDate": "2016-05-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]