[
  {
    "symbol": "GNGBY",
    "price": 17.19,
    "beta": 0.852873,
    "volAvg": 8011,
    "mktCap": 4682040025,
    "lastDiv": 0.41,
    "range": "15.87-26.22",
    "changes": 0.31,
    "companyName": "Getinge AB (publ)",
    "currency": "USD",
    "cik": null,
    "isin": "US37427X1046",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Medical Devices",
    "website": "https://www.getinge.com",
    "description": "Getinge AB (publ) provides products and solutions for operating rooms, intensive-care units, and sterilization departments. The company operates through Acute Care Therapies, Life Science, and Surgical Workflows segments. It offers sterile transfer systems, closure processing systems, washers, isolators, sterilizers, logistic automation solutions, bioreactors, bioprocess control systems, bioprocess software, biobundles, bioprocess analytics, and perfusion systems; practice-oriented monitoring systems and disposables, anesthesia machines, beating heart stabilizers and positioners, axius blower mister and coronary shunts, proximal seal systems, ceiling supply units, connected solutions, cleaning and disinfection products, packaging and sealing solutions, monitors and indicators, and SteriTec products. The company also provides thoracic catheters, dry seal chest drain, mobile dry seal drain, dry and wet suction water seal chest drain, and chest drain valves; transitional accessories; endoscope reprocessing; endoscopic vessel harvesting systems; endovascular products; extracorporeal life support or extracorporeal membrane oxygenation products; inspection and packing products; intra-aortic balloon counter pulsation therapies; mechanical ventilation products; medical furniture; modular room systems; operating lights and tables; OR integration and management; patient flow management; patient transport; sterile supply management; sterilization; surgical assist systems; surgical perfusion; transport & storage; trays & baskets; and vascular and cardiothoracic surgery solutions. It offers its products through a network of proprietary sales companies, as well as through agents and distributors in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Getinge AB (publ) was founded in 1904 and is headquartered in Gothenburg, Sweden.",
    "ceo": "Mr. Mattias  Perjos M.Sc.",
    "sector": "Healthcare",
    "country": "SE",
    "fullTimeEmployees": "11056",
    "phone": "46 1 03 35 00 00",
    "address": "Lindholmspiren 7A",
    "city": "Gothenburg",
    "state": null,
    "zip": "417 56",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/GNGBY.png",
    "ipoDate": "2012-08-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]