[
  {
    "symbol": "GNTX",
    "price": 29.03,
    "beta": 0.90845,
    "volAvg": 1082679,
    "mktCap": 6784398322,
    "lastDiv": 0.48,
    "range": "23.28-30.41",
    "changes": 0.25,
    "companyName": "Gentex Corporation",
    "currency": "USD",
    "cik": "0000355811",
    "isin": "US3719011096",
    "cusip": "371901109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Auto Parts",
    "website": "https://www.gentex.com",
    "description": "Gentex Corporation designs, develops, manufactures, markets, and supplies digital vision, connected car, dimmable glass, and fire protection products in the United States, Germany, Japan, Mexico, and internationally. It operates through Automotive Products and Other segments. The company offers automotive products, including interior and exterior electrochromic automatic-dimming rearview mirrors, automotive electronics, and non-automatic-dimming rearview mirrors for automotive passenger cars, light trucks, pick-up trucks, sport utility vehicles, and vans for original equipment manufacturers, automotive suppliers, and various aftermarket and accessory customers. It also provides variable dimmable windows to aircraft manufacturers and airline operators. In addition, the company offers photoelectric smoke detectors and alarms, electrochemical carbon monoxide alarms and detectors, audible and visual signaling alarms, and bells and speakers used in fire detection systems in office buildings, hotels, and other commercial and residential buildings, as well as researches and develops nanofiber chemical sensing products. The company sells its fire protection products directly, as well as through sales managers and manufacturer representative organizations to fire protection and security product distributors, electrical wholesale houses, and original equipment manufacturers of fire protection systems. Gentex Corporation was incorporated in 1974 and is headquartered in Zeeland, Michigan.",
    "ceo": "Mr. Steven R. Downing",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "5466",
    "phone": "616 772 1800",
    "address": "600 North Centennial Street",
    "city": "Zeeland",
    "state": "MI",
    "zip": "49464",
    "dcfDiff": 1.27064,
    "dcf": 29.6506,
    "image": "https://financialmodelingprep.com/image-stock/GNTX.png",
    "ipoDate": "1981-12-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]