[
  {
    "symbol": "GOGO",
    "price": 16.72,
    "beta": 1.316901,
    "volAvg": 518687,
    "mktCap": 2149957920,
    "lastDiv": 0,
    "range": "11.57-19.29",
    "changes": -0.04,
    "companyName": "Gogo Inc.",
    "currency": "USD",
    "cik": "0001537054",
    "isin": "US38046C1099",
    "cusip": "38046C109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Telecom Services",
    "website": "https://www.gogoair.com",
    "description": "Gogo Inc., through its subsidiaries, provides broadband connectivity services to the aviation industry in the United States and internationally. It operates through Commercial Aviation North America (CA-NA), Commercial Aviation Rest of World (CA-ROW), and Business Aviation (BA) segments. The company design, build and operate air-to-ground networks, engineer and maintain in-flight systems of proprietary hardware and software, and deliver customizable connectivity and wireless entertainment services. It also offers suite of integrated equipment, network, and internet connectivity products and services, as well as includes suite of smart cabin systems for integrated connectivity, in-flight entertainment, and voice solutions. In addition, the company portfolio comprises of in-flight network, in-flight systems, in-flight services, aviation partner support, and production operations functions. Further, the company offers satellite-based voice and data services. Gogo Inc. was founded in 1991 and is headquartered in Broomfield, Colorado.",
    "ceo": "Mr. Oakleigh  Thorne",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "422",
    "phone": "312 517 5000",
    "address": "105 Edgeview",
    "city": "Broomfield",
    "state": "CO",
    "zip": "80021",
    "dcfDiff": 3.52615,
    "dcf": 20.1362,
    "image": "https://financialmodelingprep.com/image-stock/GOGO.png",
    "ipoDate": "2013-06-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]