[
  {
    "symbol": "GOLF",
    "price": 54.27,
    "beta": 0.816901,
    "volAvg": 331637,
    "mktCap": 3655795654,
    "lastDiv": 0.78,
    "range": "40.167-54.49",
    "changes": 0.49,
    "companyName": "Acushnet Holdings Corp.",
    "currency": "USD",
    "cik": "0001672013",
    "isin": "US0050981085",
    "cusip": "005098108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Leisure",
    "website": "https://www.acushnetholdingscorp.com",
    "description": "Acushnet Holdings Corp. designs, develops, manufactures, and distributes golf products in the United States, Europe, the Middle East, Africa, Japan, Korea, and internationally. The company operates through four segments: Titleist Golf Balls, Titleist Golf Clubs, Titleist Golf Gear, and FootJoy Golf Wear. It offers golf balls under the Titleist brand; golf clubs, such as drivers, fairways, hybrids, and irons under the Titleist brand name; wedges under the Vokey Design brand; and putters under the Scotty Cameron brand. The company also provides golf bags, headwear, golf gloves, travel products, head covers, and other golf accessories, as well as offers customization and personalization of products in Titleist golf gear. In addition, it offers golf shoes, gloves, golf outerwear, and men's and women's golf apparels under the FootJoy brand; and ski, golf, and lifestyle apparels under the KJUS brand name. It sells its products through on-course golf shops and golf specialty retailers, as well as through representatives, other retailers, and online. The company was formerly known as Alexandria Holdings Corp. and changed its name to Acushnet Holdings Corp. in March 2016. Acushnet Holdings Corp. was founded in 1910 and is headquartered in Fairhaven, Massachusetts.",
    "ceo": "Mr. David E. Maher",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "7300",
    "phone": "800 225 8500",
    "address": "333 Bridge Street",
    "city": "Fairhaven",
    "state": "MA",
    "zip": "02719",
    "dcfDiff": 1.64247,
    "dcf": 48.5025,
    "image": "https://financialmodelingprep.com/image-stock/GOLF.png",
    "ipoDate": "2016-10-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]