[
  {
    "symbol": "GOOGL",
    "price": 120.18,
    "beta": 1.091901,
    "volAvg": 33861095,
    "mktCap": 1529843339898,
    "lastDiv": 0,
    "range": "83.34-129.04",
    "changes": 1.85,
    "companyName": "Alphabet Inc.",
    "currency": "USD",
    "cik": "0001652044",
    "isin": "US02079K3059",
    "cusip": "02079K305",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Content & Information",
    "website": "https://www.abc.xyz",
    "description": "Alphabet Inc. provides various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment offers products and services, including ads, Android, Chrome, hardware, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play store; and Fitbit wearable devices, Google Nest home products, Pixel phones, and other devices, as well as in the provision of YouTube non-advertising services. The Google Cloud segment offers infrastructure, platform, and other services; Google Workspace that include cloud-based collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells health technology and internet services. The company was founded in 1998 and is headquartered in Mountain View, California.",
    "ceo": "Mr. Sundar  Pichai",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "190711",
    "phone": "650 253 0000",
    "address": "1600 Amphitheatre Parkway",
    "city": "Mountain View",
    "state": "CA",
    "zip": "94043",
    "dcfDiff": 27.1372,
    "dcf": 126.507,
    "image": "https://financialmodelingprep.com/image-stock/GOOGL.png",
    "ipoDate": "2004-08-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]