[
  {
    "symbol": "GPK",
    "price": 24.02,
    "beta": 0.984154,
    "volAvg": 4078275,
    "mktCap": 7377502800,
    "lastDiv": 0.4,
    "range": "19.46-27.56",
    "changes": -0.2,
    "companyName": "Graphic Packaging Holding Company",
    "currency": "USD",
    "cik": "0001408075",
    "isin": "US3886891015",
    "cusip": "388689101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaging & Containers",
    "website": "https://www.graphicpkg.com",
    "description": "Graphic Packaging Holding Company, together with its subsidiaries, provides fiber-based packaging solutions to food, beverage, foodservice, and other consumer products companies. It operates through three segments: Paperboard Mills, Americas Paperboard Packaging, and Europe Paperboard Packaging. The company offers coated unbleached kraft (CUK), coated recycled paperboard (CRB), and solid bleached sulfate paperboard (SBS) to various paperboard packaging converters and brokers; and paperboard packaging products, such as folding cartons, cups, lids, and food containers primarily to consumer packaged goods, quick-service restaurants, and foodservice companies; and barrier packaging products that protect against moisture, hot and cold temperature, grease, oil, oxygen, sunlight, insects, and other potential product-damaging factors. It also offers various laminated, coated, and printed packaging structures that are produced from its CUK, CRB, and SBS, as well as other grades of paperboards that are purchased from third-party suppliers; designs and manufactures specialized packaging machines that package bottles and cans, and non-beverage consumer products; and installs its packaging machines at customer plants and provides support, service, and performance monitoring of the machines. The company markets its products primarily through sales offices and broker arrangements with third parties in the Americas, Europe, and the Asia Pacific. Graphic Packaging Holding Company was incorporated in 2007 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. Michael P. Doss",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "24000",
    "phone": "770 240 7200",
    "address": "1500 Riveredge Parkway",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30328",
    "dcfDiff": 0.812101,
    "dcf": 22.9479,
    "image": "https://financialmodelingprep.com/image-stock/GPK.png",
    "ipoDate": "1992-12-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]