[
  {
    "symbol": "GPOVY",
    "price": 14.5,
    "beta": 0.664041,
    "volAvg": 391,
    "mktCap": 16292200000,
    "lastDiv": 0.1,
    "range": "6.05-14.5",
    "changes": 0.64,
    "companyName": "Grupo Carso, S.A.B. de C.V.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Conglomerates",
    "website": "https://www.carso.com.mx",
    "description": "Grupo Carso, S.A.B. de C.V., together with its subsidiaries, engages in the commercial, industrial, infrastructure and construction, and energy sectors. It operates through Commercial and Consumer, Industrial and Manufacturing, Infrastructure and Construction, and Energy divisions. The company's Commercial and Consumption division operates department stores and boutiques, gift shops, restaurants, coffee shops, electronics, and technology and games stores under the Sears, Sanborns, iShop, Mixup, Claro Shop, and Saks Fifth Avenue brands. The company's Industrial and Manufacturing division provides cables, such as energy, telecommunication, electronic, coaxial, and fiber optics for application in mining, automotive, and other; electric harnesses for automotive industry; precision steel tubing; power transformers; and alternate energy. It serves customers under the Condumex, Latincasa, Vinanel, Condulac, IEM, Precitubo, Sitcom, Microm, Sinergia, Equiter, and Logtec brands. The company's Infrastructure and Construction division constructs roads, tunnels, water treatment plants, and general infrastructure works; oil and geothermic well drilling and drilling services; and oil platforms and equipment for chemical and petroleum industries. It also constructs commercial centers, industrial plants, and office building and houses; and telecommunication facilities, gas pipelines, and aqueducts under the CICSA, Swecomex, Bronco Drilling, Cilsa, GSM, PC Construcciones, and Urvitec brands. The company's Energy division engages in the gas transportation services; and exploration and production of oil, gas, and other hydrocarbons, as well as explores geothermal energy under the Carso Energy, Carso Oil & Gas, and Carso Electric brands. It serves customers in Mexico; Central America, South America, and the Caribbean; the United States; Europe; and internationally. Grupo Carso, S.A.B. de C.V. is incorporated in 1980 and is headquartered in Mexico City, Mexico.",
    "ceo": "Engineer Antonio  Gomez Garcia",
    "sector": "Industrials",
    "country": "MX",
    "fullTimeEmployees": "94983",
    "phone": "52 55 1101 2956",
    "address": "Plaza Carso, Edificio Frisco",
    "city": "Mexico City",
    "state": "DF",
    "zip": "11529",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/GPOVY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]