[
  {
    "symbol": "GRFS",
    "price": 9.02,
    "beta": 0.39157,
    "volAvg": 760814,
    "mktCap": 7670066484,
    "lastDiv": 3.0434999999999994,
    "range": "5.71-12.5",
    "changes": 0.03,
    "companyName": "Grifols, S.A.",
    "currency": "USD",
    "cik": "0001438569",
    "isin": "US3984384087",
    "cusip": "398438408",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.grifols.com",
    "description": "Grifols, S.A. engages in the procurement, manufacture, preparation, and sale of therapeutic products, primarily hemoderivatives. The company operates through Bioscience, Hospital, Diagnostic, Bio Supplies, and Others divisions. The Bioscience division researches, develops, produces, and markets plasma-derived medicines and other innovative solutions to treat patients with chronic, rare, prevalent, and life-threatening diseases. It offers immunoglobulins, alpha-1 antitrypsin, albumin, clotting factors, and hyperimmune globulins. The Hospital division offers non-biological pharmaceutical products and medical supplies clinical nutrition, intravenous therapy, and medical devices. The Diagnostic division researches, develops, produces, and commercializes diagnostic products that span the healthcare continuumfrom prevention, screening, diagnosis, and prognosis to disease and treatment monitoringto serve professionals. The Bio Supplies division provides biological materials for life-science research, clinical trials, and for manufacturing pharmaceutical and diagnostic products. Its products and services are used by healthcare providers to diagnose and treat patients with hemophilia, immune deficiencies, infectious diseases, and other medical conditions. The company serves public and private customers; and wholesalers, distributors, group purchasing organizations, blood banks, hospitals and care institutions, and national health systems. Grifols, S.A. has a technology collaboration agreement with Mondragon. The company was founded in 1940 and is headquartered in Barcelona, Spain.",
    "ceo": "Mr. Thomas H. Glanzmann",
    "sector": "Healthcare",
    "country": "ES",
    "fullTimeEmployees": "24000",
    "phone": "34 93 571 02 21",
    "address": "Avinguda de la Generalitat, 152",
    "city": "Barcelona",
    "state": null,
    "zip": "08174",
    "dcfDiff": 0.458242,
    "dcf": 8.77176,
    "image": "https://financialmodelingprep.com/image-stock/GRFS.png",
    "ipoDate": "2011-06-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]