[
  {
    "symbol": "GRSXY",
    "price": 19.61,
    "beta": 0.548972,
    "volAvg": 0,
    "mktCap": 15238343661,
    "lastDiv": 0.07,
    "range": "19.61-19.61",
    "changes": 0,
    "companyName": "Grasim Industries Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Building Materials",
    "website": "https://www.grasim.com",
    "description": "Grasim Industries Limited operates in fibre, yarn, pulp, chemicals, textile, fertilizers, and insulators businesses in India and internationally. The company operates through Viscose, Chemicals, Cement, Financial Services, and Others segments. It provides viscose staple fiber, a man-made biodegradable fiber for use in apparels, home textiles, dress materials, knitted wear products, and non-woven applications; wood pulp products; viscose filament yarn, a natural fibre for manufacturing fabrics; and textile products, such as linen and wool. The company also offers various chemical products, including chlor-alkali and epoxy resin products; and fertilizers comprising neem-coated urea, soil and crop specific customised fertilizers, seeds, agrochemicals, and plant and soil health products under the Birla Shaktiman brand name. In addition, it provides electrical insulators for transmission lines and substations, as well as equipment and railways. Further, the company offers grey cement; white cement under the Birla White brand; ready mix concrete; and cement-based putty. Additionally, it provides various financial services comprising non-bank financial, life insurance, asset management, housing finance, equity broking, wealth management, general insurance advisory, and health insurance services. The company is also involved in solar power designing, engineering procurement, and commissioning business. Grasim Industries Limited was incorporated in 1947 and is based in Mumbai, India.",
    "ceo": "Mr. Hari Krishna Agarwal",
    "sector": "Basic Materials",
    "country": "IN",
    "fullTimeEmployees": "23591",
    "phone": "91 22 6652 5000",
    "address": "Aditya Birla Centre",
    "city": "Mumbai",
    "state": null,
    "zip": "400030",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/GRSXY.png",
    "ipoDate": "2009-08-28",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]