[
  {
    "symbol": "GS",
    "price": 313.66,
    "beta": 1.411971,
    "volAvg": 2149843,
    "mktCap": 104275639680,
    "lastDiv": 10,
    "range": "277.84-389.58",
    "changes": 0.21,
    "companyName": "The Goldman Sachs Group, Inc.",
    "currency": "USD",
    "cik": "0000886982",
    "isin": "US38141G1040",
    "cusip": "38141G104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.goldmansachs.com",
    "description": "The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through four segments: Investment Banking, Global Markets, Asset Management, and Consumer & Wealth Management. The company's Investment Banking segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and middle-market lending, relationship lending, and acquisition financing, as well as transaction banking services. This segment also offers underwriting services, such as equity underwriting for common and preferred stock and convertible and exchangeable securities; and debt underwriting for various types of debt instruments, including investment-grade and high-yield debt, bank and bridge loans, and emerging-and growth-market debt, as well as originates structured securities. Its Global Markets segment is involved in client execution activities for cash and derivative instruments; credit and interest rate products; and provision of equity intermediation and equity financing, clearing, settlement, and custody services, as well as mortgages, currencies, commodities, and equities related products. The company's Asset Management segment manages assets across various classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, as well as invests in corporate, real estate, and infrastructure entities. Its Consumer & Wealth Management segment offers wealth advisory and banking services, including financial planning, investment management, deposit taking, and lending; private banking; and unsecured loans, as well as accepts saving and time deposits. The company was founded in 1869 and is headquartered in New York, New York.",
    "ceo": "Mr. David  Solomon",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "45400",
    "phone": "212-902-1000",
    "address": "200 West Street",
    "city": "New York",
    "state": "NY",
    "zip": "10282",
    "dcfDiff": 767.356,
    "dcf": 1121.06,
    "image": "https://financialmodelingprep.com/image-stock/GS.png",
    "ipoDate": "1999-05-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]