[
  {
    "symbol": "GSK",
    "price": 35.53,
    "beta": 0.307662,
    "volAvg": 3064354,
    "mktCap": 72747676137,
    "lastDiv": 1.39,
    "range": "28.47-44.75",
    "changes": -0.23,
    "companyName": "GSK plc",
    "currency": "USD",
    "cik": "0001131399",
    "isin": null,
    "cusip": "37733W204",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.gsk.com",
    "description": "GSK plc, together with its subsidiaries, engages in the creation, discovery, development, manufacture, and marketing of pharmaceutical products, vaccines, over-the-counter medicines, and health-related consumer products in the United Kingdom, the United States, and internationally. It operates through four segments: Pharmaceuticals, Pharmaceuticals R&D, Vaccines, and Consumer Healthcare. The company offers pharmaceutical products comprising medicines in the therapeutic areas, such as respiratory, HIV, immuno-inflammation, oncology, anti-viral, central nervous system, cardiovascular and urogenital, metabolic, anti-bacterial, and dermatology. It also provides consumer healthcare products in wellness, oral health, nutrition, and skin health categories. The company offers its consumer healthcare products in the form of nasal sprays, tablets, syrups, lozenges, gum and trans-dermal patches, caplets, infant syrup drops, liquid filled suspension, wipes, gels, effervescents, toothpastes, toothbrushes, mouthwashes, denture adhesives and cleansers, topical creams and non-medicated patches, lip balm, gummies, and soft chews. It has collaboration agreements with 23andMe; Lyell Immunopharma, Inc.; Novartis; Sanofi SA; Surface Oncology; Progentec Diagnostics, Inc.; Alector, Inc.; and CureVac AG., as well as strategic partnership with IDEAYA Biosciences, Inc. and Vir Biotechnology, Inc. The company was formerly known as GlaxoSmithKline plc and changed its name to GSK plc in May 2022. GSK plc was founded in 1715 and is headquartered in Brentford, the United Kingdom.",
    "ceo": "Ms. Emma Natasha Walmsley",
    "sector": "Healthcare",
    "country": "GB",
    "fullTimeEmployees": "69400",
    "phone": "44 20 8047 5000",
    "address": "980 Great West Road",
    "city": "Brentford",
    "state": null,
    "zip": "TW8 9GS",
    "dcfDiff": 0.172341,
    "dcf": 35.1277,
    "image": "https://financialmodelingprep.com/image-stock/GSK.png",
    "ipoDate": "1980-03-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]