[
  {
    "symbol": "GTES",
    "price": 13.19,
    "beta": 1.539084,
    "volAvg": 1558569,
    "mktCap": 3759545911,
    "lastDiv": 0,
    "range": "9.4-14.93",
    "changes": -0.01,
    "companyName": "Gates Industrial Corporation plc",
    "currency": "USD",
    "cik": "0001718512",
    "isin": "GB00BD9G2S12",
    "cusip": "G39108108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.gates.com",
    "description": "Gates Industrial Corporation plc manufactures and sells engineered power transmission and fluid power solutions worldwide. It operates in two segments, Power Transmission and Fluid Power. The company offers synchronous or asynchronous belts, including V-belts, CVT belts, and Micro-V belts, as well as related components, such as sprockets, pulleys, water pumps, tensioners, or other accessories; solutions for stationary and mobile drives, engine systems, personal mobility, and vertical lifts application platforms; metal drive components; and kits for automotive replacement channels. It also provides fluid power solutions comprising stationary hydraulics, mobile hydraulics, engine systems, and other industrial application platforms; and hydraulics, including hoses, tubing, and fittings, as well as assemblies. The company serves construction, agriculture, energy and resources, automotive, transportation, mobility and recreation, consumer products, and various industrial applications, such as automated manufacturing and logistics systems. It sells its engineered products under the Gates brand. The company offers its products to replacement channel customers, as well as to original equipment manufacturers. Gates Industrial Corporation plc was founded in 1911 and is headquartered in Denver, Colorado.",
    "ceo": "Mr. Ivo  Jurek",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "15000",
    "phone": "303 744 1911",
    "address": "1144 Fifteenth Street",
    "city": "Denver",
    "state": "CO",
    "zip": "80202",
    "dcfDiff": 0.788211,
    "dcf": 13.8082,
    "image": "https://financialmodelingprep.com/image-stock/GTES.png",
    "ipoDate": "2018-01-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]