[
  {
    "symbol": "GTLS",
    "price": 154.61,
    "beta": 1.464436,
    "volAvg": 666101,
    "mktCap": 6606083314,
    "lastDiv": 0,
    "range": "101.44-242.59",
    "changes": 1.28,
    "companyName": "Chart Industries, Inc.",
    "currency": "USD",
    "cik": "0000892553",
    "isin": "US16115Q3083",
    "cusip": "16115Q308",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.chartindustries.com",
    "description": "Chart Industries, Inc. manufactures and sells engineered equipment for the energy and industrial gas industries worldwide. The company operates through four segments: Cryo Tank Solutions, Heat Transfer Systems, Specialty Products, and Repair, Service & Leasing. It provides bulk and packaged gas cryogenic solutions for the storage, distribution, vaporization, and application of industrial gases; cryogenic trailers, ISO containers, bulk storage tanks, loading facilities, and regasification equipment for delivering liquefied natural gas (LNG) into virtual pipeline applications; and large vacuum insulated storage tanks as equipment for purchasers of standard liquefaction plants. The company also offers process technology, liquefaction train, and critical equipment for the LNG, including small to mid-scale facilities, floating LNG applications, and large base-load export facilities; brazed aluminum, Core-in-Kettle, heat exchangers, cold boxes, air cooled heat exchangers, pressure vessels, and pipe works; and air cooled heat exchangers and axial cooling fans for the power, heating, ventilation, air conditioning, and refining applications. In addition, it provides highly engineered equipment that is used in specialty end-market applications for hydrogen, LNG, biogas, CO2 Capture, food and beverage, aerospace, lasers, cannabis, and water treatment; and cryogenic components, including vacuum insulated pipes, specialty liquid nitrogen, end-use equipment, and cryogenic flow meters. Additionally, it provides extended warranties, plant start-up, parts, 24/7 support, monitoring and process optimization, repairing, maintenance, and upgrading services; plant services on equipment, including brazed aluminum heat exchangers, cold boxes, etc.; and service locations that undertake installation, service, repair, maintenance, and refurbishment of cryogenic products, as well as equipment leasing solutions. The company was founded in 1859 and is based in Ball Ground, Georgia.",
    "ceo": "Ms. Jillian C. Evanko",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5178",
    "phone": "770 721 8800",
    "address": "2200 Airport Industrial Drive",
    "city": "Ball Ground",
    "state": "GA",
    "zip": "30107",
    "dcfDiff": 4.65254,
    "dcf": 132.483,
    "image": "https://financialmodelingprep.com/image-stock/GTLS.png",
    "ipoDate": "2006-07-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]