[
  {
    "symbol": "GVDNY",
    "price": 65.96,
    "beta": 0.437931,
    "volAvg": 14238,
    "mktCap": 30430051832,
    "lastDiv": 1.46,
    "range": "53.49-72.82",
    "changes": -0.177,
    "companyName": "Givaudan SA",
    "currency": "USD",
    "cik": null,
    "isin": "US37636P1084",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Chemicals",
    "website": "https://www.givaudan.com",
    "description": "Givaudan SA, together with its subsidiaries, manufactures, supplies, and sells fragrance, beauty, taste, and wellbeing products to the consumer goods industry. The company operates through in divisions, Fragrance & Beauty, and Taste & Wellbeing. The Fragrance & Beauty division offers fine fragrances, consumer products, and fragrance ingredients and active beauty products. The Taste & Wellbeing division provides beverages, such as carbonated soft drinks, juices, bottled waters, ready-to-drink products, alcoholic beverages, hot drinks, and others; dairy and cheese products, including dairy drinks, yoghurt, ice cream, chilled desserts, cream cheese, and spreads; snacks comprising rice crackers and cassava chips; savory and nutraceutical products; and biscuits, crackers, and cereals, as well as confectionery products, such as chewing gums, chocolates, and sweets. It operates in Switzerland, Europe, Africa, the Middle East, North America, Latin America, and the Asia Pacific. The company was founded in 1796 and is headquartered in Vernier, Switzerland.",
    "ceo": "Mr. Gilles  Andrier",
    "sector": "Basic Materials",
    "country": "CH",
    "fullTimeEmployees": "16676",
    "phone": "41 22 780 91 11",
    "address": "Chemin de la Parfumerie 5",
    "city": "Vernier",
    "state": null,
    "zip": "1214",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/GVDNY.png",
    "ipoDate": "2008-12-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]