[
  {
    "symbol": "GWRE",
    "price": 75.49,
    "beta": 1.264084,
    "volAvg": 728588,
    "mktCap": 6148275199,
    "lastDiv": 0,
    "range": "52.08-83.51",
    "changes": 0.56,
    "companyName": "Guidewire Software, Inc.",
    "currency": "USD",
    "cik": "0001528396",
    "isin": "US40171V1008",
    "cusip": "40171V100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.guidewire.com",
    "description": "Guidewire Software, Inc. provides software products for property and casualty insurers worldwide. The company offers Guidewire InsuranceSuite comprising Guidewire PolicyCenter, BillingCenter, and ClaimCenter applications. It also provides Guidewire InsuranceNow, a cloud-based platform that offers policy, billing, and claims management functionality to insurers; and Guidewire InsuranceSuite for Self-Managed. In addition, the company offers Guidewire Rating Management to manage the pricing of insurance products; Guidewire Reinsurance Management to use rules-based logic to execute reinsurance strategy through underwriting and claims processes; Guidewire Client Data Management to capitalize on customer information; and Guidewire Product Content Management that offers software tools and standards-based line-of-business templates to introduce and modify products. Further, it provides Guidewire Underwriting Management, a cloud-based integrated business application; Guidewire AppReader, a submission intake management solution; Guidewire ClaimCenter Package for the London market supports the claims workflow used by London Market insurers and brokers; Guidewire Digital Engagement Applications, which enable insurers to provide digital experiences to customers, agents, vendors, and field personnel through their device of choice; and Guidewire for Salesforce to provide customer information regarding policies and claims. Additionally, the company offers Guidewire Predictive Analytics, a set of cloud-native applications; Guidewire Risk Insights that allows insurers to assess new and evolving risks; Guidewire Business Intelligence that allows insurers to measure business performance; Guidewire DataHub, an operational data store; and Guidewire InfoCenter, a business intelligence warehouse, as well as implementation and integration, and professional services. The company was founded in 2001 and is headquartered in San Mateo, California.",
    "ceo": "Mr. Michael George Rosenbaum",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3376",
    "phone": "650 357 9100",
    "address": "2850 South Delaware Street",
    "city": "San Mateo",
    "state": "CA",
    "zip": "94403",
    "dcfDiff": 11.4146,
    "dcf": 61.8054,
    "image": "https://financialmodelingprep.com/image-stock/GWRE.png",
    "ipoDate": "2012-01-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]