[
  {
    "symbol": "HALO",
    "price": 34.22,
    "beta": 1.216901,
    "volAvg": 1250583,
    "mktCap": 4506089600,
    "lastDiv": 0,
    "range": "29.85-59.46",
    "changes": 0.02,
    "companyName": "Halozyme Therapeutics, Inc.",
    "currency": "USD",
    "cik": "0001159036",
    "isin": "US40637H1095",
    "cusip": "40637H109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.halozyme.com",
    "description": "Halozyme Therapeutics, Inc. operates as a biopharma technology platform company in the United States, Switzerland, Ireland, Belgium, Japan, and internationally. The company's products are based on the ENHANZE drug delivery technology, a patented recombinant human hyaluronidase enzyme (rHuPH20) that enables the subcutaneous delivery of injectable biologics, such as monoclonal antibodies and other therapeutic molecules, as well as small molecules and fluids. Its flagship product is Hylenex recombinant, a formulation of rHuPH20 to facilitate subcutaneous fluid administration for achieving hydration to enhance the dispersion and absorption of other injected drugs in subcutaneous urography and to improve resorption of radiopaque agents. The company also develops Perjeta; RITUXAN HYCELA and MabThera SC for the treatment of non-Hodgkin lymphoma and chronic lymphocytic leukemia (CLL); RITUXAN SC for patients with CLL; and HYQVIA for the treatment of immunodeficiency disorders. In addition, it is developing Tecentriq for non-small cell lung cancer; OCREVUS for multiple sclerosis; DARZALEX for the treatment of patients with amyloidosis, smoldering myeloma, and multiple myeloma; nivolumab for the treatment of solid tumors; ARGX-113, a human neonatal Fc receptor; ARGX-117 to treat autoimmune diseases; and BMS-986179, an anti-CD-73 antibody. The company has collaborations with F. Hoffmann-La Roche, Ltd.; Hoffmann-La Roche, Inc.; Baxalta US Inc.; Baxalta GmbH; Pfizer Inc.; Janssen Biotech, Inc.; AbbVie, Inc.; Eli Lilly and Company; Bristol-Myers Squibb Company; Alexion Pharma Holding; ARGENX BVBA; Horizon Therapeutics plc; National Institute of Allergy and Infectious Diseases; Centre for the AIDS Programme of Research in South Africa; and ViiV Healthcare Limited for small and large molecule targets for the treatment and prevention of HIV. Halozyme Therapeutics, Inc. was founded in 1998 and is based in San Diego, California.",
    "ceo": "Dr. Helen I. Torley M.B. Ch. B., M.R.C.P.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "393",
    "phone": "858 794 8889",
    "address": "11388 Sorrento Valley Road",
    "city": "San Diego",
    "state": "CA",
    "zip": "92121",
    "dcfDiff": 3.38932,
    "dcf": 54.0993,
    "image": "https://financialmodelingprep.com/image-stock/HALO.png",
    "ipoDate": "2004-03-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]