[
  {
    "symbol": "HASI",
    "price": 24.55,
    "beta": 1.680985,
    "volAvg": 999417,
    "mktCap": 2624689600,
    "lastDiv": 1.58,
    "range": "21.56-46.24",
    "changes": 0.13,
    "companyName": "Hannon Armstrong Sustainable Infrastructure Capital, Inc.",
    "currency": "USD",
    "cik": "0001561894",
    "isin": "US41068X1000",
    "cusip": "41068X100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "REIT—Specialty",
    "website": "https://www.hannonarmstrong.com",
    "description": "Hannon Armstrong Sustainable Infrastructure Capital, Inc. provides capital and services to the energy efficiency, renewable energy, and other sustainable infrastructure markets in the United States. The company's projects include building or facility that reduce energy usage or cost through the use of solar generation and energy storage or energy efficiency improvements, including heating, ventilation, and air conditioning systems (HVAC), as well as lighting, energy controls, roofs, windows, building shells, and/or combined heat and power systems. It also focuses in the areas of grid connected projects that deploy cleaner energy sources, such as solar and wind to generate power; and other sustainable infrastructure projects, including upgraded transmission or distribution systems, water and storm water infrastructures, and other projects. The company qualifies as a real estate investment trust for U.S. federal income tax purposes. It generally would not be subject to federal corporate income taxes if it distributes at least 90% of its taxable income to its stockholders. The company was founded in 1981 and is headquartered in Annapolis, Maryland.",
    "ceo": "Mr. Jeffrey A. Lipson",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "112",
    "phone": "410 571 9860",
    "address": "1906 Towne Centre Boulevard",
    "city": "Annapolis",
    "state": "MD",
    "zip": "21401",
    "dcfDiff": 1.78849,
    "dcf": 33.9615,
    "image": "https://financialmodelingprep.com/image-stock/HASI.png",
    "ipoDate": "2013-04-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]