[
  {
    "symbol": "HCM",
    "price": 11.18,
    "beta": 0.883908,
    "volAvg": 125658,
    "mktCap": 1936733760,
    "lastDiv": 0,
    "range": "7.39-21.28",
    "changes": -0.41,
    "companyName": "HUTCHMED (China) Limited",
    "currency": "USD",
    "cik": "0001648257",
    "isin": "US44842L1035",
    "cusip": "44842L103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.hutch-med.com",
    "description": "HUTCHMED (China) Limited discovers, develops, and commercializes targeted therapeutics and immunotherapies for cancer and immunological diseases in HongKong and internationally. It operates in Oncology/Immunology and Other Ventures segments. The company develops Savolitinib, an inhibitor for non-small cell lung cancer (NSCLC), papillary and renal cell carcinoma, colorectal cancer (CRC), and gastric cancer (GC); and Fruquintinib, an inhibitor for CRC, breast cancer, GC, endometrial cancer (EMC), NSCLC, hepatocellular carcinoma, and gastrointestinal and solid tumors. It also develops Surufatinib, an inhibitor for neuroendocrine tumors (NET), pancreatic NET, non-pancreatic NET, biliary tract cancer, sarcoma, neuroendocrine neoplasm, esophageal cancer, small cell lung cancer, GC, thyroid cancer, EMC, NSCLC, and solid tumors; HMPL-523, a spleen tyrosine kinase inhibitor for hematological cancers and certain chronic immune diseases; and HMPL-689 for isoform PI3Kd (phosphoinositide 3'-kinase delta). In addition, it develops Tazemetostat, an inhibitor of EZH2 for the treatment of certain epithelioid sarcoma and follicular lymphoma patients; HMPL-306, an inhibitor for hematological malignancies, gliomas, and solid tumors; HMPL-760, an Bruton's tyrosine kinase inhibitor; HMPL-453, an inhibitor for intrahepatic cholangiocarcinoma; HMPL-295 for solid tumors; HMPL-653 for metastatic solid tumors and tenosynovial giant cell tumors; and Epitinib (HMPL-813) and Theliatinib (HMPL-309) inhibitors. It has collaboration agreements with AstraZeneca AB (publ), Lilly (Shanghai) Management Company Limited, BeiGene, Inmagene Biopharmaceuticals Co. Ltd., Innovent Biologics Co., Inc., Genor Biopharma Co. Ltd., Shanghai Junshi Biosciences Co. Ltd., and Epizyme, Inc. The company was formerly known as Hutchison China MediTech Limited and changed its name to HUTCHMED (China) Limited in May 2021. The company was incorporated in 2000 and is headquartered in Central, Hong Kong.",
    "ceo": "Dr. Wei-Guo  Su B.Sc., Ph.D.",
    "sector": "Healthcare",
    "country": "HK",
    "fullTimeEmployees": "1280",
    "phone": "852 2128 1188",
    "address": "Cheung Kong Center",
    "city": "Central",
    "state": null,
    "zip": null,
    "dcfDiff": 6.99859,
    "dcf": 12.8714,
    "image": "https://financialmodelingprep.com/image-stock/HCM.png",
    "ipoDate": "2016-03-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]