[
  {
    "symbol": "HCP",
    "price": 25.79,
    "beta": 0,
    "volAvg": 2052391,
    "mktCap": 4948688541,
    "lastDiv": 13.600000000000001,
    "range": "21.5-44.34",
    "changes": 0.1,
    "companyName": "HashiCorp, Inc.",
    "currency": "USD",
    "cik": "0001720671",
    "isin": "US4181001037",
    "cusip": "418100103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.hashicorp.com",
    "description": "HashiCorp, Inc. provides multi-cloud infrastructure automation solutions worldwide. The company offers Terraform, an infrastructure provisioning product that applies an Infrastructure-as-Code approach, where processes and configuration required to support applications are codified and automated instead of being manual and ticket-based; and Vault, a secrets management and data protection product, which enables security teams to apply policies based on application and user identity to govern access to credentials and secure sensitive data. It also provides Consul, an application-centric networking automation product that enables practitioners to manage application traffic, security teams to secure and restrict access between applications, and operations teams to automate the underlying network infrastructure; and Nomad, a scheduler and workload orchestrator, which provides practitioners with a self-service interface to manage the application lifecycle. The company was incorporated in 2012 and is headquartered in San Francisco, California.",
    "ceo": "Mr. David  McJannet",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2400",
    "phone": "415 301 3250",
    "address": "101 Second Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94105",
    "dcfDiff": 1.19071,
    "dcf": 33.0207,
    "image": "https://financialmodelingprep.com/image-stock/HCP.png",
    "ipoDate": "2021-12-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]