[
  {
    "symbol": "HDB",
    "price": 68.94,
    "beta": 0.735616,
    "volAvg": 1655864,
    "mktCap": 128499333097,
    "lastDiv": 0.7,
    "range": "53.65-71.76",
    "changes": 0.09,
    "companyName": "HDFC Bank Limited",
    "currency": "USD",
    "cik": "0001144967",
    "isin": "US40415F1012",
    "cusip": "40415F101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.hdfcbank.com",
    "description": "HDFC Bank Limited provides various banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, and Dubai. It operates in Treasury, Retail Banking, Wholesale Banking, Other Banking Business, and Unallocated segments. The company accepts savings, salary, current, rural, public provident fund, pension, and Demat accounts; fixed and recurring deposits; and safe deposit lockers; as well as offshore accounts and deposits, overdrafts against fixed deposits, and sweep-in facilities. It also provides personal, home, car, two wheeler, business, educational, gold, consumer, and rural loans; loans against properties, securities, rental receivables, and assets; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, healthcare/medical equipment and commercial vehicle finance, dealer finance, and term and professional loans. The company offers credit, debit, prepaid, and forex cards; payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, and merchant and cash management services; insurance and investment products. It provides short term finance, bill discounting, structured finance, export credit, loan syndication, and documents collection services; online and wholesale, mobile, and phone banking services; unified payment interface, immediate payment, national electronic funds transfer, and real time gross settlement services; and channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services, as well as financial solutions for supply chain partners and agricultural customers. As of March 31, 2022, the company had 21,683 banking outlets; 6,342 branches; and 18,130 automated teller machines in 3,188 cities/towns. HDFC Bank Limited was incorporated in 1994 and is based in Mumbai, India.",
    "ceo": "Mr. Sashidhar  Jagdishan",
    "sector": "Financial Services",
    "country": "IN",
    "fullTimeEmployees": "166890",
    "phone": "91 22 6652 1000",
    "address": "HDFC Bank House",
    "city": "Mumbai",
    "state": null,
    "zip": "400013",
    "dcfDiff": 566.963,
    "dcf": 632.733,
    "image": "https://financialmodelingprep.com/image-stock/HDB.png",
    "ipoDate": "2001-07-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]