[
  {
    "symbol": "HE",
    "price": 35.92,
    "beta": 0.41338,
    "volAvg": 368754,
    "mktCap": 3935826240,
    "lastDiv": 1.44,
    "range": "33.18-44.01",
    "changes": -0.64,
    "companyName": "Hawaiian Electric Industries, Inc.",
    "currency": "USD",
    "cik": "0000354707",
    "isin": "US4198701009",
    "cusip": "419870100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Diversified",
    "website": "https://www.hei.com",
    "description": "Hawaiian Electric Industries, Inc., together with its subsidiaries, engages in the electric utility, banking, and renewable/sustainable infrastructure investment businesses in the state of Hawaii. It operates in three segments: Electric Utility, Bank, and Other. The Electric Utility segment engages in the production, purchase, transmission, distribution, and sale of electricity in the islands of Oahu, Hawaii, Maui, Lanai, and Molokai. Its renewable energy sources and potential sources include wind, solar, photovoltaic, geothermal, wave, hydroelectric, municipal waste, and other biofuels. This segment serves suburban communities, resorts, the United States armed forces installations, and agricultural operations. The Bank segment operates a community bank that offers banking and other financial services to consumers and businesses, including savings and checking accounts; and loans comprising residential and commercial real estate, residential mortgage, construction and development, multifamily residential and commercial real estate, consumer, and commercial loans. This segment operates 42 branches, including 29 branches in Oahu, 6 branches in Maui, 4 branches in Hawaii, 2 branches in Kauai, and 1 branch in Molokai. The Other segment invests in non-regulated renewable energy and sustainable infrastructure in the State of Hawaii. Hawaiian Electric Industries Inc. was incorporated in 1891 and is headquartered in Honolulu, Hawaii.",
    "ceo": "Mr. Scott W. H. Seu",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "3640",
    "phone": "808 543 5662",
    "address": "1001 Bishop Street",
    "city": "Honolulu",
    "state": "HI",
    "zip": "96813",
    "dcfDiff": 0.768382,
    "dcf": 42.4084,
    "image": "https://financialmodelingprep.com/image-stock/HE.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]