[
  {
    "symbol": "HEGIY",
    "price": 21.25,
    "beta": 0.471264,
    "volAvg": 9459,
    "mktCap": 4939010000,
    "lastDiv": 1.02,
    "range": "19.2-27.75",
    "changes": -0.45,
    "companyName": "Hengan International Group Company Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US42551N1046",
    "cusip": "42551N104",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Household & Personal Products",
    "website": "https://www.hengan.com",
    "description": "Hengan International Group Company Limited, an investment holding company, manufactures, distributes, and sells personal hygiene products in the People's Republic of China and internationally. The company offers pocket handkerchiefs, box and soft tissue papers, kitchen towels/papers, toilet rolls, first-aid products, enema, garbage and food bags, preservation papers, table cloths and swabbers, sanitary napkins, pantiliners, overnight pants, wet tissues, maternal and child care products, adult and baby diapers, and cleansing products. It is also involved in the trading of various products for ladies, pregnant women, infants, and kids, as well as disposable fiber-based products; and engages in the ecommerce business. In addition, the company manufactures and distributes heat and power; and manufactures, distributes, and sells gas, protective equipment, medical instrument, skin care products, antiseptics, and household products. Hengan International Group Company Limited was founded in 1985 and is headquartered in Jinjiang, the People's Republic of China.",
    "ceo": "Mr. Ching Lau  Hui",
    "sector": "Consumer Defensive",
    "country": "CN",
    "fullTimeEmployees": "23000",
    "phone": "86 595 8570 8888",
    "address": "Hengan Industrial City",
    "city": "Jinjiang",
    "state": null,
    "zip": "362261",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HEGIY.png",
    "ipoDate": "2011-05-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]