[
  {
    "symbol": "HEI",
    "price": 175.15,
    "beta": 1.183802,
    "volAvg": 354379,
    "mktCap": 21118184399,
    "lastDiv": 0.2,
    "range": "127.45-180.59",
    "changes": 0.5,
    "companyName": "HEICO Corporation",
    "currency": "USD",
    "cik": "0000046619",
    "isin": "US4228061093",
    "cusip": "422806109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.heico.com",
    "description": "HEICO Corporation, through its subsidiaries, designs, manufactures, and sells aerospace, defense, and electronic related products and services in the United States and internationally. The company's Flight Support Group segment provides jet engine and aircraft component replacement parts; thermal insulation blankets and parts; renewable/reusable insulation systems; and specialty components. This segment also distributes hydraulic, pneumatic, structural, interconnect, mechanical, and electro-mechanical components for the commercial, regional, and general aviation markets; and offers repair and overhaul services for jet engine and aircraft component parts, avionics, instruments, composites, and flight surfaces of commercial aircraft, as well as for avionics and navigation systems, subcomponents, and other instruments utilized on military aircraft. Its Electronic Technologies Group segment provides electro-optical infrared simulation and test equipment; electro-optical laser products; electro-optical, microwave, and other power equipment; electromagnetic and RFI shielding and suppression filters; high-speed interface products; high voltage interconnection devices; high voltage advanced power electronics; power conversion products; and underwater locator beacons and emergency locator transmission beacons. This segment also offers traveling wave tube amplifiers and microwave power modules; three-dimensional microelectronic and stacked memory products; harsh environment connectivity products and custom molded cable assemblies; radio frequency and microwave amplifiers, transmitters, and receivers; communications and electronic intercept receivers and tuners; self-sealing auxiliary fuel systems; active antenna systems; and nuclear radiation detectors. The company serves customers primarily in the aviation, defense, space, medical, telecommunications, and electronics industries. HEICO Corporation was incorporated in 1957 and is headquartered in Hollywood, Florida.",
    "ceo": "Mr. Laurans A. Mendelson",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "6500",
    "phone": "954 987 4000",
    "address": "3000 Taft Street",
    "city": "Hollywood",
    "state": "FL",
    "zip": "33021",
    "dcfDiff": 7.76441,
    "dcf": 162.436,
    "image": "https://financialmodelingprep.com/image-stock/HEI.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]