[
  {
    "symbol": "HELE",
    "price": 105.78,
    "beta": 0.623943,
    "volAvg": 519467,
    "mktCap": 2549202798,
    "lastDiv": 0,
    "range": "81.14-172.45",
    "changes": 3.38,
    "companyName": "Helen of Troy Limited",
    "currency": "USD",
    "cik": "0000916789",
    "isin": "BMG4388N1065",
    "cusip": "G4388N106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Household & Personal Products",
    "website": "https://www.helenoftroy.com",
    "description": "Helen of Troy Limited provides various consumer products in the United States, Canada, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The company operates through three segments: Home & Outdoor, Health & Wellness, and Beauty. The Home & Outdoor segment offers food preparation tools and gadgets, storage containers, and organization products; coffee makers, grinders, manual pour overs, and tea kettles; household cleaning products, shower organization, and bathroom accessories; feeding and drinking products, child seating products, cleaning tools, and nursery accessories; insulated water bottles, hydration packs, drinkware, mugs, food containers, lunch containers, insulated totes, soft coolers, and accessories; and technical and outdoor sports packs, travel packs, luggage, daypacks, and everyday packs. The Health & Wellness segment provides thermometers, blood pressure monitors, pulse oximeters, nasal aspirators, and humidifiers; faucet mount water-filtration systems and pitcher-based water filtration systems; and air purifiers, heaters, fans, and humidifiers. The Beauty segment offers grooming brushes, tools, and decorative hair accessories; and shampoos, liquid hair styling, and treatment and conditioning products, as well as hair appliances. The company sells its products through mass merchandisers, drugstore chains, warehouse clubs, home improvement stores, grocery and specialty stores, beauty supply and e-commerce retailers, wholesalers, and various types of distributors, as well as directly to consumers under the OXO, Good Grips, Hydro Flask, Soft Works, OXO tot, OXO Brew, OXO Strive, OXO Outdoor, Osprey, PUR, Honeywell, Braun, Vicks, Drybar, Hot Tools, Revlon, and Bed Head brands. Helen of Troy Limited was incorporated in 1968 and is headquartered in El Paso, Texas.",
    "ceo": "Mr. Julien R. Mininberg",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "1903",
    "phone": "915 225 8000",
    "address": "1 Helen of Troy Plaza",
    "city": "El Paso",
    "state": "TX",
    "zip": "79912",
    "dcfDiff": 16.8825,
    "dcf": 93.9575,
    "image": "https://financialmodelingprep.com/image-stock/HELE.png",
    "ipoDate": "1976-07-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]