[
  {
    "symbol": "HES",
    "price": 133.55,
    "beta": 1.586267,
    "volAvg": 1562670,
    "mktCap": 41006794600,
    "lastDiv": 1.75,
    "range": "90.34-160.52",
    "changes": 0.68,
    "companyName": "Hess Corporation",
    "currency": "USD",
    "cik": "0000004447",
    "isin": "US42809H1077",
    "cusip": "42809H107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas E&P",
    "website": "https://www.hess.com",
    "description": "Hess Corporation, an exploration and production company, explores, develops, produces, purchases, transports, and sells crude oil, natural gas liquids (NGLs), and natural gas. The company operates in two segments, Exploration and Production, and Midstream. It conducts production operations primarily in the United States, Guyana, the Malaysia/Thailand Joint Development Area, and Malaysia; and exploration activities principally offshore Guyana, the U.S. Gulf of Mexico, and offshore Suriname and Canada. The company is also involved in gathering, compressing, and processing natural gas; fractionating NGLs; gathering, terminaling, loading, and transporting crude oil and NGL through rail car; and storing and terminaling propane, as well as providing water handling services primarily in the Bakken Shale plays in the Williston Basin area of North Dakota. As of December 31, 2021, it had total proved reserves of 1,309 million barrels of oil equivalent. The company was incorporated in 1920 and is headquartered in New York, New York.",
    "ceo": "Mr. John B. Hess",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "1623",
    "phone": "212 997 8500",
    "address": "1185 Avenue of the Americas",
    "city": "New York",
    "state": "NY",
    "zip": "10036",
    "dcfDiff": 6.57838,
    "dcf": 149.672,
    "image": "https://financialmodelingprep.com/image-stock/HES.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]