[
  {
    "symbol": "HGTY",
    "price": 9.24,
    "beta": 0.728848,
    "volAvg": 109540,
    "mktCap": 5419010659,
    "lastDiv": 0,
    "range": "7.72-13.58",
    "changes": -0.11,
    "companyName": "Hagerty, Inc.",
    "currency": "USD",
    "cik": "0001840776",
    "isin": "US4051661092",
    "cusip": "405166109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.hagerty.com",
    "description": "Hagerty, Inc. provides insurance agency services worldwide. It offers automobile and boat insurance products; and reinsurance products. The company also provides Hagerty Media, which publishes contents through the HDC Magazine, video content, YouTube channel; HDC that offers subscription based products and services, including HDC Magazine, automotive enthusiast events, proprietary vehicle valuation tools, emergency roadside services, and special vehicle-related discounts; HVT, a valuation tool used by the customer to access current and historic pricing data of collector car, truck, SUV, and motorcycle models; and Hagerty Events, an eclectic mix of small and large events. In addition, it offers DriveShare, a peer-to-peer rental platform for collector and cool vehicles; Motorsport Reg, a motorsport membership, licensing, and event online management system that automates event listings, registration, and payment processing for various motorsport events; and Hagerty Garage + Social, a platform that provides clubhouses and car storage facilities. The company is headquartered in Traverse City, Michigan.",
    "ceo": "Mr. McKeel O. Hagerty",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1874",
    "phone": "800 922 4050",
    "address": "121 Drivers Edge",
    "city": "Traverse City",
    "state": "MI",
    "zip": "49684-4203",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HGTY.png",
    "ipoDate": "2021-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]