[
  {
    "symbol": "HGV",
    "price": 44.7,
    "beta": 2.037323,
    "volAvg": 799330,
    "mktCap": 4979758800,
    "lastDiv": 0,
    "range": "32.12-51.81",
    "changes": -0.24,
    "companyName": "Hilton Grand Vacations Inc.",
    "currency": "USD",
    "cik": "0001674168",
    "isin": "US43283X1054",
    "cusip": "43283X105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Resorts & Casinos",
    "website": "https://www.hiltongrandvacations.com",
    "description": "Hilton Grand Vacations Inc., a timeshare company, develops, markets, sells, and manages vacation ownership resorts primarily under the Hilton Grand Vacations brand. The company operates in two segments, Real Estate Sales and Financing, and Resort Operations and Club Management. It sells vacation ownership intervals and vacation ownership interests; manages resorts and clubs; operates points-based vacation clubs and resort amenities; and finances and services loans provided to consumers for their timeshare purchases. The company also manages and operates the points-based Hilton Grand Vacations Club and Hilton Club exchange programs, and Diamond Clubs, which provide exchange, leisure travel, and reservation services to approximately 333,000 members, as well as engages in the rental of inventory made available due to ownership exchanges through its club programs. As of December 31, 2021, it had 154 properties located in the United States. The company was founded in 1992 and is headquartered in Orlando, Florida.",
    "ceo": "Mr. Mark D. Wang",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "14500",
    "phone": "407 613 3100",
    "address": "6355 MetroWest Boulevard",
    "city": "Orlando",
    "state": "FL",
    "zip": "32835",
    "dcfDiff": 17.1992,
    "dcf": 63.6592,
    "image": "https://financialmodelingprep.com/image-stock/HGV.png",
    "ipoDate": "2017-01-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]