[
  {
    "symbol": "HHC",
    "price": 77.69,
    "beta": 1.472183,
    "volAvg": 196340,
    "mktCap": 3883567720,
    "lastDiv": 0,
    "range": "50.9-89.58",
    "changes": 1.65,
    "companyName": "The Howard Hughes Corporation",
    "currency": "USD",
    "cik": "0001498828",
    "isin": "US44267D1072",
    "cusip": "44267D107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Real Estate—Diversified",
    "website": "https://www.howardhughes.com",
    "description": "The Howard Hughes Corporation owns, manages, and develops commercial, residential, and hospitality operating properties in the United States. It operates through four segments: Operating Assets; Master Planned Communities (MPCs); Seaport District; and Strategic Developments. As of December 31, 2020, the Operating Assets segment owned 15 retail, 33 office, 12 multi-family, 3 hospitality, and 13 other operating assets and investments primarily located in The Woodlands, Texas; Chicago, Illinois; Columbia, Maryland; Las Vegas, Nevada; and Honolulu, Hawaii. The MPCs segment develops and sells detached and attached single family homes, and range from entry-level to luxury homes to residential homebuilders and developers; and sells or leases land for commercial development, including land parcels designated for retail, office, hospitality, and residential projects. The Seaport District segment is involved in the landlord operations, managed businesses, and events and sponsorships. The Strategic Development segment invests in residential condominium and commercial property projects. This segment consists of 18 development or redevelopment projects. The Howard Hughes Corporation was founded in 2010 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. David R. O'Reilly",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "565",
    "phone": "281 719 6100",
    "address": "9950 Woodloch Forest Drive",
    "city": "The Woodlands",
    "state": "TX",
    "zip": "77380",
    "dcfDiff": 1.30986,
    "dcf": 84.7901,
    "image": "https://financialmodelingprep.com/image-stock/HHC.png",
    "ipoDate": "2010-11-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]