[
  {
    "symbol": "HI",
    "price": 50.28,
    "beta": 1.489084,
    "volAvg": 343688,
    "mktCap": 3498004539,
    "lastDiv": 0.88,
    "range": "36.16-53.76",
    "changes": -0.66,
    "companyName": "Hillenbrand, Inc.",
    "currency": "USD",
    "cik": "0001417398",
    "isin": "US4315711089",
    "cusip": "431571108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.hillenbrand.com",
    "description": "Hillenbrand, Inc. operates as a diversified industrial company in the United States and internationally. It operates in three segments: Advanced Process Solutions, Molding Technology Solutions, and Batesville. The Advanced Process Solutions segment designs, engineers, manufactures, markets, and services process and material handling equipment and systems comprising compounding, extrusion, and material handling equipment, as well as offers equipment system design services; and provides screening and separating equipment for various industries, including plastics, food and pharmaceuticals, chemicals, fertilizers, minerals, energy, wastewater treatment, forest products, and other general industrials. The Molding Technology Solutions segment offers injection molding and extrusion equipment; hot runner systems; process control systems; and mold bases and components for various industries, including automotive, consumer goods, medical, packaging, construction, and electronics. The Batesville segment designs, manufactures, distributes, and sells funeral services products and solutions, such as burial caskets, cremation caskets, containers and urns, other personalization and memorialization products, and web-based technology applications. The company was founded in 1906 and is headquartered in Batesville, Indiana.",
    "ceo": "Ms. Kimberly K. Ryan",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "11000",
    "phone": "812 934 7500",
    "address": "One Batesville Boulevard",
    "city": "Batesville",
    "state": "IN",
    "zip": "47006",
    "dcfDiff": 8.42644,
    "dcf": 54.0464,
    "image": "https://financialmodelingprep.com/image-stock/HI.png",
    "ipoDate": "2008-03-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]