[
  {
    "symbol": "HLDCY",
    "price": 2.93,
    "beta": 1.101915,
    "volAvg": 167095,
    "mktCap": 14184129812,
    "lastDiv": 0.23,
    "range": "2.46-3.93",
    "changes": 0.01,
    "companyName": "Henderson Land Development Company Limited",
    "currency": "USD",
    "cik": "0000811250",
    "isin": null,
    "cusip": "425166303",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Real Estate—Diversified",
    "website": "https://www.hld.com",
    "description": "Henderson Land Development Company Limited, an investment holding company, engages in the property development and investment activities in Hong Kong and Mainland China. The company operates through Property Development, Property Leasing, Department Stores and Supermarket-Cum-Stores Operations, Other Businesses, and Utility and Energy segments. The Property Development segment develops and sells real estate properties. Its property portfolio primarily includes offices, shopping arcades, shopping malls, commercial complexes, and residential properties. The Property Leasing segment leases properties. The Department Stores and Supermarket-Cum-Stores Operations segment operates and manages department stores and supermarket-cum-stores. The Other Businesses segment operates and manages hotels; provides construction, finance, project management, property management, agency, and cleaning and security guard services; trades in building materials; and disposes leasehold land, as well as engages in the food and beverage and travel operations. The Utility and Energy segment is involved in production, distribution, and marketing gas; and water supply and environmentally friendly energy businesses. The company was incorporated in 1976 and is headquartered in Central, Hong Kong. Henderson Land Development Company Limited is a subsidiary of Henderson Development Limited.",
    "ceo": "Dr. Ka-Shing  Lee J.P., JP",
    "sector": "Real Estate",
    "country": "HK",
    "fullTimeEmployees": "9950",
    "phone": "852 2908 8888",
    "address": "Two International Finance Centre",
    "city": "Central",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HLDCY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]