[
  {
    "symbol": "HLI",
    "price": 96.67,
    "beta": 0.771126,
    "volAvg": 551061,
    "mktCap": 6480137919,
    "lastDiv": 2.2,
    "range": "74.18-102.36",
    "changes": 0.82,
    "companyName": "Houlihan Lokey, Inc.",
    "currency": "USD",
    "cik": "0001302215",
    "isin": "US4415931009",
    "cusip": "441593100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.hl.com",
    "description": "Houlihan Lokey, Inc., an investment banking company, provides merger and acquisition (M&A), capital market, financial restructuring, and financial and valuation advisory services worldwide. It operates in three segments: Corporate Finance, Financial Restructuring, and Financial and Valuation Advisory. The Corporate Finance segment offers general financial advisory services; and advises public and private institutions on buy-side and sell-side transactions, leveraged loans, private mezzanine debt, high-yield debt, initial public offerings, follow-ons, convertibles, equity private placements, private equity, and liability management transactions, as well as advise financial sponsors on various transactions. The Financial Restructuring segment advises debtors, creditors, and other parties-in-interest related to recapitalization/deleveraging transactions. It also provides a range of advisory services, including structuring, negotiation, and confirmation of plans of reorganization; structuring and analysis of exchange offers; corporate viability assessment; dispute resolution and expert testimony; and procuring debtor-in-possession financing. The Financial and Valuation Advisory segment offers valuations of various assets, such as companies, illiquid debt and equity securities, and intellectual property. It also provides fairness opinions in connection with M&A and other transactions, and solvency opinions in connection with corporate spin-offs and dividend recapitalizations; and other types of financial opinions. In addition, this segment offers dispute resolution services. It serves corporations, institutions, and governments. The company was incorporated in 1972 and is headquartered in Los Angeles, California with offices in the United States, Europe, the Middle East, and the Asia-Pacific region.",
    "ceo": "Mr. Scott Lee Beiser",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2610",
    "phone": "310 788 5200",
    "address": "10250 Constellation Boulevard",
    "city": "Los Angeles",
    "state": "CA",
    "zip": "90067",
    "dcfDiff": 10.2297,
    "dcf": 107.39,
    "image": "https://financialmodelingprep.com/image-stock/HLI.png",
    "ipoDate": "2015-08-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]