[
  {
    "symbol": "HLIO",
    "price": 63.92,
    "beta": 1.127112,
    "volAvg": 131775,
    "mktCap": 2086668400,
    "lastDiv": 0.36,
    "range": "48.27-72.61",
    "changes": 0.08,
    "companyName": "Helios Technologies, Inc.",
    "currency": "USD",
    "cik": "0001024795",
    "isin": "US42328H1095",
    "cusip": "42328H109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.heliostechnologies.com",
    "description": "Helios Technologies, Inc., together with its subsidiaries, develops, manufactures, and sells solutions for the hydraulics and electronics markets in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates in two segments, Hydraulics and Electronics. The Hydraulics segment offers cartridge valve technology products to control rates and direction of fluid flow, and to regulate and control pressures for industrial and mobile applications; quick release coupling solutions for the agriculture, construction equipment, and industrial markets; and hydraulic system design that provides engineered solutions for machine users, manufacturers, or designers. This segment sells its products under the Sun Hydraulics, Faster, and Custom Fluidpower brands. The Electronics segment offers displays, controls, and instrumentation products for off-highway, recreational and commercial marine, power sports and specialty vehicles, agriculture and water pumping, power generation, health and wellness, and engine-driven industrial equipment markets. This segment sells its products under the Enovation Controls, Murphy, and Balboa Water Group brands. It sells its hydraulic products primarily through value-add distributors, as well as directly to original equipment manufacturers; and electronic products to original equipment manufacturer customers. The company was formerly known as Sun Hydraulics Corporation and changed its name to Helios Technologies, Inc. in June 2019. Helios Technologies, Inc. was founded in 1970 and is headquartered in Sarasota, Florida.",
    "ceo": "Mr. Josef  Matosevic",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "2400",
    "phone": "941 362 1200",
    "address": "7456 16th Street East",
    "city": "Sarasota",
    "state": "FL",
    "zip": "34243",
    "dcfDiff": 8.16057,
    "dcf": 58.0294,
    "image": "https://financialmodelingprep.com/image-stock/HLIO.png",
    "ipoDate": "1997-01-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]