[
  {
    "symbol": "HLIT",
    "price": 16.03,
    "beta": 0.928521,
    "volAvg": 1413551,
    "mktCap": 1785020650,
    "lastDiv": 0,
    "range": "8.29-18.43",
    "changes": -0.03,
    "companyName": "Harmonic Inc.",
    "currency": "USD",
    "cik": "0000851310",
    "isin": "US4131601027",
    "cusip": "413160102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Communication Equipment",
    "website": "https://www.harmonicinc.com",
    "description": "Harmonic Inc., together with its subsidiaries, provide video delivery software, products, system solutions, and services worldwide. The company operates in two segments, Video and Cable Access. The Video segment sells video processing, production, and playout solutions and services to cable operators, and satellite and telecommunications Pay-TV service providers, as well as to broadcast and media, including streaming media companies. This segment's video processing appliance solutions include network management and application software, and hardware products, such as encoders, video servers, high-density stream processing systems, and edge processors. This segment also provides software-as-a-service (SaaS) solutions, which enables the packaging and delivery of streaming services, including live streaming, video-on-demand, catch-up TV, start-over TV, network-DVR, and cloud-DVR services through HTTP streaming to various device along with dynamic and personal ad insertion. The Cable Access segment offers CableOS software-based cable access solutions; and CableOS central cloud services primarily to cable operators. Its products enable customers to create, prepare, store, playout, and deliver a range of broadcast and streaming video services to consumer devices, including televisions, personal computers, laptops, tablets, and smart phones. The company also provides technical support and professional services, such as maintenance and support, consulting, implementation, program management, technical design and planning, building and site preparation, integration and equipment installation, end-to-end system testing, and training. It sells its products through its direct sales force, as well as through independent resellers and systems integrators. The company was incorporated in 1988 and is headquartered in San Jose, California.",
    "ceo": "Dr. Patrick J. Harshman",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1358",
    "phone": "408 542 2500",
    "address": "2590 Orchard Parkway",
    "city": "San Jose",
    "state": "CA",
    "zip": "95131",
    "dcfDiff": 0.843803,
    "dcf": 15.5938,
    "image": "https://financialmodelingprep.com/image-stock/HLIT.png",
    "ipoDate": "1995-05-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]