[
  {
    "symbol": "HLMAF",
    "price": 30,
    "beta": 0.527586,
    "volAvg": 5912,
    "mktCap": 11389349760,
    "lastDiv": 0.25,
    "range": "22.01-31.44",
    "changes": 1.8,
    "companyName": "Halma plc",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Conglomerates",
    "website": "https://www.halma.com",
    "description": "Halma plc, through its subsidiaries, provides technology solutions in the safety, health, and environmental markets. It operates through three segments: Safety, Environmental & Analysis, and Medical. The Safety segment provides fire detection, specialist fire suppression, elevator safety, security sensors, people and vehicle flow technologies, specialized interlocks that control critical processes safely, and explosion protection and corrosion monitoring systems. This segment serves elevator safety, fire suppression, people and vehicle flow, fire detection, pressure management, industrial access control, and safe storage and transfer markets. The Environmental & Analysis segment offers optical, optoelectronic, and spectral imaging systems; water, air and gases monitoring technologies; instruments that detect hazardous gases and analyses air quality; and systems for water analysis and treatment. It serves the optical analysis, water analysis and treatment, gas detection, and environmental monitoring markets. The Medical segment provides critical fluidic components used by medical diagnostics and original equipment manufacturers; laboratory devices and systems that provide information to understand patient health and enable providers to make decisions across the continuum of care; technologies and solutions to enable in-vitro diagnostic systems and life-science discoveries and development; and technologies that enable positive outcomes across clinical specialties. This segment serves the life sciences, health assessment, and therapeutic solutions market. The company was incorporated in 1894 and is headquartered in Amersham, the United Kingdom.",
    "ceo": "Mr. Marc A. Ronchetti",
    "sector": "Industrials",
    "country": "GB",
    "fullTimeEmployees": "8000",
    "phone": "44 1494 721111",
    "address": "Misbourne Court",
    "city": "Amersham",
    "state": null,
    "zip": "HP7 0DE",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HLMAF.png",
    "ipoDate": "2012-08-15",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]