[
  {
    "symbol": "HLNE",
    "price": 77.75,
    "beta": 1.085563,
    "volAvg": 208480,
    "mktCap": 4198461047,
    "lastDiv": 1.78,
    "range": "55.81-81.23",
    "changes": 0.25,
    "companyName": "Hamilton Lane Incorporated",
    "currency": "USD",
    "cik": "0001433642",
    "isin": "US4074971064",
    "cusip": "407497106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Asset Management",
    "website": "https://www.hamiltonlane.com",
    "description": "Hamilton Lane Incorporated is an investment firm specializing in direct and fund of fund investments. It provides following services: separate accounts (customized to each individual client and structured as single client vehicles); specialized strategies (fund-of-funds, secondaries, co-investments, taft-hartley, distribution management); advisory relationships (including due diligence, strategic portfolio planning, monitoring and reporting services); and reporting and analytics solutions. For direct investments, the firm invests in early, mid and late venture, mature companies, growth equity, emerging growth, distressed debt, later stage, turnarounds, bridge financing, mezzanine financing, and buyouts in middle market companies. For fund of fund investments, it invests in mezzanine, venture capital, private equity, turnaround, secondary investments, real estate, and special situation funds. The firm invests in real estate investments. It also invest in technology, healthcare, education, natural resources, energy and essential consumer goods sectors, cleantech, and environment, community development, and financial empowerment. It invests in private equity markets in North America, Latin America, United States, Western Europe, Middle East, Africa, United Kingdom, Asia, Japan, and Australia. The firm prefer to invest $1 million to $100 million in companies. It prefers to have majority stake in companies. Hamilton Lane Incorporated was founded in 1991 and is based in Conshohocken, Pennsylvania with additional offices across Europe, North America, and Asia.",
    "ceo": "Mr. Mario Lucio Giannini J.D.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "600",
    "phone": "610-934-2222",
    "address": "110 Washington Street",
    "city": "Conshohocken",
    "state": "PA",
    "zip": "19428",
    "dcfDiff": 0.8822,
    "dcf": 76.3078,
    "image": "https://financialmodelingprep.com/image-stock/HLNE.png",
    "ipoDate": "2017-03-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]