[
  {
    "symbol": "HLT",
    "price": 141.92,
    "beta": 1.230633,
    "volAvg": 1669022,
    "mktCap": 37555864975,
    "lastDiv": 0.6,
    "range": "108.41-152.89",
    "changes": 0.57,
    "companyName": "Hilton Worldwide Holdings Inc.",
    "currency": "USD",
    "cik": "0001585689",
    "isin": "US43300A2033",
    "cusip": "43300A203",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Lodging",
    "website": "https://www.hilton.com",
    "description": "Hilton Worldwide Holdings Inc., a hospitality company, owns, leases, manages, develops, and franchises hotels and resorts. It operates through two segments, Management and Franchise, and Ownership. The company engages in the hotel management and licensing of its brands. It operates hotels under the Waldorf Astoria Hotels & Resorts, LXR Hotels & Resorts, Conrad Hotels & Resorts, Canopy by Hilton, Tempo by Hilton, Motto by Hilton, Signia by Hilton, Hilton Hotels & Resorts, Curio Collection by Hilton, DoubleTree by Hilton, Tapestry Collection by Hilton, Embassy Suites by Hilton, Hilton Garden Inn, Hampton by Hilton, Tru by Hilton, Homewood Suites by Hilton, Home2 Suites by Hilton, and Hilton Grand Vacations. The company operates in North America, South America, and Central America, including various Caribbean nations; Europe, the Middle East, and Africa; and the Asia Pacific. As of February 16, 2022, the company had approximately 6,800 properties with 1 million rooms in 122 countries and territories. Hilton Worldwide Holdings Inc. was founded in 1919 and is headquartered in McLean, Virginia.",
    "ceo": "Mr. Christopher J. Nassetta",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "159000",
    "phone": "703 883 1000",
    "address": "7930 Jones Branch Drive",
    "city": "McLean",
    "state": "VA",
    "zip": "22102",
    "dcfDiff": 1.7217,
    "dcf": 142.988,
    "image": "https://financialmodelingprep.com/image-stock/HLT.png",
    "ipoDate": "2013-12-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]