[
  {
    "symbol": "HMC",
    "price": 30.55,
    "beta": 0.722988,
    "volAvg": 1103166,
    "mktCap": 50597216966,
    "lastDiv": 0.87,
    "range": "21.44-32.62",
    "changes": 0.33,
    "companyName": "Honda Motor Co., Ltd.",
    "currency": "USD",
    "cik": "0000715153",
    "isin": "US4381283088",
    "cusip": "438128308",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Auto Manufacturers",
    "website": "https://www.honda.co.jp",
    "description": "Honda Motor Co., Ltd. develops, manufactures, and distributes motorcycles, automobiles, power products, and other products in Japan, North America, Europe, Asia, and internationally. It operates through four segments: Motorcycle Business, Automobile Business, Financial Services Business, and Life Creation and Other Businesses. The Motorcycle Business segment produces motorcycles, including sports, business, and commuter models; and various off-road vehicles, such as all-terrain vehicles and side-by-sides. The Automobile Business segment offers passenger cars, light trucks, and mini vehicles. The Financial Services Business segment provides various financial services, including retail lending and leasing services to customers, as well as wholesale financing services to dealers. The Life Creation and Other Businesses segment manufactures and sells power products, such as general purpose engines, generators, water pumps, lawn mowers, riding mowers, robotic mowers, brush cutters, tillers, snow blowers, outboard marine engines, walking assist devices, and portable battery inverter power sources. This segment also offers HondaJet aircraft. The company also sells spare parts; and provides after-sale services through retail dealers directly, as well as through independent distributors and licensees. Honda Motor Co., Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Toshihiro  Mibe",
    "sector": "Consumer Cyclical",
    "country": "JP",
    "fullTimeEmployees": "197039",
    "phone": "81 3 3423 1111",
    "address": "2-1-1, Minami-Aoyama",
    "city": "Tokyo",
    "state": null,
    "zip": "107-8556",
    "dcfDiff": 1596.4,
    "dcf": 1620.99,
    "image": "https://financialmodelingprep.com/image-stock/HMC.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]