[
  {
    "symbol": "HNHPF",
    "price": 7.32,
    "beta": 0.624315,
    "volAvg": 40953,
    "mktCap": 50733089649,
    "lastDiv": 0.34,
    "range": "6.03-7.48",
    "changes": 0.07,
    "companyName": "Hon Hai Precision Industry Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US4380908057",
    "cusip": "438090805",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Electronic Components",
    "website": "https://www.foxconn.com",
    "description": "Hon Hai Precision Industry Co., Ltd. provides technology solutions in Japan, Ireland, the United States, Singapore, China, Taiwan, and internationally. The company manufactures, sells, and services connectors, cases, thermal modules, wired/wireless communication products, optical products, power supply modules, and assemblies for use in the information technology, communications, automotive equipment, precision molding, automobile, and consumer electronics industries. It also manufactures and sells computer terminal monitors and related components, as well as data storage and processing equipment; offers solutions for autonomous driving systems, new energy power, and IoV systems; and provides services of planning, advisory, and business operation and management, logistics, export processing, construction, leasing, and information/software services. In addition, the company manufactures and sells application modules and network cables assemblies; develops educational technology; holds patent applications; manufactures and trades in portable cameras; and retails office machinery and equipment, and electronic appliances. Further, it is involved in the reinvestment in the businesses relating to robots, automatic equipment, molds, parts, and accessories and corresponding services; and software development, repair and after-sale, and rental services of robots. Additionally, the company manufactures and sells computer and data processing equipment, WIFI cards and modules, CFTVs, DVRs, Bluetooth modules, set-top boxes, and optical network terminals. It is also involved in the provision of data storage services; manufacturing of wire or wireless communication; installation of computer and satellite TV channels; and provision of mobile phone services, as well as telecom-related business. The company was founded in 1974 and is headquartered in New Taipei City, Taiwan.",
    "ceo": "Mr. Yang-Wei  Liu",
    "sector": "Technology",
    "country": "TW",
    "fullTimeEmployees": "826608",
    "phone": "886 2 2268 3466",
    "address": "No.2, Zihyou Street",
    "city": "New Taipei City",
    "state": null,
    "zip": "236",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HNHPF.png",
    "ipoDate": "2008-06-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]