[
  {
    "symbol": "HNLGY",
    "price": 8.11,
    "beta": 0.860536,
    "volAvg": 11,
    "mktCap": 2208547640,
    "lastDiv": 0.55,
    "range": "6.6-9.37",
    "changes": 0,
    "companyName": "Hang Lung Group Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Real Estate—Diversified",
    "website": "https://www.hanglung.com",
    "description": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. It develops properties for sale and lease, such as large-scale commercial, office, and residential developments. The company also develops various properties, including shopping mall, office premises, residential and industrial premises, and carparking bays. Its investment properties portfolio includes Grand Gateway 66, a commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Palace 66 and Forum 66 in Shenyang; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Spring City 66 in Kunming; Heartland 66 in Wuhan; and Westlake 66 in Hangzhou. In addition, the company offers car park and property management, financial, project management, dry and laundry cleaning, and property agency services, as well as operates and manages apartment. Hang Lung Group Limited was founded in 1960 and is headquartered in Central, Hong Kong.",
    "ceo": "Mr. Wai Pak  Lo",
    "sector": "Real Estate",
    "country": "HK",
    "fullTimeEmployees": "4239",
    "phone": "852 2879 0111",
    "address": "Standard Chartered Bank Building",
    "city": "Central",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HNLGY.png",
    "ipoDate": "2010-10-15",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]