[
  {
    "symbol": "HOCPY",
    "price": 117.26,
    "beta": 0.622222,
    "volAvg": 35267,
    "mktCap": 41459852720,
    "lastDiv": 0.79,
    "range": "82.15-132.25",
    "changes": 1.26,
    "companyName": "HOYA Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US4432511032",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.hoya.com",
    "description": "HOYA Corporation operates as a med-tech company, and a supplier of high-tech and medical products worldwide. The company offers life care products, including eyeglass and contact lenses; medical endoscopes; intraocular lenses; laparoscopic surgical instruments; automatic endoscope cleaning equipment; and medical related products, such as prosthetic ceramic fillers and metallic implants. It also operates Eyecity, a specialty retailer of contact lenses. In addition, the company provides information technology products, such as mask blanks and photomasks for manufacturing semiconductor chips; photomasks for liquid crystal display panels; glass disks for hard disk drives; and imaging products that include optical glasses/optical lenses, colored glass filters, and laser equipment/UV light resources. Further, it offers ReadSpeaker, a speech synthesis software; and cloud services comprising Kinnosuke that is a time and attendance management service, and Yonosuke, an electronic payslip service. HOYA Corporation was founded in 1941 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Eiichiro  Ikeda",
    "sector": "Healthcare",
    "country": "JP",
    "fullTimeEmployees": "36571",
    "phone": "81 3 6911 4811",
    "address": "Nittochi Nishishinjuku Building",
    "city": "Tokyo",
    "state": null,
    "zip": "160-8347",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HOCPY.png",
    "ipoDate": "2007-08-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]