[
  {
    "symbol": "HOG",
    "price": 34.25,
    "beta": 1.382042,
    "volAvg": 1821569,
    "mktCap": 4923780000,
    "lastDiv": 0.66,
    "range": "30.62-51.77",
    "changes": 0.12,
    "companyName": "Harley-Davidson, Inc.",
    "currency": "USD",
    "cik": "0000793952",
    "isin": "US4128221086",
    "cusip": "412822108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Recreational Vehicles",
    "website": "https://www.harley-davidson.com",
    "description": "Harley-Davidson, Inc. manufactures and sells motorcycles. The company operates in two segments, Motorcycles and Related Products and Financial Services. The Motorcycles and Related Products segment designs, manufactures, and sells Harley-Davidson motorcycles, including cruiser, touring, standard, sportbike, and dual models, as well as motorcycle parts, accessories, apparel, and related services. This segment sells its products to retail customers through a network of independent dealers, as well as e-commerce channels in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia-Pacific. The Financial Services segment provides wholesale financing services, such as floorplan and open account financing of motorcycles, and parts and accessories; and retail financing services, including installment lending for the purchase of new and used Harley-Davidson motorcycles, as well as point-of-sale protection products comprising motorcycle insurance, extended service contracts, and motorcycle maintenance protection. This segment also licenses third-party financial institutions that issue credit cards bearing the Harley-Davidson brand. Harley-Davidson, Inc. was founded in 1903 and is based in Milwaukee, Wisconsin.",
    "ceo": "Mr. Jochen  Zeitz",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "6300",
    "phone": "414 342 4680",
    "address": "3700 West Juneau Avenue",
    "city": "Milwaukee",
    "state": "WI",
    "zip": "53208",
    "dcfDiff": 13.706,
    "dcf": 58.876,
    "image": "https://financialmodelingprep.com/image-stock/HOG.png",
    "ipoDate": "1986-07-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]