[
  {
    "symbol": "HOKCY",
    "price": 0.8358,
    "beta": 0.560919,
    "volAvg": 58138,
    "mktCap": 16225635476,
    "lastDiv": 0.04,
    "range": "0.71-1.11",
    "changes": 0.0188,
    "companyName": "The Hong Kong and China Gas Company Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Utilities—Regulated Gas",
    "website": "https://www.towngas.com",
    "description": "The Hong Kong and China Gas Company Limited, together with its subsidiaries, produces, distributes, and markets gas in Hong Kong and Mainland China. It is involved in the provision of liquefied natural gas, methanol, and coal and other chemicals; conversion and utilization of biomass; agricultural waste; and operation of natural gas refilling stations, piped city-gas projects, upstream and midstream developments, photovoltaic projects, water and wastewater treatment projects, energy exploration and utilization ventures, and aviation fuel facilities. The company supplies town gas to approximately 1.9 million customers. It also provides network connectivity, and data center and cloud computing services; and engages in the software development, solution implementation, and systems integration activities. In addition, the company offers consultancy and engineering contractor services, including utilities installation, infrastructure construction, and civil and building services engineering for public and private projects; and designs and manufactures gas meters and metering systems. Further, it is involved in water supply, and domestic sewage and industrial wastewater treatment serving 2.4 million customers. Additionally, the company manufactures polyethylene piping and fittings; and engages in the customers center, café, restaurant, retail sale, laundry, automatic meter reading system development, laboratory testing, payment gateway and related, project management, landfill gas project, financing, logistics, oil, research and development, property development, and securities investment activities. The Hong Kong and China Gas Company Limited was founded in 1862 and is headquartered in North Point, Hong Kong.",
    "ceo": "Mr. Wai Yee  Wong A.C.I.S., A.C.S., C.M.A., C.P.A., F.I.G.E.",
    "sector": "Utilities",
    "country": "HK",
    "fullTimeEmployees": "56222",
    "phone": "852 2963 2739",
    "address": "363 Java Road",
    "city": "North Point",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HOKCY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]