[
  {
    "symbol": "HOMB",
    "price": 22.68,
    "beta": 1.166901,
    "volAvg": 1206112,
    "mktCap": 4599481501,
    "lastDiv": 0.72,
    "range": "19.77-26.2",
    "changes": -0.03,
    "companyName": "Home Bancshares, Inc. (Conway, AR)",
    "currency": "USD",
    "cik": "0001331520",
    "isin": "US4368932004",
    "cusip": "436893200",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.homebancshares.com",
    "description": "Home Bancshares, Inc. (Conway, AR) operates as the bank holding company for Centennial Bank that provides commercial and retail banking, and related financial services to businesses, real estate developers and investors, individuals, and municipalities. Its deposit products include checking, savings, and money market accounts, as well as certificates of deposit. The company's loan portfolio comprises non-farm/non-residential real estate, construction/land development, residential mortgage, consumer, agricultural, and commercial and industrial loans. It also provides internet banking, mobile banking and voice response information, cash management, overdraft protection, direct deposit, and automatic account transfer services, as well as safe deposit boxes and the United States savings bonds. In addition, the company writes policies for commercial and personal lines of business, including insurance for property, casualty, life, health, and employee benefits. As of December 31, 2021, it operated through 160 branch locations that included 76 branches in Arkansas, 78 branches in Florida, 5 branches in Alabama, and 1 branch in New York City. Home Bancshares, Inc. (Conway, AR) was founded in 1998 and is headquartered in Conway, Arkansas.",
    "ceo": "Mr. John W. Allison",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2774",
    "phone": "501 339 2929",
    "address": "719 Harkrider Street",
    "city": "Conway",
    "state": "AR",
    "zip": "72032-5619",
    "dcfDiff": 24.4366,
    "dcf": 47.2566,
    "image": "https://financialmodelingprep.com/image-stock/HOMB.png",
    "ipoDate": "2006-06-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]