[
  {
    "symbol": "HP",
    "price": 34.21,
    "beta": 1.652112,
    "volAvg": 1547393,
    "mktCap": 3509432850,
    "lastDiv": 1.94,
    "range": "30.41-54.45",
    "changes": -0.09,
    "companyName": "Helmerich & Payne, Inc.",
    "currency": "USD",
    "cik": "0000046765",
    "isin": "US4234521015",
    "cusip": "423452101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Drilling",
    "website": "https://www.hpinc.com",
    "description": "Helmerich & Payne, Inc., together with its subsidiaries, provides drilling services and solutions for exploration and production companies. The company operates through three segments: North America Solutions, Offshore Gulf of Mexico, and International Solutions. The North America Solutions segment drills primarily in Colorado, Louisiana, Montana, Nevada, New Mexico, North Dakota, Ohio, Oklahoma, Pennsylvania, Texas, Utah, West Virginia, and Wyoming. It also focuses on developing, promoting, and commercializing technologies designed to enhance the drilling operations, as well as wellbore quality and placement. The Offshore Gulf of Mexico segment has drilling operations in Louisiana and in U.S. federal waters in the Gulf of Mexico. The International Solutions segment conducts drilling operations in Argentina, Bahrain, Colombia, and the United Arab Emirates. As of September 30, 2021, the company operated a fleet of 236 land rigs in North America; 30 international land rigs; and 7 offshore platform rigs. It also owns, develops, and operates commercial real estate properties. The company's real estate investments include a shopping center comprising approximately 390,000 leasable square feet; and approximately 176 acres of undeveloped real estate located in Tulsa, Oklahoma. Helmerich & Payne, Inc. was founded in 1920 and is headquartered in Tulsa, Oklahoma.",
    "ceo": "Mr. John W. Lindsay",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "8000",
    "phone": "918 742 5531",
    "address": "1437 South Boulder Avenue",
    "city": "Tulsa",
    "state": "OK",
    "zip": "74119",
    "dcfDiff": 10.56,
    "dcf": 59.75,
    "image": "https://financialmodelingprep.com/image-stock/HP.png",
    "ipoDate": "1980-10-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]