[
  {
    "symbol": "HPE",
    "price": 16.36,
    "beta": 1.248591,
    "volAvg": 13217235,
    "mktCap": 21129267200,
    "lastDiv": 0.48,
    "range": "11.9-17.74",
    "changes": -0.07,
    "companyName": "Hewlett Packard Enterprise Company",
    "currency": "USD",
    "cik": "0001645590",
    "isin": "US42824C1099",
    "cusip": "42824C109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Communication Equipment",
    "website": "https://www.hpe.com",
    "description": "Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant rack and tower servers; HPE BladeSystem and HPE Synergy; and solutions for secondary workloads and traditional tape, storage networking, and disk products, such as HPE Modular Storage Arrays and HPE XP. It also offers HPE Apollo and Cray products; and HPE Superdome Flex, HPE Nonstop, HPE Integrity, and HPE Edgeline products. In addition, the company provides HPE Aruba product portfolio that includes wired and wireless local area network hardware products, such as Wi-Fi access points, switches, routers, and sensors; HPE Aruba software and services comprising cloud-based management, network management, network access control, analytics and assurance, and location; and professional and support services, as well as as-a-service and consumption models for the intelligent edge portfolio of products. Further, it offers various leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate technology deployment models and the acquisition of complete IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others. Additionally, the company invests in communications and media solutions. It has a partnership with Striim, Inc. to offer high performance and mission-critical solutions with real-time analytics. It serves commercial and large enterprise groups, such as business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. Hewlett Packard Enterprise Company was founded in 1939 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Antonio Fabio Neri",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "60200",
    "phone": "650 687 5817",
    "address": "11445 Compaq Center West Drive",
    "city": "Houston",
    "state": "TX",
    "zip": "77070",
    "dcfDiff": 2.41451,
    "dcf": 18.5545,
    "image": "https://financialmodelingprep.com/image-stock/HPE.png",
    "ipoDate": "2015-10-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]