[
  {
    "symbol": "HPQ",
    "price": 29.94,
    "beta": 1.015845,
    "volAvg": 7407119,
    "mktCap": 29519521682,
    "lastDiv": 1.05,
    "range": "24.08-35.32",
    "changes": 0.1,
    "companyName": "HP Inc.",
    "currency": "USD",
    "cik": "0000047217",
    "isin": "US40434L1052",
    "cusip": "40434L105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Computer Hardware",
    "website": "https://www.hp.com",
    "description": "HP Inc. provides personal computing and other access devices, imaging and printing products, and related technologies, solutions, and services in the United States and internationally. The company operates through three segments: Personal Systems, Printing, and Corporate Investments. The Personal Systems segment offers commercial and consumer desktop and notebook personal computers, workstations, thin clients, commercial mobility devices, retail point-of-sale systems, displays and peripherals, software, support, and services. The Printing segment provides consumer and commercial printer hardware, supplies, solutions, and services. The Corporate Investments segment is involved in the HP Labs and business incubation, and investment projects. It serves individual consumers, small- and medium-sized businesses, and large enterprises, including customers in the government, health, and education sectors. The company was formerly known as Hewlett-Packard Company and changed its name to HP Inc. in October 2015. HP Inc. was founded in 1939 and is headquartered in Palo Alto, California.",
    "ceo": "Mr. Enrique J. Lores",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "58000",
    "phone": "650 857 1501",
    "address": "1501 Page Mill Road",
    "city": "Palo Alto",
    "state": "CA",
    "zip": "94304",
    "dcfDiff": 3.45377,
    "dcf": 32.6838,
    "image": "https://financialmodelingprep.com/image-stock/HPQ.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]