[
  {
    "symbol": "HQY",
    "price": 61.58,
    "beta": 0.779929,
    "volAvg": 572806,
    "mktCap": 5263304180,
    "lastDiv": 0,
    "range": "48.86-79.2",
    "changes": 0.67,
    "companyName": "HealthEquity, Inc.",
    "currency": "USD",
    "cik": "0001428336",
    "isin": "US42226A1079",
    "cusip": "42226A107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Health Information Services",
    "website": "https://www.healthequity.com",
    "description": "HealthEquity, Inc. provides technology-enabled services platforms to consumers and employers in the United States. The company offers cloud-based platforms for individuals to make health saving and spending decisions, pay healthcare bills, compare treatment options and prices, receive personalized benefit and clinical information, earn wellness incentives, grow their savings, and make investment choices; and health savings accounts. It also provides mutual fund investment platform; and online-only automated investment advisory services through Advisor, a Web-based tool. In addition, the company offers flexible spending accounts; health reimbursement arrangements; and Consolidated Omnibus Budget Reconciliation Act continuation services, as well as administers pre-tax commuter benefit programs. It serves clients through a direct sales force; benefits brokers and advisors; and a network of health plans, benefits administrators, benefits brokers and consultants, and retirement plan record-keepers. The company was incorporated in 2002 and is headquartered in Draper, Utah.",
    "ceo": "Mr. Jon  Kessler",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "3170",
    "phone": "801 727 1000",
    "address": "15 West Scenic Pointe Drive",
    "city": "Draper",
    "state": "UT",
    "zip": "84020",
    "dcfDiff": 5.57856,
    "dcf": 65.8886,
    "image": "https://financialmodelingprep.com/image-stock/HQY.png",
    "ipoDate": "2014-07-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]