[
  {
    "symbol": "HRB",
    "price": 32.04,
    "beta": 0.684507,
    "volAvg": 1872425,
    "mktCap": 4879179360,
    "lastDiv": 1.16,
    "range": "28.83-48.76",
    "changes": -0.27,
    "companyName": "H&R Block, Inc.",
    "currency": "USD",
    "cik": "0000012659",
    "isin": "US0936711052",
    "cusip": "093671105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Personal Services",
    "website": "https://www.hrblock.com",
    "description": "H&R Block, Inc., through its subsidiaries, provides assisted income tax return preparation and do-it-yourself (DIY) tax return preparation services and products to the general public primarily in the United States, Canada, and Australia. The company offers assisted income tax return preparation and related services through a system of retail offices operated directly by the company or its franchisees. It also provides Refund Transfers and H&R Block Emerald Prepaid Mastercard, which enables clients to receive their tax refunds; Peace of Mind extended service plans; H&R Block Emerald Advance lines of credit; Tax Identity Shield that provides clients assistance in helping protect their tax identity and access to services to help restore their tax identity; refund advance loans; H&R Block Instant Refund; and H&R Block Pay With Refund services. In addition, the company offers small business financial solutions through its company-owned or franchise offices, and online. H&R Block, Inc. was founded in 1955 and is headquartered in Kansas City, Missouri.",
    "ceo": "Mr. Jeffrey J. Jones II",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "3800",
    "phone": "816 854 3000",
    "address": "One H&R Block Way",
    "city": "Kansas City",
    "state": "MO",
    "zip": "64105",
    "dcfDiff": 9.16896,
    "dcf": 47.419,
    "image": "https://financialmodelingprep.com/image-stock/HRB.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]