[
  {
    "symbol": "HRIBF",
    "price": 56.32,
    "beta": 1.080076,
    "volAvg": 3,
    "mktCap": 2378404864,
    "lastDiv": 1.94,
    "range": "45.14-56.32",
    "changes": 0,
    "companyName": "HORIBA, Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.horiba.com/int/",
    "description": "HORIBA, Ltd. manufactures and sells instruments and systems worldwide. It operates in five segments: Automotive, Process & Environmental, Medical-Diagnostic, Semiconductors, and Scientific. The Automotive segment offers automotive emission analyzers, onboard emission measurement systems, driveline test systems, engine test and fuel cell test systems, and battery test systems; test systems for engines, chassis, powertrains, brakes, and catalysts, as well as water electrolysis cell/stack assessment equipment; and vehicle development engineering and testing engineering services, as well as leases and manages research and development facilities. The Process & Environmental segment provides stack gas analyzers, industrial water quality analyzers, water quality analysis and examination systems, air pollution analyzers, environmental radiation meters, and process measurement equipment. The Medical-Diagnostic segment offers hematology and CRP, immunology, clinical chemistry, and blood glucose analyzers, as well as coagulation/hemostasis analyzers. The Semiconductor Instruments & Systems segment provides mass flow controllers, chemical concentration monitors, reticle/mask particle detection systems, residual gas analyzers, and vaporizers. The Scientific segment offers Raman spectrometers, pH meters, particle-size distribution analyzers, X-Ray fluorescence analyzers, elemental analyzers, fluorescence spectroscopy/fluorescence lifetime spectroscopy, optical components, spectrometers and detectors, and gratings. The company's products are used in arts, entertainment, and recreation; education, research and development, and government institution; food and beverage; energy and environment; health care; industrials; information technology; water; materials; mobility and transport; and waste management applications. HORIBA, Ltd. was founded in 1945 and is headquartered in Kyoto, Japan.",
    "ceo": "Mr. Atsushi  Horiba",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "8432",
    "phone": "81 75 313 8121",
    "address": "2 Miyanohigashi",
    "city": "Kyoto",
    "state": null,
    "zip": "601-8510",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HRIBF.png",
    "ipoDate": "2014-05-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]