[
  {
    "symbol": "HRL",
    "price": 39.43,
    "beta": 0.166549,
    "volAvg": 2278627,
    "mktCap": 21539348502,
    "lastDiv": 1.1,
    "range": "37.78-51.69",
    "changes": -1.06,
    "companyName": "Hormel Foods Corporation",
    "currency": "USD",
    "cik": "0000048465",
    "isin": "US4404521001",
    "cusip": "440452100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaged Foods",
    "website": "https://www.hormelfoods.com",
    "description": "Hormel Foods Corporation develops, processes, and distributes various meat, nuts, and food products to retail, foodservice, deli, and commercial customers in the United States and internationally. The company operates through four segments: Grocery Products, Refrigerated Foods, Jennie-O Turkey Store, and International & Other. It provides various perishable products that include fresh meats, frozen items, refrigerated meal solutions, sausages, hams, guacamoles, and bacons; and shelf-stable products comprising canned luncheon meats, nut butters, snack nuts, chilies, shelf-stable microwaveable meals, hashes, stews, tortillas, salsas, tortilla chips, and others. The company also engages in the processing, marketing, and sale of branded and unbranded pork, beef, poultry, and turkey products, as well as offers nutritional food products and supplements, desserts and drink mixes, and industrial gelatin products. It sells its products primarily under the SKIPPY, SPAM, Hormel, Natural Choice, Applegate, Justin's, Jennie-O, Café H, Herdez, Black Label, Sadler's, Columbus, Gatherings, Herdez, Wholly, Columbus, Planters, NUT-rition, Planters Cheez Balls, Corn Nuts, etc. brand names through sales personnel, independent brokers, and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.",
    "ceo": "Mr. James P. Snee",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "20000",
    "phone": "507 437 5611",
    "address": "1 Hormel Place",
    "city": "Austin",
    "state": "MN",
    "zip": "55912-3680",
    "dcfDiff": 5.54044,
    "dcf": 50.4304,
    "image": "https://financialmodelingprep.com/image-stock/HRL.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]