[
  {
    "symbol": "HSBC",
    "price": 38.9,
    "beta": 0.571264,
    "volAvg": 1634990,
    "mktCap": 154434558490,
    "lastDiv": 2.1,
    "range": "24.77-39.63",
    "changes": -0.11,
    "companyName": "HSBC Holdings plc",
    "currency": "USD",
    "cik": "0001089113",
    "isin": "US4042804066",
    "cusip": "404280406",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.hsbc.com",
    "description": "HSBC Holdings plc provides banking and financial services worldwide. The company operates through Wealth and Personal Banking, Commercial Banking, and Global Banking and Markets segments. The Wealth and Personal Banking segment offers retail banking and wealth products, including current and savings accounts, mortgages and personal loans, credit and debit cards, and local and international payment services; and wealth management services comprising insurance and investment products, global asset management services, investment management, and private wealth solutions. This segment serves personal banking and high net worth individuals. The Commercial Banking segment provides credit and lending, treasury management, payment, cash management, commercial insurance, and investment services; commercial cards; international trade and receivables finance services; foreign exchange products; capital raising services on debt and equity markets; and advisory services. It serves small and medium sized enterprises, mid-market enterprises, and corporates. The Global Banking and Markets segment offers financing, advisory, and transaction services; and credit, rates, foreign exchange, equities, money markets, and securities services; and engages in principal investment activities. It serves government, corporate and institutional clients, and private investors. HSBC Holdings plc was founded in 1865 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. Noel Paul Quinn",
    "sector": "Financial Services",
    "country": "GB",
    "fullTimeEmployees": "221656",
    "phone": "44 20 7991 8888",
    "address": "8 Canada Square",
    "city": "London",
    "state": null,
    "zip": "E14 5HQ",
    "dcfDiff": 95.6383,
    "dcf": 132.788,
    "image": "https://financialmodelingprep.com/image-stock/HSBC.png",
    "ipoDate": "1999-07-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]