[
  {
    "symbol": "HSNGY",
    "price": 14.19,
    "beta": 0.578544,
    "volAvg": 76333,
    "mktCap": 27129009600,
    "lastDiv": 0.57,
    "range": "13.28-17.73",
    "changes": -0.05,
    "companyName": "Hang Seng Bank Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US41043C3043",
    "cusip": "41043C304",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.hangseng.com",
    "description": "Hang Seng Bank Limited, together with its subsidiaries, provides various banking and related financial services to individual, corporate, commercial, small and medium-sized enterprise, and institutional customers in Hong Kong, Mainland China, and internationally. It operates through four segments: Wealth and Personal Banking, Commercial Banking, Global Banking and Markets, and Other. The company offers personal banking services, including current and savings accounts, time deposits, mortgages and personal loans, credit cards, and insurance, investment, and other wealth management services, as well as consumer lending services. It also provides corporate lending, trade and receivable finance, payments and cash management, treasury and foreign exchange, general insurance, key-person insurance, investment services, and corporate wealth management; and general banking, corporate lending, interest rates, foreign exchange, money markets, structured products and derivatives, etc. In addition, the company offers retirement benefits, life assurance, fund management, and stock broking services, as well as index compilation and licensing; fund raising and sales; and asset management services. It operates approximately 280 service outlets in Hong Kong; branches in Macau and Singapore; and a representative office in Taipei, Taiwan. Hang Seng Bank Limited, through its subsidiary, Hang Seng Bank (China) Limited, also operates a network of outlets in approximately 20 cities in Mainland China. The company was founded in 1933 and is headquartered in Central, Hong Kong. Hang Seng Bank Limited is a subsidiary of The Hongkong and Shanghai Banking Corporation Limited.",
    "ceo": "Ms. Diana Ferreira  Cesar J.P.",
    "sector": "Financial Services",
    "country": "HK",
    "fullTimeEmployees": "8708",
    "phone": null,
    "address": "83 Des Voeux Road",
    "city": "Central",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HSNGY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]