[
  {
    "symbol": "HSY",
    "price": 249.59,
    "beta": 0.317253,
    "volAvg": 1026806,
    "mktCap": 51015947408,
    "lastDiv": 4.14,
    "range": "211.49-276.88",
    "changes": -10.32,
    "companyName": "The Hershey Company",
    "currency": "USD",
    "cik": "0000047111",
    "isin": "US4278661081",
    "cusip": "427866108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Confectioners",
    "website": "https://www.thehersheycompany.com",
    "description": "The Hershey Company, together with its subsidiaries, engages in the manufacture and sale of confectionery products and pantry items in the United States and internationally. The company operates through three segments: North America Confectionery, North America Salty Snacks, and International. It offers chocolate and non-chocolate confectionery products; gum and mint refreshment products, including mints, chewing gums, and bubble gums; pantry items, such as baking ingredients, toppings, beverages, and sundae syrups; and snack items comprising spreads, meat snacks, bars and snack bites, mixes, popcorn, and protein bars. The company provides its products primarily under the Hershey's, Reese's, Kisses, Jolly Rancher, Almond Joy, Brookside, barkTHINS, Cadbury, Good & Plenty, Heath, Kit Kat, Payday, Rolo, Twizzlers, Whoppers, York, Ice Breakers, Breath Savers, Bubble Yum, Lily's, SkinnyPop, Pirates Booty, Paqui, Dot's Homestyle Pretzels, and ONE Bar brands, as well as under the Pelon Pelo Rico, IO-IO, and Sofit brands. It markets and sells its products to wholesale distributors, chain grocery stores, mass merchandisers, chain drug stores, vending companies, wholesale clubs, convenience stores, dollar stores, concessionaires, and department stores. The company was founded in 1894 and is headquartered in Hershey, Pennsylvania.",
    "ceo": "Ms. Michele Gross Buck",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "18075",
    "phone": "717 534 4200",
    "address": "19 East Chocolate Avenue",
    "city": "Hershey",
    "state": "PA",
    "zip": "17033",
    "dcfDiff": 15.0129,
    "dcf": 233.773,
    "image": "https://financialmodelingprep.com/image-stock/HSY.png",
    "ipoDate": "1927-12-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]