[
  {
    "symbol": "HTH",
    "price": 30.88,
    "beta": 1.05,
    "volAvg": 341185,
    "mktCap": 2007938032,
    "lastDiv": 0.64,
    "range": "24.18-34.87",
    "changes": -0.01,
    "companyName": "Hilltop Holdings Inc.",
    "currency": "USD",
    "cik": "0001265131",
    "isin": "US4327481010",
    "cusip": "432748101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.hilltop-holdings.com",
    "description": "Hilltop Holdings Inc. provides business and consumer banking, and financial products and services. It operates through three segments: Banking, Broker-Dealer, and Mortgage Origination. The Banking segment offers savings, checking, interest-bearing checking, and money market accounts; certificates of deposit; lines and letters of credit, home improvement and equity loans, loans for purchasing and carrying securities, equipment loans and leases, agricultural and commercial real estate loans, and other loans; and commercial and industrial loans, and term and construction finance. This segment also provides treasury management, wealth management, asset management, check cards, safe deposit boxes, online banking, bill pay, trust, and overdraft services; and estate planning, management and administration, investment portfolio management, employee benefit accounts, and individual retirement accounts, as well as automated teller machines. The Broker-Dealer segment offers public finance services that assist public entities in originating, syndicating, and distributing securities of municipalities and political subdivisions; specialized advisory and investment banking services; advice and guidance to arbitrage rebate compliance, portfolio management, and local government investment pool administration; structured finance services, which include advisory services for derivatives and commodities; sells, trades in, and underwrites U.S. government and government agency bonds, corporate bonds, and municipal bonds, as well as mortgage-backed, asset-backed, and commercial mortgage-backed securities and structured products. This segment also provides asset and liability management advisory, clearing, retail, and securities lending services. The Mortgage Origination segment offers mortgage, jumbo, Federal Housing Administration, Veterans Affairs, and United States Department of Agriculture loans. Hilltop Holdings Inc. was founded in 1998 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Jeremy Blue Ford",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4100",
    "phone": "214 855 2177",
    "address": "6565 Hillcrest Avenue",
    "city": "Dallas",
    "state": "TX",
    "zip": "75205",
    "dcfDiff": 32.2938,
    "dcf": 64.7138,
    "image": "https://financialmodelingprep.com/image-stock/HTH.png",
    "ipoDate": "2004-02-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]