[
  {
    "symbol": "HTHIY",
    "price": 123.85,
    "beta": 0.847126,
    "volAvg": 34783,
    "mktCap": 58068929259,
    "lastDiv": 2.09,
    "range": "83.49-128.48",
    "changes": 1.4,
    "companyName": "Hitachi, Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US4335785071",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Conglomerates",
    "website": "https://www.hitachi.co.jp",
    "description": "Hitachi, Ltd. provides information technology, energy, industry, mobility, and smart life solutions in Japan and internationally. The company offers information and telecommunication services, such as internet of things, storage systems, servers, software, ATMs, and scanners for manufacturing, communication, finance, healthcare and life science, energy and transportation, and distribution industries, as well as government and urban sectors; drone platform and unmanned aerial system traffic management solutions; infrastructure information systems; and consulting and system integration services. It also operates nuclear power plants, power grides, wind turbines, and power generation systems; provides energy and equipment management services; power semiconductors; elevators, escalators and moving sidewalk, and control elevator systems; and transportation systems. In addition, the company offers medical equipment for radiation therapy, In-vitro diagnosis, and regenerative medicines; automotive systems; home appliances; and water treatment solutions for water supply and sewage infrastructure, industrial water treatment, seawater desalination, and water recycling, as well as maintenance and repair services. Further, it manufactures and sales air and centrifugal compressors, blowers, electrical machinery control systems, fans, pumps, pharmaceutical manufacturing execution systems, induction motors, industrial computers and controllers, inverters, logistics and marking systems, IGBT drives, motors, nitrogen gas generators, rope and chain hoist, PCS, UPS, switches and breakers, steel systems, and transformers. Additionally, the company offers functional components and equipment, power electronic and magnetic materials, wires, and cable and related products; optical disk drives; and property management services. Hitachi, Ltd. was founded in 1910 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Keiji  Kojima",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "322525",
    "phone": "81 3 3258 1111",
    "address": "6-6, Marunouchi 1-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "100-8280",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HTHIY.png",
    "ipoDate": "1982-04-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]