[
  {
    "symbol": "HUBB",
    "price": 321.82,
    "beta": 0.990845,
    "volAvg": 408597,
    "mktCap": 17245851070,
    "lastDiv": 4.48,
    "range": "176.42-326.62",
    "changes": -1.5,
    "companyName": "Hubbell Incorporated",
    "currency": "USD",
    "cik": "0000048898",
    "isin": "US4435106079",
    "cusip": "443510607",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electrical Equipment & Parts",
    "website": "https://www.hubbell.com",
    "description": "Hubbell Incorporated, together with its subsidiaries, designs, manufactures, and sells electrical and electronic products in the United States and internationally. It operates through two segments, Electrical Solution and Utility Solution. The Electrical Solution segment offers standard and special application wiring device products, rough-in electrical products, connector and grounding products, lighting fixtures, and other electrical equipment for use in industrial, commercial, and institutional facilities by electrical contractors, maintenance personnel, electricians, utilities, and telecommunications companies, as well as components and assemblies for the natural gas distribution market. It also designs and manufactures various industrial controls, and communication systems for use in the non-residential and industrial markets, as well as in the oil and gas, and mining industries. This segment sells its products through electrical and industrial distributors, home centers, retail and hardware outlets, lighting showrooms, and residential product-oriented Internet sites; and special application products primarily through wholesale distributors to contractors, industrial customers, and original equipment manufacturers. The Utility Solution segment designs, manufactures, and sells distribution, transmission, substation, and telecommunications products, such as arresters, insulators, connectors, anchors, bushings, and enclosures; and utility infrastructure products, including smart meters, communications systems, and protection and control devices. This segment sells its products to distributors, as well as directly to users, such as utilities, telecommunication companies, industrial firms, and construction and engineering firms. Its brand portfolio includes Hubbell, Kellems, Bryant, Burndy, CMC, Bell, TayMac, Wiegmann, Killark, Hawke, Aclara, Fargo, Quazite, Hot Box, etc. The company was founded in 1888 and is headquartered in Shelton, Connecticut.",
    "ceo": "Mr. Gerben W. Bakker",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "16600",
    "phone": "475 882 4000",
    "address": "40 Waterview Drive",
    "city": "Shelton",
    "state": "CT",
    "zip": "06484-1000",
    "dcfDiff": 27.9885,
    "dcf": 259.019,
    "image": "https://financialmodelingprep.com/image-stock/HUBB.png",
    "ipoDate": "1972-06-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]