[
  {
    "symbol": "HUBG",
    "price": 78.96,
    "beta": 0.894366,
    "volAvg": 248701,
    "mktCap": 2587827144,
    "lastDiv": 0,
    "range": "67.36-104.67",
    "changes": 0.13,
    "companyName": "Hub Group, Inc.",
    "currency": "USD",
    "cik": "0000940942",
    "isin": "US4433201062",
    "cusip": "443320106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Integrated Freight & Logistics",
    "website": "https://www.hubgroup.com",
    "description": "Hub Group, Inc., a supply chain solutions provider, offers transportation and logistics management services in North America. The company's transportation services include intermodal, truckload, less-than-truckload, flatbed, temperature-controlled, and dedicated and regional trucking, as well as final mile, railcar, small parcel, and international transportation. Its logistics services comprise full outsource logistics solution, transportation management, freight consolidation, warehousing and fulfillment, final mile delivery, and parcel and international services. The company also provides dry van, expedited, less-than-truckload, refrigerated, and flatbed truck brokerage services. It offers a fleet of approximately 1,000 tractors and 4,600 trailers to its customers, as well as the driver staffing, management, and infrastructure. The company serves a range of industries, including retail, consumer products, and durable goods. As of December 31, 2021, it owned approximately 43,750 dry, 53-foot containers, as well as 450 refrigerated, 53-foot containers; and leased approximately 250 dry, 53-foot containers. The company was founded in 1971 and is headquartered in Oak Brook, Illinois.",
    "ceo": "Mr. Phillip D. Yeager",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "6084",
    "phone": "630 271 3600",
    "address": "2000 Clearwater Drive",
    "city": "Oak Brook",
    "state": "IL",
    "zip": "60523-8809",
    "dcfDiff": 2.46356,
    "dcf": 86.0536,
    "image": "https://financialmodelingprep.com/image-stock/HUBG.png",
    "ipoDate": "1996-03-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]