[
  {
    "symbol": "HUM",
    "price": 444.83,
    "beta": 0.726056,
    "volAvg": 1128516,
    "mktCap": 55579284350,
    "lastDiv": 3.54,
    "range": "435.0-571.3",
    "changes": -1.09,
    "companyName": "Humana Inc.",
    "currency": "USD",
    "cik": "0000049071",
    "isin": "US4448591028",
    "cusip": "444859102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Healthcare Plans",
    "website": "https://www.humana.com",
    "description": "Humana Inc., together with its subsidiaries, operates as a health and well-being company in the United States. It operates through three segments: Retail, Group and Specialty, and Healthcare Services. The company offers medical and supplemental benefit plans to individuals. It also has a contract with Centers for Medicare and Medicaid Services to administer the Limited Income Newly Eligible Transition prescription drug plan program; and contracts with various states to provide Medicaid, dual eligible, and long-term support services benefits. In addition, the company provides commercial fully insured medical and specialty health insurance benefits comprising dental, vision, and other supplemental health benefits; and administrative services only products to individuals and employer groups, as well as military services, such as TRICARE T2017 East Region contract. Further, it offers pharmacy solutions, provider services, and home solutions services, such as home health and other services to its health plan members, as well as to third parties. As of December 31, 2021, the company had approximately 17 million members in medical benefit plans, as well as approximately 5 million members in specialty products. Humana Inc. was founded in 1961 and is headquartered in Louisville, Kentucky.",
    "ceo": "Mr. Bruce Dale Broussard",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "67100",
    "phone": "502 580 1000",
    "address": "Humana Building",
    "city": "Louisville",
    "state": "KY",
    "zip": "40202",
    "dcfDiff": 69.7195,
    "dcf": 551.41,
    "image": "https://financialmodelingprep.com/image-stock/HUM.png",
    "ipoDate": "1981-12-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]