[
  {
    "symbol": "HUN",
    "price": 26.45,
    "beta": 1.142605,
    "volAvg": 1979979,
    "mktCap": 4792290562,
    "lastDiv": 0.95,
    "range": "23.53-33.46",
    "changes": 0.44,
    "companyName": "Huntsman Corporation",
    "currency": "USD",
    "cik": "0001307954",
    "isin": "US4470111075",
    "cusip": "447011107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Chemicals",
    "website": "https://www.huntsman.com",
    "description": "Huntsman Corporation manufactures and sells differentiated organic chemical products worldwide. The company operates through four segments: Polyurethanes, Performance Products, Advanced Materials, and Textile Effects. The Polyurethanes segment offers polyurethane chemicals, including methyl diphenyl diisocyanate, polyols, thermoplastic polyurethane, propylene oxide, and methyl tertiary-butyl ether products. The Performance Products segment manufactures amines and maleic anhydrides, including ethylene oxide, propylene oxide, glycols, ethylene dichloride, caustic soda, ammonia, hydrogen, methylamines, and acrylonitrile. The Advanced Materials segment offers epoxy, acrylic, polyurethane, and acrylonitrile-butadiene-based polymer formulations; high performance thermoset resins, curing agents and toughening agents, and carbon nanotubes additives; and base liquid and solid resins. The Textile Effects segment provides textile chemicals and dyes. The company's products are used in a range of applications, including adhesives, aerospace, automotive, construction products, durable and non-durable consumer products, electronics, insulation, medical, packaging, coatings and construction, power generation, refining, synthetic fiber, textile chemicals, and dye industries. Huntsman Corporation was founded in 1970 and is headquartered in The Woodlands, Texas.",
    "ceo": "Mr. Peter R. Huntsman",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "7000",
    "phone": "281 719 6000",
    "address": "10003 Woodloch Forest Drive",
    "city": "The Woodlands",
    "state": "TX",
    "zip": "77380",
    "dcfDiff": 0.690409,
    "dcf": 32.1104,
    "image": "https://financialmodelingprep.com/image-stock/HUN.png",
    "ipoDate": "2005-02-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]