[
  {
    "symbol": "HVRRY",
    "price": 104.72,
    "beta": 0.628735,
    "volAvg": 1762,
    "mktCap": 25257835680,
    "lastDiv": 2.75,
    "range": "65.98-111.33",
    "changes": -0.77,
    "companyName": "Hannover Rück SE",
    "currency": "USD",
    "cik": null,
    "isin": "US4106931052",
    "cusip": "410693105",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Insurance—Reinsurance",
    "website": "https://www.hannover-re.com",
    "description": "Hannover Rück SE, together with its subsidiaries, provides reinsurance products and services worldwide. It operates through Property & Casualty Reinsurance, and Life & Health Reinsurance segments. The company offers property, casualty, facultative, catastrophe XL, structured reinsurance, and insurance-linked securities. It also provides risk solutions for agricultural, livestock, and bloodstock businesses; aviation and space business; and marine and offshore energy business, as well as credit, surety, and political risks reinsurance products. In addition, the company offers group and individual credit life, enhanced annuities, group life and health, and Takaful reinsurance products; and risk solutions in the areas of critical illness, disability, health, longevity, long term care, mortality, and morbidity. Further, it provides various financial solutions, including new-business financing; monetization of embedded value; reserve and solvency relief; and divestiture of non-core businesses. The company was formerly known as Hannover Rückversicherung AG and changed its name to Hannover Rück SE in March 2013. The company was founded in 1966 and is headquartered in Hanover, Germany. Hannover Rück SE is a subsidiary of Talanx AG.",
    "ceo": "Mr. Jean-Jacques  Henchoz",
    "sector": "Financial Services",
    "country": "DE",
    "fullTimeEmployees": "3519",
    "phone": "49 511 5604 0",
    "address": "Karl-Wiechert-Allee 50",
    "city": "Hanover",
    "state": null,
    "zip": "30625",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/HVRRY.png",
    "ipoDate": "2010-01-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]