[
  {
    "symbol": "HWC",
    "price": 38.34,
    "beta": 1.328169,
    "volAvg": 633938,
    "mktCap": 3300196167,
    "lastDiv": 1.2,
    "range": "31.02-57.0",
    "changes": 0.18,
    "companyName": "Hancock Whitney Corporation",
    "currency": "USD",
    "cik": "0000750577",
    "isin": "US4101201097",
    "cusip": "410120109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.hancockwhitney.com",
    "description": "Hancock Whitney Corporation operates as the financial holding company for Hancock Whitney Bank that provides traditional and online banking services to commercial, small business, and retail customers. It accepts various deposit products, including noninterest-bearing demand deposits, interest-bearing transaction accounts, savings accounts, money market deposit accounts, and time deposit accounts. The company also offers loans products comprising commercial and industrial loans; commercial real estate loans; construction and land development loans; residential mortgages; consumer loans comprising second lien mortgage home loans, home equity lines of credit, and nonresidential consumer purpose loans; revolving credit facilities; and letters of credit and financial guarantees. In addition, it offers investment brokerage and treasury management services, and annuity and life insurance products; and trust and investment management services to retirement plans, corporations, and individuals. Further, the company facilitates investments in new market tax credit activities; and holds various foreclosed assets. The company operates 177 banking locations and 239 automated teller machines primarily in the Gulf south corridor, including southern and central Mississippi; southern and central Alabama; southern, central, and northwest Louisiana; the northern, central, and panhandle regions of Florida; and certain areas of east Texas, including Houston, Beaumont, Dallas, and San Antonio. It also operates a loan production office in Tennessee; and a trust and asset management office in Texas. The company was formerly known as Hancock Holding Company and changed its name to Hancock Whitney Corporation in May 2018. Hancock Whitney Corporation was founded in 1899 and is headquartered in Gulfport, Mississippi.",
    "ceo": "Mr. John M. Hairston",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3679",
    "phone": "228 868 4000",
    "address": "Hancock Whitney Plaza",
    "city": "Gulfport",
    "state": "MS",
    "zip": "39501",
    "dcfDiff": 51.5984,
    "dcf": 101.778,
    "image": "https://financialmodelingprep.com/image-stock/HWC.png",
    "ipoDate": "1991-06-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]