[
  {
    "symbol": "HWM",
    "price": 48.11,
    "beta": 1.279225,
    "volAvg": 2756145,
    "mktCap": 19883430395,
    "lastDiv": 0.16,
    "range": "30.05-48.34",
    "changes": 0.01,
    "companyName": "Howmet Aerospace Inc.",
    "currency": "USD",
    "cik": "0000004281",
    "isin": "US4432011082",
    "cusip": "443201108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.howmet.com",
    "description": "Howmet Aerospace Inc. provides advanced engineered solutions for the aerospace and transportation industries in the United States, Japan, France, Germany, the United Kingdom, Mexico, Italy, Canada, Poland, China, and internationally. It operates through four segments: Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels. The Engine Products segment offers airfoils and seamless rolled rings primarily for aircraft engines and industrial gas turbines; and rotating parts, as well as structural parts. The Fastening Systems segment produces aerospace fastening systems, as well as commercial transportation, industrial, and other fasteners. The Engineered Structures segment provides titanium ingots and mill products for aerospace and defense applications; and aluminum and nickel forgings, and machined components and assemblies. The Forged Wheels segment offers forged aluminum wheels and related products for heavy-duty trucks and commercial transportation markets. The company was formerly known as Arconic Inc. The company was founded in 1888 and is based in Pittsburgh, Pennsylvania.",
    "ceo": "Mr. John C. Plant FCA",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "21400",
    "phone": "412 553 1950",
    "address": "201 Isabella Street",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15212-5872",
    "dcfDiff": 1.49101,
    "dcf": 38.909,
    "image": "https://financialmodelingprep.com/image-stock/HWM.png",
    "ipoDate": "2016-11-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]