[
  {
    "symbol": "HZNP",
    "price": 103,
    "beta": 1.112323,
    "volAvg": 2330414,
    "mktCap": 23548066000,
    "lastDiv": 0,
    "range": "57.84-113.83",
    "changes": 0.29,
    "companyName": "Horizon Therapeutics Public Limited Company",
    "currency": "USD",
    "cik": "0001492426",
    "isin": "IE00BQPVQZ61",
    "cusip": "G46188101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.horizontherapeutics.com",
    "description": "Horizon Therapeutics Public Limited Company, a biotechnology company, focuses on the discovery, development, and commercialization of medicines that address critical needs for people impacted by rare, autoimmune, and severe inflammatory diseases. The company operates in two segments, Orphan and Inflammation. Its portfolio comprises 12 medicines in the areas of rare diseases, gout, ophthalmology, and inflammation. It markets TEPEZZA (teprotumumab-trbw) for intravenous infusion; KRYSTEXXA (pegloticase injection) for intravenous infusion; RAVICTI (glycerol phenylbutyrate) oral liquid; PROCYSBI (cysteamine bitartrate) delayed-release capsules and granules for oral use; ACTIMMUNE (interferon gamma-1b) injection for subcutaneous use; BUPHENYL (sodium phenylbutyrate) tablets and powder for oral use; QUINSAIR (levofloxacin) solution for inhalation; and UPLIZNA (inebilizumab-cdon) injection for intravenous use. The company also markets PENNSAID (diclofenac sodium topical solution) for topical use; DUEXIS (ibuprofen/famotidine) tablets for oral use; RAYOS (prednisone) delayed-release tablets for oral use; and VIMOVO (naproxen/esomeprazole magnesium) delayed-release tablets for oral use. It has collaboration agreements with HemoShear Therapeutics, LLC.; Alpine Immune Sciences, Inc.; Halozyme Therapeutics, Inc.; and Arrowhead Pharmaceuticals, Inc. The company was formerly known as Horizon Pharma Public Limited Company and changed its name to Horizon Therapeutics Public Limited Company in May 2019. Horizon Therapeutics Public Limited Company was founded in 2005 and is headquartered in Dublin, Ireland with additional offices in Deerfield, Illinois; Chicago, Illinois; Lake Forest, Illinois; South San Francisco, California; Washington, D.C.; Gaithersburg, Maryland; Rockville, Maryland; and Mannheim, Germany.",
    "ceo": "Mr. Timothy P. Walbert",
    "sector": "Healthcare",
    "country": "IE",
    "fullTimeEmployees": "2145",
    "phone": "353 1 772 2100",
    "address": "70 St. Stephen’s Green",
    "city": "Dublin",
    "state": null,
    "zip": "2",
    "dcfDiff": 26.5802,
    "dcf": 84.0498,
    "image": "https://financialmodelingprep.com/image-stock/HZNP.png",
    "ipoDate": "2011-07-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]