[
  {
    "symbol": "IAC",
    "price": 63.51,
    "beta": 1.134228,
    "volAvg": 645311,
    "mktCap": 5452650986,
    "lastDiv": 0.9411430000000003,
    "range": "41.52-81.66",
    "changes": 0.96,
    "companyName": "IAC Inc.",
    "currency": "USD",
    "cik": "0001800227",
    "isin": "US44891N1090",
    "cusip": "44891N208",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Content & Information",
    "website": "https://www.iac.com",
    "description": "IAC/InterActiveCorp operates as a media and internet company worldwide. The company publishes original and engaging digital content in the form of articles, illustrations, and videos and images across entertainment, food, home, beauty, travel, health, family, luxury, and fashion areas; and magazines related to women and lifestyle. It also operates a digital marketplace that connects home service professionals with consumers for repairing, remodeling, cleaning, landscaping, maintenance, and enhancement services under the Angi Ads, Angi Leads, and Angi Services brands. In addition, the company operates websites that offer general search services and information, including Ask.com, a search site with a variety of fresh and contemporary content; Reference.com that offers content across select vertical categories; Consumersearch.com, which offers content designed to simplify the product research process; and Shopping.net, a vertical shopping search site that contains a mix of search services and/or content targeted to various user or segment demographics, as well as offers direct-to-consumer downloadable desktop applications. Further, it offers Care.com, an online destination for families to connect with caregivers for their children, aging parents, pets, and homes; develops and provides subscription mobile applications across the communication, language, weather, business, health, and lifestyle verticals; a technology driven staffing platform for flexible W-2 work under the Bluecrew name; a platform to connect healthcare professionals with job opportunities under the Vivian Health name; The Daily Beast, a website dedicated to news, commentary, culture, and entertainment that publishes original reporting and opinion; and production and producer services for feature films for sale and distribution through theatrical releases and video-on-demand services. The company was formerly known as IAC HOLDINGS, INC. IAC/InterActiveCorp is headquartered in New York, New York.",
    "ceo": "Mr. Joseph M. Levin",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "11000",
    "phone": "212 314 7300",
    "address": "555 West 18Th Street",
    "city": "New York",
    "state": "NY",
    "zip": "10011",
    "dcfDiff": 12.0204,
    "dcf": 68.1104,
    "image": "https://financialmodelingprep.com/image-stock/IAC.png",
    "ipoDate": "1993-01-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]