[
  {
    "symbol": "IAS",
    "price": 18.15,
    "beta": 0,
    "volAvg": 919111,
    "mktCap": 2811943200,
    "lastDiv": 0,
    "range": "6.63-19.659",
    "changes": 0.01,
    "companyName": "Integral Ad Science Holding Corp.",
    "currency": "USD",
    "cik": "0001842718",
    "isin": "US45828L1089",
    "cusip": "45828L108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Advertising Agencies",
    "website": "https://integralads.com",
    "description": "Integral Ad Science Holding Corp. operates as a digital advertising verification company in the United States, the United Kingdom, Germany, Italy, Spain, Sweden, Singapore, Australia, France, Japan, Canada, India, and Brazil. The company provides IAS Signal, a cloud-based technology platform that offers actionable insights; and deliver independent measurement and verification of digital advertising across devices, channels, and formats, including desktop, mobile, connected TV, social, display, and video. Its digital media quality solutions offer ad fraud detection and prevention, viewability, brand safety and suitability, contextual targeting, inventory yield management, and reporting. The company offers Quality Impressions, a metric designed to verify that digital ads are served to a real person rather than a bot, viewable on-screen, and presented in a brand-safe and suitable environment in the correct geography; Context Control solution that delivers contextual targeting and brand suitability capabilities; pre-bid programmatic and post-bid verification solutions for advertisers; and optimization and verification solutions for publishers. It serves advertisers and agencies, publishers, advertising/audience networks, and supply side platforms. The company was founded in 2009 and is headquartered in New York, New York.",
    "ceo": "Ms. Lisa  Utzschneider",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "835",
    "phone": "646 278 4871",
    "address": "95 Morton Street",
    "city": "New York",
    "state": "NY",
    "zip": "10014",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/IAS.png",
    "ipoDate": "2021-06-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]