[
  {
    "symbol": "IBDRY",
    "price": 51.75,
    "beta": 0.496934,
    "volAvg": 81922,
    "mktCap": 81067929984,
    "lastDiv": 2.7,
    "range": "35.15-52.77",
    "changes": 0.04,
    "companyName": "Iberdrola, S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US4507371015",
    "cusip": "450737101",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Utilities—Diversified",
    "website": "https://www.iberdrola.com",
    "description": "Iberdrola, S.A. engages in the generation, transmission, distribution, and supply of electricity in Spain and internationally. It generates and markets electrical power using renewable sources, such as onshore and offshore wind, hydro, solar photovoltaic, combined cycle gas, nuclear, and biomass, as well as through installation of batteries. The company is also involved in the purchase and sale of electricity and gas on wholesale markets; development of green hydrogen projects; and distribution and sale of gas. It has a total installed capacity of 58,320 MW, including 38,138 MW of renewable installed capacity; and operates 1.2 million kilometers of electricity transmission and distribution lines, as well as serves 36.11 million consumers. In addition, the company offers energy storage, heat pumps, self-consumption, and electric vehicles for residential customers; and management of energy facilities, as well as supplies green H2, industrial heat, etc. to industrial customers. Iberdrola, S.A. was founded in 1840 and is headquartered in Bilbao, Spain.",
    "ceo": "Mr. Armando Martínez Martínez",
    "sector": "Utilities",
    "country": "ES",
    "fullTimeEmployees": "40920",
    "phone": "34 944 15 14 11",
    "address": "Plaza Euskadi 5",
    "city": "Bilbao",
    "state": null,
    "zip": "48009",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/IBDRY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]