[
  {
    "symbol": "IBN",
    "price": 23.01,
    "beta": 0.700684,
    "volAvg": 4075967,
    "mktCap": 80478397609,
    "lastDiv": 0.126,
    "range": "17.57-23.75",
    "changes": 0.03,
    "companyName": "ICICI Bank Limited",
    "currency": "USD",
    "cik": "0001103838",
    "isin": "US45104G1040",
    "cusip": "45104G104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.icicibank.com",
    "description": "ICICI Bank Limited provides various banking products and financial services in India and internationally. It operates through Retail Banking, Wholesale Banking, Treasury, Other Banking, Life insurance, General insurance, and Others segments. The company offers savings, salary, pension, current, and other accounts; and time, fixed, recurring, and security deposits. It also provides home, car, two-wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, including working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and overdraft facilities, as well as loans for new entities, card swipes, and schools and colleges; and credit, debit, prepaid, travel, and corporate cards. In addition, the company offers insurance products; pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, initial public offerings, and other online investment services; and agri and rural business, farmer finance, tractor loans, and micro banking services, as well as other services to agri corporates. Further, it provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, project and technology finance, and institutional banking services, as well as Internet, mobile, and phone banking services. Additionally, the company offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, pension fund management, asset management, investment advisory, points of presence, and private equity/venture capital fund management services. As of March 31, 2022, it had a network of 5,418 branches and 13,626 ATMs. ICICI Bank Limited was founded in 1955 and is headquartered in Mumbai, India.",
    "ceo": "Mr. Sandeep  Bakhshi B.E.",
    "sector": "Financial Services",
    "country": "IN",
    "fullTimeEmployees": "130542",
    "phone": "91 22 2653 1414",
    "address": "ICICI Bank Towers",
    "city": "Mumbai",
    "state": null,
    "zip": "400051",
    "dcfDiff": 519.572,
    "dcf": 539.682,
    "image": "https://financialmodelingprep.com/image-stock/IBN.png",
    "ipoDate": "2000-03-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]