[
  {
    "symbol": "IBP",
    "price": 134.09,
    "beta": 1.694366,
    "volAvg": 211572,
    "mktCap": 3808759405,
    "lastDiv": 1.32,
    "range": "74.69-136.58",
    "changes": -1.48,
    "companyName": "Installed Building Products, Inc.",
    "currency": "USD",
    "cik": "0001580905",
    "isin": "US45780R1014",
    "cusip": "45780R101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.installedbuildingproducts.com",
    "description": "Installed Building Products, Inc., together with its subsidiaries, engages in the installation of insulation, waterproofing, fire-stopping, fireproofing, garage doors, rain gutters, window blinds, shower doors, closet shelving and mirrors, and other products in the continental United States. The company offers a range of insulation materials, such as fiberglass and cellulose, and spray foam insulation materials. It is also involved in the installation of insulation and sealant materials in various areas of a structure, which includes basement and crawl space, building envelope, attic, and acoustical applications. In addition, the company installs a range of caulk and sealant products that control air infiltration in residential and commercial buildings; and waterproofing options, including sheet and hot applied waterproofing membranes, as well as deck coating, bentonite, and air and vapor systems. It serves homebuilders, multi-family and commercial construction firms, individual homeowners, and repair and remodeling contractors through a network of approximately 210 branch locations. The company was formerly known as CCIB Holdco, Inc. Installed Building Products, Inc. was founded in 1977 and is based in Columbus, Ohio.",
    "ceo": "Mr. Jeffrey W. Edwards",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "10300",
    "phone": "614 221 3399",
    "address": "495 South High Street",
    "city": "Columbus",
    "state": "OH",
    "zip": "43215",
    "dcfDiff": 19.5982,
    "dcf": 88.5518,
    "image": "https://financialmodelingprep.com/image-stock/IBP.png",
    "ipoDate": "2014-02-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]