[
  {
    "symbol": "ICL",
    "price": 5.64,
    "beta": 0.425342,
    "volAvg": 1273245,
    "mktCap": 7271934090,
    "lastDiv": 0.45,
    "range": "4.96-11.03",
    "changes": -0.16,
    "companyName": "ICL Group Ltd",
    "currency": "USD",
    "cik": "0000941221",
    "isin": "IL0002810146",
    "cusip": "M53213100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Agricultural Inputs",
    "website": "https://www.icl-group.com",
    "description": "ICL Group Ltd, together with its subsidiaries, operates as a specialty minerals and chemicals company worldwide. It operates in four segments: Industrial Products, Potash, Phosphate Solutions, and Innovative Ag Solutions (IAS). The Industrial Products segment produces bromine out of a solution that is a by-product of the potash production process, as well as bromine-based compounds; produces various grades of potash, salt, magnesium chloride, and magnesia products; and produces and markets phosphorous-based flame retardants and other phosphorus-based products. The Potash segment extracts potash from the Dead Sea; mines and produces potash and salt; produces Polysulphate; produces, markets, and sells magnesium and magnesium alloys, as well as related by-products, including chlorine and sylvinite; and sells salt. The Phosphate Solutions segment uses phosphate commodity products to produce specialty products; produces and markets phosphate-based fertilizers, as well as sulphuric acid, green phosphoric acid, and phosphate fertilizers; and manufactures thermal phosphoric acid for various industrial end markets, such as oral care, cleaning products, paints and coatings, water treatment, asphalt modification, construction, and metal treatment. It also develops and produces functional food ingredients and phosphate additives for use in the processed meat, poultry, seafood, dairy, beverage, and baked goods markets; and produces milk and whey proteins for the food ingredients industry. The IAS segment develops, manufactures, markets, and sells fertilizers based primarily on nitrogen, potash, and phosphate, including water soluble specialty, liquid, soluble, and controlled-release fertilizers. It sells its products through marketing companies, agents, and distributors. The company was formerly known as Israel Chemicals Ltd. and changed its name to ICL Group Ltd in May 2020. The company was founded in 1968 and is headquartered in Tel Aviv, Israel.",
    "ceo": "Mr. Raviv  Zoller",
    "sector": "Basic Materials",
    "country": "IL",
    "fullTimeEmployees": "12500",
    "phone": "972 3 684 4400",
    "address": "Millenium Tower",
    "city": "Tel Aviv",
    "state": null,
    "zip": "6107025",
    "dcfDiff": 0.467507,
    "dcf": 8.47751,
    "image": "https://financialmodelingprep.com/image-stock/ICL.png",
    "ipoDate": "2005-03-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]