[
  {
    "symbol": "ICLR",
    "price": 240.26,
    "beta": 1.10669,
    "volAvg": 708088,
    "mktCap": 19684117384,
    "lastDiv": 0,
    "range": "171.43-249.62",
    "changes": 11.35,
    "companyName": "ICON Public Limited Company",
    "currency": "USD",
    "cik": "0001060955",
    "isin": "IE0005711209",
    "cusip": "G4705A100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Diagnostics & Research",
    "website": "https://www.iconplc.com",
    "description": "ICON Public Limited Company, a clinical research organization, provides outsourced development and commercialization services in Ireland, rest of Europe, the United States, and internationally. The company specializes in the strategic development, management, and analysis of programs that support various stages of the clinical development process from compound selection to Phase I-IV clinical studies. It offers clinical development services, including early development, patient recruitment and retention, strategy and analytics, late phase research, data and technology solution, and consulting and analytics services. The company's clinical development services also comprise medical imaging, clinical research and laboratory services, project management, site monitoring and management services, data management, biostatistics and programming, medical writing and publishing, medical affair, endpoint adjudication/data monitoring committees, pharmacovigilance, interactive response technologies, clinical supplies management, strategic regulatory, medical communication, and consulting and advisory services. It serves pharmaceutical, biotechnology, and medical device industries, as well as government and public health organizations. The company was incorporated in 1990 and is headquartered in Dublin, Ireland.",
    "ceo": "Dr. Steven A. Cutler MBA, Ph.D.",
    "sector": "Healthcare",
    "country": "IE",
    "fullTimeEmployees": "41150",
    "phone": "353 1 291 2000",
    "address": "South County Business Park",
    "city": "Dublin",
    "state": null,
    "zip": "18",
    "dcfDiff": 0.969141,
    "dcf": 227.271,
    "image": "https://financialmodelingprep.com/image-stock/ICLR.png",
    "ipoDate": "1998-05-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]