[
  {
    "symbol": "IDA",
    "price": 102.19,
    "beta": 0.619718,
    "volAvg": 182761,
    "mktCap": 5171590644,
    "lastDiv": 3.16,
    "range": "93.53-115.92",
    "changes": -1.65,
    "companyName": "IDACORP, Inc.",
    "currency": "USD",
    "cik": "0001057877",
    "isin": "US4511071064",
    "cusip": "451107106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.idacorpinc.com",
    "description": "IDACORP, Inc., together with its subsidiaries, engages in the generation, transmission, distribution, purchase, and sale of electric energy in the United States. The company operates 17 hydropower generating plants located in southern Idaho and eastern Oregon; three natural gas-fired plants in southern Idaho; and interests in two coal-fired steam electric generating plants located in Wyoming and Nevada. As of December 31, 2021, it had approximately 4,843 pole-miles of high-voltage transmission lines; 23 step-up transmission substations located at power plants; 21 transmission substations; 10 switching stations; 30 mixed-use transmission and distribution substations; 187 energized distribution substations; and 28,570 pole-miles of distribution lines, as well as provides electric utility services to approximately 604,000 retail customers in southern Idaho and eastern Oregon. The company serves commercial and industrial customers, which involved in food processing, electronics and general manufacturing, agriculture, health care, government, and education. It also invests in housing and other real estate tax credit investments. IDACORP, Inc. was founded in 1915 and is headquartered in Boise, Idaho.",
    "ceo": "Ms. Lisa A. Grow",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "2070",
    "phone": "208 388 2200",
    "address": "1221 West Idaho Street",
    "city": "Boise",
    "state": "ID",
    "zip": "83702-5627",
    "dcfDiff": 5.15004,
    "dcf": 110.35,
    "image": "https://financialmodelingprep.com/image-stock/IDA.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]