[
  {
    "symbol": "IDCBY",
    "price": 10.54,
    "beta": 0.428352,
    "volAvg": 64832,
    "mktCap": 229619159091,
    "lastDiv": 0.84,
    "range": "8.48-11.92",
    "changes": 0.04,
    "companyName": "Industrial & Commercial Bank of China Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US4558071076",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Diversified",
    "website": "https://www.icbc-ltd.com",
    "description": "Industrial and Commercial Bank of China Limited, together with its subsidiaries, provides banking products and services in the People's Republic of China and internationally. It operates through Corporate Banking, Personal Banking, and Treasury Operations segments. The Corporate Banking segment offers financial products and services to corporations, government agencies, and financial institutions. Its products and services include corporate loans, trade financing, deposit taking activities, corporate wealth management services, custody activities, and various corporate intermediary services. The Personal Banking segment provides financial products and services to individual customers. This segment's products and services comprise personal loans and cards, deposits, and personal wealth management and intermediary services. The Treasury Operations segment is involved in the money market transactions, investment securities, and foreign exchange transactions businesses, as well as in the holding of derivative positions. It also offers e-banking services, investment banking, financial leasing, and insurance services. The company was founded in 1984 and is based in Beijing, the People's Republic of China.",
    "ceo": "Mr. Siqing  Chen",
    "sector": "Financial Services",
    "country": "CN",
    "fullTimeEmployees": "427587",
    "phone": "86 10 6610 6114",
    "address": "55 Fuxingmennei Avenue",
    "city": "Beijing",
    "state": null,
    "zip": "100140",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/IDCBY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]