[
  {
    "symbol": "IDCC",
    "price": 94.17,
    "beta": 1.192253,
    "volAvg": 364511,
    "mktCap": 2518265889,
    "lastDiv": 1.4,
    "range": "40.23-94.65",
    "changes": 1.8,
    "companyName": "InterDigital, Inc.",
    "currency": "USD",
    "cik": "0001405495",
    "isin": "US45867G1013",
    "cusip": "45867G101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Telecom Services",
    "website": "https://www.interdigital.com",
    "description": "InterDigital, Inc., together with its subsidiaries, designs and develops technologies that enable and enhance wireless communications in the United States, China, South Korea, Japan, Taiwan, and Europe. It provides technology solutions for use in digital cellular and wireless products and networks, including 2G, 3G, 4G, 5G, and IEEE 802-related products and networks. The company develops cellular technologies, such as technologies related to CDMA, TDMA, OFDM/OFDMA, and MIMO for use in 2G, 3G, 4G, and 5G wireless networks, as well as mobile terminal devices; and 3GPP technology portfolio in 5G NR, beyond 5G (B5G), extended reality over wireless, and cellular Internet of Things (IoT) areas, as well as technologies for automobiles, wearables, smart homes, drones, and other connected consumer electronic products. It also provides video coding and transmission technologies; and engages in the research and development of artificial intelligence. The company's patented technologies are used in various products that include cellular phones, tablets, notebook computers, and wireless personal digital assistants; wireless infrastructure equipment, which comprise base stations; components, dongles, and modules for wireless devices; and IoT devices and software platforms. As of December 31, 2021, it had a portfolio of approximately 27,500 patents and patent applications related to wireless communications, video coding, display technology, and other areas. InterDigital, Inc. was incorporated in 1972 and is headquartered in Wilmington, Delaware.",
    "ceo": "Mr. Lawrence  Chen",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "425",
    "phone": "302 281 3600",
    "address": "200 Bellevue Parkway",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19809-3727",
    "dcfDiff": 1.86885,
    "dcf": 71.3689,
    "image": "https://financialmodelingprep.com/image-stock/IDCC.png",
    "ipoDate": "1981-11-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]