[
  {
    "symbol": "IEP",
    "price": 27.7,
    "beta": 0.735563,
    "volAvg": 2909659,
    "mktCap": 10226756678,
    "lastDiv": 8,
    "range": "18.03-55.16",
    "changes": 0.84,
    "companyName": "Icahn Enterprises L.P.",
    "currency": "USD",
    "cik": "0000813762",
    "isin": "US4511001012",
    "cusip": "451100101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Conglomerates",
    "website": "https://www.ielp.com",
    "description": "Icahn Enterprises L.P., through its subsidiaries, operates in investment, energy, automotive, food packaging, real estate, home fashion, and pharma businesses in the United States and Internationally. Its Investment segment invests its proprietary capital through various private investment funds. The company's Energy segment refines and markets transportation fuels; and produces and markets nitrogen fertilizers in the form of urea ammonium nitrate and ammonia. Its Automotive segment is involved in the retail and wholesale distribution of automotive parts; and offers automotive repair and maintenance services. The company's Food Packaging segment produces and sells cellulosic, fibrous, and plastic casings that are used for preparing processed meat products. Its Real Estate segment is involved in the rental of retail, office, and industrial properties; construction and sale of single-family homes and residential units; and golf and club operations. This segment also engages in hotel and timeshare resort operations. The company's Home Fashion segment manufactures, sources, markets, distributes, and sells home fashion consumer products. Its Pharma segment offers pharmaceutical products and services. The company was incorporated in 1987 and is headquartered in Sunny Isles Beach, Florida.",
    "ceo": "Mr. David P. Willetts",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "20041",
    "phone": "305 422 4100",
    "address": "16690 Collins Avenue",
    "city": "Sunny Isles Beach",
    "state": "FL",
    "zip": "33160",
    "dcfDiff": 6.12556,
    "dcf": 59.9756,
    "image": "https://financialmodelingprep.com/image-stock/IEP.png",
    "ipoDate": "1987-07-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]