[
  {
    "symbol": "IFNNY",
    "price": 39.3,
    "beta": 1.631417,
    "volAvg": 191561,
    "mktCap": 51196896000,
    "lastDiv": 0.34,
    "range": "21.43-42.69",
    "changes": -0.09,
    "companyName": "Infineon Technologies AG",
    "currency": "USD",
    "cik": "0001107457",
    "isin": "US45662N1037",
    "cusip": "45662N103",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Semiconductors",
    "website": "https://www.infineon.com",
    "description": "Infineon Technologies AG designs, develops, manufactures, and markets semiconductors and related system solutions worldwide. Its Automotive segment offers automotive microcontrollers; 3D ToF, magnetic, and pressure sensors; discrete power semiconductors; IGBT modules; industrial microcontrollers; power and radar sensor integrated circuits (ICs); transceivers; silicon carbide diodes, MOSEFTs, and modules; and voltage regulators for use in assistance and safety systems, comfort electronics, infotainment, powertrain, and security products. The company's Industrial Power Control segment provides bare dies, discrete IGBTs, driver ICs, SIC diodes, and IGBT modules and stacks for home appliances, industrial drives, industrial power supplies, industrial robotics, industrial vehicles, and traction, as well as for energy generation, storage, and transmission. Its Power & Sensor Systems segment offers gas sensors, MEMS microphones, and pressure sensors chips; discrete low-voltage, mid-voltage, and high-voltage power MOSFETs; control ICs; customized chips; GaN power switches; GPS low-noise amplifiers; low-voltage and high-voltage driver ICs; radar sensor ICs; RF antenna switches and power transistors; transient voltage suppressor diodes; and USB controllers for use in audio amplifiers, automotive electronics, BLDC motors, cellular communications infrastructure, electric vehicle charging stations, human machine interaction, Internet of Things, LED and conventional lighting systems, mobile devices, and power management applications. The company's Connected Secure Systems segment provides connectivity solutions, embedded security controllers, microcontrollers, and security controllers for authentication, automotive, consumer electronics, government identification document, Internet of Things, mobile communication, payment system, ticketing, access control, and trusted computing applications. Infineon Technologies AG was founded in 1999 and is headquartered in Munich, Germany.",
    "ceo": "Mr. Jochen  Hanebeck",
    "sector": "Technology",
    "country": "DE",
    "fullTimeEmployees": "57217",
    "phone": "49 89 234 26655",
    "address": "Am Campeon 1-15",
    "city": "Munich",
    "state": null,
    "zip": "85579",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/IFNNY.png",
    "ipoDate": "2000-03-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]