[
  {
    "symbol": "IFS",
    "price": 24.15,
    "beta": 0.79452,
    "volAvg": 51916,
    "mktCap": 2787344700,
    "lastDiv": 1.18,
    "range": "19.65-29.5",
    "changes": 0.09,
    "companyName": "Intercorp Financial Services Inc.",
    "currency": "USD",
    "cik": "0001615903",
    "isin": "PAL2400671A3",
    "cusip": "P5626F128",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.ifs.com.pe",
    "description": "Intercorp Financial Services Inc. provides banking, insurance, and wealth management services for retail and commercial clients in Peru. The company operates through three segments: Banking, Insurance, and Wealth Management. It provides transactional accounts, such as cuenta sueldo and cuenta simple; savings accounts; investment accounts; and time deposits, certificates of deposit, and compensation for service time accounts. The company also offers retail banking products, including credit cards, payroll deduction loans, mortgages, and consumer loans, as well as cash, student, and collateralized cash loans. In addition, the company provides corporate, medium-size business, and small business banking services; and commercial banking products, which include commercial real estate, vehicles, machinery and other goods, cash management, trade finance, and electronic factoring products. Further, it offers treasury and institutional banking, as well as securitization services. Additionally, the company provides annuities and conventional life insurance, and other retail insurance products, as well as financial advisory services for equities, fixed income, structured products, alternative investments, and managed accounts; brokerage, and investment management services. As of December 31, 2021, it operated 189 financial stores and 1,581 ATMs. Intercorp Financial Services Inc. was incorporated in 1897 and is based in Lima, Peru. Intercorp Financial Services Inc. operates as a subsidiary of Intercorp Perú Ltd.",
    "ceo": "Lord Luis Felipe  Castellanos Lopez-Torres B.B.A.",
    "sector": "Financial Services",
    "country": "PE",
    "fullTimeEmployees": "7378",
    "phone": "511 219 000",
    "address": "Torre Interbank",
    "city": "Lima",
    "state": null,
    "zip": "13",
    "dcfDiff": 143.206,
    "dcf": 167.076,
    "image": "https://financialmodelingprep.com/image-stock/IFS.png",
    "ipoDate": "2019-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]