[
  {
    "symbol": "IGT",
    "price": 31.46,
    "beta": 1.896126,
    "volAvg": 1560201,
    "mktCap": 6298732440,
    "lastDiv": 0.8,
    "range": "15.01-32.23",
    "changes": 0.03,
    "companyName": "International Game Technology PLC",
    "currency": "USD",
    "cik": "0001619762",
    "isin": "GB00BVG7F061",
    "cusip": "G4863A108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Gambling",
    "website": "https://www.igt.com",
    "description": "International Game Technology PLC operates and provides gaming technology products and services in North America, Europe, the Middle East, Africa, Asia-Pacific, Latin America, and the Caribbean. It operates in three segments: Global Lottery, Global Gaming, and Digital & Betting. The company designs, sells, operates, and leases a suite of point-of-sale machines that reconciles lottery funds between the retailer and lottery authority; provides online lottery transaction processing systems; produces instant ticket games; and offers printing services, such as instant ticket marketing plans and graphic design, programming, packaging, shipping, and delivery services. It also designs, develops, assembles, and provides cabinets, games, systems, and software for the gaming market, as well as offers gaming management systems for casino management, customer relationship management, patron management, and server-based gaming. In addition, the company provides video lottery terminals (VLT), VLT central systems, and VLT games. Further, it offers digital gaming and betting; sports betting; and technology and management services. Additionally, the company provides digital gaming products and services, including blackjack, roulette, slot games, poker, bingo, and other casino card games; social casino content; and remote game server, as well as iGaming systems and digital platforms that offer player account management, advanced marketing and analytical, and payment system services. It processes commercial transactions, such as prepaid cellular telephone recharges, bill payments, e-vouchers and retail-based programs, electronic tax payments, prepaid card recharges, and stamp duty and money transfer services. The company was formerly known as GTECH S.p.A. and changed its name to International Game Technology PLC in April 2015. The company was founded in 2014 and is headquartered in London, the United Kingdom. International Game Technology PLC is a subsidiary of De Agostini S.p.A.",
    "ceo": "Mr. Vincent L. Sadusky",
    "sector": "Consumer Cyclical",
    "country": "GB",
    "fullTimeEmployees": "10500",
    "phone": "44 2075 353 200",
    "address": "Marble Arch House",
    "city": "London",
    "state": null,
    "zip": "W1H 5BT",
    "dcfDiff": 0.157904,
    "dcf": 26.8179,
    "image": "https://financialmodelingprep.com/image-stock/IGT.png",
    "ipoDate": "1990-03-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]