[
  {
    "symbol": "IHICY",
    "price": 6.552,
    "beta": 1.515325,
    "volAvg": 2851,
    "mktCap": 3964962613,
    "lastDiv": 0.15,
    "range": "4.995-7.525",
    "changes": 0.022,
    "companyName": "IHI Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US44962U1079",
    "cusip": "44962U107",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.ihi.co.jp",
    "description": "IHI Corporation operates in resources, energy, and environment; social infrastructure and offshore facilities; industrial systems and general-purpose machinery; aero engine, space, and defense; and other business areas in Japan and internationally. It provides carbon reduction solutions; gas turbines and engines, and diesel engines for land use, and high-speed ships and other marine vessels; LNG receiving terminals and storage tanks; and equipment for various plants. The company also constructs natural gas liquefaction, oil refining, petrochemicals, LPG, and other process plants; develops and constructs nuclear fuel cycle systems; provides components for boiling and pressurized water reactors; and constructs bridges and steel structures. It offers water gates for rivers and dams; environmental monitoring products; concrete construction materials; 3D laser radars, X-ray inspection systems, monitoring and disaster prevention equipment, oil leak monitors, and vibration control and seismic isolation floor systems; shield tunneling machines and automatic segment assembling systems; transportation systems; LPG/LEG storage tanks; floating LNG/LPG production, storage, and offloading units; and semi-submersible rigs, mega-float, and others. The company also leases and sells real estate properties; develops houses; and provides compressors, cryogenic products, logistics systems, steelmaking equipment, machinery for ships, turbochargers for vehicles, separators, lubricating systems, pulp and paper machinery, materials handling systems, agricultural machinery, parking systems, boilers, and life associated equipment. It offers factory, heat treatment and surface engineering solutions; aero engines; air traffic control systems; and rocket systems and space exploration solutions. The company was formerly known as Ishikawajima-Harima Heavy Industries Co., Ltd and changed its name to IHI Corporation in 2007. IHI Corporation was founded in 1853 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Hiroshi  Ide",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "28801",
    "phone": "81 3 6204 7800",
    "address": "Toyosu IHI Building",
    "city": "Tokyo",
    "state": null,
    "zip": "135-8710",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/IHICY.png",
    "ipoDate": "2015-06-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]