[
  {
    "symbol": "IIJIY",
    "price": 39.45,
    "beta": 0.174712,
    "volAvg": 332,
    "mktCap": 3486776573,
    "lastDiv": 0.4,
    "range": "22.51-43.73",
    "changes": 0.25,
    "companyName": "Internet Initiative Japan Inc.",
    "currency": "USD",
    "cik": "0001090633",
    "isin": null,
    "cusip": "46059T109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.iij.ad.jp",
    "description": "Internet Initiative Japan Inc. provides Internet connectivity, WAN, outsourcing, systems integration, and network-related equipment sales services in Japan. It operates through two segments, Network Services and Systems Integration Business, and ATM Operation Business. The company offers mobile communication and remote access/telework services; WAN/network services, including SDN, multi-cloud network, closed connection, internet VPN, SEIL, remote access, wireless LAN, and GIGA-school; leased line and broadband services; IIJ DNS platform, and domain name registration and maintenance services; IIJ access ID management, dial-up access, and IIJ IPv6 fiber access services; and security solutions for IIJ managed firewall, DDoS protection, and managed IPS/IDS services. It also provides cloud solutions, such as HaaS/IaaS, cloud storage, monitoring/operation, virtual desktop, Paas/Saas, IoT/M2M, ID management and authentication, network, global, mobile, license, and specialized solutions, as well as IIJ cloud exchange and IIJ cloud integration solutions; network, mail, and web security, endpoint, security assessment/consulting, web and mail hosting, online storage, content delivery/CDN/CMS, and system integration; IoT services and solutions in the field of industrial, agriculture, energy, and IoT-oriented mobile communication; industry-specific solution; content delivery; and global/privacy products. In addition, the company offers IT outsourcing, IIJ consulting, cognitive factory, IIJ private cloud, network solutions, IIJ security audit, IIJ malware analysis, IIJ content management, cloud integration solution for Microsoft and AWS, Microsoft 365 transition support solution, data center service, and data center construction engineering solutions, as well as DX edge services. The company was incorporated in 1992 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Koichi  Suzuki",
    "sector": "Communication Services",
    "country": "JP",
    "fullTimeEmployees": "4392",
    "phone": "81 3 5205 6500",
    "address": "Iidabashi Grand Bloom",
    "city": "Tokyo",
    "state": null,
    "zip": "102-0071",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/IIJIY.png",
    "ipoDate": "2019-04-22",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]