[
  {
    "symbol": "IMBBY",
    "price": 22.18,
    "beta": 0.421455,
    "volAvg": 100543,
    "mktCap": 20237808477,
    "lastDiv": 1.74,
    "range": "20.23-26.05",
    "changes": -0.51,
    "companyName": "Imperial Brands PLC",
    "currency": "USD",
    "cik": "0001072670",
    "isin": "US45262P1021",
    "cusip": "45262P102",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Tobacco",
    "website": "https://www.imperialbrandsplc.com",
    "description": "Imperial Brands PLC, together with its subsidiaries, manufactures, imports, markets, and sells tobacco and tobacco-related products in Europe, Americas, Africa, Asia, and Australasia. It offers a range of cigarettes, fine cut and smokeless tobacco, papers, and cigars; and next generation product (NGP) portfolio, such as e-vapour products, oral nicotine, and heated tobacco products. The company sells its products under various brands, including Davidoff, Gauloises, JPS, West, L&B, Winston, Parker & Simpson, blu, Pluze, Zone-X, Kool, Horizon, Backwoods, Skruf, Golden Virginia, Rizla, and Dutch Masters. It also engages in the distribution of tobacco and NGP products for tobacco and NGP product manufacturers; and various non-tobacco and NGP products and services. In addition, the company is involved in the management of a golf course; distribution of pharmaceuticals, POS software, and published materials and other products; printing and publishing activities; and provision of long haul transportation, industrial parcel and express delivery, advertising, and support management services. Further, it owns the trademarks; and retails its products. The company was formerly known as Imperial Tobacco Group PLC and changed its name to Imperial Brands PLC in February 2016. Imperial Brands PLC was founded in 1901 and is based in Bristol, the United Kingdom.",
    "ceo": "Mr. Stefan  Bomhard",
    "sector": "Consumer Defensive",
    "country": "GB",
    "fullTimeEmployees": "25700",
    "phone": "44 11 7963 6636",
    "address": "121 Winterstoke Road",
    "city": "Bristol",
    "state": null,
    "zip": "BS3 2LL",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/IMBBY.png",
    "ipoDate": "1998-11-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]