[
  {
    "symbol": "IMCR",
    "price": 56.16,
    "beta": 0.575598,
    "volAvg": 256761,
    "mktCap": 2596007232,
    "lastDiv": 0,
    "range": "34.63-69.055",
    "changes": -0.18,
    "companyName": "Immunocore Holdings plc",
    "currency": "USD",
    "cik": "0001671927",
    "isin": "US45258D1054",
    "cusip": "45258D105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.immunocore.com",
    "description": "Immunocore Holdings plc, a commercial-stage biotechnology company, engages in the development of immunotherapies for the treatment of cancer, infectious, and autoimmune diseases. The company offers KIMMTRAK for the treatment of patients with unresectable or metastatic uveal melanoma. Its other programs for oncology comprise IMC-C103C that is in Phase I/II dose escalation trial in patients with solid tumor cancers, including non-small-cell lung (NSCLC), gastric, head and neck, ovarian, and synovial sarcoma cancers; IMC-F106C, which is in a Phase I/II dose escalation trial in patients with multiple solid tumor cancers comprising NSCLC, small-cell lung, endometrial, ovarian, cutaneous melanoma, and breast cancers. In addition, the company's programs for infectious diseases include IMC-I109V, which is in a Phase I/II clinical trial in patients with chronic hepatitis B virus; and IMC-M113V that is in pre-clinical development stage for patients with human immunosuppression virus. Further, it develops product candidates to provide precision targeted immunosuppression for the treatment of autoimmune diseases. Immunocore Holdings plc was founded in 1999 and is headquartered in Abingdon, the United Kingdom.",
    "ceo": "Dr. Bahija  Jallal Ph.D.",
    "sector": "Healthcare",
    "country": "GB",
    "fullTimeEmployees": "408",
    "phone": "44 12 3543 8600",
    "address": "92 Park Drive",
    "city": "Abingdon",
    "state": null,
    "zip": "OX14 4RY",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/IMCR.png",
    "ipoDate": "2021-02-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]