[
  {
    "symbol": "INDB",
    "price": 44.99,
    "beta": 0.82007,
    "volAvg": 261108,
    "mktCap": 1985183750,
    "lastDiv": 2.2,
    "range": "43.28-91.65",
    "changes": -1.42,
    "companyName": "Independent Bank Corp.",
    "currency": "USD",
    "cik": "0000776901",
    "isin": "US4538361084",
    "cusip": "453836108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.rocklandtrust.com",
    "description": "Independent Bank Corp. operates as the bank holding company for Rockland Trust Company that provides commercial banking products and services to individuals and small-to-medium sized businesses primarily in Massachusetts. The company accepts interest checking, money market, and savings accounts, as well as demand deposits and time certificates of deposit. It also offers commercial and industrial, commercial real estate and construction, small business, consumer real estate, and personal loans. In addition, the company provides investment management and trust services to individuals, institutions, small businesses, and charitable institutions; Internet and mobile banking services, as well as estate settlement, financial planning, tax services, and other services; automated teller machine and debit cards; and mutual fund and unit investment trust shares, general securities, fixed and variable annuities, and life insurance products. As of December 31, 2021, it operates one hundred nineteen retail branches, two limited-service retail branches, and one mobile branch located within Barnstable, Bristol, Dukes, Essex, Middlesex, Nantucket, Norfolk, Plymouth, Suffolk, and Worcester counties in Eastern Massachusetts. The company was founded in 1907 and is headquartered in Rockland, Massachusetts.",
    "ceo": "Mr. Jeffrey J. Tengel",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1739",
    "phone": "781 878 6100",
    "address": "288 Union Street",
    "city": "Rockland",
    "state": "MA",
    "zip": "02370",
    "dcfDiff": 78.2835,
    "dcf": 155.843,
    "image": "https://financialmodelingprep.com/image-stock/INDB.png",
    "ipoDate": "1986-05-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]