[
  {
    "symbol": "INFA",
    "price": 18.33,
    "beta": 0,
    "volAvg": 518824,
    "mktCap": 5247310587,
    "lastDiv": 0,
    "range": "13.29-23.86",
    "changes": 0.55,
    "companyName": "Informatica Inc.",
    "currency": "USD",
    "cik": "0001868778",
    "isin": "US45674M1018",
    "cusip": "45674M101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.informatica.com",
    "description": "Informatica Inc. develops an artificial intelligence-powered platform that connects, manages, and unifies data across multi-cloud, hybrid systems at enterprise scale in the United States. The company's platform includes a suite of interoperable data management products, including data integration products to ingest, transform, and integrate data; API and application integration products that enable users to create and manage APIs and integration processes for app-to-app synchronization, business process orchestration, B2B partner management, application development, and API management; data quality products to profile, cleanse, standardize, and enrich data to deliver accurate, complete, and consistent data sets for analytics, data science, governance, and other initiatives; and master data management products to create an authoritative single source of truth of business-critical data to reduce data related errors and remove redundancies. Its platform also includes customer and business 360 products to create, visualize, and browse comprehensive 360-degree views of business-critical data; data catalog products that enables customers to quickly find, access, and understand enterprise data using a simple Google-like search experience; and governance and privacy products that help users govern data, enable compliance with regulatory and corporate policies, and drive broader data consumption. The company also offers maintenance and professional services. Informatica Inc. was founded in 1993 and is headquartered in Redwood City, California.",
    "ceo": "Mr. Amit  Walia",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "6000",
    "phone": "650 385 5000",
    "address": "2100 Seaport Boulevard",
    "city": "Redwood City",
    "state": "CA",
    "zip": "94063",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/INFA.png",
    "ipoDate": "2021-10-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]