[
  {
    "symbol": "INFY",
    "price": 15.75,
    "beta": 0.626027,
    "volAvg": 11345532,
    "mktCap": 65173816512,
    "lastDiv": 0.4,
    "range": "14.71-20.6",
    "changes": 0.13,
    "companyName": "Infosys Limited",
    "currency": "USD",
    "cik": "0001067491",
    "isin": "US4567881085",
    "cusip": "456788108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.infosys.com",
    "description": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application development and management, independent validation, product engineering and management, infrastructure management, enterprise application management, and support and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Infosys Nia, an artificial intelligence platform; Infosys McCamish - an insurance platform; Wingspan, a customizable learning platform; Stater mortgage servicing platform; Panaya automation suite; and Skava, an e-commerce suite. The company serves clients in the financial services and insurance, life sciences and healthcare, manufacturing, retail, consumer packaged goods and logistics, hi-tech, communications, telecom OEM, media, energy, utilities, resources, services, and other industries. It has collaboration agreements with Rolls-Royce, BP plc, Newmont Corporation, RXR Realty, Majesco Limited, and Centre for Accessibility Australia; and a strategic partnership with The Economist Group Limited to enable and enhance sustainability solutions through a business-to-business model. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was incorporated in 1981 and is headquartered in Bengaluru, India.",
    "ceo": "Mr. Salil Satish Parekh",
    "sector": "Technology",
    "country": "IN",
    "fullTimeEmployees": "300000",
    "phone": "91 80 2852 0261",
    "address": "Plot no. 44/97 A",
    "city": "Bengaluru",
    "state": null,
    "zip": "560100",
    "dcfDiff": 1.18226,
    "dcf": 19.8423,
    "image": "https://financialmodelingprep.com/image-stock/INFY.png",
    "ipoDate": "1999-03-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]