[
  {
    "symbol": "ING",
    "price": 13.06,
    "beta": 1.687739,
    "volAvg": 3239253,
    "mktCap": 47131840737,
    "lastDiv": 0.6,
    "range": "8.14-14.72",
    "changes": -0.05,
    "companyName": "ING Groep N.V.",
    "currency": "USD",
    "cik": "0001039765",
    "isin": "US4568371037",
    "cusip": "456837103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.ing.com",
    "description": "ING Groep N.V., a financial institution, provides various banking products and services in the Netherlands, Belgium, Germany, Poland, Rest of Europe, North America, Latin America, Asia, and Australia. It operates in six segments: Retail Netherlands, Retail Belgium, Retail Germany, Retail Other, Wholesale Banking, and Corporate Line Banking. The company accepts various deposits, such as current and savings accounts; and offers business lending products, as well as consumer lending products, such as residential mortgage loans, term loans, and revolver and personal loans. It also provides debt capital market, working capital, export finance, daily banking, treasury and risk, and corporate finance solutions; and specialized lending, equity market, finance, payments and cash management, and trade services and solutions, as well as savings, investment, insurance, mortgage, and digital banking services. The company serves customers, corporate clients, and financial institutions, including small and medium-sized, and mid-corporates. ING Groep N.V. was founded in 1762 and is headquartered in Amsterdam, the Netherlands.",
    "ceo": "Mr. Steven J. A. van Rijswijk",
    "sector": "Financial Services",
    "country": "NL",
    "fullTimeEmployees": "58693",
    "phone": "31 20 563 9111",
    "address": "Bijlmerdreef 106",
    "city": "Amsterdam",
    "state": null,
    "zip": "1102 CT",
    "dcfDiff": 24.7281,
    "dcf": 38.9481,
    "image": "https://financialmodelingprep.com/image-stock/ING.png",
    "ipoDate": "1994-05-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]