[
  {
    "symbol": "INGR",
    "price": 104.46,
    "beta": 0.771126,
    "volAvg": 352085,
    "mktCap": 6896041806,
    "lastDiv": 2.84,
    "range": "78.81-113.46",
    "changes": 0.17,
    "companyName": "Ingredion Incorporated",
    "currency": "USD",
    "cik": "0001046257",
    "isin": "US4571871023",
    "cusip": "457187102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaged Foods",
    "website": "https://www.ingredion.com",
    "description": "Ingredion Incorporated, together with its subsidiaries, produces and sells starches and sweeteners for various industries. It operates through four segments: North America; South America; Asia-Pacific; and Europe, Middle East and Africa. The company offers sweetener products comprising glucose syrups, high maltose syrups, high fructose corn syrups, caramel colors, dextrose, polyols, maltodextrins, and glucose syrup solids, as well as food-grade and industrial starches, biomaterials, and nutrition ingredients. It also provides edible corn oil; refined corn oil to packers of cooking oil and to producers of margarine, salad dressings, shortening, mayonnaise, and other foods; and corn gluten feed used as protein feed for chickens, pet food, and aquaculture, as well as fruit and vegetable products, such as concentrates, purees and essences, pulse proteins, and hydrocolloids systems and blends. The company's products are derived primarily from processing corn and other starch-based materials, such as tapioca, potato, and rice. It serves food, beverage, brewing, and animal nutrition industries. The company was formerly known as Corn Products International, Inc. and changed its name to Ingredion Incorporated in June 2012. Ingredion Incorporated was founded in 1906 and is headquartered in Westchester, Illinois.",
    "ceo": "Mr. James P. Zallie",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "12000",
    "phone": "708 551 2600",
    "address": "5 Westbrook Corporate Center",
    "city": "Westchester",
    "state": "IL",
    "zip": "60154",
    "dcfDiff": 0.652244,
    "dcf": 100.708,
    "image": "https://financialmodelingprep.com/image-stock/INGR.png",
    "ipoDate": "1997-12-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]