[
  {
    "symbol": "INMD",
    "price": 36.66,
    "beta": 2.085008,
    "volAvg": 1424985,
    "mktCap": 3045379047,
    "lastDiv": 0,
    "range": "21.81-41.84",
    "changes": 0.84,
    "companyName": "InMode Ltd.",
    "currency": "USD",
    "cik": "0001742692",
    "isin": "IL0011595993",
    "cusip": "M5425M103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Devices",
    "website": "https://www.inmodemd.com",
    "description": "InMode Ltd. designs, develops, manufactures, and markets minimally invasive aesthetic medical products based on its proprietary radiofrequency assisted lipolysis and deep subdermal fractional radiofrequency technologies in the United States and internationally. The company offers minimally invasive aesthetic medical products for various procedures, such as liposuction with simultaneous skin tightening, body and face contouring, and ablative skin rejuvenation treatments, as well as for use in women's health conditions and procedures. It also designs, develops, manufactures, and markets non-invasive medical aesthetic products that target an array of procedures, including permanent hair reduction, facial skin rejuvenation, wrinkle reduction, cellulite treatment, skin appearance and texture, and superficial benign vascular and pigmented lesions, as well as hands-free medical aesthetic products that target a range of procedures, such as skin tightening, fat reduction, and muscle stimulation. The company was formerly known as Invasix Ltd. and changed its name to InMode Ltd. in November 2017. InMode Ltd. was incorporated in 2008 and is headquartered in Yokneam, Israel.",
    "ceo": "Mr. Moshe  Mizrahy",
    "sector": "Healthcare",
    "country": "IL",
    "fullTimeEmployees": "480",
    "phone": "972 4 909 6313",
    "address": "Tavor Building",
    "city": "Yokne'am",
    "state": null,
    "zip": "2069206",
    "dcfDiff": 0.722122,
    "dcf": 36.2021,
    "image": "https://financialmodelingprep.com/image-stock/INMD.png",
    "ipoDate": "2019-08-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]