[
  {
    "symbol": "INST",
    "price": 24.74,
    "beta": 0,
    "volAvg": 133770,
    "mktCap": 3549670658,
    "lastDiv": 0,
    "range": "20.33-31.47",
    "changes": 0.55,
    "companyName": "Instructure Holdings, Inc.",
    "currency": "USD",
    "cik": "0001841804",
    "isin": "US4577901030",
    "cusip": "457790103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.instructure.com",
    "description": "Instructure Holdings, Inc. provides cloud-based learning, assessment, development, and engagement systems worldwide. It offers Canvas Learning Management System that includes assessments, analytics, and learning content for K-12 and higher education institutions; Canvas Studio, an online video platform; Canvas Catalog, a course catalog and registration system; Canvas Assessment, a solution for assessments that include MasteryConnect, a robust student assessment management system, and Certica, which provides assessment content solutions and analytics to inform daily instruction in the classroom and data; Canvas Network that allows access to open online courses; Impact that helps K-12 and higher education institutions to improve technology adoption and evaluate impact of educational technology; and Elevate Data Sync, a solution that allows edtech vendors to share learning data between K-12 and higher education applications. The company was founded in 2008 and is headquartered in Salt Lake City, Utah.",
    "ceo": "Mr. Stephen M. Daly",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1466",
    "phone": "800 203 6755",
    "address": "6330 South 3000 East",
    "city": "Salt Lake City",
    "state": "UT",
    "zip": "84121",
    "dcfDiff": 2.68918,
    "dcf": 24.2408,
    "image": "https://financialmodelingprep.com/image-stock/INST.png",
    "ipoDate": "2021-07-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]