[
  {
    "symbol": "INTA",
    "price": 41.82,
    "beta": 0,
    "volAvg": 498479,
    "mktCap": 2818693092,
    "lastDiv": 0,
    "range": "13.54-50.46",
    "changes": 1.51,
    "companyName": "Intapp, Inc.",
    "currency": "USD",
    "cik": "0001565687",
    "isin": "US45827U1097",
    "cusip": "45827U109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.intapp.com",
    "description": "Intapp, Inc., through its subsidiary, Integration Appliance, Inc., provides industry-specific cloud-based software solutions for the professional and financial services industry in the United States, the United Kingdom, and internationally. Its solutions include DealCloud, a deal and relationship management solution that manages financial services firms' market relationships, prospective clients and investments, current engagements and deal processes, and operations and compliance activities; and OnePlace, a solution to manage various aspects of professional services firms' client and engagement lifecycle. The company's solutions enable private capital, investment banking, legal, accounting, and consulting firms to realize the benefits of modern AI and cloud-based architectures for their critical business functions without compromising industry-specific functionality or regulatory compliance. It sells its software on a subscription basis through a direct enterprise sales model. The company was formerly known as LegalApp Holdings, Inc. and changed its name to Intapp, Inc. in February 2021. Intapp, Inc. was founded in 2000 and is headquartered in Palo Alto, California.",
    "ceo": "Mr. John T. Hall",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "946",
    "phone": "650 852 0400",
    "address": "3101 Park Boulevard",
    "city": "Palo Alto",
    "state": "CA",
    "zip": "94306",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/INTA.png",
    "ipoDate": "2021-06-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]