[
  {
    "symbol": "INTC",
    "price": 33.57,
    "beta": 0.868309,
    "volAvg": 46313474,
    "mktCap": 140020472148,
    "lastDiv": 0.5,
    "range": "24.59-40.73",
    "changes": -0.53,
    "companyName": "Intel Corporation",
    "currency": "USD",
    "cik": "0000050863",
    "isin": "US4581401001",
    "cusip": "458140100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.intel.com",
    "description": "Intel Corporation engages in the design, manufacture, and sale of computer products and technologies worldwide. The company operates through CCG, DCG, IOTG, Mobileye, NSG, PSG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products, including accelerators, boards and systems, connectivity products, graphics, and memory and storage products. The company also provides high-performance compute solutions for targeted verticals and embedded applications for retail, industrial, and healthcare markets; and solutions for assisted and autonomous driving comprising compute platforms, computer vision and machine learning-based sensing, mapping and localization, driving policy, and active sensors. In addition, it offers workload-optimized platforms and related products for cloud service providers, enterprise and government, and communications service providers. The company serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was incorporated in 1968 and is headquartered in Santa Clara, California.",
    "ceo": "Mr. Patrick P. Gelsinger",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "131900",
    "phone": "408 765 8080",
    "address": "2200 Mission College Boulevard",
    "city": "Santa Clara",
    "state": "CA",
    "zip": "95054-1549",
    "dcfDiff": 1.9602,
    "dcf": 30.1202,
    "image": "https://financialmodelingprep.com/image-stock/INTC.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]