[
  {
    "symbol": "IONS",
    "price": 40.85,
    "beta": 0.523591,
    "volAvg": 1220730,
    "mktCap": 5845308200,
    "lastDiv": 0,
    "range": "32.69-48.82",
    "changes": 1.49,
    "companyName": "Ionis Pharmaceuticals, Inc.",
    "currency": "USD",
    "cik": "0000874015",
    "isin": "US4622221004",
    "cusip": "462222100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.ionispharma.com",
    "description": "Ionis Pharmaceuticals, Inc. discovers and develops RNA-targeted therapeutics in the United States. The company offers SPINRAZA for spinal muscular atrophy (SMA) in pediatric and adult patients; TEGSEDI, an injection for the treatment of polyneuropathy of hereditary transthyretin-mediated amyloidosis in adults; and WAYLIVRA, a treatment for familial chylomicronemia syndrome and familial partial lipodystrophy. It also develops medicines for various indications that are in phase 3 study, including Eplontersen as a monthly self-administered subcutaneous injection to treat all types of TTR amyloidosis; Olezarsen for patients with severe hypertriglyceridemia (SHTG); Donidalorsen for patients with hereditary angioedema; ION363 for patients with amyotrophic lateral sclerosis; Pelacarsen for patients with established cardiovascular disease and elevated lipoprotein(a); and Tofersen to inhibit the production of superoxide dismutase 1. In addition, the company develops medicines for metabolic diseases, infectious diseases, renal diseases, ophthalmic diseases, and cancer. It has a strategic collaboration with Biogen Inc.; and collaboration and license agreement with AstraZeneca, Bayer AG, GlaxoSmithKline plc, Novartis AG, Roche, Janssen Biotech, Inc., and Flamingo Therapeutics, Inc. Ionis Pharmaceuticals, Inc. was founded in 1989 and is based in Carlsbad, California.",
    "ceo": "Dr. Brett P. Monia Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "796",
    "phone": "760 931 9200",
    "address": "2855 Gazelle Court",
    "city": "Carlsbad",
    "state": "CA",
    "zip": "92010",
    "dcfDiff": 8.5984,
    "dcf": 48.6184,
    "image": "https://financialmodelingprep.com/image-stock/IONS.png",
    "ipoDate": "1991-05-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]