[
  {
    "symbol": "IOSP",
    "price": 98.74,
    "beta": 1.166901,
    "volAvg": 85575,
    "mktCap": 2455594682,
    "lastDiv": 1.38,
    "range": "83.13-116.0",
    "changes": 0.07,
    "companyName": "Innospec Inc.",
    "currency": "USD",
    "cik": "0001054905",
    "isin": "US45768S1050",
    "cusip": "45768S105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Specialty Chemicals",
    "website": "https://innospec.com",
    "description": "Innospec Inc. develops, manufactures, blends, markets, and supplies specialty chemicals in the United States, rest of North America, the United Kingdom, rest of Europe, and internationally. The company's Fuel Specialties segment offers a range of specialty chemical products that are used as additives in various fuels. This segment's products are used in the operation of automotive, marine, and aviation engines; power station generators; and heating oil. Its Performance Chemicals segment provides technology-based solutions for its customers' processes or products that focuses on the personal care, home care, agrochemical, and metal extraction markets. The company's Oilfield Services segment develops and markets chemical solutions for fracturing, stimulation, and completion operations; and products for oil and gas production, as well as products to prevent loss of mud in drilling operations. It sells its products primarily to oil and gas exploration and production companies, oil refineries, fuel manufacturers and users, personal care and home care companies, formulators of agrochemical and metal extraction formulations, and other chemical and industrial companies. The company was formerly known as Octel Corp. and changed its name to Innospec Inc. in January 2006. Innospec Inc. was founded in 1938 and is headquartered in Englewood, Colorado.",
    "ceo": "Mr. Patrick S. Williams",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "2100",
    "phone": "303 792 5554",
    "address": "8310 South Valley Highway",
    "city": "Englewood",
    "state": "CO",
    "zip": "80112",
    "dcfDiff": 6.92259,
    "dcf": 116.793,
    "image": "https://financialmodelingprep.com/image-stock/IOSP.png",
    "ipoDate": "1998-05-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]