[
  {
    "symbol": "IPAR",
    "price": 132.46,
    "beta": 1.085211,
    "volAvg": 135264,
    "mktCap": 4240441980,
    "lastDiv": 2.5,
    "range": "68.86-161.17",
    "changes": -1.14,
    "companyName": "Inter Parfums, Inc.",
    "currency": "USD",
    "cik": "0000822663",
    "isin": "US4583341098",
    "cusip": "458334109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Household & Personal Products",
    "website": "https://www.interparfumsinc.com",
    "description": "Inter Parfums, Inc., together with its subsidiaries, manufactures, markets, and distributes a range of fragrances and fragrance related products in the United States and internationally. The company operates in two segments, European Based Operations and United States Based Operations. It offers its fragrance and cosmetic products under the Boucheron, Coach, Jimmy Choo, Karl Lagerfeld, Kate Spade, Lily Aldridge, Lanvin, Moncler, Montblanc, Rochas, S.T. Dupont, Van Cleef & Arpels, Abercrombie & Fitch, Anna Sui, babe, Dunhill, Ferragamo, Graff, GUESS, Hollister, MCM, Oscar de la Renta, French Connection, and Ungaro brand names, as well as under the Intimate and Aziza names. It sells its products to department stores, specialty stores, duty free shops, beauty retailers, and domestic and international wholesalers, and distributors, as well as through e-commerce. The company was formerly known as Jean Philippe Fragrances, Inc. and changed its name to Inter Parfums, Inc. in July 1999. Inter Parfums, Inc. was founded in 1982 and is headquartered in New York, New York.",
    "ceo": "Mr. Jean  Madar",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "527",
    "phone": "212 983 2640",
    "address": "551 Fifth Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10176",
    "dcfDiff": 19.4663,
    "dcf": 93.5237,
    "image": "https://financialmodelingprep.com/image-stock/IPAR.png",
    "ipoDate": "1988-02-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]