[
  {
    "symbol": "IQ",
    "price": 5.24,
    "beta": 0.486267,
    "volAvg": 11246848,
    "mktCap": 5013076644,
    "lastDiv": 0,
    "range": "1.65-7.989",
    "changes": -0.05,
    "companyName": "iQIYI, Inc.",
    "currency": "USD",
    "cik": "0001722608",
    "isin": "US46267X1081",
    "cusip": "46267X108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Entertainment",
    "website": "https://www.iqiyi.com",
    "description": "iQIYI, Inc., together with its subsidiaries, provides online entertainment services under the iQIYI brand in the People's Republic of China. The company offers various products and services comprising internet video, online games, live broadcasting, online literature, animations, e-commerce, and social media platform. It operates a platform that provides a collection of internet video content, including professionally-produced content licensed from professional content providers and self-produced content. The company also provides membership, content distribution, and online advertising services. In addition, it operates iQIYI Show, a live broadcasting service that enables users to follow their favorite hosts, celebrities, and shows in real time through live broadcasting; and iQIYI Lite, an easy and quick access to the personalized videos based on their user preferences. Further, it is involved in the talent agency and IP licensing activities, as well as engages in developing a video community app. The company was formerly known as Qiyi.com, Inc. and changed its name to iQIYI, Inc. in November 2017. iQIYI, Inc. was incorporated in 2009 and is headquartered in Beijing, China. iQIYI, Inc. is a subsidiary of Baidu Holdings Limited.",
    "ceo": "Dr. Tim Gong  Yu",
    "sector": "Communication Services",
    "country": "CN",
    "fullTimeEmployees": "4981",
    "phone": "86 10 6267 7171",
    "address": "iQIYI Innovation Building",
    "city": "Beijing",
    "state": null,
    "zip": "100080",
    "dcfDiff": 0.653276,
    "dcf": 6.89328,
    "image": "https://financialmodelingprep.com/image-stock/IQ.png",
    "ipoDate": "2018-03-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]