[
  {
    "symbol": "IR",
    "price": 63.66,
    "beta": 1.417253,
    "volAvg": 2346662,
    "mktCap": 25751680049,
    "lastDiv": 0.08,
    "range": "39.285-65.244",
    "changes": -0.27,
    "companyName": "Ingersoll Rand Inc.",
    "currency": "USD",
    "cik": "0001699150",
    "isin": "US45687V1061",
    "cusip": "45687V106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.irco.com",
    "description": "Ingersoll Rand Inc. provides various mission-critical air, fluid, energy, specialty vehicle and medical technologies in the United States, Europe, the Middle East, Africa, and the Asia Pacific. It operates through two segments, Industrial Technologies and Services, and Precision and Science Technologies. The Industrial Technologies and Services segment designs, manufactures, markets, and services various air and gas compression, vacuum, and blower products; fluid transfer equipment and loading systems; and power tools and lifting equipment, including associated aftermarket parts, consumables, air treatment equipment, controls, other accessories, and services. The Precision and Science Technologies segment designs, manufactures, and markets a range of specialized positive displacement pumps, fluid management systems, accessories and aftermarket parts for liquid and gas dosing, transfer, dispensing, compression, sampling, pressure management and flow control in specialized or critical applications. The company's products are used in medical, laboratory, industrial manufacturing, water and wastewater, chemical processing, precision irrigation, energy, food and beverage, agriculture, and vacuum and automated liquid handling end-markets, as well as various manufacturing and industrial facilities applications. It sells through an integrated network of direct sales representatives and independent distributors under the Ingersoll Rand, Gardner Denver, Club Car, CompAir, Nash, Elmo Rietschle, Robuschi, Thomas, Milton Roy, Seepex, ARO, Emco Wheaton, Runtech Systems, Air Dimensions, Albin, Dosatron, Haskel, LMI, Maximus, MP, Oberdorfer, Welch, Williams, Zinnser Analytic, and YZ brands. The company was formerly known as Gardner Denver Holdings, Inc. and changed its name to Ingersoll Rand Inc. in March 2020. Ingersoll Rand Inc. was founded in 1859 and is headquartered in Davidson, North Carolina.",
    "ceo": "Mr. Vicente  Reynal",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "17000",
    "phone": "704 655 4000",
    "address": "800-A Beaty Street",
    "city": "Davidson",
    "state": "NC",
    "zip": "28036",
    "dcfDiff": 2.98086,
    "dcf": 58.6409,
    "image": "https://financialmodelingprep.com/image-stock/IR.png",
    "ipoDate": "2017-05-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]