[
  {
    "symbol": "ISEE",
    "price": 38.6,
    "beta": 1.108098,
    "volAvg": 4243070,
    "mktCap": 5325911891,
    "lastDiv": 0,
    "range": "8.95-39.72",
    "changes": -1.03,
    "companyName": "IVERIC bio, Inc.",
    "currency": "USD",
    "cik": "0001410939",
    "isin": "US46583P1021",
    "cusip": "46583P102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://ivericbio.com",
    "description": "IVERIC bio, Inc., a biopharmaceutical company, discovers and develops novel treatments for retinal diseases with a focus on age-related and orphan inherited retinal diseases (IRDs). The company develops Zimura, an inhibitor of complement factor C5 comprising GATHER1, which has completed Phase 2/3 clinical trial; and GATHER2 that is in Phase 3 clinical trial for the treatment of geographic atrophy (GA) secondary to dry age-related macular degeneration (AMD). It also develops STAR or OPH2005 that is in Phase 2b clinical trial for the treatment of leber congenital amaurosis type 10 (LCA10) and autosomal recessive stargardt disease (STGD1); IC-500, a high temperature requirement A serine peptidase 1 protein inhibitors for the treatment of GA and other age-related retinal diseases; IC-100 for the treatment of rhodopsin-mediated autosomal dominant retinitis pigmentosa; and IC-200 for the treatment of IRDs associated with mutations in the BEST1 gene. In addition, the company develops OPH2001 that has completed Phase 1/2a clinical trial of various doses of Zimura monotherapy for the treatment of GA; OPH2000, which has completed Phase 1/2a clinical trial of various doses of Zimura administered in combination with Lucentis for the treatment of wet AMD; OPH2007 that has completed Phase 2a clinical trial for the treatment of wet AMD; and OPH2002, which has completed Phase 2a clinical trial for the treatment of idiopathic polypoidal choroidal vasculopathy. Its discovery and research programs include miniCEP290 program for LCA10; miniABCA4 Program for STGD1; and miniUSH2A Program for usher syndrome type 2A-Related IRDs. The company was formerly known as Ophthotech Corporation and changed its name to IVERIC bio, Inc. in April 2019. The company was incorporated in 2007 and is based in Parsippany, New Jersey.",
    "ceo": "Mr. Glenn P. Sblendorio M.B.A.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "163",
    "phone": "609 474 6755",
    "address": "8 Sylvan Way",
    "city": "Parsippany",
    "state": "NJ",
    "zip": "07054",
    "dcfDiff": 1.94426,
    "dcf": 24.5943,
    "image": "https://financialmodelingprep.com/image-stock/ISEE.png",
    "ipoDate": "2013-09-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]