[
  {
    "symbol": "ISMAY",
    "price": 5.95,
    "beta": 1.026436,
    "volAvg": 9,
    "mktCap": 2095970800,
    "lastDiv": 0.08,
    "range": "3.5-7.0",
    "changes": 0,
    "companyName": "Indra Sistemas, S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US45579R1068",
    "cusip": "45579R106",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Information Technology Services",
    "website": "https://www.indracompany.com",
    "description": "Indra Sistemas, S.A. operates as a technology and consulting company worldwide. It designs, develops, produces, integrates, operates, maintains, repairs, and markets systems, solutions, and services based on the use of information technologies, electronics, and communication; and for surveillance and security control of facilities. It also researches, engineers, designs, develops, manufactures, markets, installs, maintains, and repairs devices, equipment, and systems for data communication, encryption systems, encryption, beacon, and command and control center; manages, executes, commercializes, and sells system engineering services for the defense industry; and provides engineering and maintenance services for air defense systems and other related systems, as well as architectural and engineering technical services. In addition, it offers systems to aid navigation and landing, and air traffic control systems; outsources business processes; delivers document management services and mortgage management; realizes measures for the settlement and registration; and manages digitalization and data capture. Further, it provides business consulting, technology and solutions consulting, administration, management, support, advisory, telecommunications, mobile telephony, credit card processing, and energy transport and distribution network manufacture services; engineering and consultancy services for environment, transport, construction, water, and industry areas; and digital agency, web communication and marketing, securities, computer programing, aerodrome air traffic, radio communication security, port infrastructure, airline training and coaching, and project services. Additionally, it researches and develops autonomous air systems and solutions in unmanned systems; and develops and produces aircraft, tactical communication systems, and toll and traffic control and management systems. Indra Sistemas, S.A. was founded in 1921 and is headquartered in Alcobendas, Spain.",
    "ceo": "Mr. Jose vicente de Los mozos",
    "sector": "Technology",
    "country": "ES",
    "fullTimeEmployees": "56573",
    "phone": "34 91 480 50 00",
    "address": "Avenida de Bruselas, 35",
    "city": "Alcobendas",
    "state": null,
    "zip": "28108",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ISMAY.png",
    "ipoDate": "2011-04-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]