[
  {
    "symbol": "ITCI",
    "price": 62.19,
    "beta": 1.126408,
    "volAvg": 796083,
    "mktCap": 5965613064,
    "lastDiv": 0,
    "range": "42.01-67.05",
    "changes": -0.51,
    "companyName": "Intra-Cellular Therapies, Inc.",
    "currency": "USD",
    "cik": "0001567514",
    "isin": "US46116X1019",
    "cusip": "46116X101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.intracellulartherapies.com",
    "description": "Intra-Cellular Therapies, Inc., a biopharmaceutical company, develops novel drugs for the treatment of neuropsychiatric and neurologic diseases by targeting intracellular signaling mechanisms within the central nervous system in the United States. The company offers CAPLYTA for the treatment of schizophrenia in adults. It is also involved in developing lumateperone, which is in Phase III clinical trial for the treatment of bipolar depression, as well as to treat autism spectrum disorder; and in additional neuropsychiatric indications, such as sleep disorders associated with neuropsychiatric and neurological disorders. In addition, the company is developing Lenrispodun (ITI-214) for the treatment of Parkinson's disease and heart failure; ITI-1284-ODT-SL for the treatment of neuropsychiatric disorders and behavioral disturbances in dementia; and ITI-333 for substance use disorders, pain, and psychiatric comorbidities, including depression and anxiety. Intra-Cellular Therapies, Inc. was founded in 2002 and is headquartered in New York, New York.",
    "ceo": "Dr. Sharon  Mates Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "561",
    "phone": "646 440 9333",
    "address": "430 East 29th Street",
    "city": "New York",
    "state": "NY",
    "zip": "10016",
    "dcfDiff": 5.5496,
    "dcf": 53.2996,
    "image": "https://financialmodelingprep.com/image-stock/ITCI.png",
    "ipoDate": "2014-01-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]