[
  {
    "symbol": "ITGR",
    "price": 87.4,
    "beta": 1.118661,
    "volAvg": 251562,
    "mktCap": 2908357360,
    "lastDiv": 0,
    "range": "50.05-87.47",
    "changes": 0.19,
    "companyName": "Integer Holdings Corporation",
    "currency": "USD",
    "cik": "0001114483",
    "isin": "US45826H1095",
    "cusip": "45826H109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.integer.net",
    "description": "Integer Holdings Corporation operates as a medical device outsource manufacturer in the United States, Puerto Rico, Costa Rica, and internationally. It operates through Medical and Non-Medical segments. The company offers products for interventional cardiology, structural heart, heart failure, peripheral vascular, neurovascular, interventional oncology, electrophysiology, vascular access, infusion therapy, hemodialysis, urology, and gastroenterology procedures. It also provides cardiac rhythm management products, including implantable pacemakers, implantable cardioverter defibrillators, insertable cardiac monitors, implantable cardiac pacing and defibrillation leads, and heart failure therapies; neuromodulation products, such as implantable spinal cord stimulators; and non-rechargeable batteries, feedthroughs, device enclosures, machined components, and lead components and sub-assemblies. In addition, the company offers rechargeable batteries and chargers; and arthroscopic, laparoscopic, and general surgery devices and components, such as harmonic scalpels, shaver blades, burr shavers, radio frequency probes, biopsy probes, trocars, electrocautery components, wound dressings, GERD treatment components, and phacoemulsification needles. Further, it provides orthopedic products that include instruments used in hip, knee, and spine surgeries, as well as reamers and chisels. Additionally, the company offers customized battery power and power management systems, and battery solutions for the energy, military, and environmental markets. Furthermore, the company provides medical technologies. It serves multi-national original equipment manufacturers and their affiliated subsidiaries in the cardiac, neuromodulation, orthopedics, vascular, and advanced surgical and portable medical markets. Integer Holdings Corporation was founded in 1970 and is headquartered in Plano, Texas.",
    "ceo": "Mr. Joseph W. Dziedzic",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "10000",
    "phone": "214 618 5243",
    "address": "5830 Granite Parkway",
    "city": "Plano",
    "state": "TX",
    "zip": "75024",
    "dcfDiff": 0.927763,
    "dcf": 71.9178,
    "image": "https://financialmodelingprep.com/image-stock/ITGR.png",
    "ipoDate": "2000-09-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]