[
  {
    "symbol": "ITOCY",
    "price": 79.51,
    "beta": 0.621455,
    "volAvg": 20819,
    "mktCap": 57854020320,
    "lastDiv": 1.9,
    "range": "48.31-83.75",
    "changes": 0.71,
    "companyName": "ITOCHU Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US4657171066",
    "cusip": "465717106",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Conglomerates",
    "website": "https://www.itochu.co.jp",
    "description": "ITOCHU Corporation engages in trading and importing/exporting various products worldwide. The company's Textile segment produces and sells fiber and garment materials, textiles fabrics, apparel, and industrial materials; and imports lifestyle brands, fashion accessories, and garments in various areas, such as luxury, casual, and sports. Its Machinery segment provides engineering, procurement, and construction services; operates water and environmental, infrastructure, renewable energy, oil and gas, petrochemical, and independent power producer projects and plants; sells and leases aircraft and related equipment; sells automobiles, construction machinery, electronic systems, industrial machinery, and medical devices; and owns and charters ships. The company's Metals & Minerals segment engages in mining and trading of iron ore, coal, uranium, base metals, and minor metals; trading in non-ferrous metal materials; and processing and trading in steel products. Its Energy & Chemicals segment trades in crude oil, petroleum products, LPG, LNG, natural gas, hydrogen, organic and inorganic chemicals, synthetic resins, household goods, fine chemicals, pharmaceuticals, and electronic materials, as well as generates and trades in power. The company's Food segment produces, distributes, and retails food products. Its General Products & Realty segment produces and sells paper, pulp, natural rubber, tire, and wood products and materials; develops and operates real estate properties, such as housing, logistics facilities, and other projects; and offers logistics services. The company's ICT & Financial Business segment offers IT solutions, Internet related and venture capital services, mobile telephone equipment and services, BPO, broadcasting and communications, entertainment and content services, outsourcing services for healthcare and preventive medicine, and financial and insurance brokerage services. The company was founded in 1858 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Masahiro  Okafuji",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "115124",
    "phone": "81 3 3497 2121",
    "address": "5-1, Kita-Aoyama 2-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "107-8077",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ITOCY.png",
    "ipoDate": "2006-01-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]