[
  {
    "symbol": "ITRI",
    "price": 69.27,
    "beta": 1.342605,
    "volAvg": 314935,
    "mktCap": 3146437356,
    "lastDiv": 0,
    "range": "39.38-73.67",
    "changes": 0.67,
    "companyName": "Itron, Inc.",
    "currency": "USD",
    "cik": "0000780571",
    "isin": "US4657411066",
    "cusip": "465741106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.itron.com/na",
    "description": "Itron, Inc., a technology and service company, provides end-to-end solutions that help manage operations in the energy, water, and smart city space worldwide. The company operates through three segments: Device Solutions, Networked Solutions, and Outcomes. The Device Solutions segment offers hardware products that are used for measurement, control, or sensing. The Networked Solutions segment provides a combination of communicating devices, such as smart meters, modules, endpoints, and sensors; network infrastructure; and associated application software for acquiring and transporting application-specific data. The Outcomes segment offers value-added, enhanced software and services for managing, organizing, analyzing, and interpreting data to enhance decision making, maximize operational profitability, drive resource efficiency, and deliver results for consumers, utilities, and smart cities. In addition, it offers implementation, project management, installation, consulting, and post-sale maintenance support services, as well as cloud and software-as-a-service; and extended or customer-specific warranties. It offers its products and services under the Itron brand. The company markets its products directly through its sales force, as well as through indirect sales force consisting of distributors, sales representatives, partners, and meter manufacturer representatives to utilities and municipalities. Itron, Inc. was incorporated in 1977 and is headquartered in Liberty Lake, Washington.",
    "ceo": "Mr. Thomas L. Deitrich",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "4822",
    "phone": "509 924 9900",
    "address": "2111 North Molter Road",
    "city": "Liberty Lake",
    "state": "WA",
    "zip": "99019",
    "dcfDiff": 0.316301,
    "dcf": 56.1237,
    "image": "https://financialmodelingprep.com/image-stock/ITRI.png",
    "ipoDate": "1993-11-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]