[
  {
    "symbol": "ITT",
    "price": 90.75,
    "beta": 1.419014,
    "volAvg": 407498,
    "mktCap": 7477800000,
    "lastDiv": 1.16,
    "range": "63.77-95.18",
    "changes": 0.22,
    "companyName": "ITT Inc.",
    "currency": "USD",
    "cik": "0000216228",
    "isin": "US45073V1089",
    "cusip": "45073V108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.itt.com",
    "description": "ITT Inc. manufactures and sells engineered critical components and customized technology solutions for the transportation, industrial, and energy markets worldwide. The company operates through three segments: Motion Technologies, Industrial Process, and Connect & Control Technologies. The Motion Technologies segment manufactures brake pads, shims, shock absorbers, and energy absorption components; and sealing technologies primarily for the transportation industry, including passenger cars, trucks, light- and heavy-duty commercial and military vehicles, buses, and trains. The Industrial Process segment designs and manufactures industrial pumps, valves, and plant optimization and remote monitoring systems and services; and centrifugal and twin screw positive displacement pumps, as well as aftermarket solutions, such as replacement parts and services. It serves various customers in industries, such as chemical, energy, mining, and other industrial process markets. The Connect & Control Technologies segment designs and manufactures a range of engineered connectors and specialized control components for critical applications supporting various markets, including aerospace and defense, industrial, transportation, medical, and energy. This segment's connector product portfolio includes electrical connectors, such as circular, rectangular, radio frequency, fiber optic, D-sub miniature, micro-miniature, and cable assemblies, as well as control products consist of actuators, valves, and pumps and switches for flow control applications; rate controls, seat recline locks, and elastomer isolators for aircraft interiors; elastomeric bearings for rotorcraft vibration isolation; heaters, hoses, and composite ducting for environmental control systems; and advanced composites for engine applications. ITT Inc. was incorporated in 1920 and is headquartered in White Plains, New York.",
    "ceo": "Mr. Luca  Savi",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "10300",
    "phone": "914 641 2000",
    "address": "1133 Westchester Avenue",
    "city": "White Plains",
    "state": "NY",
    "zip": "10604",
    "dcfDiff": 0.153044,
    "dcf": 91.107,
    "image": "https://financialmodelingprep.com/image-stock/ITT.png",
    "ipoDate": "1995-12-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]