[
  {
    "symbol": "ITUB",
    "price": 5.74,
    "beta": 0.438356,
    "volAvg": 22621769,
    "mktCap": 56251656151,
    "lastDiv": 0.29,
    "range": "3.9-6.08",
    "changes": -0.12,
    "companyName": "Itaú Unibanco Holding S.A.",
    "currency": "USD",
    "cik": "0001132597",
    "isin": "US4655621062",
    "cusip": "465562106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.itau.com.br",
    "description": "Itaú Unibanco Holding S.A. offers a range of financial products and services to individuals and corporate customers in Brazil and internationally. The company operates through three segments: Retail Banking, Wholesale Banking, and Activities with the Market and Corporation. It offers various deposit products, as well as loans and credit cards; investment and commercial banking services; real estate lending services; financing and investment services; and leasing and foreign exchange services. The company also provides property and casualty insurance products covering loss, damage, or liabilities for assets or persons, as well as life insurance products covering death and personal accident; and reinsurance products. It serves retail customers, account and non-account holders, individuals and legal entities, high income clients, microenterprises, and small companies. The company was formerly known as Itaú Unibanco Banco Múltiplo S.A. and changed its name to Itaú Unibanco Holding S.A. in April 2009. The company was incorporated in 1924 and is headquartered in São Paulo, Brazil. Itaú Unibanco Holding S.A. is a subsidiary of IUPAR - Itaú Unibanco Participações S.A.",
    "ceo": "Mr. Milton Maluhy Filho",
    "sector": "Financial Services",
    "country": "BR",
    "fullTimeEmployees": "99600",
    "phone": "55 11 5019 1267",
    "address": "PraCa Alfredo Egydio de Souza Aranha",
    "city": "São Paulo",
    "state": "SP",
    "zip": "04344-902",
    "dcfDiff": 22.4204,
    "dcf": 27.2704,
    "image": "https://financialmodelingprep.com/image-stock/ITUB.png",
    "ipoDate": "2002-02-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]