[
  {
    "symbol": "ITVPY",
    "price": 8.68,
    "beta": 1.496168,
    "volAvg": 6420,
    "mktCap": 3494055811,
    "lastDiv": 0.61,
    "range": "5.98-11.21",
    "changes": -0.0515,
    "companyName": "ITV plc",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Broadcasting",
    "website": "https://www.itv.com",
    "description": "ITV plc, an integrated producer broadcaster, creates, owns, and distributes content on various platforms worldwide. It operates through Media & Entertainment, and ITV Studios segments. The Media & Entertainment segment broadcasts various contents on its family of free-to-air channels, including ITV, ITV2, ITV3, ITV4, ITVBe, ITV Encore, CITV, ITV Breakfast, CITV Breakfast, and various related +1 and HD equivalents; and offers television advertising services. It also delivers content through linear television broadcasting, as well as on the ITV Hub, catch up services on pay platforms, and through direct content deals. In addition, this segment offers online advertising, HD digital channel on pay platform, and ITV Choice subscription services, as well as licenses DTT Multiplex A. The ITV Studios segment creates and produces programs and formats that include drama, entertainment, and factual entertainment for its own channels and other broadcasters. It also operates as an unscripted independent producer of content in the United States; and produces content for local broadcasters and international OTT platforms in Australia, Germany, France, Italy, the Netherlands, Sweden, Norway, Finland, and Denmark. In addition, this segment engages in formats and distribution ITV's finished programmes, and formats and third-party content internationally, as well as finances productions. The company also engages in the development of platform, broadband, transactional, and mobile services; operation of digital television channels; operation of Freeview Multiplex A; rights ownership and distribution of television programs and films; and scheduling and commissioning of television programs. ITV plc was founded in 1955 is based in London, the United Kingdom.",
    "ceo": "Ms. Dame Carolyn J. McCall DBE",
    "sector": "Communication Services",
    "country": "GB",
    "fullTimeEmployees": "7272",
    "phone": null,
    "address": "2 Waterhouse Square",
    "city": "London",
    "state": null,
    "zip": "EC1N 2AE",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ITVPY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]