[
  {
    "symbol": "IX",
    "price": 91.96,
    "beta": 0.948275,
    "volAvg": 25645,
    "mktCap": 20377600320,
    "lastDiv": 3.09,
    "range": "68.78-92.03",
    "changes": 1.63,
    "companyName": "ORIX Corporation",
    "currency": "USD",
    "cik": "0001070304",
    "isin": "US6863301015",
    "cusip": "686330101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Credit Services",
    "website": "https://www.orix.co.jp",
    "description": "ORIX Corporation provides diversified financial services in Japan, the Americas, Asia, Europe, Australasia, the Middle East, and internationally. The company's Corporate Financial Services and Maintenance Leasing segment is involved in the finance and fee; leasing and rental of automobiles, electronic measuring instruments, and ICT-related equipment businesses; and provision of life insurance and environment and energy-related products and services. Its Real Estate segment develops, rents, and manages real estate properties; operates facilities; manages residential condominiums and office building; and provides construction contracting, real estate brokerage, and real estate investment advisory services. The company's PE Investment and Concession segment engages in the private equity (PE) investment and concession businesses. Its Environment and Energy segment provides renewable energy; ESCO; retails electric power; sells solar panels and battery electricity storage systems; and recycling and waste management services. The company's Insurance segment sells life insurance products through agents, banks, and other financial institutions, as well as face-to-face and online. Its Banking and Credit segment provides banking and consumer finance services. The company's Aircraft and Ships segment engages in the aircraft leasing and management, and ship-related finance and investment businesses. Its ORIX USA segment offers finance, investment, and asset management services. The company's ORIX Europe segment provides equity and fixed income asset management services. Its Asia and Australia segment offers finance and investment businesses. The company was formerly known as Orient Leasing Co., Ltd. and changed its name to ORIX Corporation in 1989. ORIX Corporation was incorporated in 1950 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Makoto  Inoue",
    "sector": "Financial Services",
    "country": "JP",
    "fullTimeEmployees": "32235",
    "phone": "81 3 3435 3000",
    "address": "South Tower",
    "city": "Tokyo",
    "state": null,
    "zip": "105-5135",
    "dcfDiff": 3936.27,
    "dcf": 4023.99,
    "image": "https://financialmodelingprep.com/image-stock/IX.png",
    "ipoDate": "1998-09-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]