[
  {
    "symbol": "J",
    "price": 116.31,
    "beta": 0.835563,
    "volAvg": 636909,
    "mktCap": 14753923500,
    "lastDiv": 1.04,
    "range": "106.78-138.05",
    "changes": -0.08,
    "companyName": "Jacobs Engineering Group Inc.",
    "currency": "USD",
    "cik": "0000052988",
    "isin": "US4698141078",
    "cusip": "469814107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Engineering & Construction",
    "website": "https://www.jacobs.com",
    "description": "Jacobs Engineering Group Inc. provides consulting, technical, scientific, and project delivery services for the government and private sectors in the United States, Europe, Canada, India, rest of Asia, Australia, New Zealand, South America, Mexico, the Middle East, and Africa. The company operates in two segments, Critical Mission Solutions and People & Places Solutions. The Critical Mission Solutions segment provides cybersecurity, data analytics, systems and software application integration and consulting, enterprise and mission IT, engineering and design, nuclear, enterprise level operations and maintenance, and other technical consulting solutions. The People & Places Solutions segment offers data analytics, artificial intelligence and automation, software development, digitally driven consulting, planning and architecture, program management, and other technical consulting solutions. The company is also involved in the management and execution of wind-tunnel design-build projects; and design-build for water and construction management. Jacobs Engineering Group Inc. was founded in 1947 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Robert V. Pragada",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "60000",
    "phone": "214 583 8500",
    "address": "1999 Bryan Street",
    "city": "Dallas",
    "state": "TX",
    "zip": "75201",
    "dcfDiff": 8.1955,
    "dcf": 130.105,
    "image": "https://financialmodelingprep.com/image-stock/J.png",
    "ipoDate": "1980-03-17",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]