[
  {
    "symbol": "JAMF",
    "price": 18.84,
    "beta": 0.418344,
    "volAvg": 534485,
    "mktCap": 2335915080,
    "lastDiv": 0.2728,
    "range": "16.53-28.38",
    "changes": 0.29,
    "companyName": "Jamf Holding Corp.",
    "currency": "USD",
    "cik": "0001721947",
    "isin": "US47074L1052",
    "cusip": "47074L105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.jamf.com",
    "description": "Jamf Holding Corp. offers a cloud software platform for Apple infrastructure and security platform worldwide. Its products include Jamf Pro, an Apple ecosystem management software solution for IT environments; Jamf Now, a pay-as-you-go Apple device management software solution for small-to-medium-sized businesses; Jamf School, a software solution for educators; Jamf Data Policy, a solution to enforce acceptable usage policies to eliminate shadow IT and block risky content and manage data consumption with real-time analytics and granular reporting; and Jamf Connect that streamlines Mac authentication and identity management; and Jamf Private Access, a ZTNA solution that replaces legacy conditional access and VPN technology. The company also offers Jamf Protect, which provides protection of Mac-targeted malware and creates customized telemetry and detections that give enterprise security teams visibility into their Macs; Jamf Threat Defense, a solution to protect workers from malicious attackers; and Jamf Nation, an online community of IT and security professionals focusing on Apple in the enterprise. It sells its SaaS solutions through a subscription model, direct sales force, and online, as well as indirectly through channel partners, including Apple. The company was founded in 2002 and is headquartered in Minneapolis, Minnesota.",
    "ceo": "Mr. Dean J. Hager",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2796",
    "phone": "612 605 6625",
    "address": "100 Washington Avenue South",
    "city": "Minneapolis",
    "state": "MN",
    "zip": "55401",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/JAMF.png",
    "ipoDate": "2020-07-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]