[
  {
    "symbol": "JAZZ",
    "price": 122.5,
    "beta": 0.741197,
    "volAvg": 530495,
    "mktCap": 7857088750,
    "lastDiv": 0,
    "range": "121.665-163.31",
    "changes": -0.85,
    "companyName": "Jazz Pharmaceuticals plc",
    "currency": "USD",
    "cik": "0001232524",
    "isin": "IE00B4Q5ZN47",
    "cusip": "G50871105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.jazzpharma.com",
    "description": "Jazz Pharmaceuticals plc, a biopharmaceutical company, identifies, develops, and commercializes pharmaceutical products for various unmet medical needs in the United States, Europe, and internationally. The company has a portfolio of products and product candidates with a focus in the areas of neuroscience, including sleep medicine and movement disorders; and in oncology, including hematologic and solid tumors. Its lead marketed products include Xyrem, an oral solution for the treatment of cataplexy and excessive daytime sleepiness (EDS) in narcolepsy patients seven years of age and older; Sunosi for the treatment of EDS in patients with narcolepsy and obstructive sleep apnea; Erwinaze to treat acute lymphoblastic leukemia; Defitelio for the treatment of adult and pediatric patients with hepatic veno-occlusive disease; Vyxeos liposome for injection, a product for the treatment of adults with newly-diagnosed therapy-related acute myeloid leukemia; and Zepzelca for the treatment of adult patients with metastatic small cell lung cancer. The company also offers Xywav, an oxybate product candidate, to treat EDS and cataplexy with narcolepsy and idiopathic hypersomnia; JZP-324, a low sodium oxybate formulation with the potential to provide a clinically meaningful option for narcolepsy patients; JZP385, a T-type calcium channel modulator, for the treatment of essential tremor; JZP458, a recombinant Erwinia asparaginase, for use as a component of a multi-agent chemotherapeutic regimen in the treatment of pediatric and adult patients; and JZP150 for treatment of post-traumatic stress disorder. The company has licensing and collaboration agreements with ImmunoGen, Inc.; Codiak BioSciences, Inc.; Pfenex, Inc.; XL-protein GmbH; and Redx Pharma plc. Jazz Pharmaceuticals plc was incorporated in 2003 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Bruce C. Cozadd",
    "sector": "Healthcare",
    "country": "IE",
    "fullTimeEmployees": "2800",
    "phone": "353 1 634 7800",
    "address": "Waterloo Exchange",
    "city": "Dublin",
    "state": null,
    "zip": "4",
    "dcfDiff": 2.94094,
    "dcf": 158.511,
    "image": "https://financialmodelingprep.com/image-stock/JAZZ.png",
    "ipoDate": "2007-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]