[
  {
    "symbol": "JBSAY",
    "price": 7.23,
    "beta": 0.24315,
    "volAvg": 192050,
    "mktCap": 8018503569,
    "lastDiv": 0.79,
    "range": "6.2-12.68",
    "changes": -0.22,
    "companyName": "JBS S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US4661101034",
    "cusip": "466110103",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Packaged Foods",
    "website": "https://www.jbs.com.br",
    "description": "JBS S.A., a food company, processes and trades in animal protein worldwide. It offers beef, pork, chicken, and lamb products and by-products; food products; pet food and concentrates; and bresaola. The company also produces and commercializes steel cans, plastic resins, soap bases and bars, biodiesel, glycerin, fatty acid, collagen, and wrapper, as well as wet blue, semi-finished, and finished leather products; manages industrial residue; purchases and sells soybeans; and produces, cogenerates, and commercializes electric power. In addition, it is involved in tallow, palm oil, caustic soda, stearin, transportation, dog biscuits, hygiene and personal care, and sausage casings business; the operation of distribution centers and harbors; and the provision of cattle fattening, transportation, logistics, warehousing, and waste management and recycling services. Further, the company trades in cooked frozen meat; and operates Mercado da Carne store that provides beef and related items. It offers its products under the 1953, Doriana, Friboi, Massa Leve, Maturatta, Seara, Seara Gourmet, Swift, Angus Friboi, Anglo, Big Frango, Bordon, Confiança, delicate, Do Chef, Frangosul, Frigor Hans, LeBon, Reserva Friboi, Rezende, 1855, Incrível Seara, 5 Star, Aspen Ridge, Plumrose, Gold'n Plump, Just Bared Chicken, La Herencia, Moy Park, Pilgrim's, Primo, Rigamonti, and Swift Black. The company was formerly known as Friboi Ltda. JBS S.A. was founded in 1953 and is headquartered in São Paulo, Brazil.",
    "ceo": "Mr. Gilberto  Tomazoni",
    "sector": "Consumer Defensive",
    "country": "BR",
    "fullTimeEmployees": "260000",
    "phone": "55 11 3144 4000",
    "address": "Avenida Marginal Direita do Tietê, 500",
    "city": "São Paulo",
    "state": "SP",
    "zip": "05118-100",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/JBSAY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]