[
  {
    "symbol": "JBT",
    "price": 118.95,
    "beta": 1.416197,
    "volAvg": 156272,
    "mktCap": 3785036580,
    "lastDiv": 0.4,
    "range": "81.59-123.12",
    "changes": -0.91,
    "companyName": "John Bean Technologies Corporation",
    "currency": "USD",
    "cik": "0001433660",
    "isin": "US4778391049",
    "cusip": "477839104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.jbtc.com",
    "description": "John Bean Technologies Corporation provides technology solutions to food and beverage industry and equipment and services to air transportation industries. The company operates through two segments: JBT FoodTech and JBT AeroTech. It offers poultry processing, mixing/grinding, injecting, marinating, tumbling, portioning, packaging, coating, cooking, frying, freezing, weighing, X-ray food inspection, and food safety solutions. The company also provides processing solutions for extracting, mixing, blending, pasteurizing, sterilizing, concentrating, high pressure processing, filling, closing, sealing, and final packaging, as well as processing equipment; and packaging systems for poultry, beef, pork, seafood, ready-to-eat meals, fruits, vegetables, dairy, bakery, pet foods, soups, sauces, and juices. In addition, it offers automated guided vehicle systems for material movement in the manufacturing, warehouse, and medical facilities. Further, the company provides mobile air transportation equipment, such as commercial and defense cargo loading, aircraft deicing, aircraft towing, and aircraft ground power and cooling systems; and fixed equipment for passenger boarding. Additionally, it offers airport equipment, systems, and facilities maintenance services to domestic and international airport authorities, passenger airlines, airfreight and ground handling companies, defense forces, and defense contractors. The company markets and sells its products and solutions through direct sales force, independent distributors, and sales representatives. John Bean Technologies Corporation was incorporated in 1994 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Brian A. Deck",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "7200",
    "phone": "312 861 5900",
    "address": "70 West Madison Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60602",
    "dcfDiff": 16.4352,
    "dcf": 92.8948,
    "image": "https://financialmodelingprep.com/image-stock/JBT.png",
    "ipoDate": "2008-07-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]