[
  {
    "symbol": "JD",
    "price": 34.79,
    "beta": 0.444014,
    "volAvg": 11740661,
    "mktCap": 56224463525,
    "lastDiv": 0.62,
    "range": "31.565-67.87",
    "changes": -0.96,
    "companyName": "JD.com, Inc.",
    "currency": "USD",
    "cik": "0001549802",
    "isin": "US47215P1066",
    "cusip": "47215P106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Retail",
    "website": "https://www.jd.com",
    "description": "JD.com, Inc. provides supply chain-based technologies and services in the People's Republic of China. The company offers computers, communication, and consumer electronics products, as well as home appliances; and general merchandise products comprising food, beverage and fresh produce, baby and maternity products, furniture and household goods, cosmetics and other personal care items, pharmaceutical and healthcare products, books, automobile accessories, apparel and footwear, bags, and jewelry. It also provides online marketplace services for third-party merchants; marketing services; and omni-channel solutions to customers and offline retailers, as well as online healthcare services. In addition, the company develops, owns, and manages its logistics facilities and other real estate properties to support third parties; and provides asset management services for logistics property investors. Further, it provides integrated data, technology, business, and user management industry solutions to support the digitization of enterprises and institutions. The company was formerly known as 360buy Jingdong Inc. and changed its name to JD.com, Inc. in January 2014. JD.com, Inc. was incorporated in 2006 and is headquartered in Beijing, the People's Republic of China.",
    "ceo": "Ms. Ran  Xu",
    "sector": "Consumer Cyclical",
    "country": "CN",
    "fullTimeEmployees": "450679",
    "phone": "86 10 8911 8888",
    "address": "Building A, 20th Floor",
    "city": "Beijing",
    "state": null,
    "zip": "101111",
    "dcfDiff": 35.5972,
    "dcf": 99.3372,
    "image": "https://financialmodelingprep.com/image-stock/JD.png",
    "ipoDate": "2014-05-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]