[
  {
    "symbol": "JEF",
    "price": 33.07,
    "beta": 1.391197,
    "volAvg": 1102288,
    "mktCap": 7652762035,
    "lastDiv": 1.2,
    "range": "25.573614-40.68",
    "changes": 1.13,
    "companyName": "Jefferies Financial Group Inc.",
    "currency": "USD",
    "cik": "0000096223",
    "isin": "US47233W1099",
    "cusip": "47233W109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.jefferies.com",
    "description": "Jefferies Financial Group Inc. engages in the investment banking and capital markets, and asset management businesses in the Americas, Europe, the Middle East, Africa, and Asia. The company operates in Investment Banking and Capital Markets, Asset Management, Merchant Banking, and Corporate segments. It provides investment banking, advisory services with respect to mergers or acquisitions, restructurings or recapitalizations and private capital advisory transactions; equity and debt underwriting; and corporate lending. In addition, the company offers financing, securities lending, and other prime brokerage services; equities research and finance; and wealth management services. Further, it provides clients with sales and trading of investment grade corporate bonds, U.S. and European government and agency securities, municipal bonds, mortgage-backed and asset-backed securities, leveraged loans, consumer loans, high yield and distressed securities, emerging markets debt, interest rate, and credit derivative products, as well as foreign exchange trade execution and securitization; and manages, invests in, and provides services to a diverse group of alternative asset management platforms across a spectrum of investment strategies and asset classes. The company was formerly known as Leucadia National Corporation and changed its name to Jefferies Financial Group Inc. in May 2018. Jefferies Financial Group Inc. was founded in 1962 and is headquartered in New York, New York.",
    "ceo": "Mr. Richard Brian Handler",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "5381",
    "phone": "212 460 1900",
    "address": "520 Madison Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10022",
    "dcfDiff": 37.5336,
    "dcf": 76.6636,
    "image": "https://financialmodelingprep.com/image-stock/JEF.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]