[
  {
    "symbol": "JHX",
    "price": 26.09,
    "beta": 0.971647,
    "volAvg": 46912,
    "mktCap": 11632383040,
    "lastDiv": 0.7,
    "range": "17.25-27.81",
    "changes": -0.09,
    "companyName": "James Hardie Industries plc",
    "currency": "USD",
    "cik": "0001159152",
    "isin": "US47030M1062",
    "cusip": "47030M106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Materials",
    "website": "https://www.ir.jameshardie.com.au",
    "description": "James Hardie Industries plc, together with its subsidiaries, manufactures and sells fiber cement, fiber gypsum, and cement bonded building products for interior and exterior building construction applications primarily in the United States, Australia, Europe, New Zealand, the Philippines, and Canada. The company operates through three segments: North America Fiber Cement, Asia Pacific Fiber Cement, and Europe Building Products. It offers fiber cement interior linings, exterior siding products, and related accessories; and various fiber cement building materials for a range of applications, including external siding, internal walls, floors, ceilings, soffits, trim, fences, and facades. The company also provides fiber gypsum and cement-bonded boards for applications, such as timber frame construction, dry lining, DIY, and structural fire protection. Its products are used in various markets comprising new residential construction and commercial construction markets. James Hardie Industries plc was founded in 1888 and is based in Dublin, Ireland.",
    "ceo": "Mr. Aaron M. Erter",
    "sector": "Basic Materials",
    "country": "IE",
    "fullTimeEmployees": "5473",
    "phone": "353 1 411 6924",
    "address": "Europa House",
    "city": "Dublin",
    "state": null,
    "zip": "2",
    "dcfDiff": 3.18188,
    "dcf": 19.3981,
    "image": "https://financialmodelingprep.com/image-stock/JHX.png",
    "ipoDate": "2001-10-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]