[
  {
    "symbol": "JJSF",
    "price": 155.99,
    "beta": 0.548943,
    "volAvg": 67032,
    "mktCap": 3003166277,
    "lastDiv": 2.8,
    "range": "127.8-165.9",
    "changes": 0.42,
    "companyName": "J&J Snack Foods Corp.",
    "currency": "USD",
    "cik": "0000785956",
    "isin": "US4660321096",
    "cusip": "466032109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Packaged Foods",
    "website": "https://www.jjsnack.com",
    "description": "J&J Snack Foods Corp. manufactures, markets, and distributes nutritional snack foods and beverages to the food service and retail supermarket industries in the United States, Mexico, and Canada. It operates in three segments: Food Service, Retail Supermarkets, and Frozen Beverages. The company offers soft pretzels under the SUPERPRETZEL, PRETZEL FILLERS, PRETZELFILS, GOURMET TWISTS, MR. TWISTER, SOFT PRETZEL BITES, SOFTSTIX, SOFT PRETZEL BUNS, TEXAS TWIST, BAVARIAN BAKERY, SUPERPRETZEL BAVARIAN, NEW YORK PRETZEL, KIM & SCOTT'S GOURMET PRETZELS, SERIOUSLY TWISTED!, BRAUHAUS, AUNTIE ANNE'S, and LABRIOLA, as well as under the private labels. It also provides frozen novelty under the LUIGI'S, WHOLE FRUIT, PHILLY SWIRL, SOUR PATCH, ICEE, and MINUTE MAID brands; churros under the TIO PEPE'S and CALIFORNIA CHURROS brands; and handheld products under the SUPREME STUFFERS and SWEET STUFFERS brands. In addition, the company offers bakery products, including biscuits, fig and fruit bars, cookies, breads, rolls, crumbs, muffins, and donuts under the MRS. GOODCOOKIE, READI-BAKE, COUNTRY HOME, MARY B'S, DADDY RAY'S, and HILL & VALLEY brands, as well as under private labels; and frozen beverages under the ICEE, SLUSH PUPPIE, and PARROT ICE brands. Further, it provides funnel cakes under the FUNNEL CAKE FACTORY brand, as well as various other food products; and sells machines and machine parts to other food and beverage companies. The company sells its products through a network of food brokers, independent sales distributors, and direct sales force. It serves snack bars and food stand locations in chain, department and mass merchandising stores, malls and shopping centers, fast food and casual dining restaurants, stadiums and sports arenas, leisure and theme parks, convenience stores, movie theatres, warehouse club stores, schools, colleges and other institutions, and independent retailers. The company was incorporated in 1971 and is headquartered in Pennsauken, New Jersey.",
    "ceo": "Mr. Daniel  Fachner",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "5000",
    "phone": "856 665 9533",
    "address": "6000 Central Highway",
    "city": "Pennsauken",
    "state": "NJ",
    "zip": "08109",
    "dcfDiff": 24.7512,
    "dcf": 174.391,
    "image": "https://financialmodelingprep.com/image-stock/JJSF.png",
    "ipoDate": "1986-02-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]