[
  {
    "symbol": "JLL",
    "price": 152.07,
    "beta": 1.284154,
    "volAvg": 369019,
    "mktCap": 7263608343,
    "lastDiv": 8.41,
    "range": "123.0-191.79",
    "changes": 0.06,
    "companyName": "Jones Lang LaSalle Incorporated",
    "currency": "USD",
    "cik": "0001037976",
    "isin": "US48020Q1076",
    "cusip": "48020Q107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Real Estate Services",
    "website": "https://www.us.jll.com",
    "description": "Jones Lang LaSalle Incorporated, a professional services company, provides real estate and investment management services in Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers a range of real estate services, including agency leasing and tenant representation services; and capital market services, such as debt advisory, loan sales, equity advisory, loan servicing, merger and acquisition, corporate advisory, and investment sales and advisory services. It also provides on-site management services for office, industrial, retail, multifamily residential, and specialty properties; integrated facilities management services; designing, building, management, and consulting services to tenants of leased space, owners in self-occupied buildings, and owners of real estate investments; and advisory, consulting, valuation, and energy and sustainability services. In addition, the company offers investment management services to institutional and retail investors, including high-net-worth individuals. It provides its services to real estate owners, occupiers, investors, and developers for various property types, including cultural, educational, government, healthcare, laboratory, hotel, hospitality, and sports facilities; industrial and warehouse, office, and residential properties; retail and shopping malls; critical environment, data, transportation, and sort and fulfillment centers; infrastructure projects; and military housings. The company was formerly known as LaSalle Partners Incorporated and changed its name to Jones Lang LaSalle Incorporated in March 1999. Jones Lang LaSalle Incorporated was incorporated in 1997 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Christian  Ulbrich",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "103300",
    "phone": "312 782 5800",
    "address": "200 East Randolph Drive",
    "city": "Chicago",
    "state": "IL",
    "zip": "60601",
    "dcfDiff": 12.3704,
    "dcf": 168.93,
    "image": "https://financialmodelingprep.com/image-stock/JLL.png",
    "ipoDate": "1997-07-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]