[
  {
    "symbol": "JMHLY",
    "price": 51.58,
    "beta": 0.415708,
    "volAvg": 16869,
    "mktCap": 14946439760,
    "lastDiv": 2.15,
    "range": "45.01-58.2",
    "changes": -0.65,
    "companyName": "Jardine Matheson Holdings Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US4711154025",
    "cusip": "471115402",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Conglomerates",
    "website": "https://www.jardines.com",
    "description": "Jardine Matheson Holdings Limited, through its subsidiaries, engages in the motor vehicles and related operations, property investment and development, food retailing, health and beauty, home furnishings, engineering and construction, and transportation businesses. It is also involved in the restaurants and hotels, financial services, heavy equipment, mining, and agribusinesses. The company offers airport ground handling, and aviation and transport services; and engineering, sourcing, and contracting services, as well as owns and operates air cargo terminals, and invests in residential properties. It is also involved in the Pizza Hut and KFC franchise restaurants operations; designing, engineering, installation, maintenance, and modernization of escalators, and moving walkways; and supplying aseptic packaging materials. In addition, the company provides automobile and motorcycle products, as well as sells and services motor vehicles; invests in, owns, develops, and manages office and retail properties; operates outlets, including supermarkets, hypermarkets, convenience stores, health and beauty stores, and home furnishings stores; and invests in and manages a portfolio of deluxe and first class hotels, resorts, and residences. Further, it engages in the motor dealerships, dairy, and cement businesses. Additionally, the company is involved in the energy, infrastructure, logistics, insurance brokerage, and information technology businesses. It operates in China, Southeast Asia, the United Kingdom, and internationally. The company was founded in 1832 and is based in Hamilton, Bermuda.",
    "ceo": "Mr. Benjamin William Keswick",
    "sector": "Industrials",
    "country": "BM",
    "fullTimeEmployees": "425000",
    "phone": null,
    "address": "Jardine House",
    "city": "Hamilton",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/JMHLY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]