[
  {
    "symbol": "JMPLY",
    "price": 43.67,
    "beta": 1.020306,
    "volAvg": 5016,
    "mktCap": 4005705164,
    "lastDiv": 1.91,
    "range": "38.51-58.67",
    "changes": 0.09,
    "companyName": "Johnson Matthey Plc",
    "currency": "USD",
    "cik": null,
    "isin": "US4791425071",
    "cusip": "479142309",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Chemicals",
    "website": "https://www.matthey.com",
    "description": "Johnson Matthey Plc engages in the clean air, catalyst and hydrogen technology, and platinum group metals (PGM) service businesses in the United Kingdom, Germany, rest of Europe, the United States, rest of North America, China and Hong Kong, rest of Asia, and internationally. It operates through three segments: Clean Air, Efficient Natural Resources, and Other Markets. The Clean Air segment provides catalysts for emission control after-treatment systems to remove harmful emissions from vehicles, as well as cars, other light duty vehicles, trucks, buses, and non-road equipment powered by diesel and gasoline. The Efficient Natural Resources segment provides products and processing services for the use and transformation of critical natural resources including oil, gas, biomass, and platinum group metals; and circular economy solutions. This segment also offers specialty catalysts and additives; process technology and engineering design licenses; platinum group metal refining and recycling services, and chemical and industrial products; and other precious metal services. The Other Markets segment business portfolio includes precious metal pastes and enamels, battery systems, fuel cell technologies, battery materials, and green hydrogen; science and technology to develop the products for devices used in medical procedures; and detection, diagnostic, and measurement solutions. The company was formerly known as Johnson & Cock and changed its name to Johnson Matthey Plc in 1851. Johnson Matthey Plc was founded in 1817 and is based in London, the United Kingdom.",
    "ceo": "Mr. Liam  Condon",
    "sector": "Basic Materials",
    "country": "GB",
    "fullTimeEmployees": "12638",
    "phone": "44 20 7269 8400",
    "address": "25 Farringdon Street",
    "city": "London",
    "state": null,
    "zip": "EC4A 4AB",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/JMPLY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]