[
  {
    "symbol": "JOE",
    "price": 46.72,
    "beta": 1.269718,
    "volAvg": 167656,
    "mktCap": 2727139840,
    "lastDiv": 0.4,
    "range": "31.11-48.03",
    "changes": 0.82,
    "companyName": "The St. Joe Company",
    "currency": "USD",
    "cik": "0000745308",
    "isin": "US7901481009",
    "cusip": "790148100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Real Estate—Diversified",
    "website": "https://www.joe.com",
    "description": "The St. Joe Company, together with its subsidiaries, operates as a real estate development, asset management, and operating company in Northwest Florida. It operates through three segments: Residential, Hospitality, and Commercial. The Residential segment plans and develops residential communities of various sizes for homebuilders or retail consumers. It primarily sells developed homesites and parcels of entitled or undeveloped land. The Hospitality segment owns and operates a private membership club, golf courses, beach clubs, retail outlets, marinas, and other entertainment assets. This segment also engages in the hotel, food and beverage, and gulf-front vacation rental operations, as well as provides management services. The Commercial segment engages in leasing of commercial property, multi-family, a senior living community, and other assets. This segment also plans, develops, entitles, manages, and sells commercial land holdings for retail, office, hotel, senior living, multi-family, self-storage, and industrial uses; and grows and sells pulpwood, sawtimber, and other forest products. The company owns 170,000 acres of land in Northwest Florida. The St. Joe Company was incorporated in 1936 and is based in Panama City Beach, Florida.",
    "ceo": "Mr. Jorge Luis Gonzalez",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "680",
    "phone": "850 231 6400",
    "address": "130 Richard Jackson Boulevard",
    "city": "Panama City Beach",
    "state": "FL",
    "zip": "32407",
    "dcfDiff": 8.09844,
    "dcf": 37.9616,
    "image": "https://financialmodelingprep.com/image-stock/JOE.png",
    "ipoDate": "1990-03-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]