[
  {
    "symbol": "JRONY",
    "price": 55.34,
    "beta": 0.417241,
    "volAvg": 2340,
    "mktCap": 17388768337,
    "lastDiv": 1.19,
    "range": "35.06-56.33",
    "changes": -0.8863,
    "companyName": "Jerónimo Martins, SGPS, S.A.",
    "currency": "USD",
    "cik": "0001438077",
    "isin": "US4764931014",
    "cusip": "476493101",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Food Distribution",
    "website": "https://www.jeronimomartins.com",
    "description": "Jerónimo Martins, SGPS, S.A. operates in the food distribution and specialized retail sectors in Portugal, Poland, and Colombia. The company operates through Portugal Retail; Portugal Cash & Carry; Poland Retail; Colombia Retail; and Others, Eliminations and Adjustments segments. It operates 3,250 food stores under the Biedronka name; and a chain of 290 health and beauty stores under the Hebe banner in Poland, as well as 819 food stores under the Ara name in Colombia. The company also operates 460 supermarkets under the Pingo Doce banner; and 38 stores and 4 platforms under the Recheio name in Portugal. In addition, it operates restaurants under the Pingo Doce name; Bem-Estar stores; and petrol stations and clothing under Code brand. Further, the company operates 20 kiosks and coffee shops under the Jeronymo name; and 21 chocolates and confectionary retail stores under Hussel name. Additionally, the company engages in human resources top management, real estate management and administration, training, and saline brackish waters aquaculture; wholesale of fruit and vegetables; retail management, consultancy, and logistics activities; the purchase and sale of real estate; growing of crops and farming of animals; retail sale of health and beauty products; manufacture of milk and dairy products; and provision of economic and accounting, business portfolio management, financial, and sea passenger water transport services. It is also involved in the trading and distribution of consumer goods; retail and wholesale of non-food products; other business support service activities; and provision of services in the area of wholesale and retail distribution. The company was founded in 1792 and is headquartered in Lisbon, Portugal. Jerónimo Martins, SGPS, S.A. is a subsidiary of Sociedade Francisco Manuel dos Santos, SGPS, S.E.",
    "ceo": "Mr. Pedro Manuel de Castro Soares dos Santos",
    "sector": "Consumer Defensive",
    "country": "PT",
    "fullTimeEmployees": "111321",
    "phone": "351 21 752 61 05",
    "address": "Rua Actor AntOnio Silva n. o 7",
    "city": "Lisbon",
    "state": null,
    "zip": "1649-033",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/JRONY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]