[
  {
    "symbol": "JSCPY",
    "price": 28.87,
    "beta": 0.843678,
    "volAvg": 941,
    "mktCap": 5993007820,
    "lastDiv": 0.5,
    "range": "17.48-31.2",
    "changes": -0.38,
    "companyName": "JSR Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US46632X1063",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Chemicals",
    "website": "https://www.jsr.co.jp",
    "description": "JSR Corporation engages in the elastomers, plastics, digital solutions, and life sciences businesses in Japan and internationally. The company's Elastomers Business segment offers synthetic rubbers, such as styrene-butadiene rubber, poly-butadiene rubber, ethylene, and propylene rubber and compounded products; thermoplastic elastomers and compounded products; latex for paper processing; general industrial-use latex; acrylic emulsions; high-functional dispersants; industrial particles; materials for heat insulation paints; materials for batteries; butadiene monomers, etc. Its products are used in tires and various rubber automotive parts, shoe soles, and automobile sealants. Its Digital Solutions Business provides photoresists and multilayer materials, CMP materials, mounting materials, materials for color LCDs, functional coating materials, heat-resistant transparent resins and functional films, photo fabrication and photo molding systems, etc. Its products are used in semiconductor devices, smartphones, tablet devices, LCD TVs, OLED panel materials, and other electronics. The company's Life Sciences Business offers diagnostic and research reagents, and chromatography resins to purify antibodies and drugs; bio-process materials; drug discovery and development services for biopharmaceutical development process, etc. Its Plastics Business provides synthetic resins, including ABS, AES, AS, and ASA resins for use in automobile parts, household appliances, building materials, automobile interior materials, exterior materials, and plating materials. JSR Corporation was incorporated in 1948 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Eric R.  Johnson",
    "sector": "Basic Materials",
    "country": "JP",
    "fullTimeEmployees": "7994",
    "phone": "81 3 6218 3500",
    "address": "Shiodome Sumitomo Building",
    "city": "Tokyo",
    "state": null,
    "zip": "105-8640",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/JSCPY.png",
    "ipoDate": "2010-05-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]