[
  {
    "symbol": "JXN",
    "price": 29.81,
    "beta": 0,
    "volAvg": 968838,
    "mktCap": 2459044786,
    "lastDiv": 2.48,
    "range": "23.56-49.6",
    "changes": 0.06,
    "companyName": "Jackson Financial Inc.",
    "currency": "USD",
    "cik": "0001822993",
    "isin": "US46817M1071",
    "cusip": "46817M107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Life",
    "website": "https://www.jackson.com",
    "description": "Jackson Financial Inc., through its subsidiaries, primarily provides a suite of annuities to retail investors in the United States. The company operates through three segments: Retail Annuities, Institutional Products, and Closed Life and Annuity Blocks. The Retail Annuities segment offers various retirement income and savings products, including variable, fixed index, fixed, and immediate payout annuities, as well as registered index-linked annuities and lifetime income solutions. The Institutional Products segment provides traditional guaranteed investment contracts; funding agreements comprising agreements issued in conjunction with its participation in the U.S. federal home loan bank program; and medium-term funding agreement-backed notes. The Closed Life and Annuity Blocks segment offers various protection products, such as whole life, universal life, variable universal life, and term life insurance products, as well as fixed, fixed index, and payout annuities. This segment also provides a block of group payout annuities. The company also offers investment management services. It sells its products through a distribution network that includes independent broker-dealers, banks and other financial institutions, wirehouses and regional broker-dealers, and independent registered investment advisors, third-party platforms, and insurance agents. Jackson Financial Inc. was formerly known as Brooke (Holdco1) Inc. and changed its name to Jackson Financial Inc. in July 2020. The company was incorporated in 2006 and is headquartered in Lansing, Michigan.",
    "ceo": "Ms. Laura Louene Prieskorn",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2975",
    "phone": "517 381 5500",
    "address": "1 Corporate Way",
    "city": "Lansing",
    "state": "MI",
    "zip": "48951",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/JXN.png",
    "ipoDate": "2021-09-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]