[
  {
    "symbol": "KAI",
    "price": 213.72,
    "beta": 1.189084,
    "volAvg": 55462,
    "mktCap": 2501272020,
    "lastDiv": 1.16,
    "range": "154.19-229.9",
    "changes": -1,
    "companyName": "Kadant Inc.",
    "currency": "USD",
    "cik": "0000886346",
    "isin": "US48282T1043",
    "cusip": "48282T104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.kadant.com",
    "description": "Kadant Inc. supplies technologies and engineered systems worldwide. It operates through three segments: Flow Control, Industrial Processing, and Material Handling. The Flow Control segment develops, manufactures, and markets fluid-handling systems and equipment, such as rotary joints, syphons, turbulator bars, expansion joints, and engineered steam and condensate systems; and doctoring, cleaning, and filtration systems and related consumables, consisting of doctor systems and holders, doctor blades, shower and fabric-conditioning systems, formation systems, and water-filtration systems. The Industrial Processing segment develops, manufactures, and markets ring and rotary debarkers, stranders, chippers, logging machinery, industrial automation and control systems, recycling and approach flow systems, and virgin pulping process equipment for use in the packaging, tissue, wood products, and alternative fuel industries. The Material Handling segment offers conveying and vibratory equipment, and balers and related equipment; and manufactures and sells biodegradable absorbent granules for carriers in as carriers in agricultural, home lawn and garden, professional lawn, turf, and ornamental applications, as well as for oil and grease absorption. The company was formerly known as Thermo Fibertek Inc. and changed its name to Kadant Inc. in July 2001. Kadant Inc. was incorporated in 1991 and is headquartered in Westford, Massachusetts.",
    "ceo": "Mr. Jeffrey L. Powell",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "3100",
    "phone": "978 776 2000",
    "address": "One Technology Park Drive",
    "city": "Westford",
    "state": "MA",
    "zip": "01886",
    "dcfDiff": 3.91098,
    "dcf": 196.649,
    "image": "https://financialmodelingprep.com/image-stock/KAI.png",
    "ipoDate": "1992-11-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]