[
  {
    "symbol": "KB",
    "price": 36.39,
    "beta": 0.74726,
    "volAvg": 229909,
    "mktCap": 14178780678,
    "lastDiv": 1.85,
    "range": "30.14-48.28",
    "changes": -0.43,
    "companyName": "KB Financial Group Inc.",
    "currency": "USD",
    "cik": "0001445930",
    "isin": "US48241A1051",
    "cusip": "48241A105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.kbfg.com",
    "description": "KB Financial Group Inc. provides a range of banking and related financial services to consumers and corporations in South Korea and internationally. The company operates through Corporate Banking, Retail Banking, Other Banking Services, Securities Business, Non-life Insurance Business, Credit Card Business, and Life Insurance Business segments. It offers loans, deposit products, and other related financial products and services to large, small, and medium-sized enterprises, as well as small and home office, and individuals and households; investment banking, and brokerage and supporting services; life insurance products; non-life insurance products; and credit sale, cash service, card loan, and other supporting services. The company also engages in securities and derivatives trading, funding, and other supporting activities. In addition, it offers foreign exchange transaction; financial investment; credit card and installment financing; financial leasing; real estate trust management; capital investment; collection of receivables or credit investigation; software advisory, development, and supply; investment advisory; claim; management; savings banking; information and communication; and general advisory services. The company was incorporated in 2008 and is headquartered in Seoul, South Korea.",
    "ceo": "Dr. Jong-Kyoo  Yoon Ph.D.",
    "sector": "Financial Services",
    "country": "KR",
    "fullTimeEmployees": "25428",
    "phone": "82 2 2073 7114",
    "address": "26, Gukjegeumyung-ro 8-gil",
    "city": "Seoul",
    "state": null,
    "zip": "07331",
    "dcfDiff": 77789.3,
    "dcf": 77836.3,
    "image": "https://financialmodelingprep.com/image-stock/KB.png",
    "ipoDate": "2001-11-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]