[
  {
    "symbol": "KBCSY",
    "price": 33.73,
    "beta": 1.189655,
    "volAvg": 82395,
    "mktCap": 28142254740,
    "lastDiv": 2.15,
    "range": "22.72-38.54",
    "changes": -0.3575,
    "companyName": "KBC Group NV",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": "48241F104",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.kbc.com",
    "description": "KBC Group NV, together with its subsidiaries, provides integrated bank-insurance services primarily for retail, private banking, small and medium sized enterprises, and mid-cap clients. The company offers demand deposits and savings accounts; home and mortgage loans; consumer finance and SME funding services; credit, investment fund and asset management, and life and non-life insurance; and cash management, payments, trade finance, lease, money market, capital market products, and stockbroking services. It also provides Internet and mobile banking services. As of December 31, 2021, it operated 439 bank branches and 310 insurance agencies in Belgium; 208 bank branches in the Czech Republic; 123 bank branches in Slovakia; 198 bank branches in Hungary; 168 bank branches in Bulgaria; and 12 bank branches in Ireland. KBC Group NV serves customers through agents, brokers, and various electronic channels. The company was formerly known as KBC Bank and Insurance Holding Company NV and changed its name to KBC Group NV in March 2005. KBC Group NV was incorporated in 1935 and is headquartered in Brussels, Belgium.",
    "ceo": "Mr. Johan  Thijs",
    "sector": "Financial Services",
    "country": "BE",
    "fullTimeEmployees": "35235",
    "phone": "32 7 835 31 37",
    "address": "Havenlaan 2",
    "city": "Brussels",
    "state": null,
    "zip": "1080",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/KBCSY.png",
    "ipoDate": "2010-07-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]