[
  {
    "symbol": "KBR",
    "price": 63.4,
    "beta": 1.136267,
    "volAvg": 1369870,
    "mktCap": 8604774800,
    "lastDiv": 0.54,
    "range": "41.96-65.62",
    "changes": -0.81,
    "companyName": "KBR, Inc.",
    "currency": "USD",
    "cik": "0001357615",
    "isin": "US48242W1062",
    "cusip": "48242W106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Engineering & Construction",
    "website": "https://www.kbr.com",
    "description": "KBR, Inc. provides scientific, technology, and engineering solutions to governments and commercial customers worldwide. The company operates through Government Solutions and Sustainable Technology Solutions segments. The Government Solutions segment offers life-cycle support solutions to defense, intelligence, space, aviation, and other programs and missions for military and other government agencies in the United States, the United Kingdom, and Australia. Its services cover research and development, advanced prototyping, acquisition support, systems engineering, cyber analytics, space domain awareness, test and evaluation, systems integration and program management, global supply chain management, and operations readiness and support, as well as command, control, communications, computers, intelligence, surveillance, and reconnaissance services. This segment also provides various professional advisory services to deliver high-end systems engineering, systems assurance, and technology to customers across the defense, energy, and critical infrastructure sectors. The Sustainable Technology Solutions segment holds a portfolio of approximately 70 proprietary process technologies for ammonia/syngas/fertilizers, chemical/petrochemicals, clean refining, and circular process/circular economy solutions. This segment also includes advisory and consulting practices that focuses on energy transition and net-zero carbon emission consulting; and provides engineering, design, and professional services, as well as industrial solutions through KBR INSITE, a proprietary, digital, and cloud-based operations and maintenance platform that identifies opportunities for clients to achieve sustainable improvements in production, reliability, environment impact, energy efficiency, and profitability. KBR, Inc. was founded in 1998 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Stuart J. B. Bradie",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "32000",
    "phone": "713 753 2000",
    "address": "601 Jefferson Street",
    "city": "Houston",
    "state": "TX",
    "zip": "77002",
    "dcfDiff": 3.21172,
    "dcf": 53.1917,
    "image": "https://financialmodelingprep.com/image-stock/KBR.png",
    "ipoDate": "2006-11-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]