[
  {
    "symbol": "KCDMY",
    "price": 11.39,
    "beta": 0.231849,
    "volAvg": 14130,
    "mktCap": 7005145958,
    "lastDiv": 0.44,
    "range": "6.05-11.75",
    "changes": -0.05,
    "companyName": "Kimberly-Clark de México, S. A. B. de C. V.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Household & Personal Products",
    "website": "https://www.kimberly-clark.com.mx",
    "description": "Kimberly-Clark de México, S. A. B. de C. V., together with its subsidiaries, manufactures and commercializes disposable products for daily use by consumers in Mexico. The company offers diapers, pull-up training pants, swim diapers, wet wipes, shampoos, cream and bar soaps, and feeding products for babies; beauty products, including bar soaps, liquid hand soaps, foaming liquid soaps, liquid body washes, micellar water, and makeup removing wipes; and underwear, protectors, feminine pads, and prefolded products for adults. It also provides toilet paper, napkins, facial tissues, and paper towels for home; feminine pads, panty liners, tampons, and intimate wipes for women; and dispensers, jumbo roll toilet papers, paper towels, hand towels, anti-bacterial gel, disinfecting spray, facemasks, and industrial cleaning cloths for professional use. The company offers its products primarily under the Huggies, KleenBebe, Pull-Ups, Evenflo, Kleenex, Kotex, Depend, Cottonelle, Pétalo, Suavel, Vogue, Sanitas, Marli y Kimlark, Jabón Escudo Antibacterial, and Jabones Kleenex brands. The company also exports its products. Kimberly-Clark de México, S. A. B. de C. V. was founded in 1925 and is based in Mexico City, Mexico.",
    "ceo": "Attorney Pablo Roberto  Gonzalez Guajardo",
    "sector": "Consumer Defensive",
    "country": "MX",
    "fullTimeEmployees": "9877",
    "phone": "52 55 52 82 73 00",
    "address": "8 Jaime Balmes street",
    "city": "Mexico City",
    "state": "DF",
    "zip": "11510",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/KCDMY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]