[
  {
    "symbol": "KDDIY",
    "price": 15.72,
    "beta": 0.126819,
    "volAvg": 104527,
    "mktCap": 67819852800,
    "lastDiv": 0.49,
    "range": "13.62-16.67",
    "changes": 0.31,
    "companyName": "KDDI Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US48667L1061",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.kddi.com",
    "description": "KDDI Corporation provides telecommunications services in Japan and internationally. It operates in two segments, Personal Services and Business Services. The Personal Services segment offers smartphone, mobile phone, and other mobile communication services, as well as fixed-line services under the au Hikari brand; MVNO services; mobile services under the au brand; and voice communications, data transmission, FTTH services, and CATV services. It also provides smartphone-centric payment, financial, and other services through au PAY gateway; au HOME, an IoT service that watches over pets using sensors and cameras; au Denki to conserve energy usage; AEON, an English conversation school. The Business Services segment offers data center services to corporate customers under the TELEHOUSE brand; and various solutions for network and cloud services, smartphones, and other devices. It is also involved in the provision of broadcasting, wireless broadband, mail order, IT support, call center, and temporary personnel services; and design, construction, maintenance, and operation support for communication equipment and submarine cable. The company was founded in 1953 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Makoto  Takahashi",
    "sector": "Communication Services",
    "country": "JP",
    "fullTimeEmployees": "48829",
    "phone": "81 3 3347 0077",
    "address": "2-3-2",
    "city": "Tokyo",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/KDDIY.png",
    "ipoDate": "2008-12-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]