[
  {
    "symbol": "KDP",
    "price": 30.9,
    "beta": 0.575384,
    "volAvg": 9147650,
    "mktCap": 43376801011,
    "lastDiv": 0.8,
    "range": "30.7-41.31",
    "changes": -0.35,
    "companyName": "Keurig Dr Pepper Inc.",
    "currency": "USD",
    "cik": "0001418135",
    "isin": "US49271V1008",
    "cusip": "49271V100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Beverages—Non-Alcoholic",
    "website": "https://www.keurigdrpepper.com",
    "description": "Keurig Dr Pepper Inc. operates as a beverage company in the United States and internationally. It operates through Coffee Systems, Packaged Beverages, Beverage Concentrates, and Latin America Beverages segments. The Coffee Systems segment manufactures and distributes various finished goods related to its coffee systems, K-Cup pods, and brewers, as well as specialty coffee. This segment sells its brewers through third-party distributors and retail partners, as well as through its website at keurig.com. The Packaged Beverages segment engages in the manufacture and distribution of packaged beverages of its brands; contract manufacturing of various private label and emerging brand beverages; and distribution of packaged beverages for its partner brands. The Beverage Concentrates segment manufactures and sells beverage concentrates primarily under the Dr Pepper, Canada Dry, A&W, 7UP, Sunkist, Squirt, Big Red, RC Cola, Vernors, Snapple, Mott's, Bai, Hawaiian Punch, Clamato, Yoo-Hoo, Core, ReaLemon, evian, Vita Coco, and Mr and Mrs T mixers brands. This segment also manufactures beverage concentrates into syrup. The Latin America Beverages segment manufactures and distributes carbonated mineral water, flavored carbonated soft drinks, bottled water, and vegetable juice products under the Peñafiel, Clamato, Squirt, Dr Pepper, Crush, and Aguafiel brands. The company serves retailers, bottlers and distributors, restaurants, hotel chains, office coffee distributors, and end-use consumers. Keurig Dr Pepper Inc. was founded in 1981 and is headquartered in Burlington, Massachusetts.",
    "ceo": "Mr. Robert J. Gamgort",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "28000",
    "phone": "781 418 7000",
    "address": "53 South Avenue",
    "city": "Burlington",
    "state": "MA",
    "zip": "01803",
    "dcfDiff": 3.69709,
    "dcf": 38.3971,
    "image": "https://financialmodelingprep.com/image-stock/KDP.png",
    "ipoDate": "2008-05-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]