[
  {
    "symbol": "KEP",
    "price": 7.5,
    "beta": 0.745547,
    "volAvg": 218179,
    "mktCap": 9629474880,
    "lastDiv": 2.963,
    "range": "5.76-8.85",
    "changes": -0.25,
    "companyName": "Korea Electric Power Corporation",
    "currency": "USD",
    "cik": "0000887225",
    "isin": "US5006311063",
    "cusip": "500631106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://home.kepco.co.kr",
    "description": "Korea Electric Power Corporation, an integrated electric utility company, generates, transmits, and distributes electricity in South Korea and internationally. The company operates through Transmission and Distribution, Nuclear Power Generation, Thermal Power Generation, and Others segments. It generates power from nuclear, coal, oil, liquefied natural gas, internal combustion, combined-cycle, integrated gasification combined cycle, hydro, wind, solar, fuel cell, biogas, and other sources. As of December 31, 2021, the company had a total of 763 generation units, including nuclear, thermal, hydroelectric, and internal combustion units with an installed generation capacity of 82,459 megawatts. Its transmission system consisted of 34,923 circuit kilometers of lines of 765 kilovolts and others, including high-voltage direct current lines, as well as 892 substations with an installed transformer capacity of 344,286 megavolt-amperes; and distribution system included 132,376 megavolt-amperes of transformer capacity and 9,940,440 units of support with a total line length of 532,348 circuit kilometers. The company provides electricity to residential, commercial, educational, industrial, agricultural, street lighting, and overnight power usage. It also offers utility plant maintenance, resources development, electric power information technology, facility maintenance and service, electric meter reading, security, information, and communication line leasing services, as well as sells nuclear fuel. Korea Electric Power Corporation was founded in 1961 and is headquartered in Naju-si, South Korea.",
    "ceo": "Mr. Jung  Bok Lee",
    "sector": "Utilities",
    "country": "KR",
    "fullTimeEmployees": "22586",
    "phone": "82 6 1345 4213",
    "address": "55 Jeollyeok-ro",
    "city": "Naju-Si",
    "state": null,
    "zip": "58322",
    "dcfDiff": 1.01,
    "dcf": 7.26,
    "image": "https://financialmodelingprep.com/image-stock/KEP.png",
    "ipoDate": "1994-10-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]