[
  {
    "symbol": "KEX",
    "price": 74.62,
    "beta": 1.266197,
    "volAvg": 324035,
    "mktCap": 4477200000,
    "lastDiv": 0.1,
    "range": "55.03-76.66",
    "changes": -0.45,
    "companyName": "Kirby Corporation",
    "currency": "USD",
    "cik": "0000056047",
    "isin": "US4972661064",
    "cusip": "497266106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Marine Shipping",
    "website": "https://kirbycorp.com",
    "description": "Kirby Corporation operates domestic tank barges in the United States. Its Marine Transportation segment provides marine transportation service and towing vessel transporting bulk liquid product, as well as operates tank barge throughout the Mississippi River System, on the Gulf Intracoastal Waterway, coastwise along three United States coasts, and in Alaska and Hawaii. It also transport petrochemical, black oil, refined petroleum product, and agricultural chemicals by tank barge; and operates offshore dry-bulk barge and tugboat unit that are engaged in the offshore transportation of dry-bulk cargo in the United States coastal trade. As of December 31, 2021, it owned and operated 1,025 inland tank barge, approximately 255 inland towboat, 31 coastal tank barge, 29 coastal tugboat, 4 offshore dry-bulk cargo barge, 4 offshore tugboat, and 1 docking tugboat. Its Distribution and Services segment sells after-market service and genuine replacement part for engine, transmission, reduction gear, electric motor, drive, and control, electrical distribution and control system, energy storage battery system, and related oilfield service equipment; rebuild component parts or diesel engine, transmission and reduction gear, and related equipment used in oilfield service, marine, power generation, on-highway, and other industrial applications; rents generator, industrial compressor, high capacity lift truck, and refrigeration trailer; and manufactures and remanufactures oilfield service equipment, including pressure pumping unit, as well as manufacturers electric power generation equipment, specialized electrical distribution and control equipment, and high capacity energy storage/battery systems for oilfield customer. It serves to various companies and the United States government. The company was formerly known as Kirby Exploration Company, Inc. and changed its name to Kirby Corporation in 1990. Kirby Corporation was founded in 1921 and is headquartered in Houston, Texas.",
    "ceo": "Mr. David W. Grzebinski C.F.A.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5200",
    "phone": "713 435 1000",
    "address": "55 Waugh Drive",
    "city": "Houston",
    "state": "TX",
    "zip": "77007",
    "dcfDiff": 1.4697,
    "dcf": 67.6897,
    "image": "https://financialmodelingprep.com/image-stock/KEX.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]