[
  {
    "symbol": "KEYS",
    "price": 162.95,
    "beta": 1.067253,
    "volAvg": 1165964,
    "mktCap": 29065065600,
    "lastDiv": 0,
    "range": "133.34-189.45",
    "changes": 0.39,
    "companyName": "Keysight Technologies, Inc.",
    "currency": "USD",
    "cik": "0001601046",
    "isin": "US49338L1035",
    "cusip": "49338L103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.keysight.com",
    "description": "Keysight Technologies, Inc. provides electronic design and test solutions to commercial communications, networking, aerospace, defense and government, automotive, energy, semiconductor, electronic, and education industries in the Americas, Europe, and the Asia Pacific. Its Communications Solutions Group segment provides electronic design automation (EDA) software; radio frequency and microwave test solutions, and related software; hardware and virtual network test platforms and software applications, including data center, routing and switching, software defined networking, security, and encryption; oscilloscopes, logic and serial protocol analyzers, logic-signal sources, arbitrary waveform generators, and bit error rate testers; and optical modulation analyzers, optical component analyzers, optical power meters, and optical laser source solutions, as well as resells refurbished used Keysight equipment. The company's Electronic Industrial Solutions Group segment offers design tools; design verification tools; and digital multimeters, function generators, frequency counters, data acquisition systems, audio analyzers, LCR meters, thermal imagers, source measure units, ultra-high precision device current analyzers, and test executive software platforms, as well as various power supplies comprising AC/DC modular supplies and electronically programmable loads. This segment also provides printed-circuit-board-assembly testers, integrated circuit parametric testers, and sub-nano-meter positioning sub-assemblies; and test and measurement products and software. The company offers product support, technical support, and training and consulting services. It sells its products through direct sales force, distributors, resellers, and manufacturer's representatives. Keysight Technologies, Inc. was founded in 1939 and is headquartered in Santa Rosa, California.",
    "ceo": "Mr. Satish C. Dhanasekaran",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "15000",
    "phone": "800 829 4444",
    "address": "1400 Fountaingrove Parkway",
    "city": "Santa Rosa",
    "state": "CA",
    "zip": "95403-1738",
    "dcfDiff": 5.65326,
    "dcf": 183.103,
    "image": "https://financialmodelingprep.com/image-stock/KEYS.png",
    "ipoDate": "2014-10-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]