[
  {
    "symbol": "KFY",
    "price": 48.25,
    "beta": 1.500352,
    "volAvg": 301780,
    "mktCap": 2528739075,
    "lastDiv": 0.6,
    "range": "44.69-66.65",
    "changes": -0.65,
    "companyName": "Korn Ferry",
    "currency": "USD",
    "cik": "0000056679",
    "isin": "US5006432000",
    "cusip": "500643200",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Staffing & Employment Services",
    "website": "https://www.kornferry.com",
    "description": "Korn Ferry, together with its subsidiaries, provides organizational consulting services worldwide. It operates through four segments: Consulting, Digital, Executive Search, and Recruitment Process Outsourcing (RPO) & Professional Search. The company provides executive search services to recruit board level, chief executive, other senior executive, and general management talent of organizations. It also offers organizational strategy, assessment and succession, leadership and professional development, and total reward services. In addition, the company provides RPO, business project, professional search, and outsource recruiting solutions. Further, the company offers tech-enabled solutions that identify structures, roles, capabilities, and behaviors to drive businesses. It serves public and private companies, and middle market and emerging growth companies, as well as government and non-profit organizations. The company was formerly known as Korn/Ferry International and changed its name to Korn Ferry in January 2019. Korn Ferry was founded in 1969 and is based in Los Angeles, California.",
    "ceo": "Mr. Gary D. Burnison",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "10779",
    "phone": "310 552 1834",
    "address": "1900 Avenue of the Stars",
    "city": "Los Angeles",
    "state": "CA",
    "zip": "90067",
    "dcfDiff": 17.8407,
    "dcf": 72.5507,
    "image": "https://financialmodelingprep.com/image-stock/KFY.png",
    "ipoDate": "1999-02-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]