[
  {
    "symbol": "KGDEY",
    "price": 124.34,
    "beta": 1.092337,
    "volAvg": 191,
    "mktCap": 4580672917,
    "lastDiv": 0,
    "range": "111.17-240.67",
    "changes": -8.82,
    "companyName": "Kingdee International Software Group Company Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Software—Application",
    "website": "https://www.kingdee.com",
    "description": "Kingdee International Software Group Company Limited, an investment holding company, engages in the enterprise resource planning business. The company operates through ERP Business and Others, Cloud Services Business, and Investment Properties Operating Business segments. The ERP Business and Others segment sells software and hardware products; and provides software solution consulting, maintenance, upgrade, and other supporting services, as well as software implementation services. The Cloud Services Business segment provides enterprise, finance, industry, and other cloud services. The Investment Properties Operating Business segment invests in properties. The company also designs, develops, manufactures, and sells software and hardware products; provides software-related and online financial services; and develops Internet and online pay technologies. It serves enterprises, government agencies, and other organizations worldwide. The company was founded in 1993 and is headquartered in Shenzhen, the People's Republic of China.",
    "ceo": "Mr. Shao Chun  Xu",
    "sector": "Technology",
    "country": "CN",
    "fullTimeEmployees": "12036",
    "phone": null,
    "address": "Kingdee Software Park",
    "city": "Shenzhen",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/KGDEY.png",
    "ipoDate": "2021-01-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]