[
  {
    "symbol": "KHC",
    "price": 35.02,
    "beta": 0.688028,
    "volAvg": 7047661,
    "mktCap": 42977942559,
    "lastDiv": 1.6,
    "range": "32.73-42.8",
    "changes": -0.56,
    "companyName": "The Kraft Heinz Company",
    "currency": "USD",
    "cik": "0001637459",
    "isin": "US5007541064",
    "cusip": "500754106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Packaged Foods",
    "website": "https://www.kraftheinzcompany.com",
    "description": "The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in the United States, Canada, the United Kingdom, and internationally. Its products include condiments and sauces, cheese and dairy products, meals, meats, refreshment beverages, coffee, and other grocery products. The company also offers dressings, healthy snacks, and other categories; and spices and other seasonings. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative and independent grocery accounts, convenience stores, drug stores, value stores, bakeries, pharmacies, mass merchants, club stores, and foodservice distributors and institutions, including hotels, restaurants, hospitals, health care facilities, and government agencies; and online through various e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is headquartered in Pittsburgh, Pennsylvania.",
    "ceo": "Mr. Miguel  Patricio",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "37000",
    "phone": "412 456 5700",
    "address": "One PPG Place",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15222",
    "dcfDiff": 1.53722,
    "dcf": 41.2272,
    "image": "https://financialmodelingprep.com/image-stock/KHC.png",
    "ipoDate": "2015-07-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]