[
  {
    "symbol": "KLAC",
    "price": 474.43,
    "beta": 1.359154,
    "volAvg": 1040272,
    "mktCap": 65091325365,
    "lastDiv": 5.2,
    "range": "250.2-482.2",
    "changes": -2.5,
    "companyName": "KLA Corporation",
    "currency": "USD",
    "cik": "0000319201",
    "isin": "US4824801009",
    "cusip": "482480100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductor Equipment & Materials",
    "website": "https://www.kla.com",
    "description": "KLA Corporation designs, manufactures, and markets process control, process-enabling, and yield management solutions for the semiconductor and related electronics industries worldwide. It operates through four segments: Semiconductor Process Control; Specialty Semiconductor Process; PCB, Display and Component Inspection; and Other. The company offers integrated circuit (IC) manufacturing products that comprises wafer inspection and review, and metrology; wafer and substrate defect inspection and metrology; reticle defect inspection and metrology; chemical/materials quality analysis; in situ process management and wafer handling diagnostics for IC and original equipment manufacturer (OEM) manufacturing; software products to provide run-time process control, defect excursion identification, process corrections, and defect classification; and refurbished and remanufactured products. It also provides specialty semiconductor manufacturing, benchtop metrology, surface characterization, and electrical property measurement services for general purpose/ lab applications; etch, plasma dicing, deposition, and other wafer processing technologies and solutions for the semiconductor and microelectronics industry. In addition, the company offers direct imaging, inspection, optical shaping, additive printing, and computer-aided manufacturing and engineering solutions for the PCB market; inspection and electrical testing systems to identify and classify defects, as well as systems to repair defects for the display market; and inspection and metrology systems for quality control and yield improvement in advanced and traditional semiconductor packaging markets. The company was formerly known as KLA-Tencor Corporation and changed its name to KLA Corporation in July 2019. KLA Corporation was incorporated in 1975 and is headquartered in Milpitas, California.",
    "ceo": "Mr. Richard P. Wallace",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "14000",
    "phone": "408 875 3000",
    "address": "One Technology Drive",
    "city": "Milpitas",
    "state": "CA",
    "zip": "95035",
    "dcfDiff": 18.0305,
    "dcf": 381.34,
    "image": "https://financialmodelingprep.com/image-stock/KLAC.png",
    "ipoDate": "1980-10-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]