[
  {
    "symbol": "KLIC",
    "price": 58.01,
    "beta": 1.401408,
    "volAvg": 452427,
    "mktCap": 3282362427,
    "lastDiv": 0.76,
    "range": "35.95-59.41",
    "changes": -0.54,
    "companyName": "Kulicke and Soffa Industries, Inc.",
    "currency": "USD",
    "cik": "0000056978",
    "isin": "US5012421013",
    "cusip": "501242101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductor Equipment & Materials",
    "website": "https://www.kns.com",
    "description": "Kulicke and Soffa Industries, Inc. designs, manufactures, and sells capital equipment and tools used to assemble semiconductor devices. It operates through two segments, Capital Equipment, and Aftermarket Products and Services (APS). The company manufactures and sells advanced displays; die-transfer, flip-chip, and TCB advanced packaging products; ball bonder, die-attach, electronics assembly, lithography, wafer-level bonder, and wedge bonder products; consumables, such as capillaries, dicing blades, and wedge bonds; and auto offline programming, KNet PLUS, and new product introduction/manufacturing execution system software products. It also services, maintains, repairs, and upgrades equipment. The company serves semiconductor device manufacturers, integrated device manufacturers, outsourced semiconductor assembly and test providers, other electronics manufacturers, industrial manufacturers, and automotive electronics suppliers primarily in the United States and the Asia/Pacific region. Kulicke and Soffa Industries, Inc. was founded in 1951 and is headquartered in Singapore.",
    "ceo": "Dr. Fusen Ernie  Chen Ph.D.",
    "sector": "Technology",
    "country": "SG",
    "fullTimeEmployees": "2944",
    "phone": "65 6880 9600",
    "address": "No. 01-01, 23A Serangoon North Avenue 5",
    "city": "Singapore",
    "state": null,
    "zip": "554369",
    "dcfDiff": 0.251846,
    "dcf": 51.9118,
    "image": "https://financialmodelingprep.com/image-stock/KLIC.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]