[
  {
    "symbol": "KLYCY",
    "price": 7.6,
    "beta": 0.830268,
    "volAvg": 1888,
    "mktCap": 6580688000,
    "lastDiv": 0.37,
    "range": "5.995-9.733",
    "changes": 0.21,
    "companyName": "Kunlun Energy Company Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Oil & Gas Refining & Marketing",
    "website": "https://www.kunlun.com.hk",
    "description": "Kunlun Energy Company Limited, an investment holding company, engages in the exploration, development, production, and sale of crude oil and natural gas. It operates through four segments: Natural Gas Sales; Sales of Liquefied Petroleum Gas (LPG); Liquefied Natural Gas (LNG) Processing and Terminal; and Exploration and Production. The company is also involved in the processing, unloading, storing, gasification, and entrucking of LNG; trading, distribution, and retail sale of various natural gas products; and wholesale and retail of various LPG products. It operates in the People's Republic of China, the Republic of Kazakhstan, the Sultanate of Oman, the Republic of Peru, the Kingdom of Thailand, and the Republic of Azerbaijan. The company was formerly known as CNPC (Hong Kong) Limited and changed its name to Kunlun Energy Company Limited in March 2010. The company was incorporated in 1991 and is based in Hong Kong, Hong Kong. Kunlun Energy Company Limited is a subsidiary of PetroChina Hong Kong Limited.",
    "ceo": "Mr. Zhijia  Qian",
    "sector": "Energy",
    "country": "HK",
    "fullTimeEmployees": "30916",
    "phone": "852 2522 2282",
    "address": "118 Connaught Road West",
    "city": "Hong Kong",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/KLYCY.png",
    "ipoDate": "2012-08-15",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]