[
  {
    "symbol": "KMB",
    "price": 136.96,
    "beta": 0.42676,
    "volAvg": 1689437,
    "mktCap": 46207700664,
    "lastDiv": 4.72,
    "range": "108.74-147.87",
    "changes": -1.31,
    "companyName": "Kimberly-Clark Corporation",
    "currency": "USD",
    "cik": "0000055785",
    "isin": "US4943681035",
    "cusip": "494368103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Household & Personal Products",
    "website": "https://www.kimberly-clark.com",
    "description": "Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care and consumer tissue products worldwide. It operates through three segments: Personal Care, Consumer Tissue, and K-C Professional. The Personal Care segment offers disposable diapers, swimpants, training and youth pants, baby wipes, feminine and incontinence care products, and other related products under the Huggies, Pull-Ups, Little Swimmers, GoodNites, DryNites, Sweety, Kotex, U by Kotex, Intimus, Depend, Plenitud, Softex, Poise, and other brand names. The Consumer Tissue segment provides facial and bathroom tissues, paper towels, napkins, and related products under the Kleenex, Scott, Cottonelle, Viva, Andrex, Scottex, Neve, and other brand names. The K-C Professional segment offers wipers, tissues, towels, apparel, soaps, and sanitizers under the Kleenex, Scott, WypAll, Kimtech, and KleenGuard brands. The company sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and away-from-home use products directly to manufacturing, lodging, office building, food service, and public facilities, as well as through distributors and e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Michael D. Hsu",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "44000",
    "phone": "972-281-1200",
    "address": "PO Box 619100",
    "city": "Dallas",
    "state": "TX",
    "zip": "75261-9100",
    "dcfDiff": 5.35832,
    "dcf": 134.278,
    "image": "https://financialmodelingprep.com/image-stock/KMB.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]