[
  {
    "symbol": "KMI",
    "price": 17.01,
    "beta": 0.918661,
    "volAvg": 12635500,
    "mktCap": 38238819656,
    "lastDiv": 1.13,
    "range": "15.92-19.36",
    "changes": 0.21,
    "companyName": "Kinder Morgan, Inc.",
    "currency": "USD",
    "cik": "0001506307",
    "isin": "US49456B1017",
    "cusip": "49456B101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.kindermorgan.com",
    "description": "Kinder Morgan, Inc. operates as an energy infrastructure company in North America. The company operates through four segments: Natural Gas Pipelines, Products Pipelines, Terminals, and CO2. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and underground storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas liquefaction and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 83,000 miles of pipelines and 143 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1936 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Steven J. Kean",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "10525",
    "phone": "713 369 9000",
    "address": "1001 Louisiana Street",
    "city": "Houston",
    "state": "TX",
    "zip": "77002",
    "dcfDiff": 0.122867,
    "dcf": 18.7829,
    "image": "https://financialmodelingprep.com/image-stock/KMI.png",
    "ipoDate": "2011-02-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]