[
  {
    "symbol": "KMPR",
    "price": 48.2,
    "beta": 0.885915,
    "volAvg": 387509,
    "mktCap": 3084380660,
    "lastDiv": 1.24,
    "range": "40.65-68.15",
    "changes": -1.06,
    "companyName": "Kemper Corporation",
    "currency": "USD",
    "cik": "0000860748",
    "isin": "US4884011002",
    "cusip": "488401100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.kemper.com",
    "description": "Kemper Corporation, a diversified insurance holding company, provides property and casualty, and life and health insurance in the United States. The company operates through three segments: Specialty Property & Casualty Insurance, Preferred Property & Casualty Insurance, and Life & Health Insurance. It provides automobile, homeowners, renters, fire, umbrella, general liability, and various other property and casualty insurance to individuals, as well as commercial automobile insurance to businesses. The company also offers life insurance, including permanent and term insurance, as well as supplemental accident and health insurance products; and Medicare supplement insurance, fixed hospital indemnity, home health care, specified disease, and accident-only plans to individuals in rural, suburban, and urban areas. It distributes its products through independent agents and brokers. The company was formerly known as Unitrin, Inc. and changed its name to Kemper Corporation in August 2011. Kemper Corporation was incorporated in 1990 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Joseph Patrick Lacher Jr.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "9500",
    "phone": "312 661 4600",
    "address": "200 East Randolph Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60601",
    "dcfDiff": 0.03819,
    "dcf": 55.9182,
    "image": "https://financialmodelingprep.com/image-stock/KMPR.png",
    "ipoDate": "1990-04-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]