[
  {
    "symbol": "KMT",
    "price": 27.68,
    "beta": 1.88169,
    "volAvg": 799954,
    "mktCap": 2222023072,
    "lastDiv": 0.8,
    "range": "20.21-30.6",
    "changes": -0.52,
    "companyName": "Kennametal Inc.",
    "currency": "USD",
    "cik": "0000055242",
    "isin": "US4891701009",
    "cusip": "489170100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Tools & Accessories",
    "website": "https://www.kennametal.com",
    "description": "Kennametal Inc. engages in development and application of tungsten carbides, ceramics, and super-hard materials and solutions for use in metal cutting and extreme wear applications to enable customers work against corrosion and high temperatures conditions worldwide. The company operates through two segments, Metal Cutting and Infrastructure. It offers standard and custom products, including turning, milling, hole making, tooling systems, and services, as well as specialized wear components and metallurgical powders for manufacturers engaged in various industries, such as the manufacturers of transportation vehicles and components, machine tools, and light and heavy machinery; airframe and aerospace components; and energy-related components for the oil and gas industry, as well as power generation. The company also provides specified product design, selection, application, and support services; and standard and custom metal cutting solutions to aerospace, general engineering, energy, and transportation customers. In addition, it produces compacts, nozzles, frac seats, and custom components used in oil and gas, and petrochemical industries; rod blanks and abrasive water jet nozzles for general industries; earth cutting tools and systems used in underground mining, trenching and foundation drilling, and road milling; tungsten carbide powders for the oil and gas, aerospace, and process industries; and ceramics used by the packaging industry for metallization of films and papers. It provides its products under the Kennametal, WIDIA, WIDIA Hanita, and WIDIA GTD brands through its direct sales force; a network of independent and national distributors; integrated supplier channels; and through the Internet. The company was founded in 1938 and is based in Pittsburgh, Pennsylvania.",
    "ceo": "Mr. Christopher  Rossi",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "8600",
    "phone": "412 248 8000",
    "address": "525 William Penn Place",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15219",
    "dcfDiff": 0.566652,
    "dcf": 28.4667,
    "image": "https://financialmodelingprep.com/image-stock/KMT.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]