[
  {
    "symbol": "KMTUY",
    "price": 27.1,
    "beta": 1.200766,
    "volAvg": 111537,
    "mktCap": 25625596966,
    "lastDiv": 1,
    "range": "17.11-27.93",
    "changes": 0.53,
    "companyName": "Komatsu Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US5004584018",
    "cusip": "500458401",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "website": "https://www.komatsu.jp",
    "description": "Komatsu Ltd. manufactures and sells construction, mining, and utility equipment; and forest and industrial machinery worldwide. The company operates through three segments: Construction, Mining and Utility Equipment; Retail Finance; and Industrial Machinery and Others. It offers construction and mining equipment, including rope shovels, continuous miners, hydraulic excavators, wheel loaders, bulldozers, motor graders, dump trucks, mini excavators, utility equipment, and other mining equipment. The company also provides forklift trucks; forestry equipment, including harvesters, forwarders, and feller bunchers; demolition, waste, and recycling equipment, such as mobile crushers, hydraulic excavators, wheel loaders, and mini shovels; and tunnel-boring machines, pipe layers, towing tractors, and engines. In addition, it offers metal forging and stamping presses, including large press system; sheet-metal machines, such as fiber laser cutting machine; machine tools, which comprise transfer machines; logistics equipment; lithography light source and temperature-control equipment for semiconductor manufacturing; battery manufacturing equipment; wire saws; and thermoelectric modules. Further, the company provides retail financing for construction and mining equipment; construction machinery rental services; remanufactured products; other support services; and purchases and sells used equipment. Komatsu Ltd. was founded in 1884 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Hiroyuki  Ogawa",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "64343",
    "phone": "81 3 5561 4711",
    "address": "2-3-6 Akasaka",
    "city": "Tokyo",
    "state": null,
    "zip": "107-8414",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/KMTUY.png",
    "ipoDate": "2007-07-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]