[
  {
    "symbol": "KNBWY",
    "price": 14.94,
    "beta": 0.467049,
    "volAvg": 25125,
    "mktCap": 12128202121,
    "lastDiv": 0.5,
    "range": "14.21-17.17",
    "changes": 0.0718,
    "companyName": "Kirin Holdings Company, Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": "497350207",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Beverages—Brewers",
    "website": "https://www.kirinholdings.co.jp",
    "description": "Kirin Holdings Company, Limited produces and sells alcoholic beverages, soft drinks, pharmaceuticals, and other related products in Japan and internationally. It operates through four segments: Japan Beer and Spirits Businesses, Japan Non-Alcoholic Beverages Business, Oceania Integrated Beverages Business, and Pharmaceuticals Business. The company's products include beer, happo-shu, wine, whiskey, spirits, soft drinks, dairy products, fruit juices, and other products. It also produces and sells pharmaceutical products, biochemical products, and other products. In addition, the company engages in the factories and theme park businesses; management and operation of a chain of Kirin City beer pubs; and manufacture and sale of amino acids and nucleic acids for pharmaceutical and industrial use bulk pharmaceuticals, as well as margarine, jams, and honey. Further, it is involved in the manufacture and sale of Coca-Cola products and other soft drinks, and sake and other food products; as well as manufacture and supply of Four Roses bourbon; and acts as an insurance agent. The company was formerly known as Kirin Brewery Company, Limited and changed its name to Kirin Holdings Company, Limited in July 2007. Kirin Holdings Company, Limited was founded in 1885 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Yoshinori  Isozaki",
    "sector": "Consumer Defensive",
    "country": "JP",
    "fullTimeEmployees": "30538",
    "phone": "81 3 6837 7000",
    "address": "Nakano Central Park South",
    "city": "Tokyo",
    "state": null,
    "zip": "164-0001",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/KNBWY.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]