[
  {
    "symbol": "KNX",
    "price": 55.39,
    "beta": 1.15845,
    "volAvg": 2002838,
    "mktCap": 8919451700,
    "lastDiv": 0.56,
    "range": "44.89-64.35",
    "changes": -0.17,
    "companyName": "Knight-Swift Transportation Holdings Inc.",
    "currency": "USD",
    "cik": "0001492691",
    "isin": "US4990491049",
    "cusip": "499049104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Trucking",
    "website": "https://knight-swift.com",
    "description": "Knight-Swift Transportation Holdings Inc., together with its subsidiaries, provides truckload transportation services in the United States, Mexico, and Canada. The company operates through four segments: Trucking, Logistics, Less-than-truckload (LTL), and Intermodal. Its trucking services include irregular route, dedicated, refrigerated, flatbed, expedited, dry van, drayage, and cross-border transportation of various products, goods, and materials. The company also provides logistics and intermodal services, such as brokerage, intermodal, and certain logistics; freight management; and non-trucking services. In addition, it offers various support services, including repair and maintenance shop services, warranty, insurance, and equipment leasing; and trailer parts manufacturing and warehousing services, as well as engages in the driving academy activities. In addition, it offers regional direct services to customers national transportation needs by utilizing carriers for coverage areas outside networks. The company operates a total of 18,019 tractors, which comprises 16,166 company tractors and 1,853 independent contractor tractors, as well as 67,606 trailers; 2,735 tractors and 7,413 trailers; and 597 tractors and 10,847 intermodal containers. It serves retail, food and beverage, consumer products, paper products, transportation and logistics, housing and building, automotive, and manufacturing industries. Knight-Swift Transportation Holdings Inc. was incorporated in 1989 and is headquartered in Phoenix, Arizona.",
    "ceo": "Mr. David A. Jackson",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "28100",
    "phone": "602 269 2000",
    "address": "2002 West Wahalla Lane",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85027",
    "dcfDiff": 3.53964,
    "dcf": 55.5804,
    "image": "https://financialmodelingprep.com/image-stock/KNX.png",
    "ipoDate": "1994-10-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]