[
  {
    "symbol": "KNYJY",
    "price": 26.28,
    "beta": 0.642528,
    "volAvg": 39335,
    "mktCap": 27185872020,
    "lastDiv": 0.92,
    "range": "17.72-29.19",
    "changes": -0.24,
    "companyName": "KONE Oyj",
    "currency": "USD",
    "cik": null,
    "isin": "US50048H1014",
    "cusip": "50048H101",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.kone.com",
    "description": "KONE Oyj, together with its subsidiaries, engages in the elevator and escalator business worldwide. It offers elevators, escalators, and automatic building doors. The company also provides maintenance services; modernization solutions; and various residential solutions. In addition, it offers KONE Office Flow, a connected solution that allows for personalized user experiences and touch-free access; health and well-being solutions for elevators, escalators, and doors; KONE Residential Flow, a smarter building solution for the movement of people, goods, and information; KONE Access, an access control system, which is integrated with elevator system and building doors; KONE Destination, a destination control system that reduce waiting and travel times; KONE infotainment, a communication channel for building tenants and visitors; and monitoring solutions that enable real-time inspection of elevators and escalators. Further, the company provides people flow planning and consulting services; and solutions for special buildings and large projects. KONE Oyj was founded in 1908 and is based in Espoo, Finland.",
    "ceo": "Mr. Henrik  Ehrnrooth M.Sc. (Econ)",
    "sector": "Industrials",
    "country": "FI",
    "fullTimeEmployees": "62976",
    "phone": "358 204 751",
    "address": "Keilasatama 3",
    "city": "Espoo",
    "state": null,
    "zip": "02150",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/KNYJY.png",
    "ipoDate": "2012-08-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]