[
  {
    "symbol": "KO",
    "price": 60.52,
    "beta": 0.551056,
    "volAvg": 13132303,
    "mktCap": 261723571917,
    "lastDiv": 1.84,
    "range": "54.02-65.47",
    "changes": -0.57,
    "companyName": "The Coca-Cola Company",
    "currency": "USD",
    "cik": "0000021344",
    "isin": "US1912161007",
    "cusip": "191216100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Beverages—Non-Alcoholic",
    "website": "https://www.coca-colacompany.com",
    "description": "The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks; flavored and enhanced water, and sports drinks; juice, dairy, and plantbased beverages; tea and coffee; and energy drinks. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke/Coca-Cola Light, Coca-Cola Zero Sugar, Fanta, Fresca, Schweppes, Sprite, Thums Up, Aquarius, Ciel, dogadan, Dasani, glacéau smartwater, glacéau vitaminwater, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, Minute Maid Pulpy, Simply, Ayataka, BODYARMOR, Costa, FUZE TEA, Georgia, and Gold Peak brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. James Robert B. Quincey",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "82500",
    "phone": "404 676 2121",
    "address": "One Coca-Cola Plaza",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30313",
    "dcfDiff": 3.83011,
    "dcf": 64.3201,
    "image": "https://financialmodelingprep.com/image-stock/KO.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]