[
  {
    "symbol": "KR",
    "price": 47.17,
    "beta": 0.471478,
    "volAvg": 5432493,
    "mktCap": 33856078065,
    "lastDiv": 1.16,
    "range": "41.82-52.0",
    "changes": 0.4,
    "companyName": "The Kroger Co.",
    "currency": "USD",
    "cik": "0000056873",
    "isin": "US5010441013",
    "cusip": "501044101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Grocery Stores",
    "website": "https://www.thekrogerco.com",
    "description": "The Kroger Co. operates as a retailer in the United States. The company operates combination food and drug stores, multi-department stores, marketplace stores, and price impact warehouses. Its combination food and drug stores offer natural food and organic sections, pharmacies, general merchandise, pet centers, fresh seafood, and organic produce; and multi-department stores provide apparel, home fashion and furnishings, outdoor living, electronics, automotive products, and toys. The company's marketplace stores offer full-service grocery, pharmacy, health and beauty care, and perishable goods, as well as general merchandise, including apparel, home goods, and toys; and price impact warehouse stores provide grocery, and health and beauty care items, as well as meat, dairy, baked goods, and fresh produce items. It also manufactures and processes food products for sale in its supermarkets and online; and sells fuel through 1,613 fuel centers. As of January 29, 2022, the company operated 2,726 supermarkets under various banner names in 35 states and the District of Columbia. The Kroger Co. was founded in 1883 and is based in Cincinnati, Ohio.",
    "ceo": "Mr. William Rodney McMullen",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "500000",
    "phone": "513 762 4000",
    "address": "1014 Vine Street",
    "city": "Cincinnati",
    "state": "OH",
    "zip": "45202-1100",
    "dcfDiff": 5.33211,
    "dcf": 50.3821,
    "image": "https://financialmodelingprep.com/image-stock/KR.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]