[
  {
    "symbol": "KRC",
    "price": 30.09,
    "beta": 0.879577,
    "volAvg": 1270201,
    "mktCap": 3524170890,
    "lastDiv": 2.16,
    "range": "25.99-55.03",
    "changes": -0.96,
    "companyName": "Kilroy Realty Corporation",
    "currency": "USD",
    "cik": "0001025996",
    "isin": "US49427F1084",
    "cusip": "49427F108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "REIT—Office",
    "website": "https://www.kilroyrealty.com",
    "description": "Kilroy Realty Corporation (NYSE: KRC, the company, KRC) is a leading West Coast landlord and developer, with a major presence in San Diego, Greater Los Angeles, the San Francisco Bay Area, and the Pacific Northwest. The company has earned global recognition for sustainability, building operations, innovation and design. As pioneers and innovators in the creation of a more sustainable real estate industry, the company's approach to modern business environments helps drive creativity, productivity and employee retention for some of the world's leading technology, entertainment, life science and business services companies. KRC is a publicly traded real estate investment trust (REIT) and member of the S&P MidCap 400 Index with more than seven decades of experience developing, acquiring and managing office and mixed-use projects. As of September 30, 2020, KRC's stabilized portfolio totaled approximately 14.3 million square feet of primarily office and life science space that was 92.2% occupied and 95.5% leased. The company also had 808 residential units in Hollywood and San Diego, which had a quarterly average occupancy of 85.0% and 37.5%, respectively. In addition, KRC had seven in-process development projects with an estimated total investment of $1.9 billion, totaling approximately 2.3 million square feet of office and life science space. The office and life science space was 90% leased.",
    "ceo": "Mr. John B. Kilroy Jr.",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "259",
    "phone": "310-481-8400",
    "address": "12200 West Olympic Boulevard",
    "city": "Los Angeles",
    "state": "CA",
    "zip": "90064",
    "dcfDiff": 4.78367,
    "dcf": 45.5937,
    "image": "https://financialmodelingprep.com/image-stock/KRC.png",
    "ipoDate": "1997-01-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]