[
  {
    "symbol": "KRTX",
    "price": 221.14,
    "beta": 1.118069,
    "volAvg": 413272,
    "mktCap": 8280366160,
    "lastDiv": 0,
    "range": "116.59-278.253",
    "changes": 2.05,
    "companyName": "Karuna Therapeutics, Inc.",
    "currency": "USD",
    "cik": "0001771917",
    "isin": "US48576A1007",
    "cusip": "48576A100",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.karunatx.com",
    "description": "Karuna Therapeutics, Inc., a clinical-stage biopharmaceutical company, creates and delivers transformative medicines for people living with psychiatric and neurological conditions. Its lead product candidate is KarXT, an oral modulator of muscarinic receptors that is in Phase III clinical trial for the treatment of acute psychosis in patients with schizophrenia; and for the treatment of central nervous system disorders, such as negative and cognitive symptoms of schizophrenia and psychosis, as well as for the treatment of dementia-related psychosis. The company also focuses on developing other muscarinic-targeted drug candidates. Karuna Therapeutics, Inc. has a license agreement with Eli Lilly and Company, and Zai Lab (Shanghai) Co., Ltd; patent license agreement with PureTech Health LLC; and drug discovery partnership with Charles River Laboratories, as well as drug discovery collaboration with PsychoGenics, Inc. The company was formerly known as Karuna Pharmaceuticals, Inc. and changed its name to Karuna Therapeutics, Inc. in March 2019. Karuna Therapeutics, Inc. was incorporated in 2009 and is headquartered in Boston, Massachusetts.",
    "ceo": "Mr. William  Meury",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "210",
    "phone": "857 449 2244",
    "address": "99 High Street",
    "city": "Boston",
    "state": "MA",
    "zip": "02110",
    "dcfDiff": 36.0655,
    "dcf": 232.945,
    "image": "https://financialmodelingprep.com/image-stock/KRTX.png",
    "ipoDate": "2019-06-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]