[
  {
    "symbol": "KWHIY",
    "price": 9.87,
    "beta": 1.271647,
    "volAvg": 2919,
    "mktCap": 4142448791,
    "lastDiv": 0.15,
    "range": "5.96-10.36",
    "changes": 0.05,
    "companyName": "Kawasaki Heavy Industries, Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US4863592014",
    "cusip": "486359201",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Industrial Machinery",
    "website": "https://global.kawasaki.com",
    "description": "Kawasaki Heavy Industries, Ltd. engages in aerospace systems, energy solution and marine engineering, precision machinery and robot, rolling stock, and motorcycle and engine businesses in Japan and internationally. It manufactures aircraft for the Japan ministry of defense; helicopters; and helicopter engines and jet engines for commercial aircrafts. The company also manufactures railway cars; a range of rolling stocks, including Shinkansen, electric cars, passenger coaches, freight cars, locomotives, diesel locomotives, transit systems, and snow plows. In addition, it engages in the production and sale of energy-related machinery and systems, marine machinery and systems, industrial equipment, environmental equipment, ultralow temperature tanks, hydrogen-related structures, crushers, ships, other vessels, etc. Further, the company manufactures and supplies motorcycles, off-road four wheelers, watercrafts, general-purpose gasoline engines, etc. Additionally, it manufactures and sells hydraulic machinery used in construction and agricultural machinery, industrial machinery, and ships; pumps, motors, valves, and various hydraulic machinery, as well as assembles hydraulic systems; and industrial robots for use in welding, assembly, handling, painting, and palletization for various industries, including automotive and electronics industries. Kawasaki Heavy Industries, Ltd. was founded in 1878 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Yasuhiko  Hashimoto",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "36587",
    "phone": "81 3 3435 2111",
    "address": "1-14-5, Kaigan",
    "city": "Tokyo",
    "state": null,
    "zip": "105-8315",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/KWHIY.png",
    "ipoDate": "2010-04-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]