[
  {
    "symbol": "KWR",
    "price": 190.02,
    "beta": 1.424295,
    "volAvg": 97154,
    "mktCap": 3416711616,
    "lastDiv": 1.74,
    "range": "129.06-216.45",
    "changes": 0.62,
    "companyName": "Quaker Chemical Corporation",
    "currency": "USD",
    "cik": "0000081362",
    "isin": "US7473161070",
    "cusip": "747316107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.quakerhoughton.com",
    "description": "Quaker Chemical Corporation develops, produces, and markets various formulated chemical specialty products for a range of heavy industrial and manufacturing applications. The company operates through four segments: Americas; Europe, Middle East, and Africa; Asia/Pacific; and Global Specialty Businesses. It offers metal removal fluids, cleaning fluids, corrosion inhibitors, metal drawing and forming fluids, die cast mold releases, heat treatment and quenchants, metal forging fluids, hydraulic fluids, specialty greases, metal finishing fluids, offshore sub-sea energy control fluids, rolling lubricants, rod and wire drawing fluids, and surface treatment chemicals. The company also provides chemical management services. It serves steel, aluminum, automotive, aerospace, offshore, can, mining, and metalworking companies. The company was formerly known as Quaker Chemical Products Corporation and changed its name to Quaker Chemical Corporation in August 1962. Quaker Chemical Corporation was founded in 1918 and is headquartered in Conshohocken, Pennsylvania.",
    "ceo": "Mr. Andrew E. Tometich",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "4600",
    "phone": "610 832 4000",
    "address": "One Quaker Park",
    "city": "Conshohocken",
    "state": "PA",
    "zip": "19428-2380",
    "dcfDiff": 6.193,
    "dcf": 195.383,
    "image": "https://financialmodelingprep.com/image-stock/KWR.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]