[
  {
    "symbol": "KYOCY",
    "price": 54.055,
    "beta": 0.364367,
    "volAvg": 26185,
    "mktCap": 19401041783,
    "lastDiv": 1.39,
    "range": "44.0-59.05",
    "changes": 0.165,
    "companyName": "Kyocera Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US5015562037",
    "cusip": "501556203",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Consumer Electronics",
    "website": "https://global.kyocera.com",
    "description": "Kyocera Corporation develops, produces, and distributes products based on fine ceramic technologies in Japan, rest of Asia, Europe, the United States, and internationally. It operates through Core Components Business, Electronic Components Business, and Solutions Business segments. The company offers fine ceramic components; automotive components; optical components; and inorganic and organic ceramic packages, and boards for use in industrial machinery, general industrial, smartphones and communication infrastructures, and automotive-related markets. It also provides electronic components and devices comprising capacitors, crystal and SAW devices, connectors, sensing and control devices, power semiconductor and printing devices for the information and communications equipment, industrial equipment, and automotive markets. Further, the company offers smartphones, mobile phones, and communication modules for in-vehicle installation and Internet of Things market; printers, multifunctional products, commercial inkjet printers, document solutions, and supplies. In addition, it provides solar modules for commercial and residential uses; smart energy related products, including storage batteries and energy management systems; and medical devices, such as prosthetic joints and dental prosthetics, and jewelry and kitchen accessories, including ceramic knives. The company offers its products through sales personnel, sales companies, and third-party distributors. The company was formerly known as Kyoto Ceramic Kabushiki Kaisha and changed its name to Kyocera Corporation in 1982. Kyocera Corporation was incorporated in 1946 and is headquartered in Kyoto, Japan.",
    "ceo": "Mr. Hideo  Tanimoto",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "81209",
    "phone": "81 7 5604 3500",
    "address": "6, Takeda Tobadono-cho",
    "city": "Kyoto",
    "state": null,
    "zip": "612-8501",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/KYOCY.png",
    "ipoDate": "1980-03-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]