[
  {
    "symbol": "LANC",
    "price": 196.98,
    "beta": 0.228169,
    "volAvg": 154235,
    "mktCap": 5421283560,
    "lastDiv": 3.4,
    "range": "126.82-220.65",
    "changes": 0.48,
    "companyName": "Lancaster Colony Corporation",
    "currency": "USD",
    "cik": "0000057515",
    "isin": "US5138471033",
    "cusip": "513847103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Packaged Foods",
    "website": "https://www.lancastercolony.com",
    "description": "Lancaster Colony Corporation manufactures and markets food products for the retail and foodservice markets in the United States. The company operates in two segments, Retail and Foodservice. It offers frozen garlic bread under the New York BRAND Bakery; frozen Parkerhouse style yeast and dinner rolls under the Sister Schubert's brand; salad dressings under the Marzetti, Cardini's, and Girard's; flatbread wraps and pizza crusts under the Flatout brand; croutons and salad toppings under the New York BRAND Bakery, Chatham Village, and Marzetti; frozen pasta under the Marzetti Frozen Pasta brand; and vegetable and fruit dips under the Marzetti brand. In addition, it manufactures and sells other products to brand license agreements, including Olive Garden dressings, Buffalo Wild Wings sauces and Chick-fil-A sauces. The company sells its products through sales personnel, food brokers, and distributors to retailers and restaurants. Lancaster Colony Corporation was incorporated in 1961 and is based in Westerville, Ohio.",
    "ceo": "Mr. David A. Ciesinski",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "3200",
    "phone": "614 224 7141",
    "address": "380 Polaris Parkway",
    "city": "Westerville",
    "state": "OH",
    "zip": "43082",
    "dcfDiff": 24.5539,
    "dcf": 215.894,
    "image": "https://financialmodelingprep.com/image-stock/LANC.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]