[
  {
    "symbol": "LAZ",
    "price": 31.24,
    "beta": 1.392605,
    "volAvg": 734598,
    "mktCap": 2707445840,
    "lastDiv": 2,
    "range": "27.71-43.44",
    "changes": 0.41,
    "companyName": "Lazard Ltd",
    "currency": "USD",
    "cik": "0001311370",
    "isin": "BMG540501027",
    "cusip": "505336107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.lazard.com",
    "description": "Lazard Ltd, together with its subsidiaries, operates as a financial advisory and asset management firm in North America, Europe, Asia, Australia, and Central and South America. It operates in two segments, Financial Advisory and Asset Management. The Financial Advisory segment offers various financial advisory services regarding mergers and acquisitions, restructurings, capital advisory, shareholder advisory, capital raising, sovereign advisory, and other strategic advisory matters. This segment serves corporate, partnership, institutional, government, sovereign, and individual clients across various industry areas, including consumers, financial institutions, healthcare and life sciences, industrials, power and energy/infrastructure, and real estate, as well as technology, telecommunication, and media and entertainment. The Asset Management segment offers a range of investment solutions, and investment and wealth management services in equity and fixed income strategies; asset allocation strategies; and alternative investments and private equity funds to corporations, public funds, sovereign entities, endowments and foundations, labor funds, financial intermediaries, and private clients. The company was founded in 1848 and is based in Hamilton, Bermuda.",
    "ceo": "Mr. Kenneth Marc Jacobs",
    "sector": "Financial Services",
    "country": "BM",
    "fullTimeEmployees": "3442",
    "phone": "14412951422",
    "address": "Clarendon House",
    "city": "Hamilton",
    "state": null,
    "zip": "HM11",
    "dcfDiff": 8.69805,
    "dcf": 49.5881,
    "image": "https://financialmodelingprep.com/image-stock/LAZ.png",
    "ipoDate": "2005-05-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]