[
  {
    "symbol": "LBRDA",
    "price": 79.24,
    "beta": 1.12676,
    "volAvg": 140390,
    "mktCap": 11673953205,
    "lastDiv": 0.4375,
    "range": "68.15-123.74",
    "changes": 1.55,
    "companyName": "Liberty Broadband Corporation",
    "currency": "USD",
    "cik": "0001611983",
    "isin": "US5303071071",
    "cusip": "530307107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Telecom Services",
    "website": "https://www.libertybroadband.com",
    "description": "Liberty Broadband Corporation engages in the communications businesses. It operates through GCI Holdings and Charter segments. The GCI Holdings segment provides a range of wireless, data, video, voice, and managed services to residential customers, businesses, governmental entities, and educational and medical institutions primarily in Alaska under the GCI brand. The Charter segment offers subscription-based video services comprising video on demand, high-definition television, and digital video recorder service; local and long-distance calling, voicemail, call waiting, caller ID, call forwarding, and other voice services, as well as international calling services; and Spectrum TV. It also provides internet services, including an in-home Wi-Fi product that provides customers with high-performance wireless routers and managed Wi-Fi services; advanced community Wi-Fi; mobile internet; and a security suite that offers protection against computer viruses and spyware. In addition, this segment offers internet access, data networking, fiber connectivity to cellular towers and office buildings, video entertainment, and business telephone services; advertising services on cable television networks and digital outlets; and operates regional sports and news networks. Liberty Broadband Corporation was incorporated in 2014 and is based in Englewood, Colorado.",
    "ceo": "Mr. Gregory B. Maffei",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "0",
    "phone": "720 875 5700",
    "address": "12300 Liberty Boulevard",
    "city": "Englewood",
    "state": "CO",
    "zip": "80112",
    "dcfDiff": 5.64393,
    "dcf": 86.0761,
    "image": "https://financialmodelingprep.com/image-stock/LBRDA.png",
    "ipoDate": "2014-11-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]