[
  {
    "symbol": "LBTYA",
    "price": 16.99,
    "beta": 1.261971,
    "volAvg": 1717320,
    "mktCap": 7780213132,
    "lastDiv": 13.798670999999999,
    "range": "15.22-22.41",
    "changes": -0.24,
    "companyName": "Liberty Global plc",
    "currency": "USD",
    "cik": "0001570585",
    "isin": "GB00B8W67662",
    "cusip": "G5480U104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Telecom Services",
    "website": "https://www.libertyglobal.com",
    "description": "Liberty Global plc, together with its subsidiaries, provides broadband internet, video, fixed-line telephony, and mobile communications services to residential and business customers. It offers value-added broadband services, such as intelligent WiFi features; security; smart home, online storage solutions, and Web spaces; Connect Box, a set-top or Horizon box that delivers in-home Wi-Fi service; community Wi-Fi via routers in home, which provides access to the internet; and public Wi-Fi access points in train stations, hotels, bars, restaurants, and other public places. The company also provides various tiers of digital video programming and audio services, as well as digital video recorders and multimedia home gateway systems; and channels, including general entertainment, sports, movies, series, documentaries, lifestyles, news, adult, children, and ethnic and foreign channels. In addition, it offers postpaid and prepaid mobile services; circuit-switched telephony services; and personal call manager, unified messaging, and a second or third phone line at an incremental cost. Further, the company offers business services comprising voice, advanced data, video, wireless, cloud-based services, and mobile and converged fixed-mobile services to small or home office, small business, and medium and large enterprises, as well as on a wholesale basis to other operators. It operates in the United Kingdom, Belgium, Switzerland, Ireland, Poland, Slovakia, and internationally. Liberty Global plc was founded in 2004 and is based in London, the United Kingdom.",
    "ceo": "Mr. Michael Thomas Fries",
    "sector": "Communication Services",
    "country": "GB",
    "fullTimeEmployees": "10100",
    "phone": "44 20 8483 6449",
    "address": "Griffin House",
    "city": "London",
    "state": null,
    "zip": "W6 8BS",
    "dcfDiff": 0.498446,
    "dcf": 20.8916,
    "image": "https://financialmodelingprep.com/image-stock/LBTYA.png",
    "ipoDate": "2004-06-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]