[
  {
    "symbol": "LCII",
    "price": 124.8,
    "beta": 1.472887,
    "volAvg": 183103,
    "mktCap": 3157240320,
    "lastDiv": 4.2,
    "range": "89.28-139.89",
    "changes": 0.55,
    "companyName": "LCI Industries",
    "currency": "USD",
    "cik": "0000763744",
    "isin": "US50189K1034",
    "cusip": "50189K103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Recreational Vehicles",
    "website": "https://www.lci1.com",
    "description": "LCI Industries, together with its subsidiaries, manufactures and supplies components for the manufacturers of recreational vehicles (RVs) and adjacent industries in the United States and internationally. It operates in two segments, Original Equipment Manufacturers (OEM) and Aftermarket. The OEM segment manufactures and distributes a range of engineered components, such as steel chassis and related components; axles and suspension solutions; slide-out mechanisms and solutions; thermoformed bath, kitchen, and other products; vinyl, aluminum, and frameless windows; manual, electric, and hydraulic stabilizer and leveling systems; entry, luggage, patio, and ramp doors; furniture and mattresses; electric and manual entry steps; awnings and awning accessories; towing products; truck accessories; electronic components; appliances; air conditioners; televisions and sound systems; and other accessories. This segment serves OEMs of RVs and adjacent industries, including buses; trailers used to haul boats, livestock, equipment, and other cargo; trucks; boats; trains; manufactured homes; and modular housing, as well as travel trailers, fifth-wheel travel trailers, folding camping trailers, and truck campers. The Aftermarket segment supplies various components of RV and adjacent industries to retail dealers, wholesale distributors, and service centers. This segment also sells replacement glass and awnings to fulfill insurance claims; and biminis, covers, buoys, and fenders to the marine industry. The company was formerly known as Drew Industries Incorporated and changed its name to LCI Industries in December 2016. LCI Industries was incorporated in 1984 and is based in Elkhart, Indiana.",
    "ceo": "Mr. Jason D. Lippert",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "12900",
    "phone": "574 535 1125",
    "address": "3501 County Road 6 East",
    "city": "Elkhart",
    "state": "IN",
    "zip": "46514",
    "dcfDiff": 6.17544,
    "dcf": 101.895,
    "image": "https://financialmodelingprep.com/image-stock/LCII.png",
    "ipoDate": "1985-05-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]