[
  {
    "symbol": "LEG",
    "price": 29.18,
    "beta": 1.326056,
    "volAvg": 820740,
    "mktCap": 3884208160,
    "lastDiv": 1.84,
    "range": "28.77-41.94",
    "changes": -0.42,
    "companyName": "Leggett & Platt, Incorporated",
    "currency": "USD",
    "cik": "0000058492",
    "isin": "US5246601075",
    "cusip": "524660107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Furnishings, Fixtures & Appliances",
    "website": "https://www.leggett.com",
    "description": "Leggett & Platt, Incorporated designs, manufactures, and markets engineered components and products worldwide. It operates through three segments: Bedding Products; Specialized Products; and Furniture, Flooring & Textile Products. The company offers steel rods, drawn wires, foam chemicals and additives, innersprings, specialty foams, private label finished mattresses, mattress foundations, wire forms for mattress foundations, adjustable beds, industrial sewing and quilting machines, and mattress packaging and glue drying equipment, as well as machines to produce innersprings for industrial users of steel rods and wires, manufacturers of finished bedding, big box and e-commerce retailers, bedding brands and mattress retailers, department stores, and home improvement centers. It also provides mechanical and pneumatic lumbar support and massage systems for automotive seating; seat suspension systems, motors and actuators, and cables; titanium, nickel, and stainless-steel tubing, formed tubes, tube assemblies, and flexible joint components for fluid conveyance systems; and engineered hydraulic cylinders to automobile OEMs and Tier 1 suppliers, aerospace OEMs and suppliers, and mobile equipment OEMs. In addition, the company offers steel mechanisms and motion hardware for reclining chairs, sofas, sleeper sofas and lift chairs; springs and seat suspensions; components and private label finished goods for soft seating; and bases, columns, back rests, casters, and frames, as well as control devices for chairs. Further, it offers carpet cushion and hard surface flooring underlayment, structural fabrics, and geo components to manufacturers of upholstered and office furniture, flooring retailers and distributors, contractors, landscapers, road construction companies, retailers, government agencies, and mattress and furniture producers, as well as manufacturers of packaging, filtration, and draperies. The company was founded in 1883 and is based in Carthage, Missouri.",
    "ceo": "Mr. J. Mitchell Dolloff",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "19900",
    "phone": "417 358 8131",
    "address": "No. 1 Leggett Road",
    "city": "Carthage",
    "state": "MO",
    "zip": "64836",
    "dcfDiff": 1.82594,
    "dcf": 37.5459,
    "image": "https://financialmodelingprep.com/image-stock/LEG.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]