[
  {
    "symbol": "LEGN",
    "price": 70.2,
    "beta": -0.051387,
    "volAvg": 929317,
    "mktCap": 12660640762,
    "lastDiv": 0,
    "range": "37.3-75.453",
    "changes": -1.96,
    "companyName": "Legend Biotech Corporation",
    "currency": "USD",
    "cik": "0001801198",
    "isin": "US52490G1022",
    "cusip": "52490G102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.legendbiotech.com",
    "description": "Legend Biotech Corporation, a clinical-stage biopharmaceutical company, through its subsidiaries, engages in the discovery and development of novel cell therapies for oncology and other indications in the United States, China, and internationally. Its lead product candidate, LCAR- B38M, is a chimeric antigen receptor for the treatment of multiple myeloma (MM), as well as a comparison of the treatment with standard triplet therapy in revlimid-refractory multiple myeloma. The company also has a portfolio of earlier-stage autologous product candidates, which are in Phase I clinical trials for the treatment of gastric cancer and T cell lymphoma. In addition, it is developing CAR-T product candidates targeting CD20/CD22/CD19 for the treatment of non-hodgkins lymphoma, diffuse large B-cell lymphoma, and acute lymphoblastic leukemia. Further, the company has product candidates in early preclinical and clinical development for the treatment of solid tumors as well as infectious diseases. It has collaboration and license agreement with Janssen Biotech, Inc. for the development and commercialization of ciltacabtagene autoleucel. Legend Biotech Corporation was founded in 2014 and is based in Somerset, New Jersey. Legend Biotech Corporation is a subsidiary of Genscript Biotech Corporation.",
    "ceo": "Dr. Ying  Huang Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "1390",
    "phone": "732 317 5050",
    "address": "2101 Cottontail Lane",
    "city": "Somerset",
    "state": "NJ",
    "zip": "08873",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/LEGN.png",
    "ipoDate": "2020-06-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]