[
  {
    "symbol": "LEVI",
    "price": 14.34,
    "beta": 1.169548,
    "volAvg": 2528737,
    "mktCap": 5684046094,
    "lastDiv": 0.48,
    "range": "12.8-20.49",
    "changes": -0.25,
    "companyName": "Levi Strauss & Co.",
    "currency": "USD",
    "cik": "0000094845",
    "isin": "US52736R1023",
    "cusip": "52736R102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Apparel Manufacturing",
    "website": "https://www.levistrauss.com",
    "description": "Levi Strauss & Co. operates as an apparel company. The company designs, markets, and sells jeans, casual and dress pants, activewear, tops, shorts, skirts, dresses, jackets, footwear, and related accessories for men, women, and children in the Americas, Europe, and Asia. It also sells its products under the Levi's, Dockers, Signature by Levi Strauss & Co., and Denizen brands. In addition, the company licenses Levi's and Dockers trademarks for various product categories, including footwear, belts, wallets and bags, outerwear, sweaters, dress shirts, kids wear, sleepwear, and hosiery. Further, it sells its products through third-party retailers, such as department stores, specialty retailers, third-party e-commerce sites, and franchisees who operate brand-dedicated stores; and directly to consumers through various formats, including company-operated mainline and outlet stores, company-operated e-commerce sites, and select shop-in-shops located in department stores, and other third-party retail locations. The company also operates approximately 3,100 brand-dedicated stores and shop-in-shops. The company was founded in 1853 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Charles Victor Bergh",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "18000",
    "phone": "415 501 6000",
    "address": "1155 Battery Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94111",
    "dcfDiff": 0.108598,
    "dcf": 17.6814,
    "image": "https://financialmodelingprep.com/image-stock/LEVI.png",
    "ipoDate": "2019-03-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]