[
  {
    "symbol": "LGRVF",
    "price": 99.5,
    "beta": 0.932567,
    "volAvg": 293,
    "mktCap": 26343320704,
    "lastDiv": 2.04,
    "range": "62.95-99.5",
    "changes": 5.15,
    "companyName": "Legrand SA",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Electrical Equipment & Parts",
    "website": "https://www.legrandgroup.com",
    "description": "Legrand SA, together with its subsidiaries, provides electrical and digital building infrastructures worldwide. The company offers MCBs, RCDs, and din rail equipment, including residual current circuit breakers, RCBOs, add-on modules and accessories, surge protective devices, other control and signaling devices, and time and light-sensitive switches, as well as dimmers, relays, transformers, power supplies, and accessories; ACBs, MCCBs, head equipment, and busbar systems; enclosures and accessories; equipment and accessories; home network, home automation, and hotel equipment; wiring accessories; weatherproof wiring accessories and other installation equipment; lighting management, emergency lighting, access control, and safety equipment; UPS and LCS products, cable management systems, equipment, and accessories; and mosaic wiring accessories. Its products are used in hotels, offices, data centers, industrial sites, shops, hospitals, schools, and universities, as well as residential, commercial, and industrial buildings. Legrand SA was founded in 1865 and is headquartered in Limoges, France.",
    "ceo": "Mr. Benoît  Coquart",
    "sector": "Industrials",
    "country": "FR",
    "fullTimeEmployees": "38000",
    "phone": "33 5 55 06 87 87",
    "address": "128, Avenue de Lattre de Tassigny",
    "city": "Limoges",
    "state": null,
    "zip": "87045",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/LGRVF.png",
    "ipoDate": "2012-01-31",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]