[
  {
    "symbol": "LH",
    "price": 237.94,
    "beta": 1.042253,
    "volAvg": 588746,
    "mktCap": 21081484000,
    "lastDiv": 2.88,
    "range": "200.32-263.13",
    "changes": -0.15,
    "companyName": "Laboratory Corporation of America Holdings",
    "currency": "USD",
    "cik": "0000920148",
    "isin": "US50540R4092",
    "cusip": "50540R409",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Diagnostics & Research",
    "website": "https://www.labcorp.com",
    "description": "Laboratory Corporation of America Holdings operates as a global life sciences company that provides vital information to help doctors, hospitals, pharmaceutical companies, researchers, and patients make clear and confident decisions. It operates in two segments, Labcorp Diagnostics (Dx) and Labcorp Drug Development (DD). It offers various tests, such as blood chemistry analyses, urinalyses, blood cell counts, thyroid tests, PAP tests, hemoglobin A1C and vitamin D, prostate-specific antigens, tests for sexually transmitted diseases, hepatitis C tests, microbiology cultures and procedures, and alcohol and other substance-abuse tests. The company also provides specialty testing services comprising gene-based and esoteric testing; advanced tests target specific diseases, including anatomic pathology/oncology, cardiovascular disease, coagulation, diagnostic genetics, endocrinology, infectious disease, women's health, pharmacogenetics, and parentage and donor testing; and occupational testing services, medical drug monitoring services, chronic disease programs, and kidney stone prevention tests. It provides online and mobile applications to enable patients to check test results; and online applications for managed care organizations and accountable care organizations. It offers end-to-end drug development, medical device, and companion diagnostic development solutions from early-stage research to clinical development and commercial market access. It serves managed care organizations, pharmaceutical, biotechnology, medical device and diagnostics companies, governmental agencies, physicians and other healthcare providers, hospitals and health systems, employers, patients and consumers, contract research organizations, and independent clinical laboratories. Laboratory Corporation of America Holdings has a collaboration agreement with Tigerlily Foundation to increase clinical trial diversity for women of color. The company was incorporated in 1994 and is headquartered in Burlington, North Carolina.",
    "ceo": "Mr. Adam H. Schechter",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "80000",
    "phone": "336 229 1127",
    "address": "358 South Main Street",
    "city": "Burlington",
    "state": "NC",
    "zip": "27215",
    "dcfDiff": 3.31538,
    "dcf": 250.985,
    "image": "https://financialmodelingprep.com/image-stock/LH.png",
    "ipoDate": "1990-03-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]