[
  {
    "symbol": "LHX",
    "price": 191.74,
    "beta": 0.71338,
    "volAvg": 1019137,
    "mktCap": 36325716686,
    "lastDiv": 4.56,
    "range": "174.55-255.1",
    "changes": -1.91,
    "companyName": "L3Harris Technologies, Inc.",
    "currency": "USD",
    "cik": "0000202058",
    "isin": "US5024311095",
    "cusip": "502431109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.l3harris.com",
    "description": "L3Harris Technologies, Inc., an aerospace and defense technology company, provides mission-critical solutions for government and commercial customers worldwide. The company's Integrated Mission Systems segment provides multi-mission intelligence, surveillance, and reconnaissance (ISR) systems; and communication systems, as well as fleet management support, sensor development, modification, and periodic depot maintenance services for ISR and airborne missions. It also manufactures and integrates mission systems for maritime platforms, such as signals intelligence and multi-intelligence platforms; unmanned surface and undersea autonomous solutions; and power and ship control systems and other electronic and electrical products and systems. In addition, this segment offers advanced electro-optical and infrared solutions. Its Space and Airborne Systems segment offers space payloads, sensors, and full-mission solutions; classified intelligence and cyber defense solutions; mission avionics; and electronic warfare systems. The company's Communication Systems segment provides tactical communications; broadband secured mobile networked communication equipment, including airborne, space, and surface data link terminals, ground stations, and transportable tactical satellite communication (SATCOM) systems for use in manned aircraft, unmanned aerial vehicles, and naval ships; and helmet and weapon mounted integrated night vision systems. This segment also offers radios, systems applications, and equipment for critical public safety and professional communications; and SATCOM terminals and battlefield management networks. Its Aviation Systems segment offers defense aviation products; commercial pilot training; and mission networks solutions for air traffic management. The company was formerly known as Harris Corporation and changed its name to L3Harris Technologies, Inc. in June 2019. L3Harris Technologies, Inc. was founded in 1895 and is headquartered in Melbourne, Florida.",
    "ceo": "Mr. Christopher E. Kubasik CPA, CPA",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "46000",
    "phone": "321 727 9100",
    "address": "1025 West NASA Boulevard",
    "city": "Melbourne",
    "state": "FL",
    "zip": "32919",
    "dcfDiff": 18.0315,
    "dcf": 230.132,
    "image": "https://financialmodelingprep.com/image-stock/LHX.png",
    "ipoDate": "1981-12-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]