[
  {
    "symbol": "LII",
    "price": 321.44,
    "beta": 0.929225,
    "volAvg": 332445,
    "mktCap": 11411602160,
    "lastDiv": 4.4,
    "range": "197.92-324.24",
    "changes": -1.26,
    "companyName": "Lennox International Inc.",
    "currency": "USD",
    "cik": "0001069202",
    "isin": "US5261071071",
    "cusip": "526107107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.lennoxinternational.com",
    "description": "Lennox International Inc., together with its subsidiaries, designs, manufactures, and markets a range of products for the heating, ventilation, air conditioning, and refrigeration markets in the United States, Canada, and internationally. It operates through three segments: Residential Heating & Cooling, Commercial Heating & Cooling, and Refrigeration. The Residential Heating & Cooling segment provides furnaces, air conditioners, heat pumps, packaged heating and cooling systems, indoor air quality equipment and accessories, comfort control products, and replacement parts and supplies for residential replacement and new construction markets. The Commercial Heating & Cooling segment offers unitary heating and air conditioning equipment, applied systems, controls, installation and service of commercial heating and cooling equipment, and variable refrigerant flow commercial products for light commercial markets. The Refrigeration segment offers condensing units, unit coolers, fluid coolers, air cooled condensers, air handlers, and refrigeration rack systems for preserving food and other perishables in supermarkets, convenience stores, restaurants, warehouses, and distribution centers, as well as for data centers, machine tooling, and other cooling applications; and compressor racks and industrial process chillers. The company sells its products and services through direct sales, distributors, and company-owned parts and supplies stores. Lennox International Inc. was founded in 1895 and is headquartered in Richardson, Texas.",
    "ceo": "Mr. Alok  Maskara",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "13200",
    "phone": "972 497 5000",
    "address": "2140 Lake Park Boulevard",
    "city": "Richardson",
    "state": "TX",
    "zip": "75080",
    "dcfDiff": 18.8367,
    "dcf": 267.977,
    "image": "https://financialmodelingprep.com/image-stock/LII.png",
    "ipoDate": "1999-07-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]