[
  {
    "symbol": "LIOPF",
    "price": 10.72,
    "beta": -0.006896,
    "volAvg": 19,
    "mktCap": 3046967040,
    "lastDiv": 0.2,
    "range": "10.27-13.99",
    "changes": 0,
    "companyName": "Lion Corporation",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Household & Personal Products",
    "website": "https://www.lion.co.jp",
    "description": "Lion Corporation manufactures and sells consumer and industrial products in Japan and internationally. It operates through three segments: Consumer Products Business, Industrial Products Business, and Overseas Business. The company offers dental and oral care products, including toothpastes, toothbrushes, dental floss, dental rinses, mouthwashes and breath fresheners, periodontitis ointments, and denture products; body care products, such as shampoos and conditioners, hand soaps, sanitizers, wet wipes, body washes, skin and acne care products, antiperspirants and deodorants, hair-nourishment treatments, men's care and toiletries products, and foot care products. It also provides antipyretic analgesics, eye drops and eye care products, cold medicines, gargles, cold relief products, topical anti-inflammatory analgesics, antidiarrheal and gastrointestinal medicines, health tonic drinks and vitamin supplements, acne and anti-drowsiness medicines, and dermatologic agents. In addition, the company offers fabric care products, such as laundry detergent, delicate detergent, prewash treatment, stain remover, bleach, and fabric softener; clothing care products; household cleaners; kitchen cleanup products comprises dishwashing detergents and antibacterial and deodorizing products; and food preparation products. Further, it provides health and beauty food products consisting of supplements and health tonic drinks; specialty chemicals, and chemical products, include rubber processing and additive agents, mandrel release agents, fatty acid methyl esters, plant-based electrical insulating oils, concrete admixtures, ground improvement and asphalt recycling agents, surfactants, and cosmetics ingredients, as well as electro-conductive carbon black and pressure-sensitive adhesives; pet supplies; and gift and special order products. The company was founded in 1891 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Masazumi  Kikukawa",
    "sector": "Consumer Defensive",
    "country": "JP",
    "fullTimeEmployees": "7587",
    "phone": "81 3 3621 6211",
    "address": "3-7, Honjo 1-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "130-8644",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/LIOPF.png",
    "ipoDate": "2014-01-03",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]