[
  {
    "symbol": "LITE",
    "price": 56.31,
    "beta": 1.084507,
    "volAvg": 1661025,
    "mktCap": 3868497000,
    "lastDiv": 0,
    "range": "42.0-96.46",
    "changes": -1.6,
    "companyName": "Lumentum Holdings Inc.",
    "currency": "USD",
    "cik": "0001633978",
    "isin": "US55024U1097",
    "cusip": "55024U109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Communication Equipment",
    "website": "https://www.lumentum.com",
    "description": "Lumentum Holdings Inc. manufactures and sells optical and photonic products in the Americas, the Asia-Pacific, Europe, the Middle East, and Africa. The company operates in two segments, Optical Communications (OpComms) and Commercial Lasers (Lasers). The OpComms segment offers components, modules, and subsystems that enable the transmission and transport of video, audio, and data over high-capacity fiber optic cables. It offers tunable transponders, transceivers, and transmitter modules; tunable lasers, receivers, and modulators; transport products, such as reconfigurable optical add/drop multiplexers, amplifiers, and optical channel monitors, as well as components, including 980nm, multi-mode, and Raman pumps; and switches, attenuators, photodetectors, gain flattening filters, isolators, wavelength-division multiplexing filters, arrayed waveguide gratings, multiplex/de-multiplexers, and integrated passive modules. This segment also provides Super Transport Blade, which integrates optical transport functions into a single-slot blade; vertical-cavity surface-emitting lasers; directly modulated and electro-absorption modulated lasers; and laser illumination sources for 3D sensing systems. It serves customers in telecommunications, data communications, and consumer and industrial markets. The Commercial Lasers segment offers diode-pumped solid-state, fiber, diode, direct-diode, and gas lasers for use in original equipment manufacturer applications. It serves customers in markets and applications, such as sheet metal processing, general manufacturing, biotechnology, graphics and imaging, remote sensing, and precision machining. Lumentum Holdings Inc. was incorporated in 2015 and is headquartered in San Jose, California.",
    "ceo": "Mr. Alan S. Lowe",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "6815",
    "phone": "408 546 5483",
    "address": "1001 Ridder Park Drive",
    "city": "San Jose",
    "state": "CA",
    "zip": "95131",
    "dcfDiff": 4.41628,
    "dcf": 64.7163,
    "image": "https://financialmodelingprep.com/image-stock/LITE.png",
    "ipoDate": "2015-07-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]