[
  {
    "symbol": "LIVN",
    "price": 51.08,
    "beta": 0.863732,
    "volAvg": 423191,
    "mktCap": 2746474548,
    "lastDiv": 0,
    "range": "40.26-66.73",
    "changes": 1.61,
    "companyName": "LivaNova PLC",
    "currency": "USD",
    "cik": "0001639691",
    "isin": "GB00BYMT0J19",
    "cusip": "G5509L101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Devices",
    "website": "https://www.livanova.com",
    "description": "LivaNova PLC, a medical device company, designs, develops, manufactures, and sells therapeutic solutions worldwide. It operates through three segments: Cardiopulmonary, Neuromodulation, and Advanced Circulatory Support. The Cardiopulmonary segment develops, produces, and sells cardiopulmonary products, including oxygenators, heart-lung machines, autotransfusion systems, perfusion tubing systems, cannulae, connect, and other related products. The Neuromodulation segment designs, develops, and markets VNS Therapy System, an implantable device that delivers vagus nerve stimulation (VNS) therapy for the treatment of drug-resistant epilepsy, difficult-to-treat depression, and obstructive sleep apnea. It is also involved in the development and clinical testing of the VITARIA System for treating heart failure through VNS. The Advanced Circulatory Support segment develops, produces, and sells temporary life support products, such as cardiopulmonary and respiratory support solutions. The company serves perfusionists, neurologists, neurosurgeons, and other physicians, as well as hospitals, other medical institutions, and healthcare providers. It sells its products through direct sales representatives and independent distributors. The company has a research collaboration with Verily to capture clinical biomarkers of depression. LivaNova PLC was founded in 1987 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. William A. Kozy",
    "sector": "Healthcare",
    "country": "GB",
    "fullTimeEmployees": "2900",
    "phone": "44 20 3325 0660",
    "address": "20 Eastbourne Terrace",
    "city": "London",
    "state": null,
    "zip": "W2 6LG",
    "dcfDiff": 1.67984,
    "dcf": 56.9598,
    "image": "https://financialmodelingprep.com/image-stock/LIVN.png",
    "ipoDate": "2015-10-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]