[
  {
    "symbol": "LKNCY",
    "price": 21.03,
    "beta": -0.701873,
    "volAvg": 1782490,
    "mktCap": 5802408498,
    "lastDiv": 0,
    "range": "11.11-32.3",
    "changes": -0.26,
    "companyName": "Luckin Coffee Inc.",
    "currency": "USD",
    "cik": "0001767582",
    "isin": null,
    "cusip": "54951L109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Restaurants",
    "website": "https://investor.luckincoffee.com",
    "description": "Luckin Coffee Inc. engages in the retail services of freshly brewed coffee and non-coffee drinks in the People's Republic of China. It also offers hot and iced freshly brewed coffee, such as Americano, Latte, Cappuccino, Macchiato, Flat White, and Mocha, as well as specialty coffee based on market and seasonal trends; coconut milk latte products; tea drinks; pre-made beverages; and pre-made food items, such as pastries, sandwiches, and snacks. In addition, the company offers cups, tote bags, and other merchandises. It operates pick-up stores, relax stores, and delivery kitchens under the Luckin brand, as well as Luckin mobile app, Weixin mini-program, and other third-party platforms for third-party payment channels. Further, the company provides technical and consultation services; and manufactures materials for products. As of December 31, 2021, it operated 4,397 self-operated stores; 1,627 partnership stores; and 1,102 Luckin Coffee EXPRESS machines. Luckin Coffee Inc. was incorporated in 2017 and is headquartered in Xiamen, the People's Republic of China.",
    "ceo": "Dr. Jinyi  Guo",
    "sector": "Consumer Cyclical",
    "country": "CN",
    "fullTimeEmployees": "14559",
    "phone": "86 59 2338 6666",
    "address": "Haixi Jingu Plaza, Building T3",
    "city": "Xiamen",
    "state": null,
    "zip": "361008",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/LKNCY.png",
    "ipoDate": "2019-05-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]