[
  {
    "symbol": "LKQ",
    "price": 56.98,
    "beta": 1.354577,
    "volAvg": 1124438,
    "mktCap": 15230184200,
    "lastDiv": 1.1,
    "range": "46.2-59.33",
    "changes": -0.02,
    "companyName": "LKQ Corporation",
    "currency": "USD",
    "cik": "0001065696",
    "isin": "US5018892084",
    "cusip": "501889208",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Auto Parts",
    "website": "https://www.lkqcorp.com",
    "description": "LKQ Corporation distributes replacement parts, components, and systems used in the repair and maintenance of vehicles. It operates through three segments: North America, Europe, and Specialty. The company distributes bumper covers, automotive body panels, and lights, as well as automotive glass products, such as windshields; salvage products, including mechanical and collision parts comprising engines; transmissions; door assemblies; sheet metal products, such as trunk lids, fenders, and hoods; lights and bumper assemblies; scrap metal and other materials to metals recyclers; and brake pads, discs and sensors, clutches, steering and suspension products, filters, and oil and automotive fluids, as well as electrical products, including spark plugs and batteries. In addition, the company distributes recreational vehicle appliances and air conditioners, towing hitches, truck bed covers, vehicle protection products, cargo management products, wheels, tires, and suspension products. It serves collision and mechanical repair shops, and new and used car dealerships, as well as retail customers. The company operates in the United States, Canada, the United Kingdom, Germany, Belgium, the Netherlands, Luxembourg, Italy, the Czech Republic, Austria, Poland, Slovakia, Taiwan, and other European countries. LKQ Corporation was incorporated in 1998 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Dominick P. Zarcone",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "45000",
    "phone": "312 621 1950",
    "address": "500 West Madison Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60661",
    "dcfDiff": 2.39122,
    "dcf": 55.2288,
    "image": "https://financialmodelingprep.com/image-stock/LKQ.png",
    "ipoDate": "2003-10-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]