[
  {
    "symbol": "LMT",
    "price": 449.66,
    "beta": 0.670774,
    "volAvg": 1055033,
    "mktCap": 113877740383,
    "lastDiv": 12,
    "range": "373.67-508.1",
    "changes": -3.49,
    "companyName": "Lockheed Martin Corporation",
    "currency": "USD",
    "cik": "0000936468",
    "isin": "US5398301094",
    "cusip": "539830109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.lockheedmartin.com",
    "description": "Lockheed Martin Corporation, a security and aerospace company, engages in the research, design, development, manufacture, integration, and sustainment of technology systems, products, and services worldwide. It operates through four segments: Aeronautics, Missiles and Fire Control, Rotary and Mission Systems, and Space. The Aeronautics segment offers combat and air mobility aircraft, unmanned air vehicles, and related technologies. The Missiles and Fire Control segment provides air and missile defense systems; tactical missiles and air-to-ground precision strike weapon systems; logistics; fire control systems; mission operations support, readiness, engineering support, and integration services; manned and unmanned ground vehicles; and energy management solutions. The Rotary and Mission Systems segment offers military and commercial helicopters, surface ships, sea and land-based missile defense systems, radar systems, sea and air-based mission and combat systems, command and control mission solutions, cyber solutions, and simulation and training solutions. The Space segment offers satellites; space transportation systems; strategic, advanced strike, and defensive missile systems; and classified systems and services in support of national security systems. This segment also provides network-enabled situational awareness and integrates space and ground-based systems to help its customers gather, analyze, and securely distribute critical intelligence data. It serves primarily serves the U.S. government, as well as foreign military sales contracted through the U.S. government. Lockheed Martin Corporation was founded in 1912 and is headquartered in Bethesda, Maryland.",
    "ceo": "Mr. James D. Taiclet Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "116000",
    "phone": "301 897 6000",
    "address": "6801 Rockledge Drive",
    "city": "Bethesda",
    "state": "MD",
    "zip": "20817",
    "dcfDiff": 34.1565,
    "dcf": 493.757,
    "image": "https://financialmodelingprep.com/image-stock/LMT.png",
    "ipoDate": "1977-01-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]