[
  {
    "symbol": "LNT",
    "price": 51.8,
    "beta": 0.542605,
    "volAvg": 1401370,
    "mktCap": 13021898400,
    "lastDiv": 1.81,
    "range": "47.19-64.62",
    "changes": -1.02,
    "companyName": "Alliant Energy Corporation",
    "currency": "USD",
    "cik": "0000352541",
    "isin": "US0188021085",
    "cusip": "018802108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.alliantenergy.com",
    "description": "Alliant Energy Corporation operates as a utility holding company that provides regulated electricity and natural gas services. It operates through three segments: Utility Electric Operations, Utility Gas Operations, and Utility Other. The company, through its subsidiary, Interstate Power and Light Company (IPL), primarily generates and distributes electricity, and distributes and transports natural gas to retail customers in Iowa; sells electricity to wholesale customers in Minnesota, Illinois, and Iowa; and generates and distributes steam in Cedar Rapids, Iowa. Alliant Energy Corporation, through its other subsidiary, Wisconsin Power and Light Company (WPL), generates and distributes electricity, and distributes and transports natural gas to retail customers in Wisconsin; and sells electricity to wholesale customers in Wisconsin. As of December 31, 2021, IPL supplied electric and natural gas service to approximately 500,000 and 225,000 retail customers respectively; and WPL supplied electric and natural gas service to approximately 485,000 and 200,000 retail customers, respectively. It serves retail customers in the farming, agriculture, industrial manufacturing, chemical, and packaging and food industries. In addition, the company owns and operates a short-line rail freight service in Iowa; a barge, rail, and truck freight terminal on the Mississippi River; and a rail-served warehouse in Iowa, as well as offers freight brokerage services. Further, it holds interests in a 347 megawatt (MW) natural gas-fired electric generating unit near Sheboygan Falls, Wisconsin; and a 225 MW wind farm located in Oklahoma. The company was incorporated in 1981 and is headquartered in Madison, Wisconsin.",
    "ceo": "Mr. John O. Larsen",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "3129",
    "phone": "608 458 3311",
    "address": "4902 North Biltmore Lane",
    "city": "Madison",
    "state": "WI",
    "zip": "53718",
    "dcfDiff": 1.07556,
    "dcf": 55.4956,
    "image": "https://financialmodelingprep.com/image-stock/LNT.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]