[
  {
    "symbol": "LNTH",
    "price": 84.54,
    "beta": 0.677464,
    "volAvg": 1031429,
    "mktCap": 6180330685,
    "lastDiv": 0,
    "range": "47.46-100.851",
    "changes": 0.1,
    "companyName": "Lantheus Holdings, Inc.",
    "currency": "USD",
    "cik": "0001521036",
    "isin": "US5165441032",
    "cusip": "516544103",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.lantheus.com",
    "description": "Lantheus Holdings, Inc. develops, manufactures, and commercializes diagnostic and therapeutic products that assist clinicians in the diagnosis and treatment of heart, cancer, and other diseases worldwide. It provides DEFINITY, a microbubble ultrasound enhancing agent used in ultrasound exams of the heart; TechneLite, a technetium generator for nuclear medicine; Xenon-133 to assess pulmonary function; Neurolite to identify the area within the brain where blood flow has been blocked or reduced due to stroke; Cardiolite, an injectable Tc-99m-labeled imaging agent; Thallium-201 to detect cardiovascular disease; and Gallium-67 to detect various infections and cancerous tumors. The company also offers AZEDRA, a radiotherapeutic to treat adult and pediatric patients; Automated Bone Scan Index that calculates the disease burden of prostate cancer by quantifying the hotspots on bone scans; and Cobalt (Co 57), a non-pharmaceutical radiochemical; RELISTOR for opioid-induced constipation; and PYLARIFY for visualization of lymph nodes, bone, and soft tissue metastases to determine the presence or absence of recurrent and/or metastatic prostate cancer. It also develops flurpiridaz F 18 to assess blood flow to the heart; 1095, a PSMA-targeted iodine-131 labeled small molecule; LMI 1195 for neuroblastoma tumors in pediatric and adults; PYLARIFY AI, an AI-based medical device software to perform standardized quantitative assessment of PSMA PET/CT images in prostate cancer; and leronlimab, an investigational humanized monoclonal antibody. The company serves radio pharmacies, distributors, integrated delivery networks, hospitals, clinics, and group practices. It has strategic partnerships with NanoMab Technology Limited; Bausch Health Companies, Inc.; GE Healthcare Limited; Curium; Bayer AG; CytoDyn Inc.; ROTOP; FUJIFILM; Regeneron Pharmaceuticals, Inc.; and POINT Biopharma US Inc. The company was founded in 1956 and is headquartered in North Billerica, Massachusetts.",
    "ceo": "Ms. Mary Anne Heino",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "698",
    "phone": "978 671 8001",
    "address": "331 Treble Cove Road",
    "city": "North Billerica",
    "state": "MA",
    "zip": "01862",
    "dcfDiff": 2.99971,
    "dcf": 59.1997,
    "image": "https://financialmodelingprep.com/image-stock/LNTH.png",
    "ipoDate": "2015-06-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]