[
  {
    "symbol": "LNVGY",
    "price": 21.34,
    "beta": 1.157854,
    "volAvg": 56393,
    "mktCap": 12940724868,
    "lastDiv": 0.97,
    "range": "13.51-22.34",
    "changes": 0.16,
    "companyName": "Lenovo Group Limited",
    "currency": "USD",
    "cik": "0000932477",
    "isin": "US5262501050",
    "cusip": "526250105",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Computer Hardware",
    "website": "https://www.lenovo.com",
    "description": "Lenovo Group Limited, an investment holding company, develops, manufactures, and markets technology products and services. It operates through Intelligent Devices Group, Infrastructure Solutions Group, and Solutions and Services Group segments. The company offers commercial and consumer personal computers, as well as servers and workstations; and a family of mobile Internet devices, including tablets and smartphones. It also provides laptops, monitors, accessories, smart home and collaboration solutions, augmented and virtual reality, commercial internet of things, and smart infrastructure data center solutions. In addition, the company manufactures and distributes IT products, computers, computer hardware, and peripheral equipment; and offers IT, business planning, management, supply chain, finance, administration support, procurement agency, data management, intellectual property, and investment management services. Further, it is involved in the retail and service business for consumer electronic products and related digital services; development, ownership, licensing, and sale of communications hardware and software; and develops software and applications. Additionally, the company is involved in motherboard design and system, full-rack assembly across server, storage, and other products; and provides device-, infrastructure-, and software-as-a-service. It operates in China, the Asia Pacific, Europe, the Middle East, Africa, and the Americas. Lenovo Group Limited was founded in 1984 and is based in Quarry Bay, Hong Kong.",
    "ceo": "Mr. Yuanqing  Yang",
    "sector": "Technology",
    "country": "HK",
    "fullTimeEmployees": "77000",
    "phone": "852 2590 0228",
    "address": "Lincoln House",
    "city": "Quarry Bay",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/LNVGY.png",
    "ipoDate": "1998-12-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]