[
  {
    "symbol": "LNW",
    "price": 68,
    "beta": 1.786619,
    "volAvg": 523712,
    "mktCap": 6196051200,
    "lastDiv": 0,
    "range": "40.1-68.55",
    "changes": -0.39,
    "companyName": "Light & Wonder, Inc.",
    "currency": "USD",
    "cik": "0000750004",
    "isin": null,
    "cusip": "80874P109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Gambling",
    "website": "https://www.scientificgames.com",
    "description": "Light & Wonder, Inc. develops technology-based products and services, and related content for the gaming, lottery, social and digital gaming industries in the United States and internationally. The company's Gaming segment sells new and used gaming machines, electronic table systems, video lottery terminals, conversion game kits, and spare parts; table products, including shufflers; and perpetual licenses to proprietary table games. It also supplies game content, gaming machines; provides table game products and services to licensed gaming entities; and installs and supports casino management systems, such as ongoing hardware and software maintenance and upgrade services of customer casino management systems. The company's SciPlay segment develops and publishes digital games on mobile and web platforms. It sells virtual coins, chips, or bingo cards, which players can use to play slot games, table games, or bingo games. Its iGaming segment provides a suite of digital gaming content, including digital real-money gaming, distribution platforms, content, products, and services. This segment also offers the Open Platform System, which offers a range of reporting and administrative functions and tools providing operators control over various areas of digital gaming operations. The company also offers software design, development, licensing, maintenance, support services, and technology solutions. Light & Wonder, Inc. was incorporated in 1984 and is based in Las Vegas, Nevada.",
    "ceo": "Mr. Matthew R. Wilson",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "6100",
    "phone": "702 897 7150",
    "address": "6601 Bermuda Road",
    "city": "Las Vegas",
    "state": "NV",
    "zip": "89119",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/LNW.png",
    "ipoDate": "1984-08-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]