[
  {
    "symbol": "LOGI",
    "price": 58.35,
    "beta": 0.683141,
    "volAvg": 575825,
    "mktCap": 9262362300,
    "lastDiv": 0.97,
    "range": "41.81-68.17",
    "changes": 1.02,
    "companyName": "Logitech International S.A.",
    "currency": "USD",
    "cik": "0001032975",
    "isin": "CH0025751329",
    "cusip": "H50430232",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Computer Hardware",
    "website": "https://www.logitech.com",
    "description": "Logitech International S.A., through its subsidiaries, designs, manufactures, and markets products that connect people to digital and cloud experiences worldwide. The company offers pointing devices, such as wireless mouse; corded and cordless keyboards, living room keyboards, and keyboard-and-mouse combinations; PC webcams; and keyboards for tablets and smartphones, as well as other accessories for mobile devices. It also provides keyboards, mice, headsets, and simulation products, such as steering wheels and flight sticks for gamers; video conferencing products, such as ConferenceCams, which combine enterprise-quality audio and high-definition video to bring video conferencing to businesses of any size; webcams and headsets that turn desktop into collaboration space; and controller for video conferencing room solutions. In addition, the company offers portable wireless Bluetooth and Wi-Fi connected speakers, mobile speakers, PC speakers, PC headsets, microphones, in-ear headphones, and wireless audio wearables; home entertainment controllers, and home security cameras. Its channel network includes consumer electronics distributors, retailers, e-tailers, mass merchandisers, specialty stores, computer and telecommunications stores, value-added resellers, and online merchants. The company sells its products under the Logitech, Logitech G, ASTRO Gaming, Streamlabs, Blue Microphones, Ultimate Ears, and Jaybird brands. Logitech International S.A. was incorporated in 1981 and is headquartered in Lausanne, Switzerland.",
    "ceo": "Mr. Guy  Gecht",
    "sector": "Technology",
    "country": "CH",
    "fullTimeEmployees": "7400",
    "phone": "510 795 8500",
    "address": "Daniel Borel Innovation Center",
    "city": "Lausanne",
    "state": null,
    "zip": "1015",
    "dcfDiff": 6.29521,
    "dcf": 65.5852,
    "image": "https://financialmodelingprep.com/image-stock/LOGI.png",
    "ipoDate": "1997-03-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]