[
  {
    "symbol": "LOPE",
    "price": 100.95,
    "beta": 0.617957,
    "volAvg": 192464,
    "mktCap": 3101789700,
    "lastDiv": 0,
    "range": "78.37-124.53",
    "changes": -1.34,
    "companyName": "Grand Canyon Education, Inc.",
    "currency": "USD",
    "cik": "0001434588",
    "isin": "US38526M1062",
    "cusip": "38526M106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Education & Training Services",
    "website": "https://www.gce.com",
    "description": "Grand Canyon Education, Inc. provides education services to colleges and universities in the United States. The company's technology services include learning management system, internal administration, infrastructure, and support services; academic services comprises program and curriculum, faculty and related training and development, class scheduling, and skills and simulation lab sites; and counseling services and support include admission, financial aid, and field experience and other counseling services. It also offers marketing and communication services, such as lead acquisition, digital communications strategy, brand identity, market research, media planning and strategy, video, and business intelligence and data science; and back-office services comprising finance and accounting, human resources, audit, and procurement services. The company, through its subsidiary, Orbis Education Services, LLC, supports healthcare education programs for 27 universities. Grand Canyon Education, Inc. was founded in 1949 and is based in Phoenix, Arizona.",
    "ceo": "Mr. Brian E. Mueller",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "3920",
    "phone": "602 247 4400",
    "address": "2600 West Camelback Road",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85017",
    "dcfDiff": 9.96125,
    "dcf": 123.391,
    "image": "https://financialmodelingprep.com/image-stock/LOPE.png",
    "ipoDate": "2008-11-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]