[
  {
    "symbol": "LPLA",
    "price": 211.46,
    "beta": 0.897183,
    "volAvg": 846741,
    "mktCap": 16565142020,
    "lastDiv": 1.2,
    "range": "169.68-271.56",
    "changes": -1.28,
    "companyName": "LPL Financial Holdings Inc.",
    "currency": "USD",
    "cik": "0001397911",
    "isin": "US50212V1008",
    "cusip": "50212V100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Capital Markets",
    "website": "https://www.lpl.com",
    "description": "LPL Financial Holdings Inc., together with its subsidiaries, provides an integrated platform of brokerage and investment advisory services to independent financial advisors and financial advisors at financial institutions in the United States. Its brokerage offerings include variable and fixed annuities, mutual funds, equities, retirement and education savings plans, fixed income, and insurance, as well as alternative investments, such as non-traded real estate investment trusts and auction rate notes. The company also provides advisory platforms that provide access to mutual funds, exchange-traded funds, stocks, bonds, certain option strategies, unit investment trusts, and institutional money managers and no-load multi-manager variable annuities. In addition, it offers money market programs; and retirement solutions for commission-and fee-based services that allow advisors to provide brokerage services, consultation, and advice to retirement plan sponsors. Further, the company provides other services comprising tools and services that enable advisors to maintain and grow their practices; trust, investment management oversight, and custodial services to trusts for estates and families, as well as insurance brokerage general agency services; and technology products, such as proposal generation, investment analytics, and portfolio modeling. The company was formerly known as LPL Investment Holdings Inc. and changed its name to LPL Financial Holdings Inc. in June 2012. LPL Financial Holdings Inc. was founded in 1989 and is based in San Diego, California.",
    "ceo": "Mr. Dan Hogan Arnold Jr., B.S., CPA, M.B.A.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "7124",
    "phone": "800 877 7210",
    "address": "4707 Executive Drive",
    "city": "San Diego",
    "state": "CA",
    "zip": "92121",
    "dcfDiff": 3.13327,
    "dcf": 228.867,
    "image": "https://financialmodelingprep.com/image-stock/LPLA.png",
    "ipoDate": "2010-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]