[
  {
    "symbol": "LPX",
    "price": 73.87,
    "beta": 1.638732,
    "volAvg": 874117,
    "mktCap": 5321845958,
    "lastDiv": 0.96,
    "range": "48.2-74.23",
    "changes": 3.05,
    "companyName": "Louisiana-Pacific Corporation",
    "currency": "USD",
    "cik": "0000060519",
    "isin": "US5463471053",
    "cusip": "546347105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.lpcorp.com",
    "description": "Louisiana-Pacific Corporation, together with its subsidiaries, manufactures and markets building products primarily for use in new home construction, repair and remodeling, and outdoor structure markets. It operates through four segments: Siding; Oriented Strand Board (OSB); Engineered Wood Products (EWP); and South America. The Siding segment offers LP SmartSide trim and siding products, LP SmartSide ExpertFinish trim and siding products, LP BuilderSeries lap siding products, and LP Outdoor Building Solutions; and engineered wood siding, trim, soffit, and fascia products. The OSB segment manufactures and distributes OSB structural panel products comprising LP TechShield radiant barriers, LP WeatherLogic air and water barriers, LP Legacy premium sub-flooring products, LP FlameBlock fire-rated sheathing products, and LP TopNotch sub-flooring products. The EWP segment provides laminated veneer lumber and other related products; and LP SolidStart I-joists, which are primarily used in residential and commercial floorings, roofing systems, and other structural applications. The South America segment manufactures and distributes OSB structural panel and siding products. This segment also distributes and sells related products for the region's transition to wood frame construction. It also offers timber and timberlands and other products and services. The company sells its products primarily to retailers, wholesalers, and homebuilding and industrial businesses in North America and South America, Asia, Australia, and Europe. Louisiana-Pacific Corporation was incorporated in 1972 and is headquartered in Nashville, Tennessee.",
    "ceo": "Mr. William Bradley Southern",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "4300",
    "phone": "615 986 5600",
    "address": "414 Union Street",
    "city": "Nashville",
    "state": "TN",
    "zip": "37219",
    "dcfDiff": 1.86357,
    "dcf": 65.6164,
    "image": "https://financialmodelingprep.com/image-stock/LPX.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]