[
  {
    "symbol": "LRCX",
    "price": 642.18,
    "beta": 1.497183,
    "volAvg": 1369070,
    "mktCap": 86270461200,
    "lastDiv": 6.9,
    "range": "299.59-650.23",
    "changes": -6.98,
    "companyName": "Lam Research Corporation",
    "currency": "USD",
    "cik": "0000707549",
    "isin": "US5128071082",
    "cusip": "512807108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductor Equipment & Materials",
    "website": "https://www.lamresearch.com",
    "description": "Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; SOLA ultraviolet thermal processing products for film treatments; and VECTOR plasma-enhanced CVD ALD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications; and Metryx mass metrology systems for high precision in-line mass measurement in semiconductor wafer manufacturing. The company sells its products and services to semiconductors industry in the United States, China, Europe, Japan, Korea, Southeast Asia, Taiwan, and internationally. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.",
    "ceo": "Mr. Timothy M. Archer",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "18700",
    "phone": "510 572 0200",
    "address": "4650 Cushing Parkway",
    "city": "Fremont",
    "state": "CA",
    "zip": "94538",
    "dcfDiff": 30.7678,
    "dcf": 513.648,
    "image": "https://financialmodelingprep.com/image-stock/LRCX.png",
    "ipoDate": "1984-05-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]