[
  {
    "symbol": "LRLCY",
    "price": 90.61,
    "beta": 0.693103,
    "volAvg": 73922,
    "mktCap": 242466027448,
    "lastDiv": 1.32,
    "range": "58.38-97.64",
    "changes": 1.11,
    "companyName": "L'Oréal S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US5021172037",
    "cusip": "502117203",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Household & Personal Products",
    "website": "https://www.loreal.com",
    "description": "L'Oréal S.A., through its subsidiaries, manufactures and sells cosmetic products for women and men worldwide. The company operates through four divisions: Consumer Products, L'oréal Luxe, Professional Products, and Active Cosmetics. It offers shampoos, hair care products, shower gels, skin care products, cleansers, hair colors, styling products, deodorants, sun care products, make-up, perfumes, etc. The company provides its products under the L'Oréal Paris, Garnier, Maybelline New York, NYX Professional Makeup, Essie, Niely, Dark and Lovely, Lancôme, Yves Saint Laurent Beauté, Giorgio Armani Beauty, Kiehl's, Urban Decay, Biotherm, Ralph Lauren, IT Cosmetics, L'Oréal Professionnel, Kérastase, Redken, Matrix, Biolage, Pureology, Decléor, Carita, Vichy, La Roche-Posay, SkinCeuticals, Roger&Gallet, CeraVe, Stylenanda, Mixa, Magic Mask, Prada, Helena Rubinstein, Valentino, Mugler, Shu Uemura, Viktor&Rolf, Azzaro, Diesel, Atelier Cologne, Cacharel, and Yue Sai brands. It sells its products through distribution channels, such as hair salons, mass-market retail channels, perfumeries, department stores, pharmacies, drugstores, medispas, branded retail, travel retail, and e-commerce. L'Oréal S.A. was founded in 1909 and is headquartered in Clichy, France.",
    "ceo": "Mr. Nicolas  Hieronimus",
    "sector": "Consumer Defensive",
    "country": "FR",
    "fullTimeEmployees": "87369",
    "phone": "33 1 47 56 70 00",
    "address": "41, rue Martre",
    "city": "Clichy",
    "state": null,
    "zip": "92117",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/LRLCY.png",
    "ipoDate": "2007-04-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]