[
  {
    "symbol": "LSPD",
    "price": 16.19,
    "beta": 2.620673,
    "volAvg": 1093670,
    "mktCap": 2450663980,
    "lastDiv": 0,
    "range": "12.45-25.34",
    "changes": 0.58,
    "companyName": "Lightspeed Commerce Inc.",
    "currency": "USD",
    "cik": "0001823306",
    "isin": "CA53229C1077",
    "cusip": "53229C107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.lightspeedhq.com",
    "description": "Lightspeed Commerce Inc. provides commerce enabling Software as a Service (SaaS) platform for small and midsize businesses, retailers, restaurants, and golf course operators in Canada, the United States, Australia, the Netherlands, and internationally. Its SaaS platform enables customers to engage with consumers, manage operations, accept payments, etc. The company's cloud platforms are designed interrelated elements, such as omni-channel consumer experience, a comprehensive back-office operations management suite to improve customers' efficiency and insight, and the facilitation of payments. Its platform functionalities include full omni-channel capabilities, point of sale (POS), product and menu management, employee and inventory management, analytics and reporting, multi-location connectivity, order-ahead and curbside pickup functionality, loyalty, and customer management solutions. The company also offers tailored financial solutions, such as Lightspeed Analytics; Lightspeed Payments; and Lightspeed Capital, a merchant cash advance program. In addition, it sells POS peripheral hardware, including tablets, customer facing displays, receipt printers, networking hardware, cash drawers, payment terminals, servers, stands, bar-code scanners, and an assortment of accessories, as well as provides installation and implementation services. The company was formerly known as Lightspeed POS Inc. and changed its name to Lightspeed Commerce Inc. in August 2021. Lightspeed Commerce Inc. was incorporated in 2005 and is headquartered in Montréal, Canada.",
    "ceo": "Mr. Jean-Paul  Chauvet",
    "sector": "Technology",
    "country": "CA",
    "fullTimeEmployees": "3000",
    "phone": "514 907 1801",
    "address": "Gare Viger",
    "city": "Montreal",
    "state": "QC",
    "zip": "H2Y 1A6",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/LSPD.png",
    "ipoDate": "2020-09-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]