[
  {
    "symbol": "LSTR",
    "price": 192.63,
    "beta": 0.890845,
    "volAvg": 239006,
    "mktCap": 6921793053,
    "lastDiv": 1.2,
    "range": "137.51-194.36",
    "changes": -0.53,
    "companyName": "Landstar System, Inc.",
    "currency": "USD",
    "cik": "0000853816",
    "isin": "US5150981018",
    "cusip": "515098101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Integrated Freight & Logistics",
    "website": "https://www.landstar.com",
    "description": "Landstar System, Inc. provides integrated transportation management solutions in the United States, Canada, Mexico, and internationally. The company operates through two segments: Transportation Logistics, and Insurance. The Transportation Logistics segment offers a range of transportation services, including truckload and less-than-truckload transportation, rail intermodal, air cargo, ocean cargo, expedited ground and air delivery of time-critical freight, heavy-haul/specialized, U.S.-Canada and U.S.-Mexico cross-border, intra-Mexico, intra-Canada, project cargo, and customs brokerage, as well as offers transportation services to other transportation companies, such as third party logistics, small package and less-than-truckload service providers. It provides truck services through dry and specialty vans of various sizes, unsided/platform trailers, temperature-controlled vans, and containers; rail intermodal services through contracts with domestic and Canadian railroads; and air and ocean services through contracts with domestic and international airlines and ocean lines. This segment serves the automotive parts and assemblies, consumer durables, building products, metals, chemicals, foodstuffs, heavy machinery, retail, electronics, and military equipment industries. The Insurance segment reinsures certain risks of the company's independent contractors. The company markets its services through independent commission sales agents and third party capacity providers. Landstar System, Inc. was founded in 1968 and is headquartered in Jacksonville, Florida.",
    "ceo": "Mr. James B. Gattoni",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "1400",
    "phone": "904 398 9400",
    "address": "13410 Sutton Park Drive South",
    "city": "Jacksonville",
    "state": "FL",
    "zip": "32224",
    "dcfDiff": 0.576776,
    "dcf": 173.227,
    "image": "https://financialmodelingprep.com/image-stock/LSTR.png",
    "ipoDate": "1993-03-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]