[
  {
    "symbol": "LTH",
    "price": 19.15,
    "beta": 0,
    "volAvg": 968648,
    "mktCap": 3734977700,
    "lastDiv": 0,
    "range": "8.75-21.75",
    "changes": 0.71,
    "companyName": "Life Time Group Holdings, Inc.",
    "currency": "USD",
    "cik": "0001869198",
    "isin": "US53190C1027",
    "cusip": "53190C102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Leisure",
    "website": "https://www.lifetime.life",
    "description": "Life Time Group Holdings, Inc. provides health, fitness, and wellness experiences to a community of individual members in the United States and Canada. It primarily engages in designing, building, and operating sports and athletic, professional fitness, family recreation, and spa centers in a resort-like environment, principally in suburban and urban locations of metropolitan areas. The company also offers fitness floors with equipment, locker rooms, group fitness studios, indoor and outdoor pools, bistros, indoor and outdoor tennis courts, basketball courts, LifeSpa, LifeCafe, and childcare and Kids Academy learning spaces. Its Life Time Digital provides live streaming fitness classes, remote goal-based personal training, nutrition and weight loss support, curated award-winning health, and fitness and wellness content, as well as access to Apple Fitness+ that offers members content and wellness data monitoring. The company is also involved in media activities, conducting athletic events, and provision of related services. As of December 31, 2021, it operated 151 centers in 29 states and one Canadian Province, 63 of which were owned, including ground leases and 88 of which were leased. The company was formerly known as LTF Holdings, Inc. and changed its name to Life Time Group Holdings, Inc. in June 21, 2021. Life Time Group Holdings, Inc. was founded in 1992 and is headquartered in Chanhassen, Minnesota.",
    "ceo": "Mr. Bahram  Akradi",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "35000",
    "phone": "952 947 0000",
    "address": "2902 Corporate Place",
    "city": "Chanhassen",
    "state": "MN",
    "zip": "55317",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/LTH.png",
    "ipoDate": "2021-10-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]