[
  {
    "symbol": "LTHM",
    "price": 26.38,
    "beta": 1.807082,
    "volAvg": 3280796,
    "mktCap": 4740169440,
    "lastDiv": 0,
    "range": "18.26-36.38",
    "changes": -0.6,
    "companyName": "Livent Corporation",
    "currency": "USD",
    "cik": "0001742924",
    "isin": "US53814L1089",
    "cusip": "53814L108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://livent.com",
    "description": "Livent Corporation manufactures and sells performance lithium compounds primarily used in lithium-based batteries, specialty polymers, and chemical synthesis applications in North America, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. The company offers lithium compounds for use in applications that have specific performance requirements, including battery-grade lithium hydroxide for use in high performance lithium-ion batteries; and butyllithium, which is used in the production of polymers and pharmaceutical products, as well as a range of specialty lithium compounds, including high purity lithium metal, which is used in non-rechargeable batteries and the production of lightweight materials for aerospace applications. It also provides lithium phosphate, pharmaceutical-grade lithium carbonate, high purity lithium chloride, and specialty organics; and lithium carbonate and lithium chloride for use as feedstock in the process of producing performance lithium compounds. The company was incorporated in 2018 and is headquartered in Philadelphia, Pennsylvania.",
    "ceo": "Mr. Paul W. Graves",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "1350",
    "phone": "215 299 5900",
    "address": "1818 Market Street",
    "city": "Philadelphia",
    "state": "PA",
    "zip": "19103",
    "dcfDiff": 3.42044,
    "dcf": 29.4804,
    "image": "https://financialmodelingprep.com/image-stock/LTHM.png",
    "ipoDate": "2018-10-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]