[
  {
    "symbol": "LULU",
    "price": 376.25,
    "beta": 1.397887,
    "volAvg": 1852082,
    "mktCap": 47869910874,
    "lastDiv": 0,
    "range": "258.79-389.06",
    "changes": 1.73,
    "companyName": "Lululemon Athletica Inc.",
    "currency": "USD",
    "cik": "0001397187",
    "isin": "US5500211090",
    "cusip": "550021109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Apparel Retail",
    "website": "https://www.lululemon.com",
    "description": "lululemon athletica inc., together with its subsidiaries, designs, distributes, and retails athletic apparel and accessories for women and men. It operates in two segments, Company-Operated Stores and Direct to Consumer. The company offers pants, shorts, tops, and jackets for healthy lifestyle and athletic activities, such as yoga, running, and training, as well as other sweaty pursuits. It also provides fitness-related accessories and footwear. The company sells its products through a chain of company-operated stores; outlets and warehouse sales; interactive workout platform; a network of wholesale accounts, such as yoga studios, health clubs, and fitness centers; temporary locations; and license and supply arrangements, as well as directly to consumer through mobile apps and lululemon.com e-commerce website. As of January 30, 2022, it operated 574 company-operated stores under the lululemon brand in the United States, Canada, the People's Republic of China, Australia, the United Kingdom, Japan, New Zealand, Germany, South Korea, Singapore, France, Malaysia, Sweden, Ireland, the Netherlands, Norway, and Switzerland. lululemon athletica inc. was founded in 1998 and is based in Vancouver, Canada.",
    "ceo": "Mr. Calvin R. McDonald",
    "sector": "Consumer Cyclical",
    "country": "CA",
    "fullTimeEmployees": "34000",
    "phone": "16047326124",
    "address": "1818 Cornwall Avenue",
    "city": "Vancouver",
    "state": "BC",
    "zip": "V6J 1C7",
    "dcfDiff": 48.1568,
    "dcf": 359.007,
    "image": "https://financialmodelingprep.com/image-stock/LULU.png",
    "ipoDate": "2007-07-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]