[
  {
    "symbol": "LUMN",
    "price": 2.18,
    "beta": 1.007394,
    "volAvg": 23565756,
    "mktCap": 2189439365,
    "lastDiv": 0.25,
    "range": "1.74-11.38",
    "changes": 0.09,
    "companyName": "Lumen Technologies, Inc.",
    "currency": "USD",
    "cik": "0000018926",
    "isin": "US5502411037",
    "cusip": "550241103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.lumen.com",
    "description": "Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services under the Lumen, Quantum Fiber, and CenturyLink brands to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers compute and application services, such as cloud services, IT solutions, unified communication and collaboration solutions, colocation and data center services, content delivery services, and managed security services; and IP and data services, including VPN data network, Ethernet, internet protocol (IP), and voice over internet protocol. The company also provides fiber infrastructure services comprising high bandwidth optical wavelength networks; and unlit optical fiber and related professional services. In addition, it offers voice and other services, including private line services, a direct circuit or channel specifically dedicated for connecting two or more organizational sites; a portfolio of traditional time division multiplexing voice services; and synchronous optical network-based Ethernet, legacy data hosting services, and conferencing services. As of December 31, 2021, the company served approximately 4.5 million broadband subscribers. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.",
    "ceo": "Ms. Kathleen E. Johnson",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "30000",
    "phone": "318 388 9000",
    "address": "100 CenturyLink Drive",
    "city": "Monroe",
    "state": "LA",
    "zip": "71203",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/LUMN.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]