[
  {
    "symbol": "LUV",
    "price": 35.47,
    "beta": 1.14507,
    "volAvg": 7019446,
    "mktCap": 21107240161,
    "lastDiv": 0.72,
    "range": "28.4-41.76",
    "changes": 0.22,
    "companyName": "Southwest Airlines Co.",
    "currency": "USD",
    "cik": "0000092380",
    "isin": "US8447411088",
    "cusip": "844741108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Airlines",
    "website": "https://www.southwest.com",
    "description": "Southwest Airlines Co. operates as a passenger airline company that provide scheduled air transportation services in the United States and near-international markets. As of December 31, 2021, the company operated a total fleet of 728 Boeing 737 aircrafts; and served 121 destinations in 42 states, the District of Columbia, and the Commonwealth of Puerto Rico, as well as 10 near-international countries, including Mexico, Jamaica, the Bahamas, Aruba, the Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos. It also provides inflight entertainment and connectivity services on Wi-Fi enabled aircrafts; and Rapid Rewards loyalty program that enables program members to earn points for dollars spent on Southwest base fares. In addition, the company offers a suite of digital platforms to support customers' travel needs, including websites and apps; and SWABIZ, an online booking tool. Further, it provides ancillary services, such as Southwest's EarlyBird Check-In, upgraded boarding, and transportation of pets and unaccompanied minors. The company was incorporated in 1967 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Robert E. Jordan",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "69868",
    "phone": "214 792 4000",
    "address": "PO Box 36611",
    "city": "Dallas",
    "state": "TX",
    "zip": "75235-1611",
    "dcfDiff": 22.0701,
    "dcf": 58.3101,
    "image": "https://financialmodelingprep.com/image-stock/LUV.png",
    "ipoDate": "1980-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]