[
  {
    "symbol": "LVMUY",
    "price": 185.72,
    "beta": 1.0318,
    "volAvg": 164738,
    "mktCap": 464041834342,
    "lastDiv": 2.6,
    "range": "114.26-199.75",
    "changes": 0.54,
    "companyName": "LVMH Moët Hennessy - Louis Vuitton, Société Européenne",
    "currency": "USD",
    "cik": "0000824046",
    "isin": "US5024413065",
    "cusip": "502441306",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Luxury Goods",
    "website": "https://www.lvmh.com",
    "description": "LVMH Moët Hennessy - Louis Vuitton, Société Européenne operates as a luxury goods company worldwide. The company offers champagnes, wines, and spirits under the Clos des Lambrays, Château d'Yquem, Dom Pérignon, Ruinart, Moët & Chandon, Hennessy, Veuve Clicquot, Ardbeg, Château Cheval Blanc, Glenmorangie, Krug, Mercier, Chandon, Cape Mentelle, Newton Vineyard, Cloudy Bay, Belvedere, Terrazas de los Andes, Bodega Numanthia, Cheval des Andes, Woodinville, Ao Yun, Clos19, and Volcan de mi Tierra brands. It also provides fashion and leather products under the Berluti, Celine, Christian Dior, Emilio Pucci, FENDI, Givenchy, Kenzo, Loewe, Loro Piana, Louis Vuitton, Marc Jacobs, Moynat, Patou, and RIMOWA brands. In addition, the company offers perfumes and cosmetics under the Acqua di Parma, Benefit Cosmetics, Cha Ling, Fenty Beauty by Rihanna, Fresh, Givenchy Parfums, Guerlain, KVD Beauty, Kenzo Parfums, Maison Francis Kurkdjian, Make Up For Ever, Marc Jacobs Beauty, Officine Universelle Buly, Parfums Christian Dior, and Perfumes Loewe brands; watches and jewelry under the Bulgari, Chaumet, Fred, Hublot, Repossi, TAG Heuer, Tiffany & Co., and Zenith brands; and custom-designed yachts under the Feadship brand name, as well as designs and builds luxury yachts under the Royal Van Lent brand. Further, it provides daily newspapers under the Les Échos brand; Belmond, a luxury tourism service; home other activities under the Belmond, Cheval Blanc, Connaissance des Arts, Cova, Investir, Jardin d'Acclimatation, La Samaritaine, Le Parisien, and Radio Classique brands; and selective retailing products under the DFS, La Grande Epicerie de Paris, Le Bon Marché Rive Gauche, Sephora, and Starboard Cruise Services brands, as well as operates Jardin d'Acclimatation, a leisure and amusement park. The company operates 5,556 stores. LVMH Moët Hennessy - Louis Vuitton, Société Européenne was incorporated in 1923 and is headquartered in Paris, France.",
    "ceo": "Mr. Bernard  Arnault",
    "sector": "Consumer Cyclical",
    "country": "FR",
    "fullTimeEmployees": "173492",
    "phone": "33 1 44 13 22 22",
    "address": "22, Avenue Montaigne",
    "city": "Paris",
    "state": null,
    "zip": "75008",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/LVMUY.png",
    "ipoDate": "2006-01-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]