[
  {
    "symbol": "LYB",
    "price": 90.83,
    "beta": 1.221126,
    "volAvg": 1952503,
    "mktCap": 29544635967,
    "lastDiv": 4.82,
    "range": "71.46-101.3",
    "changes": 0.54,
    "companyName": "LyondellBasell Industries N.V.",
    "currency": "USD",
    "cik": "0001489393",
    "isin": "NL0009434992",
    "cusip": "N53745100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.lyondellbasell.com",
    "description": "LyondellBasell Industries N.V. operates as a chemical company in the United States, Germany, Mexico, Italy, Poland, France, Japan, China, the Netherlands, and internationally. The company operates in six segments: Olefins and PolyolefinsAmericas; Olefins and PolyolefinsEurope, Asia, International; Intermediates and Derivatives; Advanced Polymer Solutions; Refining; and Technology. It produces and markets olefins and co-products; polyolefins; polyethylene products, which consist of high density polyethylene, low density polyethylene, and linear low density polyethylene; and polypropylene (PP) products, such as PP homopolymers and copolymers. The company also produces and sells propylene oxide and its derivatives; oxyfuels and related products; and intermediate chemicals, such as styrene monomers, acetyls, ethylene glycols, and ethylene oxides and derivatives. In addition, it produces and markets compounds and solutions, such as polypropylene compounds, engineered plastics, masterbatches, engineered composites, colors, and powders; and advanced polymers. Further, the company refines crude oil and other crude oils of varied types and sources into gasoline and distillates; develops and licenses chemical and polyolefin process technologies; and manufactures and sells polyolefin catalysts. LyondellBasell Industries N.V. was incorporated in 2009 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Peter Z. E. Vanacker",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "19300",
    "phone": "713 309 7200",
    "address": "LyondellBasell Tower",
    "city": "Houston",
    "state": "TX",
    "zip": "77010",
    "dcfDiff": 7.88282,
    "dcf": 87.6672,
    "image": "https://financialmodelingprep.com/image-stock/LYB.png",
    "ipoDate": "2010-04-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]