[
  {
    "symbol": "LYFT",
    "price": 10.45,
    "beta": 1.74432,
    "volAvg": 17914516,
    "mktCap": 3861484000,
    "lastDiv": 0,
    "range": "7.85-21.52",
    "changes": 0.6,
    "companyName": "Lyft, Inc.",
    "currency": "USD",
    "cik": "0001759509",
    "isin": "US55087P1049",
    "cusip": "55087P104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.lyft.com",
    "description": "Lyft, Inc. operates a peer-to-peer marketplace for on-demand ridesharing in the United States and Canada. The company operates multimodal transportation networks that offer riders personalized and on-demand access to various mobility options. It provides Ridesharing Marketplace, which connects drivers with riders; Express Drive, a flexible car rentals program for drivers; Lyft Rentals that provides vehicles for long-distance trips; and a network of shared bikes and scooters in various cities to address the needs of riders for short trips. The company also integrates third-party public transit data into the Lyft app to offer riders various transportation options. In addition, it offers access to autonomous vehicles; centralized tools and enterprise transportation solutions, such as concierge transportation solutions for organizations; Lyft Pink subscription plans; Lyft Pass commuter programs; first-mile and last-mile services; and university safe rides programs. The company was formerly known as Zimride, Inc. and changed its name to Lyft, Inc. in April 2013. Lyft, Inc. was incorporated in 2007 and is headquartered in San Francisco, California.",
    "ceo": "Mr. John David Risher",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "4419",
    "phone": "844 250 2773",
    "address": "185 Berry Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94107",
    "dcfDiff": 3.66504,
    "dcf": 12.515,
    "image": "https://financialmodelingprep.com/image-stock/LYFT.png",
    "ipoDate": "2019-03-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]