[
  {
    "symbol": "LYG",
    "price": 2.12,
    "beta": 1.229501,
    "volAvg": 10457588,
    "mktCap": 34388944814,
    "lastDiv": 0.11,
    "range": "1.7-2.63",
    "changes": -0.02,
    "companyName": "Lloyds Banking Group plc",
    "currency": "USD",
    "cik": "0001160106",
    "isin": "US5394391099",
    "cusip": "539439109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.lloydsbankinggroup.com",
    "description": "Lloyds Banking Group plc, together with its subsidiaries, provides a range of banking and financial services in the United Kingdom. It operates through three segments: Retail; Commercial Banking; and Insurance and Wealth. The Retail segment offers a range of financial service products, including current accounts, savings, mortgages, motor finance, unsecured loans, leasing solutions, and credit cards to personal and small business customers. The Commercial Banking segment provides lending, transactional banking, working capital management, risk management, debt financing, and debt capital market services to small and medium-sized entities, corporates, and financial institutions. The Insurance and Wealth segment offers insurance, investment and wealth management products and services. It also provides digital banking services. The company offers its products and services under the Lloyds Bank, Halifax, Bank of Scotland, and Scottish Widows brands. Lloyds Banking Group plc was founded in 1695 and is based in London, the United Kingdom.",
    "ceo": "Mr. Charles Alan Nunn",
    "sector": "Financial Services",
    "country": "GB",
    "fullTimeEmployees": "59354",
    "phone": "44 20 7626 1500",
    "address": "25 Gresham Street",
    "city": "London",
    "state": null,
    "zip": "EC2V 7HN",
    "dcfDiff": 3.8677,
    "dcf": 6.4677,
    "image": "https://financialmodelingprep.com/image-stock/LYG.png",
    "ipoDate": "2001-11-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]