[
  {
    "symbol": "LYV",
    "price": 88.72,
    "beta": 1.279929,
    "volAvg": 1772691,
    "mktCap": 20395930230,
    "lastDiv": 0,
    "range": "64.25-99.66",
    "changes": 0.65,
    "companyName": "Live Nation Entertainment, Inc.",
    "currency": "USD",
    "cik": "0001335258",
    "isin": "US5380341090",
    "cusip": "538034109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Entertainment",
    "website": "https://www.livenationentertainment.com",
    "description": "Live Nation Entertainment, Inc. operates as a live entertainment company. It operates through Concerts, Ticketing, and Sponsorship & Advertising segments. The Concerts segment promotes live music events in its owned or operated venues, and in rented third-party venues; operates and manages music venues; produces music festivals; creates associated content; and offers management and other services to artists. The Ticketing segment manages the ticketing operations, including the provision of ticketing software and services to clients for tickets and event information through its primary websites livenation.com and ticketmaster.com, as well as provides ticket resale services. This segment sells tickets for its events, as well as for third-party clients in various live event categories, such as arenas, stadiums, amphitheaters, music clubs, concert promoters, professional sports franchises and leagues, college sports teams, performing arts venues, museums, and theaters through websites, mobile apps, and ticket outlets. The Sponsorship & Advertising segment sells international, national, and local sponsorships and placement of advertising, including signage, promotional programs, rich media offering that comprise advertising related with live streaming and music-related content; and ads across its distribution network of venues, events, and websites. This segment also manages the development of strategic sponsorship programs, as well as develops, books, and produces custom events or programs for specific brands. As of December 31, 2021, it owned, operated, or leased 165 entertainment venues in North America and 94 entertainment venues internationally. The company was formerly known as Live Nation, Inc. and changed its name to Live Nation Entertainment, Inc. in January 2010. Live Nation Entertainment, Inc. was incorporated in 2005 and is headquartered in Beverly Hills, California.",
    "ceo": "Mr. Michael  Rapino",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "12800",
    "phone": "310 867 7000",
    "address": "9348 Civic Center Drive",
    "city": "Beverly Hills",
    "state": "CA",
    "zip": "90210",
    "dcfDiff": 9.59177,
    "dcf": 89.9518,
    "image": "https://financialmodelingprep.com/image-stock/LYV.png",
    "ipoDate": "2005-12-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]