[
  {
    "symbol": "MAIN",
    "price": 39.21,
    "beta": 1.30669,
    "volAvg": 346417,
    "mktCap": 3155099464,
    "lastDiv": 2.76,
    "range": "31.66-45.67",
    "changes": 0.36,
    "companyName": "Main Street Capital Corporation",
    "currency": "USD",
    "cik": "0001396440",
    "isin": "US56035L1044",
    "cusip": "56035L104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.mainstcapital.com",
    "description": "Main Street Capital Corporation is a business development company specializes in equity capital to lower middle market companies. The firm specializing in recapitalizations, management buyouts, refinancing, family estate planning, management buyouts, refinancing, industry consolidation, mature, later stage emerging growth. The firm also provides debt capital to middle market companies for acquisitions, management buyouts, growth financings, recapitalizations and refinancing. The firm seeks to partner with entrepreneurs, business owners and management teams and generally provides \"one stop\" financing alternatives within its lower middle market portfolio. It prefers to invest in air freight and logistics, auto components, building products, chemicals, commercial services, computers, construction and engineering, consumer finance, consumer services, electronic equipment, energy equipment and services, financial services, health care equipment, health care providers, hotels, restaurants, and leisure, internet software and services, IT Services, machinery, oil, gas and consumable fuels, paper and forest products, professional and industrial services, road and rail, software, specialty retail, telecommunication, consumer discretionary, energy, materials, technology, and transportation. The firm typically invests in lower middle market companies generally with annual revenues between $5 million and $300 million. It prefers to invest in ranging between $2 million and $75 million in equity investment and enterprise value in ranging between $3 million and $20 million. The firm typically prefers to invest in the range of $5 million and $50 million per transaction in debt investment value and in the range of $1 million and $20 million in annual EBITDA. The firm's middle market debt investments are made in businesses that are generally larger in size than its lower middle market portfolio companies. It takes 5 percent minority and up to 50 percent majority equity investments. Main Street Capital Corporation was founded in 2007 and is based in Houston, Texas with an additional office in Chojnów, Poland.",
    "ceo": "Mr. Dwayne Louis Hyzak CPA",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "91",
    "phone": "713 350 6000",
    "address": "1300 Post Oak Boulevard",
    "city": "Houston",
    "state": "TX",
    "zip": "77056",
    "dcfDiff": 1.09341,
    "dcf": 38.4866,
    "image": "https://financialmodelingprep.com/image-stock/MAIN.png",
    "ipoDate": "2007-10-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]