[
  {
    "symbol": "MAN",
    "price": 79.21,
    "beta": 1.654577,
    "volAvg": 377793,
    "mktCap": 3994251381,
    "lastDiv": 2.94,
    "range": "64.0-92.43",
    "changes": -0.21,
    "companyName": "ManpowerGroup Inc.",
    "currency": "USD",
    "cik": "0000871763",
    "isin": "US56418H1005",
    "cusip": "56418H100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Staffing & Employment Services",
    "website": "https://www.manpowergroup.com",
    "description": "ManpowerGroup Inc. provides workforce solutions and services in the Americas, Southern Europe, Northern Europe, and the Asia Pacific Middle East region. The company offers recruitment services, including permanent, temporary, and contract recruitment of professionals, as well as administrative and industrial positions under the Manpower and Experis brands. It also offers various assessment services; training and development services; career management; and outsourcing services related to human resources functions primarily in the areas of large-scale recruiting and workforce-intensive initiatives. In addition, the company provides workforce consulting services; contingent staffing and permanent recruitment services; professional resourcing and project-based solutions in information technology, engineering, and finance fields; solutions in the areas of organizational efficiency, individual development, and career mobility; and recruitment process outsourcing, TAPFIN managed, and talent based outsourcing services, as well as Proservia services in the areas of digital services market and IT infrastructure sector. It operates through a network of approximately 2,200 offices in 75 countries and territories. The company was incorporated in 1948 and is based in Milwaukee, Wisconsin.",
    "ceo": "Mr. Jonas  Prising",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "30900",
    "phone": "414 961 1000",
    "address": "100 Manpower Place",
    "city": "Milwaukee",
    "state": "WI",
    "zip": "53212",
    "dcfDiff": 14.312,
    "dcf": 101.512,
    "image": "https://financialmodelingprep.com/image-stock/MAN.png",
    "ipoDate": "1988-10-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]