[
  {
    "symbol": "MANH",
    "price": 191.83,
    "beta": 1.579225,
    "volAvg": 341348,
    "mktCap": 11898716142,
    "lastDiv": 0,
    "range": "106.02-194.8",
    "changes": 2.03,
    "companyName": "Manhattan Associates, Inc.",
    "currency": "USD",
    "cik": "0001056696",
    "isin": "US5627501092",
    "cusip": "562750109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.manh.com",
    "description": "Manhattan Associates, Inc. develops, sells, deploys, services, and maintains software solutions to manage supply chains, inventory, and omni-channel operations. It offers Manhattan SCALE, a portfolio of logistics execution solutions that provide trading partner management, yard management, optimization, warehouse management, and transportation execution services; and Manhattan Active, a set of enterprise and store omni-channel solutions. The company also provides inventory optimization, planning, and allocation solutions; maintenance services comprising customer support services and software enhancements; professional services, such as solutions planning and implementation, and related consulting services; and training and change management services. In addition, it resells computer hardware, radio frequency terminal networks, radio frequency identification chip readers, bar code printers and scanners, and other peripherals. The company offers products through direct sales personnel, as well as through partnership agreements with various organizations. It serves grocery, food and beverage, manufacturing, medical and pharmaceutical, retail, third-party logistics, and wholesale industries. The company operates in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Manhattan Associates, Inc. was founded in 1990 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. Eddie  Capel",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "4340",
    "phone": "770 955 7070",
    "address": "2300 Windy Ridge Parkway",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30339",
    "dcfDiff": 3.33028,
    "dcf": 124.35,
    "image": "https://financialmodelingprep.com/image-stock/MANH.png",
    "ipoDate": "1998-04-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]