[
  {
    "symbol": "MANU",
    "price": 25.12,
    "beta": 0.67183,
    "volAvg": 1916575,
    "mktCap": 4094635561,
    "lastDiv": 0.18,
    "range": "10.41-27.34",
    "changes": 1.12,
    "companyName": "Manchester United plc",
    "currency": "USD",
    "cik": "0001549107",
    "isin": "KYG5784H1065",
    "cusip": "G5784H106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Entertainment",
    "website": "https://www.manutd.com",
    "description": "Manchester United plc, together with its subsidiaries, owns and operates a professional sports team in the United Kingdom. The company operates Manchester United Football Club, a professional football club. It develops marketing and sponsorship relationships with international and regional companies to leverage its brand. The company also markets and sells sports apparel, training and leisure wear, and other clothing featuring the Manchester United brand; and sells other licensed products, such as coffee mugs and bed spreads featuring the Manchester United brand and trademarks, as well as distributes these products through Manchester United branded retail centers and e-commerce platforms, and through the company's partners' wholesale distribution channels. In addition, it distributes live football content directly, as well as through commercial partners; broadcasts television rights relating to the Premier League, Union of European Football Associations club competitions, and other competitions; and delivers Manchester United programming through MUTV television channel to territories worldwide. Further, the company offers a direct to consumer subscription mobile application; and operates Old Trafford, a sports venue with 74,239 seats, as well as invests in properties. Manchester United plc was founded in 1878 and is based in Manchester, the United Kingdom.",
    "ceo": "Mr. Richard  Arnold",
    "sector": "Communication Services",
    "country": "GB",
    "fullTimeEmployees": "1035",
    "phone": "44 16 1868 8000",
    "address": "Sir Matt Busby Way",
    "city": "Manchester",
    "state": null,
    "zip": "M16 0RA",
    "dcfDiff": 9.07086,
    "dcf": 13.7091,
    "image": "https://financialmodelingprep.com/image-stock/MANU.png",
    "ipoDate": "2012-08-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]