[
  {
    "symbol": "MARUY",
    "price": 173.03,
    "beta": 1.022605,
    "volAvg": 17877,
    "mktCap": 29257124994,
    "lastDiv": 5.65,
    "range": "83.68-187.55",
    "changes": 2.76,
    "companyName": "Marubeni Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US5738102079",
    "cusip": "573810207",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Conglomerates",
    "website": "https://www.marubeni.com",
    "description": "Marubeni Corporation engages in various business activities worldwide. The company trades in grains, feed ingredients, compound feeds, foods, agricultural and fishery products, and fresh and processed meat; and apparel, footwear, lifestyle, and textile and industrial materials. It also provides agri-inputs, contracting services for fertilizer application and crop protection products, technical services, crop protection product formulations, fertilizers, and oilseeds; ICT and real estate services; petrochemicals and plastics, salts and chlor-alkalis, life science products, electronic materials, and inorganic mineral resources and chemicals; and wood chips, biomass fuels, pulp and waste papers, paper, paperboards, sanitary, and building and construction materials, as well as wood products. In addition, the company explores for, develops, and produces oil and gas; trades in, distributes, and markets petroleum and LPG; develops uranium, nuclear fuel cycle, iron ore, coal, and copper mines, as well as related equipment sales and services; smelts and refines aluminum and magnesium; trades in iron ore, coking coal, non-ferrous metals, ingots and related products, and steel products; and leases temporary steel construction materials. Further, it offers engineering, procurement, and construction, as well as operation and maintenance services for railway systems, water, industrial plants, and waste-to-energy power plants; energy and transportation infrastructure, and water business; and manages infrastructure funds, as well as engages in the power generation, renewable energy, power service and retail, natural gas, hydrogen, ammonia, municipal solid waste, and thermal energy storage businesses. Additionally, it owns, purchases, operates, leases, sells, and charters aerospace and ship products; and sells, trades in, leases, finances, and services construction and industrial machinery, and mobility products. The company was founded in 1858 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Masumi  Kakinoki",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": null,
    "phone": "81 3 3282 2111",
    "address": "4-2, Ohtemachi 1-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "100-8088",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MARUY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]