[
  {
    "symbol": "MAT",
    "price": 18.98,
    "beta": 1.171478,
    "volAvg": 2397937,
    "mktCap": 6718103708,
    "lastDiv": 16.577928000000004,
    "range": "15.36-24.38",
    "changes": 0.53,
    "companyName": "Mattel, Inc.",
    "currency": "USD",
    "cik": "0000063276",
    "isin": "US5770811025",
    "cusip": "577081102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Leisure",
    "website": "https://www.mattel.com",
    "description": "Mattel, Inc., a children's entertainment company, designs and produces toys and consumer products worldwide. The company operates through North America, International, and American Girl segments. It offers dolls and accessories, as well as content, gaming, and lifestyle products for children under the Barbie, Monster High, American Girl, Polly Pocket, Spirit, and Enchantimals brands; dolls and books under the American Girl brand name; die-cast vehicles, tracks, playsets, and accessories for kids of all ages, and collectors under the Hot Wheels, Monster Trucks, Matchbox, CARS, and Mario Kart brand names; and infant, toddler, and preschool products comprising content, toys, live events, and other lifestyle products under the Fisher-Price and Thomas & Friends, Power wheels, and Fireman Sam brands. The company also provides action figures, building sets, and games under the Masters of the Universe, MEGA, UNO, Lightyear, Jurassic World, WWE, and Star Wars brands; and licensor partner brands, including Disney, NBCUniversal, WWE, Microsoft, Nickelodeon, Warner Bros, and Sanrio. It sells its products directly to consumers through its catalog, website, and proprietary retail stores; retailers, including discount and free-standing toy stores, chain stores, department stores, and other retail outlets; and wholesalers, as well as through agents and distributors. Mattel, Inc. was founded in 1945 and is headquartered in El Segundo, California.",
    "ceo": "Mr. Ynon  Kreiz",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "33900",
    "phone": "310 252 2000",
    "address": "333 Continental Boulevard",
    "city": "El Segundo",
    "state": "CA",
    "zip": "90245-5012",
    "dcfDiff": 1.2149,
    "dcf": 18.9451,
    "image": "https://financialmodelingprep.com/image-stock/MAT.png",
    "ipoDate": "1976-06-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]