[
  {
    "symbol": "MAWHY",
    "price": 12.675,
    "beta": 1.915708,
    "volAvg": 35,
    "mktCap": 2475782400,
    "lastDiv": 0.64,
    "range": "12.41-23.05",
    "changes": -0.815,
    "companyName": "Man Wah Holdings Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Furnishings, Fixtures & Appliances",
    "website": "https://www.manwahholdings.com",
    "description": "Man Wah Holdings Limited, an investment holding company, engages in the manufacture, wholesale, trading, and distribution of sofas and ancillary products in the People's Republic of China, North America, Europe, and internationally. The company operates through Sofa and Ancillary Products, Other Products, Other Business, and Home Group Business segments. It offers mattresses, smart furniture spare parts, and metal mechanism for recliners. The company is also involved in the production and sale of chairs and other products to high-speed railways, cinema chains, and other commercial customers; advertising and marketing of home furnishing products; property investment business; operation, leasing, and management of furniture malls; manufacturing and trading of bedding products, other furniture, and furniture components, as well as foam products; and research and production of smart drive machines and electric regulators. In addition, it offers property management and development services; offshore sales, business consultancy, and back-office support services; business management, advertising, and design services; and marketing, logistics, and warehousing services. The company also operates hotel; and sells residential properties. As of March 31, 2022, it had a total of 5,968 brand stores in China. The company was founded in 1992 and is based in Fo Tan, Hong Kong. Man Wah Holdings Limited is a subsidiary of Man Wah Investments Limited.",
    "ceo": "Mr. Man Li  Wong BBS",
    "sector": "Consumer Cyclical",
    "country": "HK",
    "fullTimeEmployees": "25832",
    "phone": null,
    "address": "Wah Lai Industrial Center",
    "city": "Fo Tan",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MAWHY.png",
    "ipoDate": "2011-04-06",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]