[
  {
    "symbol": "MBLY",
    "price": 38.12,
    "beta": 0,
    "volAvg": 3408733,
    "mktCap": 30711834373,
    "lastDiv": 0,
    "range": "24.85-48.11",
    "changes": 0.59,
    "companyName": "Mobileye Global Inc.",
    "currency": "USD",
    "cik": "0001910139",
    "isin": null,
    "cusip": null,
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Auto Parts",
    "website": "https://www.mobileye.com",
    "description": "Mobileye Global Inc. engages in the development and deployment of advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company offers Driver Assist, which comprise ADAS and autonomous vehicle solutions that covers safety features, such as real-time detection of road users, geometry, semantics, and markings to provide safety alerts and emergency interventions; Cloud-Enhanced Driver Assist, a solution for drivers with interpretations of a scene in real-time; Mobileye SuperVision Lite, a driver assist solution; and Mobileye SuperVision, an operational point-to-point assisted driving navigation solution on various road types and includes cloud-based enhancements, such as road experience management and supports over-the-air updates. It also provides Mobileye Chauffeur, a generation solution; and Mobileye Drive, a Level 4 solution, which comprise a set of autonomous driving technology solutions, such as Self-Driving System & Vehicles and Autonomous Mobility as a Service. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Overseas Funding Corporation.",
    "ceo": "Prof. Amnon  Shashua",
    "sector": "Consumer Cyclical",
    "country": "IL",
    "fullTimeEmployees": "3500",
    "phone": "972 2 541 7333",
    "address": "Har Hotzvim",
    "city": "Jerusalem",
    "state": null,
    "zip": "9777513",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MBLY.png",
    "ipoDate": "2022-10-26",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]