[
  {
    "symbol": "MCHP",
    "price": 85.88,
    "beta": 1.564084,
    "volAvg": 4853885,
    "mktCap": 46837577920,
    "lastDiv": 1.53,
    "range": "54.33-87.76",
    "changes": -0.9,
    "companyName": "Microchip Technology Incorporated",
    "currency": "USD",
    "cik": "0000827054",
    "isin": "US5950171042",
    "cusip": "595017104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.microchip.com",
    "description": "Microchip Technology Incorporated develops, manufactures, and sells smart, connected, and secure embedded control solutions in the Americas, Europe, and Asia. The company offers general purpose 8-bit, 16-bit, and 32-bit microcontrollers; 32-bit embedded microprocessors markets; and specialized microcontrollers for automotive, industrial, computing, communications, lighting, power supplies, motor control, human machine interface, security, wired connectivity, and wireless connectivity applications. It also provides development tools that enable system designers to program microcontroller and microprocessor products for specific applications; field-programmable gate array (FPGA) products; and analog, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products. In addition, the company offers memory products consisting of serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and NVM technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, and aerospace products. Microchip Technology Incorporated was incorporated in 1989 and is headquartered in Chandler, Arizona.",
    "ceo": "Mr. Ganesh  Moorthy",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "22600",
    "phone": "480 792 7200",
    "address": "2355 West Chandler Boulevard",
    "city": "Chandler",
    "state": "AZ",
    "zip": "85224-6199",
    "dcfDiff": 4.91263,
    "dcf": 72.7674,
    "image": "https://financialmodelingprep.com/image-stock/MCHP.png",
    "ipoDate": "1993-03-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]