[
  {
    "symbol": "MCK",
    "price": 415.21,
    "beta": 0.588732,
    "volAvg": 929677,
    "mktCap": 56266349408,
    "lastDiv": 2.16,
    "range": "315.78-419.33",
    "changes": 0.48,
    "companyName": "McKesson Corporation",
    "currency": "USD",
    "cik": "0000927653",
    "isin": "US58155Q1031",
    "cusip": "58155Q103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Distribution",
    "website": "https://www.mckesson.com",
    "description": "McKesson Corporation provides healthcare services in the United States and internationally. It operates through four segments: U.S. Pharmaceutical, International, Medical-Surgical Solutions, and Prescription Technology Solutions (RxTS). The U.S. Pharmaceutical segment distributes branded, generic, specialty, biosimilar, and over-the-counter pharmaceutical drugs and other healthcare-related products. This segment also provides practice management, technology, clinical support, and business solutions to community-based oncology and other specialty practices; and consulting, outsourcing, technological, and other services, as well as sells financial, operational, and clinical solutions to pharmacies. The International segment offers distribution and services to wholesale, institutional, and retail customers in 13 European countries and Canada. The Medical-Surgical Solutions segment provides medical-surgical supply distribution, logistics, and other services to healthcare providers. The RxTS segment serves biopharma and life sciences partners and patients to address medication challenges for patients throughout their journeys; connects pharmacies, providers, payers, and biopharma companies to deliver innovative access and adherence solutions; and provides third-party logistics and wholesale distribution support solutions. McKesson Corporation was founded in 1833 and is headquartered in Irving, Texas.",
    "ceo": "Mr. Brian S. Tyler Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "45000",
    "phone": "972 446 4800",
    "address": "6555 State Highway 161",
    "city": "Irving",
    "state": "TX",
    "zip": "75039",
    "dcfDiff": 30.3298,
    "dcf": 409.53,
    "image": "https://financialmodelingprep.com/image-stock/MCK.png",
    "ipoDate": "1994-11-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]