[
  {
    "symbol": "MCO",
    "price": 341.59,
    "beta": 1.294014,
    "volAvg": 738229,
    "mktCap": 62681765000,
    "lastDiv": 3.08,
    "range": "230.16-351.06",
    "changes": 2.76,
    "companyName": "Moody's Corporation",
    "currency": "USD",
    "cik": "0001059556",
    "isin": "US6153691059",
    "cusip": "615369105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Financial Data & Stock Exchanges",
    "website": "https://www.moodys.com",
    "description": "Moody's Corporation operates as an integrated risk assessment firm worldwide. It operates in two segments, Moody's Investors Service and Moody's Analytics. The Moody's Investors Service segment publishes credit ratings and provides assessment services on various debt obligations, programs and facilities, and entities that issue such obligations, such as various corporate, financial institution, and governmental obligations, as well as and structured finance securities. This segment provides ratings in approximately 140 countries. Its ratings are disseminated through press releases to the public through electronic media, including the internet and real-time information systems used by securities traders and investors. This segment has rated approximately 5,000 non-financial corporates; 3,600 financial institutions; 16,000 public finance issuers; 145 sovereigns; 47 supranational institutions; 459 sub-sovereigns; and 1,000 infrastructure and project finance issuers, as well as 9,100 structured finance deals. The Moody's Analytics segment develops a range of products and services that support the risk management activities of institutional participants in financial markets; and offers subscription based research, data, and analytical products comprising credit ratings, credit research, quantitative credit scores and other analytical tools, economic research and forecasts, business intelligence and company information products, commercial real estate data and analytical tools, and on-line and classroom-based training services, as well as credentialing and certification services. It also offers offshore analytical and research services with learning solutions and certification programs; and software solutions, as well as related risk management services. The company was formerly known as Dun and Bradstreet Company and changed its name to Moody's Corporation in September 2000. Moody's Corporation was founded in 1900 and is headquartered in New York, New York.",
    "ceo": "Mr. Robert Scott Fauber",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "14419",
    "phone": "212 553 0300",
    "address": "7 World Trade Center",
    "city": "New York",
    "state": "NY",
    "zip": "10007",
    "dcfDiff": 18.0019,
    "dcf": 301.578,
    "image": "https://financialmodelingprep.com/image-stock/MCO.png",
    "ipoDate": "1994-10-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]