[
  {
    "symbol": "MDLZ",
    "price": 73.22,
    "beta": 0.66514,
    "volAvg": 5914561,
    "mktCap": 99714655828,
    "lastDiv": 1.54,
    "range": "54.72-78.59",
    "changes": -0.71,
    "companyName": "Mondelez International, Inc.",
    "currency": "USD",
    "cik": "0001103982",
    "isin": "US6092071058",
    "cusip": "609207105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Confectioners",
    "website": "https://www.mondelezinternational.com",
    "description": "Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits, including cookies, crackers, and salted snacks; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's snack brand portfolio includes Cadbury, Milka, and Toblerone chocolates; Oreo, belVita, and LU biscuits; Halls candies; Trident gums; and Tang powdered beverages. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, third party distributors, and other facilities, as well as through independent sales offices and agents, and e-commerce channels. The company was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. Mondelez International, Inc. was incorporated in 2000 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Dirk  Van de Put",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "91000",
    "phone": "847 943 4000",
    "address": "905 West Fulton Market",
    "city": "Chicago",
    "state": "IL",
    "zip": "60607",
    "dcfDiff": 3.60799,
    "dcf": 68.328,
    "image": "https://financialmodelingprep.com/image-stock/MDLZ.png",
    "ipoDate": "2001-06-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]