[
  {
    "symbol": "MDT",
    "price": 86.36,
    "beta": 0.721478,
    "volAvg": 5954035,
    "mktCap": 114894206218,
    "lastDiv": 2.76,
    "range": "75.77-95.6",
    "changes": -0.79,
    "companyName": "Medtronic plc",
    "currency": "USD",
    "cik": "0001613103",
    "isin": "IE00BTN1Y115",
    "cusip": "585055106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.medtronic.com",
    "description": "Medtronic plc develops, manufactures, and sells device-based medical therapies to healthcare systems, physicians, clinicians, and patients worldwide. Its Cardiovascular Portfolio segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; cardiac ablation products; insertable cardiac monitor systems; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves, surgical valve replacement and repair products, endovascular stent grafts and accessories, and transcatheter pulmonary valves; and percutaneous coronary intervention products, percutaneous angioplasty balloons, and products. The company's Medical Surgical Portfolio segment offers surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, surgical artificial intelligence and robotic-assisted surgery products, hernia mechanical devices, mesh implants, gynecology and lung products, and various therapies to treat diseases, as well as products in the fields of minimally invasive gastrointestinal and hepatologic diagnostics and therapies, patient monitoring, airway management and ventilation therapies, and renal disease. Its Neuroscience Portfolio segment offers products for spinal surgeons; neurosurgeons; neurologists; pain management specialists; anesthesiologists; orthopedic surgeons; urologists; urogynecologists; interventional radiologists; ear, nose, and throat specialists; and systems that incorporate energy surgical instruments. It also provides image-guided surgery and intra-operative imaging systems and robotic guidance systems used in robot assisted spine procedures; and therapies for vasculature in and around the brain. The company's Diabetes Operating Unit segment offers insulin pumps and consumables, continuous glucose monitoring systems, smart insulin pen systems, and consumables and supplies. The company was founded in 1949 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Geoffrey Straub Martha",
    "sector": "Healthcare",
    "country": "IE",
    "fullTimeEmployees": "95000",
    "phone": "353 1 438 1700",
    "address": "20 On Hatch",
    "city": "Dublin",
    "state": null,
    "zip": "2",
    "dcfDiff": 2.36872,
    "dcf": 84.9487,
    "image": "https://financialmodelingprep.com/image-stock/MDT.png",
    "ipoDate": "1973-05-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]