[
  {
    "symbol": "MDU",
    "price": 20.8,
    "beta": 0.76514,
    "volAvg": 1650214,
    "mktCap": 4235670400,
    "lastDiv": 0.89,
    "range": "17.824297-22.326698",
    "changes": 0.01,
    "companyName": "MDU Resources Group, Inc.",
    "currency": "USD",
    "cik": "0000067716",
    "isin": "US5526901096",
    "cusip": "552690109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Conglomerates",
    "website": "https://www.mdu.com",
    "description": "MDU Resources Group, Inc. engages in the regulated energy delivery, and construction materials and services businesses in the United States. The company's Electric segment generates, transmits, and distributes electricity for residential, commercial, industrial, and municipal customers in Montana, North Dakota, South Dakota, and Wyoming, as well as operates 3,500 miles of transmission lines and 4,800 miles of distribution lines. Its Natural Gas Distribution segment distributes natural gas for residential, commercial, and industrial customers in Idaho, Minnesota, Montana, North Dakota, Oregon, South Dakota, Washington, and Wyoming; and offers supply-related value-added services. The company's Pipeline segment provides natural gas transportation and underground storage services through a regulated pipeline system primarily in the Rocky Mountain and northern Great Plains regions; and cathodic protection and other energy-related services. Its Construction Materials and Contracting segment mines, processes, and sells construction aggregates; produces and sells asphalt mix; and supplies ready-mixed concrete. This segment is also involved in the sale of cement, finished concrete products, and other building materials and related contracting services. The company's Construction Services segment designs, constructs, and maintains electrical and communication wiring and infrastructure, fire suppression systems, mechanical piping and services; overhead and underground electrical, gas, and communication infrastructure; and manufactures and distributes transmission lines construction equipment. It serves manufacturing, commercial, industrial, transportation, institutional, and renewable and government customers, as well as utilities. The company was founded in 1924 and is headquartered in Bismarck, North Dakota.",
    "ceo": "Mr. David L. Goodin",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "16000",
    "phone": "701 530 1000",
    "address": "1200 West Century Avenue",
    "city": "Bismarck",
    "state": "ND",
    "zip": "58506-5650",
    "dcfDiff": 0.247593,
    "dcf": 30.8476,
    "image": "https://financialmodelingprep.com/image-stock/MDU.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]