[
  {
    "symbol": "MELI",
    "price": 1207.69,
    "beta": 1.586619,
    "volAvg": 431167,
    "mktCap": 60635216444,
    "lastDiv": 3.603999999999999,
    "range": "611.46-1365.64",
    "changes": 45.6,
    "companyName": "MercadoLibre, Inc.",
    "currency": "USD",
    "cik": "0001099590",
    "isin": "US58733R1023",
    "cusip": "58733R102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Retail",
    "website": "https://www.mercadolibre.com",
    "description": "MercadoLibre, Inc. operates online commerce platforms in Latin America. It operates Mercado Libre Marketplace, an automated online commerce platform that enables businesses, merchants, and individuals to list merchandise and conduct sales and purchases online; and Mercado Pago FinTech platform, a financial technology solution platform, which facilitates transactions on and off its marketplaces by providing a mechanism that allows its users to send and receive payments online, as well as allows users to transfer money through their websites or on the apps. The company also offers Mercado Fondo that allows users to invest funds deposited in their Mercado Pago accounts; Mercado Credito, which extends loans to certain merchants and consumers; and Mercado Envios logistics solution that enables sellers on its platform to utilize third-party carriers and other logistics service providers, as well as fulfillment and warehousing services for sellers. In addition, it provides Mercado Libre Classifieds, an online classified listing service, where users can list and purchase motor vehicles, real estate, and services; Mercado Libre Ads, an advertising platform, which enables large retailers and brands to promote their products and services on the Internet; and Mercado Shops, an online storefronts solution that enables users to set-up, manage, and promote their own digital stores. MercadoLibre, Inc. was incorporated in 1999 and is headquartered in Montevideo, Uruguay.",
    "ceo": "Mr. Marcos  Eduardo Galperín",
    "sector": "Consumer Cyclical",
    "country": "UY",
    "fullTimeEmployees": "40548",
    "phone": "598 2 927 2770",
    "address": "WTC Free Zone",
    "city": "Montevideo",
    "state": null,
    "zip": "11300",
    "dcfDiff": 206.128,
    "dcf": 1015.14,
    "image": "https://financialmodelingprep.com/image-stock/MELI.png",
    "ipoDate": "2007-08-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]