[
  {
    "symbol": "MET",
    "price": 54.87,
    "beta": 1.061971,
    "volAvg": 5773172,
    "mktCap": 42020597831,
    "lastDiv": 2.08,
    "range": "48.95-77.36",
    "changes": -0.11,
    "companyName": "MetLife, Inc.",
    "currency": "USD",
    "cik": "0001099219",
    "isin": "US59156R1086",
    "cusip": "59156R108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Life",
    "website": "https://www.metlife.com",
    "description": "MetLife, Inc., a financial services company, provides insurance, annuities, employee benefits, and asset management services worldwide. It operates through five segments: U.S.; Asia; Latin America; Europe, the Middle East and Africa; and MetLife Holdings. The company offers life, dental, group short-and long-term disability, individual disability, pet insurance, accidental death and dismemberment, vision, and accident and health coverages, as well as prepaid legal plans; administrative services-only arrangements to employers; and general and separate account, and synthetic guaranteed interest contracts, as well as private floating rate funding agreements. It also provides pension risk transfers, institutional income annuities, structured settlements, and capital markets investment products; and other products and services, such as life insurance products and funding agreements for funding postretirement benefits, as well as company, bank, or trust-owned life insurance used to finance nonqualified benefit programs for executives. In addition, it provides fixed, indexed-linked, and variable annuities; and pension products; regular savings products; whole and term life, endowments, universal and variable life, and group life products; longevity reinsurance solutions; credit insurance products; and protection against long-term health care services. MetLife, Inc. was founded in 1863 and is headquartered in New York, New York.",
    "ceo": "Mr. Michel Abbas Khalaf",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "45000",
    "phone": "212 578 9500",
    "address": "200 Park Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10166-0188",
    "dcfDiff": 26.9084,
    "dcf": 98.9484,
    "image": "https://financialmodelingprep.com/image-stock/MET.png",
    "ipoDate": "2000-04-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]