[
  {
    "symbol": "META",
    "price": 285.29,
    "beta": 1.188028,
    "volAvg": 23059430,
    "mktCap": 731121233712,
    "lastDiv": 0,
    "range": "88.09-289.79",
    "changes": -1.76,
    "companyName": "Meta Platforms, Inc.",
    "currency": "USD",
    "cik": "0001326801",
    "isin": "US30303M1027",
    "cusip": "30303M102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Content & Information",
    "website": "https://investor.fb.com",
    "description": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. Meta Platforms, Inc. was incorporated in 2004 and is headquartered in Menlo Park, California.",
    "ceo": "Mr. Mark Elliot Zuckerberg",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "77114",
    "phone": "650 543 4800",
    "address": "1601 Willow Road",
    "city": "Menlo Park",
    "state": "CA",
    "zip": "94025",
    "dcfDiff": 36.0734,
    "dcf": 115.667,
    "image": "https://financialmodelingprep.com/image-stock/META.png",
    "ipoDate": "2012-05-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]