[
  {
    "symbol": "MFC",
    "price": 18.64,
    "beta": 1.127946,
    "volAvg": 2975793,
    "mktCap": 34290144000,
    "lastDiv": 1.11,
    "range": "14.92-20.4",
    "changes": 0.04,
    "companyName": "Manulife Financial Corporation",
    "currency": "USD",
    "cik": "0001086888",
    "isin": "CA56501R1064",
    "cusip": "56501R106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Life",
    "website": "https://www.manulife.com",
    "description": "Manulife Financial Corporation, together with its subsidiaries, provides financial products and services in Asia, Canada, the United States, and internationally. The company operates through Wealth and Asset Management Businesses; Insurance and Annuity Products; And Corporate and Other segments. The Wealth and Asset Management Businesses segment provides mutual funds and exchange-traded funds, group retirement and savings products, and institutional asset management services through agents and brokers affiliated with the company, securities brokerage firms, and financial advisors pension plan consultants and banks. The Insurance and Annuity Products segment offers deposit and credit products; individual life, and individual and group long-term care insurance; and guaranteed and partially guaranteed annuity products through insurance agents, brokers, banks, financial planners, and direct marketing. The Corporate and Other segment is involved in property and casualty insurance and reinsurance businesses; and run-off reinsurance operations, including variable annuities, and accident and health. It also manages timberland and agricultural portfolios; and engages in insurance agency, portfolio and mutual fund management, mutual fund dealer, life, annuity, long-term care, and financial reinsurance; and fund management businesses. Additionally, the company holds and manages provides investment management, counseling, advisory, and dealer services. Manulife Financial Corporation was incorporated in 1887 and is headquartered in Toronto, Canada.",
    "ceo": "Mr. Roy  Gori",
    "sector": "Financial Services",
    "country": "CA",
    "fullTimeEmployees": "40000",
    "phone": "18887904387",
    "address": "200 Bloor Street East",
    "city": "Toronto",
    "state": "ON",
    "zip": "M4W 1E5",
    "dcfDiff": 9.28039,
    "dcf": 28.9304,
    "image": "https://financialmodelingprep.com/image-stock/MFC.png",
    "ipoDate": "1999-09-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]