[
  {
    "symbol": "MGA",
    "price": 55.33,
    "beta": 1.606541,
    "volAvg": 1062459,
    "mktCap": 15829691680,
    "lastDiv": 1.84,
    "range": "45.58-68.92",
    "changes": 0.76,
    "companyName": "Magna International Inc.",
    "currency": "USD",
    "cik": "0000749098",
    "isin": "CA5592224011",
    "cusip": "559222401",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Auto Parts",
    "website": "https://www.magna.com",
    "description": "Magna International Inc. designs, engineers, and manufactures components, assemblies, systems, subsystems, and modules for original equipment manufacturers of vehicles and light trucks worldwide. It operates through four segments: Body Exteriors & Structures, Power & Vision, Seating Systems, and Complete Vehicles. The Body Exteriors & Structures segment provides body and chassis, exterior, and roof systems, as well as battery enclosures and engineering and testing services, including fascia and trims, front end modules, front integration panels, liftgate modules, active aerodynamics, engineered glass, running boards, truck bed access products, and side doors. The Power & Vision segment offers hybrid and electric drive systems, motors, inverters, onboard chargers, and e-clutch; dedicated hybrid, dual and hybrid dual, and manual transmissions; AWD/4WD products and rear drive modules; transmission, engine, driveline components, engine drive plates, and accessories; engineering services; advanced driver assistance systems and sensors, and electronic control units; interior and exterior mirrors, camera and driver monitoring systems and electronics, actuators, door handles, and overhead consoles; forward, rear, and auxiliary lighting products; latching, door modules, window, power closure, and hinges and wire forming systems; and modular and textile folding roofs, and hard and soft tops. The Seating Systems segment provides seat structures, mechanism and hardware solutions, and foam and trim products. The Complete Vehicles segment offers vehicle engineering and manufacturing services. The company also designs, engineers, and manufactures tooling products. Magna International Inc. was founded in 1957 and is headquartered in Aurora, Canada.",
    "ceo": "Mr. Seetarama Swamy Kotagiri M.Sc.",
    "sector": "Consumer Cyclical",
    "country": "CA",
    "fullTimeEmployees": "171000",
    "phone": "19057262462",
    "address": "337 Magna Drive",
    "city": "Aurora",
    "state": "ON",
    "zip": "L4G 7K1",
    "dcfDiff": 7.1458,
    "dcf": 71.0358,
    "image": "https://financialmodelingprep.com/image-stock/MGA.png",
    "ipoDate": "1984-10-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]