[
  {
    "symbol": "MGDDY",
    "price": 14.69,
    "beta": 0,
    "volAvg": 137764,
    "mktCap": 13113910532,
    "lastDiv": 0.682,
    "range": "10.65-16.59",
    "changes": 0.06,
    "companyName": "Compagnie Générale des Établissements Michelin Société en commandite par actions",
    "currency": "USD",
    "cik": "0000896076",
    "isin": "US59410T1060",
    "cusip": "59410T106",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Auto Parts",
    "website": "https://www.michelin.com",
    "description": "Compagnie Générale des Établissements Michelin Société en commandite par actions manufactures and sells tires worldwide. The company offers tires for private use covering cars, racing, biking, motorcycles, scooters, and mopeds; and professional use, such as freight and people transport, agriculture, construction and industrial, mining and quarries, corporate fleets, tradesmen and professionals, civil and military operations, light rail, and aircraft. It is also involved in the provision of tire-related services, including development of mobility solutions for fleet managers, vehicle manufacturers, farmers, distributors, and individuals; mobility services, such as road maps, mobile apps, itineraries, and travel guides; lifestyle products comprising car and bike accessories, shoe soles, and sports and leisure gears; and high-tech materials that include 3D metal printing, specialty, rubber, biosourced, and recycled materials. Compagnie Générale des Établissements Michelin Société en commandite par actions was incorporated in 1863 and is based in Clermont-Ferrand, France.",
    "ceo": "Mr. Florent  Menegaux",
    "sector": "Consumer Cyclical",
    "country": "FR",
    "fullTimeEmployees": "118400",
    "phone": "33 4 73 32 20 00",
    "address": "23, Place Des Carmes Dechaux",
    "city": "Clermont-Ferrand",
    "state": null,
    "zip": "63040",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MGDDY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]