[
  {
    "symbol": "MGM",
    "price": 42.36,
    "beta": 2.073943,
    "volAvg": 4348114,
    "mktCap": 15410525979,
    "lastDiv": 0.01,
    "range": "27.79-46.37",
    "changes": -0.08,
    "companyName": "MGM Resorts International",
    "currency": "USD",
    "cik": "0000789570",
    "isin": "US5529531015",
    "cusip": "552953101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Resorts & Casinos",
    "website": "https://www.mgmresorts.com",
    "description": "MGM Resorts International, through its subsidiaries, owns and operates casino, hotel, and entertainment resorts in the United States and Macau. The company operates through three segments: Las Vegas Strip Resorts, Regional Operations, and MGM China. Its casino resorts offer gaming, hotel, convention, dining, entertainment, retail, and other resort amenities. The company's casino operations include slots and table games, as well as online sports betting and iGaming through BetMGM. As of February 17, 2021, its portfolio consisted of 29 hotel and destination gaming offerings. The company also owns and operates Las Vegas Strip Resorts and Fallen Oak golf course. Its customers include premium gaming customers; leisure and wholesale travel customers; business travelers; and group customers, including conventions, trade associations, and small meetings. The company was formerly known as MGM MIRAGE and changed its name to MGM Resorts International in June 2010. MGM Resorts International was incorporated in 1986 and is based in Las Vegas, Nevada.",
    "ceo": "Mr. William Joseph Hornbuckle IV",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "57000",
    "phone": "702 693 7120",
    "address": "3600 Las Vegas Boulevard South",
    "city": "Las Vegas",
    "state": "NV",
    "zip": "89109",
    "dcfDiff": 4.46275,
    "dcf": 45.4727,
    "image": "https://financialmodelingprep.com/image-stock/MGM.png",
    "ipoDate": "1988-05-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]