[
  {
    "symbol": "MGPI",
    "price": 103.89,
    "beta": 0.901056,
    "volAvg": 126174,
    "mktCap": 2286598122,
    "lastDiv": 0.48,
    "range": "90.69-125.74",
    "changes": 0.61,
    "companyName": "MGP Ingredients, Inc.",
    "currency": "USD",
    "cik": "0000835011",
    "isin": "US55303J1060",
    "cusip": "55303J106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Beverages—Wineries & Distilleries",
    "website": "https://www.mgpingredients.com",
    "description": "MGP Ingredients, Inc., together with its subsidiaries, produces and supplies distilled spirits, branded spirits, and food ingredients. It operates through three segments: Distillery Products; Branded Spirits; and Ingredient Solutions. The Distillery Products segment provides food grade alcohol for beverage applications that include bourbon and rye whiskeys, as well as grain neutral spirits, including vodka and gin; and food-grade industrial alcohol, which is used as an ingredient in foods, personal care products, cleaning solutions, pharmaceuticals, and various other products. This segment also provides fuel-grade alcohol for blending with gasoline; distillers feed and related co-products, such as distillers feed and corn oil; and warehouse services, including barrel put away, storage, and retrieval services, as well as blending services. The Branded Spirits segment provides ultra-premium, premium, mid, and value branded distilled spirits. The Ingredient Solutions segment provides specialty wheat starches for food applications under the Fibersym, Resistant Starch, and FiberRite RW Resistant Starch names; specialty wheat proteins for food applications under the Arise and Proterra names; gluten-free textured pea proteins; commodity wheat starch for food and non-food applications; and commodity wheat proteins. The company sells its products directly or through distributors to manufacturers and processors of finished packaged goods or to bakeries primarily in the United States, the United Kingdom, Japan, Thailand, Mexico, and Canada. MGP Ingredients, Inc. was founded in 1941 and is headquartered in Atchison, Kansas.",
    "ceo": "Mr. David J. Colo",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "690",
    "phone": "913 367 1480",
    "address": "100 Commercial Street",
    "city": "Atchison",
    "state": "KS",
    "zip": "66002",
    "dcfDiff": 31.5779,
    "dcf": 123.078,
    "image": "https://financialmodelingprep.com/image-stock/MGPI.png",
    "ipoDate": "1988-10-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]