[
  {
    "symbol": "MIELF",
    "price": 13.793,
    "beta": 0.708812,
    "volAvg": 651,
    "mktCap": 29145988741,
    "lastDiv": 0.37,
    "range": "8.683-14.76",
    "changes": 0.063,
    "companyName": "Mitsubishi Electric Corporation",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Electrical Equipment & Parts",
    "website": "https://www.mitsubishielectric.com",
    "description": "Mitsubishi Electric Corporation develops, manufactures, distributes, and sells electrical and electronic equipment worldwide. It offers turbine generators, hydraulic turbine generators, nuclear power plant and power electronics equipment, motors, transformers, circuit breakers, gas insulated switchgears, switch controls, surveillance-system control and security systems, transmission and distribution ICT systems, large display devices, locomotive and rolling stock electrical equipment, wireless and wired communications systems, network camera systems, elevators, escalators, building security and management systems, and others. The company also provides programmable logic controllers, inverters, servomotors, human-machine interfaces, hoists, magnetic switches, circuit breakers, time and power meters, uninterruptible power supply, industrial fans, computerized numerical controllers, electrical-discharge and laser processing machines, industrial robots, clutches, automotive electrical equipment, electric powertrain systems, car electronics and mechatronics, car multimedia, and others. In addition, it offers satellite communications and radar equipment, satellites, antennas, missile and fire control systems, broadcasting and information systems equipment, network security systems, and systems integration products; and power modules, high-frequency devices, optical and LCD devices, and others. Further, the company provides air conditioners, chillers, showcases, compressors, refrigeration units, air-to-water heat pump boilers, ventilators, hot water supply systems, IH cooking heaters, LED bulbs, indoor lighting, LCD televisions, refrigerators, electric fans, dehumidifiers, air purifiers, vacuum cleaners, jar rice cookers, microwave ovens, and others. Additionally, it offers procurement, logistics, real estate, advertising, finance, and other services. The company was incorporated in 1921 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Kei  Uruma",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "149655",
    "phone": "81 3 3218 2111",
    "address": "Tokyo Building",
    "city": "Tokyo",
    "state": null,
    "zip": "100-8310",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MIELF.png",
    "ipoDate": "2002-03-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]