[
  {
    "symbol": "MITEY",
    "price": 11.94,
    "beta": 0.482375,
    "volAvg": 133564,
    "mktCap": 15395196818,
    "lastDiv": 0.28,
    "range": "11.2-15.4",
    "changes": -0.01,
    "companyName": "Mitsubishi Estate Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US6067832070",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Real Estate—Diversified",
    "website": "https://www.mec.co.jp",
    "description": "Mitsubishi Estate Co., Ltd. engages in the real estate activities in Japan and internationally. The company is involved in the development, leasing, property management, and sale of office buildings; planning, development, and tenant leasing of retail facilities/outlets; investment, development, operational management, and asset management of logistics facilities; operation of 16 hotels under the Royal Park Hotels brand in Japan and the Marunouchi Hotel in the Marunouchi area; and operation of Takamatsu Airport, Miyako Shimojishima Airport Terminal, Mt. Fuji Shizuoka Airport, and seven airports in Hokkaido. It also engages in the development and rebuilding, redevelopment, purchasing and sale, brokerage, and management of condominiums; and rental of apartments. In addition, the company provides real estate investment trust, as well as private placement funds management services. Further, it offers architectural design and engineering services, including construction, civil engineering, and urban and regional development planning and consulting. Additionally, the company provides real estate problem-solving solutions, such as real estate brokerage, condominium and office building leasing management support, and real estate appraisal. Mitsubishi Estate Co., Ltd. was founded in 1890 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Atsushi  Nakajima",
    "sector": "Real Estate",
    "country": "JP",
    "fullTimeEmployees": "10202",
    "phone": "81 3 3287 5100",
    "address": "Otemachi Park Building",
    "city": "Tokyo",
    "state": null,
    "zip": "100-8133",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MITEY.png",
    "ipoDate": "2008-09-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]