[
  {
    "symbol": "MITSY",
    "price": 766.12,
    "beta": 0.835249,
    "volAvg": 3788,
    "mktCap": 58540301768,
    "lastDiv": 20.08,
    "range": "400.0-818.4",
    "changes": 8,
    "companyName": "Mitsui & Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US6068272029",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Conglomerates",
    "website": "https://www.mitsui.com/jp/en/",
    "description": "Mitsui & Co., Ltd. operates as a general trading company worldwide. The company engages in the manufacture, export, and import of iron and steel products; automotive components; operation of steel processing service centers; trading of automotive, electrical, special, and stainless steel; manufacture, repair, and fabrication of wind turbine towers and flanges; gas distribution businesses; and coal mining, power generation, ferrous alloy, infrastructure maintenance, and water pumping activities. It also explores, develops, and produces oil, natural gas, and LNG; trades in petroleum products, crude oil, coal, uranium, and LNG; offers FPSO/FSO, fright car, truck, and locomotive leasing services; sells electric power facilities; and develops railway and transportation infrastructures. The company engages in logistics businesses; wholesale, retail, rental, and finance of construction and mining equipment; multimodal transportation, warehousing, and rolling stock leasing; sale, purchase, and leasing of aircraft and aero engines; leasing and financing activities; and development, process, and marketing of underground resources, and recycling of surface resources. It also provides electric-arc-furnace, construction materials processing, construction flat-rolled steel, shapes, bars, wire rods, and steel structure materials; methanol, ammonia, chlor-alkali, industrial, gas, and basic chemicals; salt; performance, advanced, specialty, and living, and environmental materials; agrochemicals and fertilizers, and animal and human nutrition products; refined sugar, oils and fats, proteins, grains, and food and beverage products; contract food services; and healthcare products. The company offers mobile communications; commodity derivative trading; venture investment and asset management services; real estate development, management, leasing, and brokerage services; and ship charter operation services. Mitsui & Co., Ltd. was incorporated in 1947 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Kenichi  Hori",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "44346",
    "phone": "81 3 3285 1111",
    "address": "2-1, Otemachi 1-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "100-8631",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MITSY.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]