[
  {
    "symbol": "MKL",
    "price": 1333.55,
    "beta": 0.787323,
    "volAvg": 34150,
    "mktCap": 17798491785,
    "lastDiv": 0,
    "range": "1064.09-1458.56",
    "changes": -9.3899,
    "companyName": "Markel Corporation",
    "currency": "USD",
    "cik": "0001096343",
    "isin": "US5705351048",
    "cusip": "570535104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.markel.com",
    "description": "Markel Corporation, a diverse financial holding company, markets and underwrites specialty insurance products in the United States, Bermuda, the United Kingdom, rest of Europe, Canada, the Asia Pacific, and the Middle East. Its Insurance segment offers general and professional liability, personal lines, marine and energy, specialty programs, and workers' compensation insurance products; and property coverages that include fire, allied lines, and other specialized property coverages, including catastrophe-exposed property risks, such as earthquake and wind. This segment also offers credit and surety products, and collateral protection insurance products. The company's Reinsurance segment offers transaction, healthcare, and environmental impairment liability; and specialty treaty reinsurance products comprising structured and whole turnover credit, political risk, mortgage and contract, and commercial surety reinsurance programs. Its Markel Ventures segment provides equipment used in baking systems and food processing; portable dredges; over-the-road car haulers and transportation equipment; and laminated oak and composite wood flooring, tube and tank trailers, as well as ornamental plants and residential homes, handbags, and architectural products. This segment also provides consulting, and other types of services to businesses and consumers, including distribution of exterior building products, crane rental, fire protection, and life safety services, management and technology consulting, and retail intelligence services. The company's Other segment provides healthcare, leasing and investment services, as well as operates as an insurance and investment fund manager offering a range of investment products, including insurance-linked securities, catastrophe bonds, insurance swaps, and weather derivatives; and program services. it also manages funds with third parties. Markel Corporation was founded in 1930 and is based in Glen Allen, Virginia.",
    "ceo": "Mr. Thomas Sinnickson Gayner",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "20900",
    "phone": "804 747 0136",
    "address": "4521 Highwoods Parkway",
    "city": "Glen Allen",
    "state": "VA",
    "zip": "23060-6148",
    "dcfDiff": 158.346,
    "dcf": 1554.9,
    "image": "https://financialmodelingprep.com/image-stock/MKL.png",
    "ipoDate": "1986-12-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]