[
  {
    "symbol": "MKSI",
    "price": 109.58,
    "beta": 1.53838,
    "volAvg": 619487,
    "mktCap": 7316371692,
    "lastDiv": 0.88,
    "range": "64.77-123.93",
    "changes": -0.69,
    "companyName": "MKS Instruments, Inc.",
    "currency": "USD",
    "cik": "0001049502",
    "isin": "US55306N1046",
    "cusip": "55306N104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.mksinst.com",
    "description": "MKS Instruments, Inc. provides instruments, systems, subsystems, and process control solutions that measure, monitor, deliver, analyze, power, and control critical parameters of manufacturing processes worldwide. Its Vacuum & Analysis segment offers pressure and vacuum control solutions, including direct and indirect pressure measurement; materials delivery solutions comprising flow and valve technologies, as well as integrated pressure measurement and control subsystems, which provide customers with precise control capabilities; power solutions products, such as microwave, power delivery systems, radio frequency matching networks, and metrology products used in providing energy to etching, stripping, and deposition processes; and plasma and reactive gas products. Its Light & Motion segment offers laser products, such as continuous wave and pulsed nanosecond, diode and diode-pumped solid-state, and fiber laser technologies; and photonics products comprising motion control, optical tables and vibration isolation systems, photonic instruments, optics and optical assemblies, opto-mechanical components, temperature sensing products for wafer fabrication systems, and laser and LED measurement products, including laser power and energy meters, laser beam profilers, and optical and photonic subsystems. Its Equipment & Solutions segment provides laser-based systems for printed circuit board (PCB) manufacturing, including flexible interconnect PCB processing systems and high-density interconnect solutions for rigid PCB manufacturing and substrate processing, and multi-layer ceramic capacitor test systems. It serves semiconductor, industrial technologies, life and health sciences, research, and defense markets. It sells its products and services through its direct sales organization, independent distributors, and sales representatives, as well as through its websites and product catalogs. The company was incorporated in 1961 and is headquartered in Andover, Massachusetts.",
    "ceo": "Dr. John T. C. Lee",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "10450",
    "phone": "978 645 5500",
    "address": "2 Tech Drive",
    "city": "Andover",
    "state": "MA",
    "zip": "01810",
    "dcfDiff": 14.6217,
    "dcf": 90.6183,
    "image": "https://financialmodelingprep.com/image-stock/MKSI.png",
    "ipoDate": "1999-03-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]