[
  {
    "symbol": "MKTX",
    "price": 257.89,
    "beta": 0.791197,
    "volAvg": 357824,
    "mktCap": 9714561566,
    "lastDiv": 2.88,
    "range": "217.44-399.78",
    "changes": -1.48,
    "companyName": "MarketAxess Holdings Inc.",
    "currency": "USD",
    "cik": "0001278021",
    "isin": "US57060D1081",
    "cusip": "57060D108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Capital Markets",
    "website": "https://www.marketaxess.com",
    "description": "MarketAxess Holdings Inc., together with its subsidiaries, operates an electronic trading platform for institutional investor and broker-dealer companies worldwide. It offers the access to liquidity in the U.S. investment-grade bonds, U.S. high-yield bonds, and U.S. Treasuries, as well as municipal bonds, emerging market debts, Eurobonds, and other fixed income securities. The company, through its Open Trading protocols, executes bond trades between and among institutional investor and broker-dealer clients in an all-to-all anonymous trading environment for corporate bonds. It also offers trading-related products and services, including composite+ pricing and other market data products to assist clients with trading decisions; auto-execution and other execution services for clients requiring specialized workflow solutions; connectivity solutions that facilitate straight-through processing; and technology services to optimize trading environments. In addition, the company provides various pre-and post-trade services, such as trade matching, trade publication, regulatory transaction reporting, and market and reference data across a range of fixed-income and other products. MarketAxess Holdings Inc. was incorporated in 2000 and is headquartered in New York, New York.",
    "ceo": "Mr. Christopher R. Concannon",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "744",
    "phone": "212 813 6000",
    "address": "55 Hudson Yards",
    "city": "New York",
    "state": "NY",
    "zip": "10001",
    "dcfDiff": 100.887,
    "dcf": 271.483,
    "image": "https://financialmodelingprep.com/image-stock/MKTX.png",
    "ipoDate": "2004-11-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]