[
  {
    "symbol": "MLI",
    "price": 86.11,
    "beta": 1.09507,
    "volAvg": 440929,
    "mktCap": 4907882505,
    "lastDiv": 1.2,
    "range": "51.07-87.22",
    "changes": -0.05,
    "companyName": "Mueller Industries, Inc.",
    "currency": "USD",
    "cik": "0000089439",
    "isin": "US6247561029",
    "cusip": "624756102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Metal Fabrication",
    "website": "https://www.muellerindustries.com",
    "description": "Mueller Industries, Inc. manufactures and sells copper, brass, aluminum, and plastic products in the United States, the United Kingdom, Canada, South Korea, the Middle East, China, and Mexico. It operates through three segments: Piping Systems, Industrial Metals, and Climate. The Piping Systems segment offers copper tubes, fittings, line sets, and pipe nipples; PEX plumbing and radiant systems; and plumbing-related fittings and plastic injection tooling. It also resells steel pipes, brass and plastic plumbing valves, malleable iron fittings and faucets, and plumbing specialties; and supplies water tubes. This segment sells its products to wholesalers in the plumbing and refrigeration markets, distributors to the manufactured housing and recreational vehicle industries, building material retailers, and air-conditioning original equipment manufacturers (OEMs). The Industrial Metals segment manufactures brass, bronze, and copper alloy rods; plumbing brass, valves, and fittings; cold-form aluminum and copper products; machining of aluminum, steel, brass, and cast iron impacts and castings; brass and aluminum forgings; brass, aluminum, and stainless-steel valves; fluid control solutions; and gas train assembles to OEMs in the industrial, construction, HVAC, plumbing, and refrigeration markets. The Climate segment offers valves, protection devices, and brass fittings for various OEMs in the commercial HVAC and refrigeration markets; high-pressure components and accessories for the air-conditioning and refrigeration markets; coaxial heat exchangers and twisted tubes for the HVAC, geothermal, refrigeration, swimming pool heat pump, marine, ice machine, commercial boiler, and heat reclamation markets; insulated HVAC flexible duct systems; and brazed manifolds, headers, and distributor assemblies. The company was founded in 1917 and is headquartered in Collierville, Tennessee.",
    "ceo": "Mr. Gregory L. Christopher",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5137",
    "phone": "901 753 3200",
    "address": "150 Schilling Boulevard",
    "city": "Collierville",
    "state": "TN",
    "zip": "38017",
    "dcfDiff": 4.02801,
    "dcf": 69.688,
    "image": "https://financialmodelingprep.com/image-stock/MLI.png",
    "ipoDate": "1991-02-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]