[
  {
    "symbol": "MMS",
    "price": 82.89,
    "beta": 0.699295,
    "volAvg": 331817,
    "mktCap": 5038352604,
    "lastDiv": 1.12,
    "range": "54.46-86.73",
    "changes": -0.84,
    "companyName": "Maximus, Inc.",
    "currency": "USD",
    "cik": "0001032220",
    "isin": "US5779331041",
    "cusip": "577933104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Business Services",
    "website": "https://www.maximus.com",
    "description": "Maximus, Inc. provides business process services (BPS) to government health and human services programs. It operates through three segments: U.S. Services, U.S. Federal Services, and Outside the U.S. The U.S. Services segment offers various BPS solutions, such as program administration, appeals and assessments, and related consulting works for U.S. state and local government programs, including the Affordable Care Act, Medicaid, the Children's Health Insurance Program, Temporary Assistance to Needy Families, child support programs, Preadmission Screening and Resident Reviews, and Independent Developmental Disability assessments. This segment also provides program eligibility support and enrollment; centralized multilingual customer contact centers, multichannel, and digital self-service options for enrollment; application assistance and independent health plan choice counseling; beneficiary outreach, education, eligibility, enrollment, and redeterminations; person-centered independent disability, long-term sick, and other health assessments; and specialized consulting services. The U.S. Federal Services segment offers centralized citizen engagement centers and support services; document and record management; case management, citizen support, and consumer education; independent medical reviews and worker's compensation benefit appeals; Medicare and Medicaid appeals; and federal marketplace eligibility appeals. This segment also provides modernization of systems and information technology infrastructure; infrastructure operations and support services; software development, operations, and management services; and data analytics services. The Outside the U.S. segment offers BPS solutions for governments and commercial clients outside the United States, including health and disability assessments, program administration for employment services, and other job seeker-related services. The company was incorporated in 1975 and is headquartered in Tysons, Virginia.",
    "ceo": "Mr. Bruce L. Caswell",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "39500",
    "phone": "17032518500",
    "address": "1600 Tysons Boulevard",
    "city": "Tysons",
    "state": "VA",
    "zip": "22102",
    "dcfDiff": 8.60435,
    "dcf": 62.7057,
    "image": "https://financialmodelingprep.com/image-stock/MMS.png",
    "ipoDate": "1997-06-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]