[
  {
    "symbol": "MMSI",
    "price": 82.34,
    "beta": 0.992605,
    "volAvg": 269425,
    "mktCap": 4734023024,
    "lastDiv": 0,
    "range": "50.46-85.62",
    "changes": -0.13,
    "companyName": "Merit Medical Systems, Inc.",
    "currency": "USD",
    "cik": "0000856982",
    "isin": "US5898891040",
    "cusip": "589889104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.merit.com",
    "description": "Merit Medical Systems, Inc. designs, develops, manufactures, and markets single-use medical products for interventional, diagnostic, and therapeutic procedures, primarily in cardiology, radiology, oncology, critical care, and endoscopy. The company operates in two segments, Cardiovascular and Endoscopy. It provides peripheral intervention products for the diagnosis and treatment of diseases in peripheral vessels and organs; and cardiac intervention products, such as access, angiography, electrophysiology and cardiac rhythm management, fluid management, hemodynamic monitoring, hemostasis, and intervention to treat various heart conditions. The company also offers custom procedural solutions that include critical care products, disinfection protection systems, syringes, manifold kits, and trays and packs; coated tubes and wires; and sensor components for microelectromechanical systems. In addition, it provides pulmonary products that consist of laser-cut tracheobronchial stents, over-the-wire and direct visualization delivery systems, and dilation balloons to endoscopically dilate strictures; gastroenterology products; and kits and accessories for endoscopy and bronchoscopy procedures. The company sells its products to hospitals and alternate site-based physicians, technicians, and nurses through direct sales force, distributors, original equipment manufacturer partners, or custom procedure tray manufacturers in the United States and internationally. Merit Medical Systems, Inc. was incorporated in 1987 and is headquartered in South Jordan, Utah.",
    "ceo": "Mr. Fred P. Lampropoulos",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "6846",
    "phone": "801 253 1600",
    "address": "1600 West Merit Parkway",
    "city": "South Jordan",
    "state": "UT",
    "zip": "84095",
    "dcfDiff": 1.91725,
    "dcf": 71.8573,
    "image": "https://financialmodelingprep.com/image-stock/MMSI.png",
    "ipoDate": "1990-05-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]