[
  {
    "symbol": "MMYT",
    "price": 27.14,
    "beta": 1.226952,
    "volAvg": 309262,
    "mktCap": 2857136441,
    "lastDiv": 0,
    "range": "22.5-34.68",
    "changes": 0.2,
    "companyName": "MakeMyTrip Limited",
    "currency": "USD",
    "cik": "0001495153",
    "isin": "MU0295S00016",
    "cusip": "V5633W109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Travel Services",
    "website": "https://www.makemytrip.com",
    "description": "MakeMyTrip Limited, an online travel company, sells travel products and solutions in India, the United States, Singapore, Malaysia, Thailand, the United Arab Emirates, Peru, Colombia, Vietnam, and Indonesia. The company operates through three segments: Air Ticketing, Hotels and Packages, and Bus Ticketing. Its services and products include air tickets; hotels; packages; rail tickets; bus tickets; and car hire, as well as ancillary travel requirements, such as visa processing and facilitating access to travel insurance. The company allows travelers to research, plan, book, and purchase travel services and products through its websites, such as makemytrip.com, goibibo.com, redbus.in, makemytrip.com.sg, and makemytrip.ae; and other technology-enhanced distribution channels, such as call centers, travel stores, and travel agents' network, as well as mobile service platform. As of March 31, 2022, it had approximately 125 franchisee-owned travel stores. The company serves leisure and corporate travelers. MakeMyTrip Limited was incorporated in 2000 and is based in Gurugram, India.",
    "ceo": "Mr. Rajesh  Magow",
    "sector": "Consumer Cyclical",
    "country": "IN",
    "fullTimeEmployees": "3338",
    "phone": "91 12 4439 5000",
    "address": "Building No. 5",
    "city": "Gurugram",
    "state": null,
    "zip": "122002",
    "dcfDiff": 1.63096,
    "dcf": 31.101,
    "image": "https://financialmodelingprep.com/image-stock/MMYT.png",
    "ipoDate": "2010-08-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]