[
  {
    "symbol": "MNST",
    "price": 57.15,
    "beta": 0.860915,
    "volAvg": 4182972,
    "mktCap": 59819477414,
    "lastDiv": 0.010417,
    "range": "42.805-60.47",
    "changes": -0.98,
    "companyName": "Monster Beverage Corporation",
    "currency": "USD",
    "cik": "0000865752",
    "isin": "US61174X1090",
    "cusip": "61174X109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Beverages—Non-Alcoholic",
    "website": "https://www.monsterbevcorp.com",
    "description": "Monster Beverage Corporation, through its subsidiaries, engages in development, marketing, sale, and distribution of energy drink beverages and concentrates in the United States and internationally. The company operates through three segments: Monster Energy Drinks, Strategic Brands, and Other. It offers carbonated energy drinks, non-carbonated, ready-to-drink iced teas, lemonades, juice cocktails, single-serve juices and fruit beverages, ready-to-drink dairy and coffee drinks, energy drinks, sports drinks and single-serve still waters, and sodas that are considered natural, sparkling juices, and flavored sparkling beverages. The company sells its products to bottlers, full-service beverage distributors, as well as sells directly to retail grocery and speciality chains, wholesalers, club stores, mass merchandisers, convenience chains, drug stores, foodservice customers, value stores, e-commerce retailers, and the military; and concentrates and/or beverage bases to authorized bottling and canning operations. It provides its products under the Monster Energy, Monster Energy Ultra, Monster Rehab, Monster Energy Nitro, Java Monster, Muscle Monster, Espresso Monster, Punch Monster, Juice Monster, Monster Hydro Energy Water, Monster Hydro Super Sport, Monster HydroSport Super Fuel, Monster Super Fuel, Monster Dragon Tea, Reign Total Body Fuel, and Reign Inferno Thermogenic Fuel, as well as NOS, Full Throttle, Burn, Mother, Nalu, Ultra Energy, Play and Power Play (stylized), Relentless, BPM, BU, Gladiator, Samurai, Live+, Predator, Fury, and True North brands. The company was formerly known as Hansen Natural Corporation and changed its name to Monster Beverage Corporation in January 2012. Monster Beverage Corporation was founded in 1985 and is headquartered in Corona, California.",
    "ceo": "Mr. Rodney Cyril Sacks H.Dip.Law, H.Dip.Tax",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "4607",
    "phone": "951 739 6200",
    "address": "1 Monster Way",
    "city": "Corona",
    "state": "CA",
    "zip": "92879",
    "dcfDiff": 0.785134,
    "dcf": 103.575,
    "image": "https://financialmodelingprep.com/image-stock/MNST.png",
    "ipoDate": "1985-12-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]