[
  {
    "symbol": "MODG",
    "price": 19.71,
    "beta": 1.754929,
    "volAvg": 2477167,
    "mktCap": 3658235288,
    "lastDiv": 4.419999999999996,
    "range": "16.13-25.96",
    "changes": -0.21,
    "companyName": "Topgolf Callaway Brands Corp.",
    "currency": "USD",
    "cik": "0000837465",
    "isin": null,
    "cusip": "131193104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Leisure",
    "website": "https://www.callawaygolf.com",
    "description": "Topgolf Callaway Brands Corp. designs, manufactures, and sells golf equipment, golf and lifestyle apparel, and other accessories. It operates through three segments: Topgolf; Golf Equipment; and Apparel, Gear and Other. The Topgolf segment operates Topgolf venues equipped with technology-enabled hitting bays, multiple bars, dining areas, and event spaces, as well as Toptracer ball-flight tracking technology; and World Golf Tour digital golf game. The Golf Equipment segment provides drivers, fairway woods, hybrids, irons, wedges and packaged sets, putters, and pre-owned golf clubs under the Callaway and Odyssey brands, as well as golf balls under the Callaway Golf and Strata brands. The Apparel, Gear and Other segment offers golf apparel and footwear; golf accessories, including golf bags, golf gloves, headwear, and practice aids under the Callaway brand; and golf and lifestyle apparel, hats, luggage and accessories, footwear, belts, facemasks, sunglasses, socks, and underwear under the TravisMathew brand. This segment also provides storage gear for sport and personal use, such as backpacks; travel, duffel, and golf bags; and storage gear accessories, as well as outerwear, headwear, and accessories under the OGIO brand. In addition, it offers outdoor apparel comprising jackets, trousers, dresses, skirts, and tops; and footwear and outdoor equipment, including packs and bags, travel bags, tents, sleeping bags, and accessories under the Jack Wolfskin brand. The company sells its products through golf retailers, sporting goods retailers, on-line retailers, mass merchants, department stores, third-party distributors, and mail order stores, as well as through its websites in the United States and approximately 120 countries. The company was formerly known as Callaway Golf Company and changed its name to Topgolf Callaway Brands Corp. in September 2022. Topgolf Callaway Brands Corp. was incorporated in 1982 and is headquartered in Carlsbad, California.",
    "ceo": "Mr. Oliver G. Brewer III",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "32000",
    "phone": "760 931 1771",
    "address": "2180 Rutherford Road",
    "city": "Carlsbad",
    "state": "CA",
    "zip": "92008",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MODG.png",
    "ipoDate": "1992-02-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]