[
  {
    "symbol": "MORF",
    "price": 56.93,
    "beta": 1.145448,
    "volAvg": 627506,
    "mktCap": 2608834329,
    "lastDiv": 0,
    "range": "20.41-63.083",
    "changes": 1.92,
    "companyName": "Morphic Holding, Inc.",
    "currency": "USD",
    "cik": "0001679363",
    "isin": "US61775R1059",
    "cusip": "61775R105",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.morphictx.com",
    "description": "Morphic Holding, Inc., a biopharmaceutical company, discovers and develops oral small-molecule integrin therapeutics for the treatment of autoimmune, cardiovascular, metabolic diseases, as well as fibrosis and cancer. Its lead product candidates are MORF-057, an a4ß7-specific integrin inhibitor affecting inflammation that is in Phase 1 clinical trial for the treatment of inflammatory bowel disease; and preclinical trial to treat idiopathic pulmonary fibrosis and fibrosis diseases. The company is also developing avß6 for the treatment of fibrotic diseases, and avß8 to treat solid tumors, as well as various other products. Morphic Holding, Inc. has a research collaboration with Engitix Ltd for the identification of Morphic integrin technology amenable targets in fibrostenotic IBD; a collaboration agreement with Schrödinger, LLC for integrin targets; and a license agreement with Children's Medical Center Corporation to develop and commercialize products worldwide for any therapeutic or diagnostic use in humans and veterinary applications. It also has collaboration agreements with AbbVie Biotechnology Ltd and Janssen Pharmaceuticals, Inc. to discover or develop integrin-based therapeutics. Morphic Holding, Inc. was incorporated in 2014 and is headquartered in Waltham, Massachusetts.",
    "ceo": "Dr. Praveen P. Tipirneni M.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "107",
    "phone": "781 996 0955",
    "address": "35 Gatehouse Drive, A2",
    "city": "Waltham",
    "state": "MA",
    "zip": "02451",
    "dcfDiff": 1.41335,
    "dcf": 33.2634,
    "image": "https://financialmodelingprep.com/image-stock/MORF.png",
    "ipoDate": "2019-06-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]