[
  {
    "symbol": "MORN",
    "price": 188.72,
    "beta": 1.181338,
    "volAvg": 168420,
    "mktCap": 8030224720,
    "lastDiv": 1.5,
    "range": "163.28-261.16",
    "changes": 0.22,
    "companyName": "Morningstar, Inc.",
    "currency": "USD",
    "cik": "0001289419",
    "isin": "US6177001095",
    "cusip": "617700109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Financial Data & Stock Exchanges",
    "website": "https://www.morningstar.com",
    "description": "Morningstar, Inc. provides independent investment research services in North America, Europe, Australia, and Asia. The company offers web-based tools; investment data, fundamental equity and manager research, private capital markets research, credit and fund rating, and index, as well as environmental, social, and governance (ESG) rating services; and investment offerings, including managed investment products, publicly listed and private companies, fixed income securities, and real-time global market data for financial advisors, asset managers, retirement plan providers and sponsors, and individual and institutional investors. It also provides Morningstar Data, an investment data spanning various databases, including equity fundamentals, managed investments, ESG factors, and market data; Morningstar Direct, an investment-analysis platform; Morningstar Managed Portfolios, an advisor service consisting of model portfolio that offers services for independent financial advisors, as well as offers asset allocation services for asset managers, broker/dealers, and insurance providers; Morningstar Advisor Workstation, a web-based research, financial planning, and proposal generation platform; and Morningstar.com, a website for individual investors. In addition, the company offers Morningstar Enterprise Components; Morningstar Credit Ratings that provides issuance and surveillance services for structured finance products and instruments; corporate credit estimates and operational risk assessment rankings; Morningstar Indexes for creating investment products; Morningstar workplace solutions, such as retirement accounts, fiduciary services, allocation funds, and custom models; and PitchBook Platform, research and analysis workstation for investment and research professionals. Further, its PitchBook provides a mobile application, excel plug-in, data feeds, and data solutions. The company was incorporated in 1984 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Kunal  Kapoor CFA",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "12411",
    "phone": "312 696 6000",
    "address": "22 West Washington Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60602",
    "dcfDiff": 10.2275,
    "dcf": 251.667,
    "image": "https://financialmodelingprep.com/image-stock/MORN.png",
    "ipoDate": "2005-05-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]