[
  {
    "symbol": "MPLX",
    "price": 33.84,
    "beta": 1.420774,
    "volAvg": 1703009,
    "mktCap": 33875193600,
    "lastDiv": 3.1,
    "range": "27.5-35.37",
    "changes": 0.15,
    "companyName": "MPLX LP",
    "currency": "USD",
    "cik": "0001552000",
    "isin": "US55336V1008",
    "cusip": "55336V100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.mplx.com",
    "description": "MPLX LP owns and operates midstream energy infrastructure and logistics assets primarily in the United States. It operates in two segments, Logistics and Storage, and Gathering and Processing. The company is involved in the gathering, processing, and transportation of natural gas; gathering, transportation, fractionation, exchange, storage, and marketing of natural gas liquids; gathering, storage, transportation, and distribution of crude oil and refined products, as well as other hydrocarbon-based products; and sale of residue gas and condensate. It also engages in the inland marine businesses comprising transportation of light products, heavy oils, crude oil, renewable fuels, chemicals, and feedstocks in the Mid-Continent and Gulf Coast regions, as well as owns and operates boats and barges, including third-party chartered equipment, and a marine repair facility located on the Ohio River; and distribution of fuel, as well as operates refining logistics, terminals, rail facilities, and storage caverns. In addition, the company operates terminal facilities for the receipt, storage, blending, additization, handling, and redelivery of refined petroleum products located through the pipeline, rail, marine, and over-the-road modes of transportation. MPLX GP LLC acts as the general partner of MPLX LP. The company was incorporated in 2012 and is headquartered in Findlay, Ohio. MPLX LP operates as a subsidiary of Marathon Petroleum Corporation.",
    "ceo": "Mr. Michael J. Hennigan",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "6200",
    "phone": "419 421 2414",
    "address": "200 East Hardin Street",
    "city": "Findlay",
    "state": "OH",
    "zip": "45840-3229",
    "dcfDiff": 14.4614,
    "dcf": 49.3114,
    "image": "https://financialmodelingprep.com/image-stock/MPLX.png",
    "ipoDate": "2012-10-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]