[
  {
    "symbol": "MPWR",
    "price": 527.27,
    "beta": 1.125704,
    "volAvg": 594046,
    "mktCap": 25004725210,
    "lastDiv": 4,
    "range": "301.69-553.64",
    "changes": -5.54,
    "companyName": "Monolithic Power Systems, Inc.",
    "currency": "USD",
    "cik": "0001280452",
    "isin": "US6098391054",
    "cusip": "609839105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.monolithicpower.com",
    "description": "Monolithic Power Systems, Inc. engages in the design, development, marketing, and sale of semiconductor-based power electronics solutions for the computing and storage, automotive, industrial, communications, and consumer markets. The company provides direct current (DC) to DC integrated circuits (ICs) that are used to convert and control voltages of various electronic systems, such as portable electronic devices, wireless LAN access points, computers and notebooks, monitors, infotainment applications, and medical equipment. It also offers lighting control ICs for backlighting that are used in systems, which provide the light source for LCD panels in notebook computers, monitors, car navigation systems, and televisions, as well as for general illumination products. The company sells its products through third-party distributors and value-added resellers, as well as directly to original equipment manufacturers, original design manufacturers, electronic manufacturing service providers, and other end customers in China, Taiwan, Europe, South Korea, Southeast Asia, Japan, the United States, and internationally. Monolithic Power Systems, Inc. was incorporated in 1997 and is headquartered in Kirkland, Washington.",
    "ceo": "Mr. Michael R. Hsing",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3247",
    "phone": "425 296 9956",
    "address": "5808 Lake Washington Boulevard NE",
    "city": "Kirkland",
    "state": "WA",
    "zip": "98033",
    "dcfDiff": 52.8348,
    "dcf": 372.235,
    "image": "https://financialmodelingprep.com/image-stock/MPWR.png",
    "ipoDate": "2004-11-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]