[
  {
    "symbol": "MRAAY",
    "price": 14.16,
    "beta": 0.916091,
    "volAvg": 150620,
    "mktCap": 35667482173,
    "lastDiv": 0.26,
    "range": "11.06-15.63",
    "changes": 0.075,
    "companyName": "Murata Manufacturing Co., Ltd.",
    "currency": "USD",
    "cik": "0001450468",
    "isin": "US6264251025",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Electronic Components",
    "website": "https://www.murata.com",
    "description": "Murata Manufacturing Co., Ltd. designs, manufactures, and sells ceramic-based passive electronic components and solutions in Japan and internationally. It operates through Components, Modules, and Others segments. The company offers capacitors, inductors, noise suppression products/EMI suppression filters/ESD protection devices, resistors, thermistors, sensors, timing devices, quartz devices, sound components, power products, batteries, micro mechatronics, RFID devices, matching devices, baluns, couplers, filters, phase shifters, RF switches, front-end modules, SAW components, connectors, antennas, connectivity modules, wireless connectivity platforms, ionizers/active oxygen modules, and transformers. It also provides mercury-free silver watch battery; and Femtet, a CAE software that solves various physical phenomena. The company offers its products for use in communications equipment, mobility, enterprise system, industrial, healthcare and medical, and personal electronics applications. Murata Manufacturing Co., Ltd. was founded in 1944 and is headquartered in Nagaokakyo, Japan.",
    "ceo": "Mr. Norio  Nakajima",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "73164",
    "phone": "81 7 5951 9111",
    "address": "10-1, Higashikotari 1-chome",
    "city": "Nagaokakyo",
    "state": null,
    "zip": "617-8555",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MRAAY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]