[
  {
    "symbol": "MRCY",
    "price": 32.87,
    "beta": 0.994366,
    "volAvg": 505990,
    "mktCap": 1912708587,
    "lastDiv": 0.6175,
    "range": "28.9-65.42",
    "changes": -0.19,
    "companyName": "Mercury Systems, Inc.",
    "currency": "USD",
    "cik": "0001049521",
    "isin": "US5893781089",
    "cusip": "589378108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Aerospace & Defense",
    "website": "https://www.mrcy.com",
    "description": "Mercury Systems, Inc., a technology company, manufactures and sells components, products, modules, and subsystems for aerospace and defense industries in the United States, Europe, and the Asia Pacific. Its products and solutions are deployed in approximately 300 programs with 25 defense contractors and commercial aviation customers. The company offers components, including power amplifiers and limiters, switches, oscillators, filters, equalizers, digital and analog converters, chips, monolithic microwave integrated circuits, and memory and storage devices; modules and sub-assemblies, such as embedded processing modules and boards, switched fabric boards, digital receiver boards, multi-chip modules, integrated radio frequency and microwave multi-function assemblies, tuners, and transceivers, as well as graphics and video processing, and Ethernet and input-output boards; and integrated subsystems. It also designs and develops digital radio frequency memory units for various modern electronic warfare applications; radar environment simulation and test systems for defense and intelligence applications; and signals intelligence payloads and EO/IR technologies for small UAV platforms, as well as onboard UAV processor systems for real-time wide area motion imagery. The company was formerly known as Mercury Computer Systems, Inc. and changed its name to Mercury Systems, Inc. in November 2012. Mercury Systems, Inc. was incorporated in 1981 and is headquartered in Andover, Massachusetts.",
    "ceo": "Dr. William L. Ballhaus",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "2537",
    "phone": "978 256 1300",
    "address": "50 Minuteman Road",
    "city": "Andover",
    "state": "MA",
    "zip": "01810",
    "dcfDiff": 2.34211,
    "dcf": 52.8821,
    "image": "https://financialmodelingprep.com/image-stock/MRCY.png",
    "ipoDate": "1998-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]