[
  {
    "symbol": "MRK",
    "price": 112.44,
    "beta": 0.357746,
    "volAvg": 6968674,
    "mktCap": 285309753600,
    "lastDiv": 2.92,
    "range": "84.52-119.65",
    "changes": -0.88,
    "companyName": "Merck & Co., Inc.",
    "currency": "USD",
    "cik": "0000310158",
    "isin": "US58933Y1055",
    "cusip": "58933Y105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.merck.com",
    "description": "Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The Pharmaceutical segment offers human health pharmaceutical products in the areas of oncology, hospital acute care, immunology, neuroscience, virology, cardiovascular, and diabetes, as well as vaccine products, such as preventive pediatric, adolescent, and adult vaccines. The Animal Health segment discovers, develops, manufactures, and markets veterinary pharmaceuticals, vaccines, and health management solutions and services, as well as digitally connected identification, traceability, and monitoring products. It serves drug wholesalers and retailers, hospitals, and government agencies; managed health care providers, such as health maintenance organizations, pharmacy benefit managers, and other institutions; and physicians and physician distributors, veterinarians, and animal producers. The company has collaborations with AstraZeneca PLC; Bayer AG; Eisai Co., Ltd.; Ridgeback Biotherapeutics; and Gilead Sciences, Inc. to jointly develop and commercialize long-acting treatments in HIV. Merck & Co., Inc. was founded in 1891 and is headquartered in Kenilworth, New Jersey.",
    "ceo": "Mr. Robert M. Davis J.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "67000",
    "phone": "908 740 4000",
    "address": "2000 Galloping Hill Road",
    "city": "Kenilworth",
    "state": "NJ",
    "zip": "07033",
    "dcfDiff": 3.43,
    "dcf": 108.81,
    "image": "https://financialmodelingprep.com/image-stock/MRK.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]