[
  {
    "symbol": "MRNA",
    "price": 123,
    "beta": 1.697464,
    "volAvg": 3355987,
    "mktCap": 46888706016,
    "lastDiv": 0,
    "range": "115.03-217.25",
    "changes": 2.33,
    "companyName": "Moderna, Inc.",
    "currency": "USD",
    "cik": "0001682852",
    "isin": "US60770K1079",
    "cusip": "60770K107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.modernatx.com",
    "description": "Moderna, Inc., a biotechnology company, discovers, develops, and commercializes messenger RNA therapeutics and vaccines for the treatment of infectious diseases, immuno-oncology, rare diseases, cardiovascular diseases, and auto-immune diseases in the United States, Europe, and internationally. Its respiratory vaccines include COVID-19, flu, respiratory syncytial virus, Endemic HCoV, and hMPV+PIV3 vaccines; latent vaccines comprise cytomegalovirus, epstein-barr virus, human immunodeficiency virus, herpes simplex virus, and varicella-zoster virus vaccines; and public health vaccines consists of Zika and Nipah vaccines. The company also offers systemic secreted and cell surface therapeutics; cancer vaccines, such as personalized cancer, KRAS, and checkpoint vaccines; intratumoral immuno-oncology products; localized regenerative, systemic intracellular, and inhaled pulmonary therapeutics. It has strategic alliances with AstraZeneca PLC; Merck & Co., Inc.; Vertex Pharmaceuticals Incorporated; Vertex Pharmaceuticals (Europe) Limited; Carisma Therapeutics, Inc.; Metagenomi, Inc.; the Defense Advanced Research Projects Agency; Biomedical Advanced Research and Development Authority; Institute for Life Changing Medicines; and The Bill & Melinda Gates Foundation, as well as a collaboration and license agreement with Chiesi Farmaceutici S.P.A. The company was formerly known as Moderna Therapeutics, Inc. and changed its name to Moderna, Inc. in August 2018. Moderna, Inc. was founded in 2010 and is headquartered in Cambridge, Massachusetts.",
    "ceo": "Mr. Stephane  Bancel",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "3900",
    "phone": "617 714 6500",
    "address": "200 Technology Square",
    "city": "Cambridge",
    "state": "MA",
    "zip": "02139",
    "dcfDiff": 5.35805,
    "dcf": 194.708,
    "image": "https://financialmodelingprep.com/image-stock/MRNA.png",
    "ipoDate": "2018-12-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]