[
  {
    "symbol": "MRVI",
    "price": 12.46,
    "beta": -0.231925,
    "volAvg": 2674627,
    "mktCap": 3127248330,
    "lastDiv": 0,
    "range": "11.59-30.44",
    "changes": -0.08,
    "companyName": "Maravai LifeSciences Holdings, Inc.",
    "currency": "USD",
    "cik": "0001823239",
    "isin": "US56600D1072",
    "cusip": "56600D107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.maravai.com",
    "description": "Maravai LifeSciences Holdings, Inc., a life sciences company, provides products to enable the development of drug therapies, diagnostics, novel vaccines, and support research on human diseases in the United States and internationally. The company's products address the key phases of biopharmaceutical development and include nucleic acids for diagnostic and therapeutic applications, antibody-based products to detect impurities during the production of biopharmaceutical products, and products to detect the expression of proteins in tissues of various species. It operates in two segments, Nucleic Acid Production and Biologics Safety Testing. The Nucleic Acid Production segment manufactures and sells products for use in the fields of gene therapy, nucleoside chemistry, oligonucleotide therapy, and molecular diagnostics, including reagents used in the chemical synthesis, modification, labelling, and purification of deoxyribonucleic acid (DNA) and ribonucleic acid (RNA). This segment also offers messenger RNA, oligonucleotides, and oligonucleotide building blocks, as well as plasmid DNA and CleanCap capping technology. The Biologics Safety Testing segment sells analytical products for use in biologic manufacturing process development, including custom product-specific development antibody and assay development services. This segment also provides HCP ELISA kits, other bioprocess impurity and contaminant ELISA kits, ancillary reagents, and custom services. The company serves biopharmaceutical companies, and other biopharmaceutical and life sciences research companies; and academic research institutions and in vitro diagnostics companies. Maravai LifeSciences Holdings, Inc. was incorporated in 2020 and is headquartered in San Diego, California.",
    "ceo": "Mr. Carl W. Hull",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "650",
    "phone": "858 546 0004",
    "address": "10770 Wateridge Circle",
    "city": "San Diego",
    "state": "CA",
    "zip": "92121",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MRVI.png",
    "ipoDate": "2020-11-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]