[
  {
    "symbol": "MS",
    "price": 83.99,
    "beta": 1.333098,
    "volAvg": 6870985,
    "mktCap": 140272534868,
    "lastDiv": 3.1,
    "range": "72.05-100.99",
    "changes": -0.44,
    "companyName": "Morgan Stanley",
    "currency": "USD",
    "cik": "0000895421",
    "isin": "US6174464486",
    "cusip": "617446448",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.morganstanley.com",
    "description": "Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides sales and trading services, such as sales, financing, prime brokerage, and market-making services in equity and fixed income products consisting of foreign exchange and commodities; corporate and commercial real estate loans, which provides secured lending facilities and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, liquidity, and alternative/other products to benefit/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, and third-party fund sponsors and corporations through institutional and intermediary channels. Morgan Stanley was founded in 1924 and is headquartered in New York, New York.",
    "ceo": "Mr. James Patrick Gorman",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "82000",
    "phone": "212 761 4000",
    "address": "1585 Broadway",
    "city": "New York",
    "state": "NY",
    "zip": "10036",
    "dcfDiff": 48.409,
    "dcf": 145.269,
    "image": "https://financialmodelingprep.com/image-stock/MS.png",
    "ipoDate": "1993-02-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]