[
  {
    "symbol": "MSA",
    "price": 170.33,
    "beta": 0.929225,
    "volAvg": 135122,
    "mktCap": 6688365143,
    "lastDiv": 1.88,
    "range": "108.75-170.56",
    "changes": 2.48,
    "companyName": "MSA Safety Incorporated",
    "currency": "USD",
    "cik": "0000066570",
    "isin": "US5534981064",
    "cusip": "553498106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Security & Protection Services",
    "website": "https://www.msasafety.com",
    "description": "MSA Safety Incorporated develops, manufactures, and supplies safety products that protect people and facility infrastructures in the oil, gas, petrochemical, fire service, construction, industrial manufacturing applications, utilities, military, and mining industries in North America, Latin America, and internationally. The company's core product offerings include permanently installed fixed gas and flame detection instruments, such as permanently installed gas detection monitoring systems, and flame detectors and open-path infrared gas detectors, as well as replacement components and related services to detect the presence or absence of various gases in the air. Its core product offerings also comprise breathing apparatus products, such as self-contained breathing apparatus; hand-held portable gas detection instruments; industrial head protection products; firefighter helmets and protective apparel; and fall protection equipment, including confined space equipment, harnesses, lanyards, and self-retracting lifelines, as well as engineered systems. In addition, the company offers air-purifying respirators, eye and face protection products, ballistic helmets, and gas masks. It serves distributors and end-users through indirect and direct sales channels. The company offers its product under the V-Gard, Cairns, and Gallet brand names. MSA Safety Incorporated was founded in 1914 and is based in Cranberry Township, Pennsylvania.",
    "ceo": "Mr. Nishan J. Vartanian",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5000",
    "phone": "724 776 8600",
    "address": "1000 Cranberry Woods Drive",
    "city": "Cranberry Township",
    "state": "PA",
    "zip": "16066-5207",
    "dcfDiff": 8.7433,
    "dcf": 143.253,
    "image": "https://financialmodelingprep.com/image-stock/MSA.png",
    "ipoDate": "1973-02-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]