[
  {
    "symbol": "MSBHF",
    "price": 48.66,
    "beta": 0.636015,
    "volAvg": 13380,
    "mktCap": 69132721021,
    "lastDiv": 1.48,
    "range": "26.47-51.79",
    "changes": 0.68,
    "companyName": "Mitsubishi Corporation",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Conglomerates",
    "website": "https://www.mitsubishicorp.com",
    "description": "Mitsubishi Corporation engages in the natural gas, industrial materials, petroleum and chemicals, mineral resources, industrial infrastructure, automotive and mobility, food and consumer industry, power solution, and urban development businesses worldwide. The company's Natural Gas segment is involved in the natural gas/oil exploration, production, and development, as well as liquified natural gas businesses. Its Industrial Materials segment invests in, develops, and trades in carbon, steel products, and performance materials for the automobile and mobility, construction, and infrastructure industries. The company's Petroleum & Chemicals segment invests in, develops, and trades in crude oil and oil products, LPG, ethylene, methanol, salt, ammonia, plastics, and fertilizers. Its Mineral Resources segment invests in and develops metallurgical coal, copper, iron ore, and aluminum resources. The company's Industrial Infrastructure segment trades in energy infrastructure, industrial plants, machinery tools, agricultural machinery, mining machinery, elevators, escalators, ships, and aerospace related equipment. Its Automotive & Mobility segment produces, finances, and sells passenger and commercial cars; and mobility services. The company's Food Industry segment develops and sells food resources, fresh foods, consumer goods, and food ingredients. Its Consumer Industry segment engages in supplying products and services a range of fields, including retail & distribution, logistics, healthcare, apparel, and tire, etc. The company's Power Solution segment generates, transmits, and retails power; supplies power generating and transmitting products and equipment; develops and sells lithium-ion battery; develops hydrogen; and offers battery services. Its Urban Development segment engages in the leasing; and urban infrastructure and real estate development, operation, and management businesses. The company was incorporated in 1950 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Katsuya  Nakanishi",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": null,
    "phone": "81 3 3210 2121",
    "address": "Mitsubishi Shoji Building",
    "city": "Tokyo",
    "state": null,
    "zip": "100-8086",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MSBHF.png",
    "ipoDate": "2010-06-09",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]