[
  {
    "symbol": "MSCI",
    "price": 463.32,
    "beta": 1.14014,
    "volAvg": 521587,
    "mktCap": 37094974488,
    "lastDiv": 5.52,
    "range": "385.0-572.5",
    "changes": -1.76,
    "companyName": "MSCI Inc.",
    "currency": "USD",
    "cik": "0001408198",
    "isin": "US55354G1004",
    "cusip": "55354G100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Financial Data & Stock Exchanges",
    "website": "https://www.msci.com",
    "description": "MSCI Inc., together with its subsidiaries, provides investment decision support tools for the clients to manage their investment processes worldwide. It operates through four segments: Index, Analytics, ESG and Climate, and All Other  Private Assets. The Index segment provides indexes for use in various areas of the investment process, including indexed product creation, such as ETFs, mutual funds, annuities, futures, options, structured products, over-the-counter derivatives; performance benchmarking; portfolio construction and rebalancing; and asset allocation, as well as licenses GICS and GICS Direct. The Analytics segment offers risk management, performance attribution and portfolio management content, application, and service that provides an integrated view of risk and return, and an analysis of market, credit, liquidity, and counterparty risk across asset classes; managed services, including consolidation of client portfolio data from various sources, review and reconciliation of input data and results, and customized reporting; and HedgePlatform to measure, evaluate, and monitor the risk of hedge fund investments. The ESG and Climate segment provides products and services that help institutional investors understand how ESG factors impact the long-term risk and return of their portfolio and individual security-level investments; and data, ratings, research, and tools to help investors navigate increasing regulation. The All Other  Private Assets segment includes real estate market and transaction data, benchmarks, return-analytics, climate assessments and market insights for funds, investors, and managers; business intelligence to real estate owners, managers, developers, and brokers; and offers investment decision support tools for private capital. It serves asset owners and managers, financial intermediaries, wealth managers, real estate professionals, and corporates. MSCI Inc. was incorporated in 1998 and is headquartered in New York, New York.",
    "ceo": "Mr. Henry A. Fernandez",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4846",
    "phone": "212 804 3900",
    "address": "7 World Trade Center",
    "city": "New York",
    "state": "NY",
    "zip": "10007",
    "dcfDiff": 9.54256,
    "dcf": 510.377,
    "image": "https://financialmodelingprep.com/image-stock/MSCI.png",
    "ipoDate": "2007-11-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]