[
  {
    "symbol": "MSI",
    "price": 283.54,
    "beta": 0.940492,
    "volAvg": 849800,
    "mktCap": 47554475912,
    "lastDiv": 3.52,
    "range": "204.55-299.43",
    "changes": -0.34,
    "companyName": "Motorola Solutions, Inc.",
    "currency": "USD",
    "cik": "0000068505",
    "isin": "US6200763075",
    "cusip": "620076307",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Communication Equipment",
    "website": "https://www.motorolasolutions.com",
    "description": "Motorola Solutions, Inc. provides mission critical communications and analytics in the United States, the United Kingdom, Canada, and internationally. The company operates in two segments, Products and Systems Integration, and Software and Services. The Products and Systems Integration segment offers a portfolio of infrastructure, devices, accessories, and video security devices and infrastructure, as well as the implementation, and integration of systems, devices, software, and applications for government, public safety, and commercial customers who operate private communications networks and video security solutions, as well as manage a mobile workforce. Its land mobile radio communications and video security and access control devices include two-way portable and vehicle-mounted radios, fixed and mobile video cameras, and accessories; radio network core and central processing software, base stations, consoles, and repeaters; and video analytics, network video management hardware and software, and access control solutions. The Software and Services segment provides repair, technical support, and hardware maintenance services. This segment also offers monitoring, software updates, and cybersecurity services; and public safety and enterprise command center software, unified communications applications, and video software solutions through on-premise and as a service. It serves government, public safety, and commercial customers. The company was formerly known as Motorola, Inc. and changed its name to Motorola Solutions, Inc. in January 2011. Motorola Solutions, Inc. was founded in 1928 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Gregory Q. Brown",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "20000",
    "phone": "847 576 5000",
    "address": "500 West Monroe Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60661",
    "dcfDiff": 19.0035,
    "dcf": 273.404,
    "image": "https://financialmodelingprep.com/image-stock/MSI.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]