[
  {
    "symbol": "MSM",
    "price": 95.95,
    "beta": 0.968661,
    "volAvg": 392251,
    "mktCap": 5378198995,
    "lastDiv": 3.16,
    "range": "71.33-98.37",
    "changes": -1.05,
    "companyName": "MSC Industrial Direct Co., Inc.",
    "currency": "USD",
    "cik": "0001003078",
    "isin": "US5535301064",
    "cusip": "553530106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Industrial Distribution",
    "website": "https://www.mscdirect.com",
    "description": "MSC Industrial Direct Co., Inc., together with its subsidiaries, distributes metalworking and maintenance, repair, and operations (MRO) products and services in the United States, Canada, Mexico, and the United Kingdom. Its MRO products include cutting tools, measuring instruments, tooling components, metalworking products, fasteners, flat stock products, raw materials, abrasives, machinery hand and power tools, safety and janitorial supplies, plumbing supplies, materials handling products, power transmission components, and electrical supplies. The company offers approximately 1.9 million stock-keeping units through its catalogs and brochures; e-commerce channels, including its Website, mscdirect.com; inventory management solutions; and call-centers and branches. It operates through a distribution network of 28 branch offices, 11 customer fulfilment centers, and seven regional inventory centers. The company serves individual machine shops, Fortune 1000 manufacturing companies, and government agencies, as well as manufacturers of various sizes. MSC Industrial Direct Co., Inc. was founded in 1941 and is headquartered in Melville, New York.",
    "ceo": "Mr. Erik David Gershwind",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "6765",
    "phone": "516 812 2000",
    "address": "515 Broadhollow Road",
    "city": "Melville",
    "state": "NY",
    "zip": "11747",
    "dcfDiff": 3.61266,
    "dcf": 85.4527,
    "image": "https://financialmodelingprep.com/image-stock/MSM.png",
    "ipoDate": "1995-12-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]