[
  {
    "symbol": "MSTR",
    "price": 325.61,
    "beta": 2.426056,
    "volAvg": 894474,
    "mktCap": 4219481981,
    "lastDiv": 0,
    "range": "132.56-361.97",
    "changes": 0.73,
    "companyName": "MicroStrategy Incorporated",
    "currency": "USD",
    "cik": "0001050446",
    "isin": "US5949724083",
    "cusip": "594972408",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.microstrategy.com",
    "description": "MicroStrategy Incorporated provides enterprise analytics software and services worldwide. It offers MicroStrategy, an enterprise platform, which provides a modern analytics experience by delivering insights across multiple devices to users via hyperintelligence products, visualization and reporting capabilities, mobility features, and custom applications developed on the platform; analysts and data scientists with seamless access to trusted, governed data directly within their tools; and APIs and gateways, multiple deployment options, enterprise semantic graph, scalability, and security. The company also provides MicroStrategy Support that helps customers to achieve their system availability and uptime goals, and to improve the overall experience through highly responsive troubleshooting and proactive technical product support. In addition, it offers MicroStrategy Consulting that provides customers with architecture and implementation services to help them quickly realize results, and helps to achieve returns on investment derived from understanding of data; and MicroStrategy Education that offers free and paid learning options. The company provides its services through enterprise sales force and channel partners. It serves companies from a range of industries, including retail, consulting, technology, manufacturing, finance, banking, insurance, healthcare, education, and telecommunications, as well as the public sector. The company was incorporated in 1989 and is headquartered in Tysons Corner, Virginia.",
    "ceo": "Mr. Phong Q. Le",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2123",
    "phone": "703 848 8600",
    "address": "1850 Towers Crescent Plaza",
    "city": "Tysons Corner",
    "state": "VA",
    "zip": "22182",
    "dcfDiff": 89.8389,
    "dcf": 168.521,
    "image": "https://financialmodelingprep.com/image-stock/MSTR.png",
    "ipoDate": "1998-06-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]