[
  {
    "symbol": "MT",
    "price": 26.85,
    "beta": 1.957088,
    "volAvg": 2352461,
    "mktCap": 22499789635,
    "lastDiv": 0.44,
    "range": "19.25-32.49",
    "changes": -0.22,
    "companyName": "ArcelorMittal S.A.",
    "currency": "USD",
    "cik": "0001243429",
    "isin": "US03938L2034",
    "cusip": "03938L203",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Steel",
    "website": "https://corporate.arcelormittal.com",
    "description": "ArcelorMittal S.A., together with its subsidiaries, operates as integrated steel and mining companies in Europe, North and South America, Asia, and Africa. Its principal steel products include semi-finished flat products, including slabs; finished flat products comprising plates, hot- and cold-rolled coils and sheets, hot-dipped and electro-galvanized coils and sheets, tinplate, and color coated coils and sheets; semi-finished long products, which includes blooms and billets; finished long products, including bars, wire-rods, structural sections, rails, sheet piles, and wire-products; and seamless and welded pipes and tubes. The company's principal mining products comprise iron ore lumps, fines, concentrates, pellets, and sinter feeds; and coking and thermal coal, and pulverized coal injections. It sells its products to various customers in the automotive, appliance, engineering, construction, energy, and machinery industries through a centralized marketing organization, as well as distributors. The company has iron ore mining activities in Brazil, Bosnia, Canada, Kazakhstan, Liberia, Mexico, South Africa, and Ukraine; and coal mining activities in Kazakhstan. ArcelorMittal S.A. was founded in 1976 and is headquartered in Luxembourg City, Luxembourg.",
    "ceo": "Mr. Aditya  Mittal",
    "sector": "Basic Materials",
    "country": "LU",
    "fullTimeEmployees": "154352",
    "phone": "352 47 921",
    "address": "24-26, Boulevard d’Avranches",
    "city": "Luxembourg City",
    "state": null,
    "zip": "1160",
    "dcfDiff": 2.29579,
    "dcf": 29.6242,
    "image": "https://financialmodelingprep.com/image-stock/MT.png",
    "ipoDate": "1997-08-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]