[
  {
    "symbol": "MTB",
    "price": 121.6,
    "beta": 0.782394,
    "volAvg": 1572256,
    "mktCap": 20169792000,
    "lastDiv": 5.2,
    "range": "109.36-193.42",
    "changes": -0.22,
    "companyName": "M&T Bank Corporation",
    "currency": "USD",
    "cik": "0000036270",
    "isin": "US55261F1049",
    "cusip": "55261F104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www3.mtb.com",
    "description": "M&T Bank Corporation operates as a bank holding company that provides commercial and retail banking services. The company's Business Banking segment offers deposit, lending, cash management, and other financial services to small businesses and professionals. Its Commercial Banking segment provides deposit products, commercial lending and leasing, letters of credit, and cash management services for middle-market and large commercial customers. The company's Commercial Real Estate segment originates, sells, and services commercial real estate loans; and offers deposit services. Its Discretionary Portfolio segment provides deposits; securities, residential real estate loans, and other assets; and short and long term borrowed funds, as well as foreign exchange services. The company's Residential Mortgage Banking segment offers residential real estate loans for consumers and sells those loans in the secondary market; and purchases servicing rights to loans originated by other entities. Its Retail Banking segment offers demand, savings, and time accounts; consumer installment loans, automobile and recreational finance loans, home equity loans and lines of credit, and credit cards; mutual funds and annuities; and other services. The company also provides trust and wealth management; fiduciary and custodial; insurance agency; institutional brokerage and securities; and investment management services. It offers its services through banking offices, business banking centers, telephone and internet banking, and automated teller machines. As of December 31, 2021, the company operates 688 domestic banking offices in New York State, Maryland, New Jersey, Pennsylvania, Delaware, Connecticut, Virginia, West Virginia, and the District of Columbia; and a full-service commercial banking office in Ontario, Canada. M&T Bank Corporation was founded in 1856 and is headquartered in Buffalo, New York.",
    "ceo": "Mr. Rene F. Jones CPA",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "23004",
    "phone": "716 635 4000",
    "address": "One M&T Plaza",
    "city": "Buffalo",
    "state": "NY",
    "zip": "14203",
    "dcfDiff": 349.989,
    "dcf": 504.969,
    "image": "https://financialmodelingprep.com/image-stock/MTB.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]