[
  {
    "symbol": "MTD",
    "price": 1275.41,
    "beta": 1.177112,
    "volAvg": 114061,
    "mktCap": 28084783282,
    "lastDiv": 0,
    "range": "1065.55-1615.97",
    "changes": 3.1901,
    "companyName": "Mettler-Toledo International Inc.",
    "currency": "USD",
    "cik": "0001037646",
    "isin": "US5926881054",
    "cusip": "592688105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Diagnostics & Research",
    "website": "https://www.mt.com",
    "description": "Mettler-Toledo International Inc. engages in the manufacture and supply of precision instruments and services worldwide. It operates in five segments: U.S. Operations, Swiss Operations, Western European Operations, Chinese Operations, and Other. The company's laboratory instruments include laboratory balances, liquid pipetting solutions, automated laboratory reactors, titrators, pH meters, process analytics sensors and analyzer technologies, physical value analyzers, thermal analysis systems, and other analytical instruments; and LabX, a laboratory software platform to manage and analyze data generated from its instruments. Its industrial instruments comprise industrial weighing instruments and related terminals, automatic dimensional measurement and data capture solutions, vehicle scale systems, industrial software, metal detection, x-ray, checkweighing, camera-based imaging equipment, track-and-trace solutions, and product inspection systems. The company's retail weighing solutions consist of networked scales and software, stand-alone scales, and automated packaging and labeling solutions for handling fresh goods. It serves the life science industry, independent research organizations, and testing labs; food and beverage manufacturers; food retailers; chemical, specialty chemical, and cosmetics companies; food retailers; transportation and logistics, metals, and electronics industries; and the academic community through its direct sales force and indirect distribution channels. The company was incorporated in 1991 and is based in Columbus, Ohio.",
    "ceo": "Mr. Patrick K. Kaltenbach",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "16400",
    "phone": "614 438 4511",
    "address": "1900 Polaris Parkway",
    "city": "Columbus",
    "state": "OH",
    "zip": "43240",
    "dcfDiff": 133.618,
    "dcf": 1396.13,
    "image": "https://financialmodelingprep.com/image-stock/MTD.png",
    "ipoDate": "1997-11-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]