[
  {
    "symbol": "MTDR",
    "price": 50.18,
    "beta": 3.57007,
    "volAvg": 1344125,
    "mktCap": 5980653120,
    "lastDiv": 0.6,
    "range": "41.17-73.78",
    "changes": 0.02,
    "companyName": "Matador Resources Company",
    "currency": "USD",
    "cik": "0001520006",
    "isin": "US5764852050",
    "cusip": "576485205",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas E&P",
    "website": "https://www.matadorresources.com",
    "description": "Matador Resources Company, an independent energy company, engages in the exploration, development, production, and acquisition of oil and natural gas resources in the United States. It operates through two segments, Exploration and Production; and Midstream. The company primarily holds interests in the Wolfcamp and Bone Spring plays in the Delaware Basin in Southeast New Mexico and West Texas. It also operates the Eagle Ford shale play in South Texas; and the Haynesville shale and Cotton Valley plays in Northwest Louisiana. In addition, the company conducts midstream operations in support of its exploration, development, and production operations; provides natural gas processing and oil transportation services; and offers oil, natural gas, and produced water gathering services, as well as produced water disposal services to third parties. As of December 31, 2021, its estimated total proved oil and natural gas reserves were 323.4 million barrels of oil equivalent, including 181.3 million stock tank barrels of oil and 852.5 billion cubic feet of natural gas. The company was formerly known as Matador Holdco, Inc. and changed its name to Matador Resources Company in August 2011. Matador Resources Company was founded in 2003 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Joseph Wm. Foran",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "360",
    "phone": "972 371 5200",
    "address": "One Lincoln Centre",
    "city": "Dallas",
    "state": "TX",
    "zip": "75240",
    "dcfDiff": 0.726175,
    "dcf": 66.5538,
    "image": "https://financialmodelingprep.com/image-stock/MTDR.png",
    "ipoDate": "2012-02-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]