[
  {
    "symbol": "MTLHY",
    "price": 29.43,
    "beta": 0.63908,
    "volAvg": 596,
    "mktCap": 8364535269,
    "lastDiv": 1.1,
    "range": "21.93-30.5",
    "changes": 0.79,
    "companyName": "Mitsubishi Chemical Group Corporation",
    "currency": "USD",
    "cik": "0001446418",
    "isin": "US6067631001",
    "cusip": "606763100",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Chemicals",
    "website": "https://www.mitsubishichem-hd.co.jp",
    "description": "Mitsubishi Chemical Group Corporation provides performance products, chemicals, industrial gases, health care products, and other products in Japan and internationally. The company's performance products include specialty chemicals, functional food materials, inorganic materials, electronic and electrical components and products, molding and processed products, film and sheet products, synthetic paper and fiber, carbon fiber, equipment, instruments and systems, materials and products for industrial use, construction materials, civil engineering materials, aqua-related materials and products, leisure, sports, and daily goods. Its health care products comprise pharmaceuticals, pharmaceutical formulation materials and related products, drug discovery solutions, diagnostic reagents and instruments, health apparatus and instruments for medical use, medical support, nursing care and health support, and clinical examination and service. The company also offers industrial materials, such as basic chemicals, carbon materials, synthetic resins, and industrial gases; and engineering, information systems, analysis and inspection, packaging and logistics, survey, consulting, and other services. In addition, it provides engineering, transportation, and warehousing services. The company was incorporated in 2005 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Jean-Marc  Gilson",
    "sector": "Basic Materials",
    "country": "JP",
    "fullTimeEmployees": "69784",
    "phone": "81 3 6748 7120",
    "address": "1-1 Marunouchi 1-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "100-8251",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MTLHY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]