[
  {
    "symbol": "MTNOY",
    "price": 7.358,
    "beta": 0.761301,
    "volAvg": 44859,
    "mktCap": 13299070058,
    "lastDiv": 0.18,
    "range": "5.66-9.88",
    "changes": 0.028,
    "companyName": "MTN Group Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US62474M1080",
    "cusip": "62474M108",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.mtn.com",
    "description": "MTN Group Limited, together with its subsidiaries, operates in the mobile telecommunications industry. The company provides data, voice and SMS, digital and fintech, wholesale, and interconnect and roaming services, as well as sells mobile devices. It also offers network as a service, which include subsea cables providing international connectivity services; terrestrial and metro fiber networks; data centers and cable landing stations; and FTTx, towers, and radio access networks. The company also provides digital financial services, such as access payments, e-commerce, insurance, and lending and remittance services; enterprise services, including cloud, unified communications, Internet of Things (IoT), and software defined networks; and API products and services for telecommunications, health, government, financial services, entertainment, and other sectors. As of March 9, 2022, it had a total of 272.4 million subscribers in 21 markets internationally. The company operates in South Africa, Nigeria, South and East Africa, West and Central Africa, and the Middle East and North Africa. MTN Group Limited was incorporated in 1994 and is based in Johannesburg, South Africa.",
    "ceo": "Mr. Ralph Tendai Mupita B.Sc., M.B.A.",
    "sector": "Communication Services",
    "country": "ZA",
    "fullTimeEmployees": "21975",
    "phone": "27 11 912 3000",
    "address": "Innovation Centre, 216 14th Avenue",
    "city": "Johannesburg",
    "state": null,
    "zip": "2195",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MTNOY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]