[
  {
    "symbol": "MTRN",
    "price": 111.24,
    "beta": 1.080985,
    "volAvg": 87020,
    "mktCap": 2292511788,
    "lastDiv": 0.52,
    "range": "64.89-121.29",
    "changes": 1.07,
    "companyName": "Materion Corporation",
    "currency": "USD",
    "cik": "0001104657",
    "isin": "US5766901012",
    "cusip": "576690101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Other Industrial Metals & Mining",
    "website": "https://materion.com",
    "description": "Materion Corporation, through with its subsidiaries, produces advanced engineered materials used in semiconductor, industrial, aerospace and defense, automotive, energy, consumer electronics, and telecom and data center in the United States, Asia, Europe, and internationally. It operates through Performance Alloys and Composites, Advanced Materials, and Precision Optics segments. The Performance Alloys and Composites segment offers advanced engineered solutions comprising beryllium and non-beryllium containing alloy systems and custom engineered parts in strip, bulk, rod, plate, bar, tube, and other customized shapes. This segment operates the bertrandite ore mine and refinery located in Utah that provides feedstock hydroxide for its beryllium businesses and external sale. The Advances Materials segment produces advanced chemicals, microelectronics packaging, precious metal, non-precious metal, and specialty metal products, including vapor deposition targets, frame lid assemblies, clad and precious metal pre-forms, high temperature braze materials, and ultra-pure wire. This segment offers its products from its facilities, as well as through direct sales offices and independent sales representatives. The Precision Optics segment designs and produces precision thin film coatings, optical filters, and assemblies. This segment sells its directly from its facilities, as well as through direct sales offices and independent sales representatives throughout the world. The company was formerly known as Brush Engineered Materials Inc. and changed its name to Materion Corporation in 2011. Materion Corporation was incorporated in 1931 and is headquartered in Mayfield Heights, Ohio.",
    "ceo": "Mr. Jugal K. Vijayvargiya",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "3723",
    "phone": "216 486 4200",
    "address": "6070 Parkland Boulevard",
    "city": "Mayfield Heights",
    "state": "OH",
    "zip": "44124",
    "dcfDiff": 11.361,
    "dcf": 78.099,
    "image": "https://financialmodelingprep.com/image-stock/MTRN.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]