[
  {
    "symbol": "MTSI",
    "price": 62.52,
    "beta": 1.830281,
    "volAvg": 486122,
    "mktCap": 4431673682,
    "lastDiv": 0,
    "range": "42.85-76.56",
    "changes": -0.54,
    "companyName": "MACOM Technology Solutions Holdings, Inc.",
    "currency": "USD",
    "cik": "0001493594",
    "isin": "US55405Y1001",
    "cusip": "55405Y100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.macom.com",
    "description": "MACOM Technology Solutions Holdings, Inc., together with its subsidiaries, designs and manufactures analog semiconductor solutions for use in wireless and wireline applications across the radio frequency (RF), microwave, millimeter wave, and lightwave spectrum in the United States, China, the Asia Pacific, and internationally. The company offers a portfolio of standard and custom devices, including integrated circuits, multi-chip modules, diodes, amplifiers, switches and switch limiters, passive and active components, and subsystems. Its semiconductor products are electronic components that are incorporated in electronic systems, such as wireless basestations, high-capacity optical networks, radar, and medical systems and test and measurement. The company serves various markets comprising telecommunication that includes carrier infrastructure, which comprise long-haul/metro, 5G, and fiber-to-the-X/passive optical network; industrial and defense, including military and commercial radar, RF jammers, electronic countermeasures, and communication data links, as well as multi-market applications, such as industrial, medical, test and measurement, and scientific applications; and data centers. It sells its products through direct sales force, applications engineering staff, independent sales representatives, resellers, and distributors. The company was founded in 1950 and is headquartered in Lowell, Massachusetts.",
    "ceo": "Mr. Stephen G. Daly",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1200",
    "phone": "978 656 2500",
    "address": "100 Chelmsford Street",
    "city": "Lowell",
    "state": "MA",
    "zip": "01851",
    "dcfDiff": 2.2512,
    "dcf": 70.4912,
    "image": "https://financialmodelingprep.com/image-stock/MTSI.png",
    "ipoDate": "2012-03-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]