[
  {
    "symbol": "MTZ",
    "price": 115.58,
    "beta": 1.357394,
    "volAvg": 628780,
    "mktCap": 9114546336,
    "lastDiv": 1,
    "range": "62.36-116.72",
    "changes": -0.95,
    "companyName": "MasTec, Inc.",
    "currency": "USD",
    "cik": "0000015615",
    "isin": "US5763231090",
    "cusip": "576323109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Engineering & Construction",
    "website": "https://www.mastec.com",
    "description": "MasTec, Inc., an infrastructure construction company, provides engineering, building, installation, maintenance, and upgrade services for communications, energy, utility, and other infrastructure primarily in the United States and Canada. It operates through Communications, Clean Energy and Infrastructure, Oil and Gas, Power Delivery, and Other segments. The company builds underground and overhead distribution systems, including trenches, conduits, cell towers, cable, and power lines, which provide wireless and wireline/fiber communications; clean energy infrastructure comprising renewable energy; natural gas, product transport; electrical and gas transmission, and distribution systems; heavy industrial plants; compressor and pump stations, and treatment plants; water and sewer infrastructure, including water pipelines; and other civil construction infrastructure. It also installs electrical and other gas distribution and transmission systems, power generation facilities, buried and aerial fiber optic and other cables, as well as home automation and energy management solutions. In addition, the company offers maintenance and upgrade support services comprising maintenance of customers' distribution facilities, networks, and infrastructure, including communications, power generation, pipeline, electrical distribution and transmission, and heavy civil infrastructure; service restoration for natural disasters and accidents; and routine replacements and upgrades to overhauls. Its customers include public and private energy providers, pipeline operators, wireless and wireline/fiber service providers, broadband operators, install-to-the-home service providers, and government entities. MasTec, Inc. was founded in 1929 and is headquartered in Coral Gables, Florida.",
    "ceo": "Mr. Jose Ramon Mas",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "33000",
    "phone": "305 599 1800",
    "address": "800 South Douglas Road",
    "city": "Coral Gables",
    "state": "FL",
    "zip": "33134",
    "dcfDiff": 2.98999,
    "dcf": 93.64,
    "image": "https://financialmodelingprep.com/image-stock/MTZ.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]