[
  {
    "symbol": "MU",
    "price": 67.07,
    "beta": 1.388028,
    "volAvg": 18522277,
    "mktCap": 73400738373,
    "lastDiv": 0.46,
    "range": "48.43-74.77",
    "changes": 0.28,
    "companyName": "Micron Technology, Inc.",
    "currency": "USD",
    "cik": "0000723125",
    "isin": "US5951121038",
    "cusip": "595112103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.micron.com",
    "description": "Micron Technology, Inc. designs, manufactures, and sells memory and storage products worldwide. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Storage Business Unit, and Embedded Business Unit. It provides memory and storage technologies comprises DRAM products, which are dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; NAND products that are non-volatile and re-writeable semiconductor storage devices; and NOR memory products, which are non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers memory products for the cloud server, enterprise, client, graphics, and networking markets, as well as for smartphone and other mobile-device markets; SSDs and component-level solutions for the enterprise and cloud, client, and consumer storage markets; other discrete storage products in component and wafers; and memory and storage products for the automotive, industrial, and consumer markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.",
    "ceo": "Mr. Sanjay  Mehrotra",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "48000",
    "phone": "208 368 4000",
    "address": "8000 South Federal Way",
    "city": "Boise",
    "state": "ID",
    "zip": "83716-9632",
    "dcfDiff": 0.0936803,
    "dcf": 63.9637,
    "image": "https://financialmodelingprep.com/image-stock/MU.png",
    "ipoDate": "1984-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]