[
  {
    "symbol": "MUFG",
    "price": 7.13,
    "beta": 0.762068,
    "volAvg": 3620369,
    "mktCap": 85728268913,
    "lastDiv": 0.22,
    "range": "4.31-7.71",
    "changes": 0.04,
    "companyName": "Mitsubishi UFJ Financial Group, Inc.",
    "currency": "USD",
    "cik": "0000067088",
    "isin": "US6068221042",
    "cusip": "606822104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.mufg.jp",
    "description": "Mitsubishi UFJ Financial Group, Inc. operates as the bank holding company for MUFG Bank, Ltd. that provides various financial services in Japan, the United States, Europe, Asia/Oceania, and internationally. It operates through Digital Service Business Group; Retail & Commercial Banking Business Group; Japanese Corporate & Investment Banking Business Group; Asset Management & Investor Services Business Group; Global Corporate & Investment Banking Business Group; Global Commercial Banking Business Group; and Global Markets Business Group segments. The company offers commercial banking, trust banking, and securities products and services to retail, and small and medium-sized enterprise customers. It also provides M&As and real estate-related services; digital-based financial services; credit cards; and trust banking and securities products and services, as well as engages in the lending, fund settlement, and foreign exchange businesses. In addition, it offers corporate, investment, and transaction banking services for large corporate and financial institutions; asset management and administration services for corporations and pension funds; loans, deposits, fund transfers, and investments services for retail, small and medium-sized enterprise, as well as corporate customers; fixed income instruments, currencies, equities, and other investment products; originates and distributes of financial products; and provides treasury services. Mitsubishi UFJ Financial Group, Inc. was founded in 1880 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Hironori  Kamezawa",
    "sector": "Financial Services",
    "country": "JP",
    "fullTimeEmployees": "129700",
    "phone": "81 3 3240 8111",
    "address": "7-1, Marunouchi 2-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "100-8330",
    "dcfDiff": 8015.88,
    "dcf": 8023.42,
    "image": "https://financialmodelingprep.com/image-stock/MUFG.png",
    "ipoDate": "2001-04-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]