[
  {
    "symbol": "MWA",
    "price": 15.8,
    "beta": 1.286971,
    "volAvg": 892887,
    "mktCap": 2471467600,
    "lastDiv": 0.24,
    "range": "9.9-15.95",
    "changes": 0.1,
    "companyName": "Mueller Water Products, Inc.",
    "currency": "USD",
    "cik": "0001350593",
    "isin": "US6247581084",
    "cusip": "624758108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.muellerwaterproducts.com",
    "description": "Mueller Water Products Inc. manufactures and markets products and services used in the transmission, distribution, and measurement of water in North America and internationally. Its products and services are used by municipalities, and the residential and non-residential construction industries. It operates through two segments, Infrastructure and Technologies. The company's Infrastructure segment manufactures and sells valves for water and gas systems, including iron gate, butterfly, tapping, check, knife, plug, automatic control, and ball valves; and dry-barrel and wet-barrel fire hydrants and service brass products, as well as a line of pipe repair products, such as clamps and couplings used to repair leaks. This segment offers its products under Canada Valve, Centurion, Ez-Max, Hydro Gate, Hydro-Guard, HYMAX, HYMAX VERSA, Jones, Krausz, Milliken, Mueller, Pratt, Pratt Industrial, Repamax, Repaflex, and Singer brands. Its Technologies segment offers residential and commercial water metering, water leak detection and pipe condition assessment products, systems, and services. It offers products under Echologics, Echoshore, ePulse, Hersey, LeakFinderRT, LeakFinderST, LeakListener, LeakTuner, Mi.Echo, Mi.Data, Mi.Hydrant, Mi.Net, Mueller Systems, and Sentryx brands. The company was founded in 1857 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. John Scott Hall",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "3600",
    "phone": "770 206 4200",
    "address": "1200 Abernathy Road NE",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30328",
    "dcfDiff": 0.60902,
    "dcf": 13.009,
    "image": "https://financialmodelingprep.com/image-stock/MWA.png",
    "ipoDate": "2006-05-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]