[
  {
    "symbol": "MXCHY",
    "price": 5.05,
    "beta": 0.885616,
    "volAvg": 287,
    "mktCap": 4814932762,
    "lastDiv": 0.27,
    "range": "3.355-5.05",
    "changes": 0,
    "companyName": "Orbia Advance Corporation, S.A.B. de C.V.",
    "currency": "USD",
    "cik": "0001435969",
    "isin": null,
    "cusip": "68560E108",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Chemicals",
    "website": "https://www.orbia.com",
    "description": "Orbia Advance Corporation, S.A.B. de C.V. provides products and solutions for precision agriculture, building and infrastructure, fluor, polymer, and data communications sectors worldwide. The company offers irrigation systems, digital agricultural technologies, and related services; and data communications infrastructure, including conduits, and cables and fiber optics, as well as pressurized pipes for natural gas and other solutions. It also provides pipes and fittings for water management systems, and home water heating and cooling systems; fluorinated material products, including chemical products, propellants, and advanced materials for a range of applications in the automotive, infrastructure, health and medicine, HVAC, and food cold chain industries; and general and special PVC resins, and other vinyl polymers for various applications. The company was formerly known as Mexichem, S.A.B. de C.V. and changed its name to Orbia Advance Corporation, S.A.B. de C.V. in August 2019. Orbia Advance Corporation, S.A.B. de C.V. was founded in 1953 and is headquartered in Mexico City, Mexico.",
    "ceo": "Mr. Sameer S.  Bharadwaj",
    "sector": "Basic Materials",
    "country": "MX",
    "fullTimeEmployees": "24736",
    "phone": "52 55 5366 4000",
    "address": "Avenida Paseo de la Reforma 483",
    "city": "Mexico City",
    "state": "DF",
    "zip": "06500",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/MXCHY.png",
    "ipoDate": "2012-08-03",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]