[
  {
    "symbol": "MXL",
    "price": 29.38,
    "beta": 1.928873,
    "volAvg": 737643,
    "mktCap": 2349844836,
    "lastDiv": 0,
    "range": "23.05-43.66",
    "changes": -0.37,
    "companyName": "MaxLinear, Inc.",
    "currency": "USD",
    "cik": "0001288469",
    "isin": "US57776J1007",
    "cusip": "57776J100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.maxlinear.com",
    "description": "MaxLinear, Inc. provides radiofrequency (RF), high-performance analog, and mixed-signal communications systems-on-chip solutions (SoCs) for the connected home, wired and wireless infrastructure, and industrial and multi-market applications worldwide. Its products integrate various portions of a high-speed communication system, including RF, high-performance analog, mixed-signal, digital signal processing, security engines, data compression, networking layers, and power management. The company offers broadband radio transceiver front ends, data converters, embedded systems and software architecture, and architecture and system design for highly integrated end-to-end communication platform solutions. Its products are used in various electronic devices, such as cable data over cable service interface specifications (DOCSIS), fiber and DSL broadband modems and gateways; Wi-Fi and wireline routers for home networking; radio transceivers and modems for 4G/5G base-station and backhaul infrastructure; and fiber-optic modules for data center, metro, and long-haul transport networks, as well as power management and interface products. It serves electronics distributors, module makers, original equipment manufacturers (OEMs), and original design manufacturers (ODMs) through a direct sales force, third-party sales representatives, and a network of distributors. The company was incorporated in 2003 and is headquartered in Carlsbad, California.",
    "ceo": "Dr. Kishore  Seendripu Ph.D.",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1844",
    "phone": "760 692 0711",
    "address": "5966 La Place Court",
    "city": "Carlsbad",
    "state": "CA",
    "zip": "92008",
    "dcfDiff": 5.42407,
    "dcf": 35.8759,
    "image": "https://financialmodelingprep.com/image-stock/MXL.png",
    "ipoDate": "2010-03-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]