[
  {
    "symbol": "MYRG",
    "price": 134.65,
    "beta": 0.996478,
    "volAvg": 121488,
    "mktCap": 2249745665,
    "lastDiv": 0,
    "range": "76.97-140.14",
    "changes": -1.35,
    "companyName": "MYR Group Inc.",
    "currency": "USD",
    "cik": "0000700923",
    "isin": "US55405W1045",
    "cusip": "55405W104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Engineering & Construction",
    "website": "https://www.myrgroup.com",
    "description": "MYR Group Inc., through its subsidiaries, provides electrical construction services in the United States and Canada. It operates in two segments, Transmission and Distribution, and Commercial and Industrial. The Transmission and Distribution segment offers a range of services on electric transmission and distribution networks, and substation facilities, including design, engineering, procurement, construction, upgrade, maintenance, and repair services with primary focus on construction, maintenance, and repair to customers in the electric utility industry; and services, including construction and maintenance of high voltage transmission lines, substations, and lower voltage underground and overhead distribution systems, renewable power facilities, and limited gas construction services, as well as emergency restoration services in response to hurricane, ice, or other storm related damages. This segment serves as a prime contractor to customers, such as investor-owned utilities, cooperatives, private developers, government-funded utilities, independent power producers, independent transmission companies, industrial facility owners, and other contractors. The Commercial and Industrial segment provides a range of services, including design, installation, maintenance, and repair of commercial and industrial wiring; and installation of traffic networks, bridge, roadway, and tunnel lighting for airports, hospitals, data centers, hotels, stadiums, convention centers, renewable energy projects, manufacturing plants, processing facilities, waste-water treatment facilities, mining facilities, and transportation control and management systems. This segment serves general contractors, commercial and industrial facility owners, governmental agencies, and developers. The company was founded in 1891 and is headquartered in Henderson, Colorado.",
    "ceo": "Mr. Richard S. Swartz Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "8500",
    "phone": "303 286 8000",
    "address": "12150 East 112th Avenue",
    "city": "Henderson",
    "state": "CO",
    "zip": "80640",
    "dcfDiff": 4.13196,
    "dcf": 101.412,
    "image": "https://financialmodelingprep.com/image-stock/MYRG.png",
    "ipoDate": "2008-08-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]