[
  {
    "symbol": "NABZY",
    "price": 8.63,
    "beta": 0.888505,
    "volAvg": 248693,
    "mktCap": 54029320991,
    "lastDiv": 0.54,
    "range": "8.17-11.45",
    "changes": -0.01,
    "companyName": "National Australia Bank Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US6325254083",
    "cusip": "632525408",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Diversified",
    "website": "https://www.nab.com.au",
    "description": "National Australia Bank Limited provides financial services to individuals and businesses in Australia, New Zealand, and internationally. It operates through Business and Private Banking, Personal Banking, Corporate and Institutional Banking, and New Zealand Banking segments. It operates through Business and Private Banking; Personal Banking; Corporate and Institutional Banking; New Zealand Banking; and Corporate Functions and Other segments. The company accepts transaction accounts, savings accounts, deposit accounts, and term deposits; and specialized accounts, such as foreign currency, business interest, statutory trust, community free saver, farm management, and project bank accounts, as well as farm management deposits. National Australia Bank Limited also provides home loans; personal loans; business loans; vehicle and equipment finance; and trade and invoice finance, as well as business overdrafts and bank guarantees. In addition, the company offers insurance products consisting of car, home and content, landlord, travel, caravan and trailer, life, and business insurance products; and pension, superannuation, self-managed super funds, cash management, and financial planning and advisory services. Further, it provides investment products; credit, debit, and business cards; payments and merchant services; travel services; online and internet banking services; small business services; international and foreign exchange solutions; and industry specific banking services. National Australia Bank Limited was founded in 1834 and is based in Melbourne, Australia.",
    "ceo": "Mr. Ross Maxwell McEwan B.B.S., CBE",
    "sector": "Financial Services",
    "country": "AU",
    "fullTimeEmployees": "36963",
    "phone": "61 3 8872 2461",
    "address": "395 Bourke Street",
    "city": "Melbourne",
    "state": "VIC",
    "zip": "3000",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NABZY.png",
    "ipoDate": "1988-06-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]