[
  {
    "symbol": "NATI",
    "price": 57.45,
    "beta": 1.195774,
    "volAvg": 2061475,
    "mktCap": 7626659850,
    "lastDiv": 1.12,
    "range": "29.81-58.3",
    "changes": -0.05,
    "companyName": "National Instruments Corporation",
    "currency": "USD",
    "cik": "0000935494",
    "isin": "US6365181022",
    "cusip": "636518102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.ni.com",
    "description": "National Instruments Corporation provides a software-centric platform and systems to engineers and scientists worldwide. Its programming environments software includes NI LabVIEW, a graphical software platform to visualize hardware configuration, measurement data, and debugging of application; NI LabWindows/CVI, an ANSI C integrated development environment and engineering toolbox; and NI Measurement Studio, a suite of .NET tools for building engineering applications in Microsoft Visual Studio. The company's application software comprises NI TestStand that is used for automated test and measurement applications in manufacturing environment; NI VeriStand, a software environment for configuring real-time testing applications; Flexlogger for sensor configuration and data logging of mixed signals; and NI InsightCM Enterprise, a software for monitoring ancillary rotating equipment. Its operations management and analytic enterprise software include NI DIAdem, which is configuration-based technical data management, analysis, and report generation tools to mine and analyze engineering and measurement data; NI SystemLink, a systems management and data collection software that enables the mass coordination of connected devices, software deployments, and data communications throughout a distributed system; and NI Optimal Plus. The company also offers PXI hardware form factor; and NI semiconductor test systems, as well as software and hardware maintenance, and training and certification services. It serves semiconductor, transportation, aerospace, and defense industries; and government agencies. National Instruments Corporation has strategic agreements with Konrad Technologies, Inc. to develop test systems and solutions for autonomous driving software and hardware validation; and Foretellix Ltd. to enhance the safety of advanced driver-assistance systems and autonomous vehicles. The company was incorporated in 1976 and is headquartered in Austin, Texas.",
    "ceo": "Mr. Eric Howard Starkloff",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "7000",
    "phone": "512 683 0100",
    "address": "11500 North MoPac Expressway",
    "city": "Austin",
    "state": "TX",
    "zip": "78759-3504",
    "dcfDiff": 12.6209,
    "dcf": 41.8891,
    "image": "https://financialmodelingprep.com/image-stock/NATI.png",
    "ipoDate": "1995-03-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]