[
  {
    "symbol": "NAVI",
    "price": 18.43,
    "beta": 1.550704,
    "volAvg": 1410169,
    "mktCap": 2330749950,
    "lastDiv": 0.64,
    "range": "12.88-19.4",
    "changes": -0.04,
    "companyName": "Navient Corporation",
    "currency": "USD",
    "cik": "0001593538",
    "isin": "US63938C1080",
    "cusip": "63938C108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Credit Services",
    "website": "https://www.navient.com",
    "description": "Navient Corporation provides education loan management and business processing solutions for education, healthcare, and government clients at the federal, state, and local levels in the United States. It operates through three segments: Federal Education Loans, Consumer Lending, and Business Processing. The company owns Federal Family Education Loan Program (FFELP) loans that are insured or guaranteed by state or not-for-profit agencies; and performs servicing and asset recovery services on its own loan portfolio, as well as asset recovery services on FFELP loans owned by other institutions. It also owns, originates, acquires, and services refinance and in-school private education loans; and offers healthcare services that include revenue cycle outsourcing, accounts receivable management, extended business office support, consulting engagement, and public health programs, as well as business processing services to state governments, agencies, court systems, municipalities, and parking and tolling authorities. In addition, the company provides customizable solutions for its clients that include hospitals, hospital systems, medical centers, large physician groups, other healthcare providers, and public health departments; and corporate liquidity portfolio services. Navient Corporation was founded in 1973 and is headquartered in Wilmington, Delaware.",
    "ceo": "Mr. David L. Yowan",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4000",
    "phone": "302 283 8000",
    "address": "123 Justison Street",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19801",
    "dcfDiff": 3.21433,
    "dcf": 21.7943,
    "image": "https://financialmodelingprep.com/image-stock/NAVI.png",
    "ipoDate": "2014-04-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]