[
  {
    "symbol": "NBIX",
    "price": 94.82,
    "beta": 0.478521,
    "volAvg": 744961,
    "mktCap": 9252042536,
    "lastDiv": 0,
    "range": "89.04-129.29",
    "changes": 0.13,
    "companyName": "Neurocrine Biosciences, Inc.",
    "currency": "USD",
    "cik": "0000914475",
    "isin": "US64125C1099",
    "cusip": "64125C109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.neurocrine.com",
    "description": "Neurocrine Biosciences, Inc. discovers, develops, and markets pharmaceuticals for neurological, endocrine, and psychiatric disorders. The company's portfolio includes treatments for tardive dyskinesia, Parkinson's disease, endometriosis, and uterine fibroids, as well as clinical programs in various therapeutic areas. Its lead asset is INGREZZA, a VMAT2 inhibitor for the treatment of tardive dyskinesia. The company's commercial products include ONGENTYS, a catechol-O-methyltransferase inhibitor used as an adjunct therapy to levodopa/DOPA decarboxylase inhibitors for patients with Parkinson's disease; ORILISSA for the management of moderate to severe endometriosis pain in women; and ORIAHNN, a non-surgical oral medication option for the management of heavy menstrual bleeding associated with uterine fibroids in pre-menopausal women. Its product candidates in clinical development include NBI-921352 for treating pediatric patients, as well as adult focal epilepsy indications; and NBI-827104 to treat rare pediatric epilepsy and essential tremor. The company's products in clinical development also comprise NBI-1065845 for the treatment of major depressive disorder; NBI-1065846 for treating anhedonia in major depressive disorder; and NBI-118568 for the treatment of schizophrenia. It has license and collaboration agreements with Heptares Therapeutics Limited; Takeda Pharmaceutical Company Limited; Idorsia Pharmaceuticals Ltd; Xenon Pharmaceuticals Inc.; Voyager Therapeutics, Inc.; BIAL  Portela & Ca, S.A.; Mitsubishi Tanabe Pharma Corporation; and AbbVie Inc. Neurocrine Biosciences, Inc. was incorporated in 1992 and is headquartered in San Diego, California.",
    "ceo": "Dr. Kevin C. Gorman Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "1300",
    "phone": "858 617 7600",
    "address": "12780 El Camino Real",
    "city": "San Diego",
    "state": "CA",
    "zip": "92130",
    "dcfDiff": 13.5447,
    "dcf": 121.795,
    "image": "https://financialmodelingprep.com/image-stock/NBIX.png",
    "ipoDate": "1996-05-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]