[
  {
    "symbol": "NCNO",
    "price": 29.98,
    "beta": 0.331469,
    "volAvg": 985991,
    "mktCap": 3365374920,
    "lastDiv": 0,
    "range": "19.58-39.826",
    "changes": 0.09,
    "companyName": "nCino, Inc.",
    "currency": "USD",
    "cik": "0001902733",
    "isin": "US63947X1019",
    "cusip": "63947X101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.ncino.com",
    "description": "nCino, Inc., a software-as-a-service company, provides cloud-based software applications to financial institutions in the United States and internationally. Its nCino Bank Operating System, a tenant cloud platform, which digitizes, automates, and streamlines complex processes and workflow; and utilizes data analytics and artificial intelligence and machine learning (AI/ML) to enable banks and credit unions to onboard new clients, make loans and manage the entire loan life cycle, open deposit and other accounts, and manage regulatory compliance. The company's nCino IQ, an application suite that utilizes data analytics and AI/ML to provide its customers with automation and insights into their operations, such as tools for analyzing, measuring, and managing credit risk, as well as to enhance their ability to comply with regulatory requirements. It also offers SimpleNexus, a suite of products that enables loan officers, borrowers, real estate agents, settlement agents, and others to engage in the homeownership process from internet-enabled device. The company serves financial institution customers, including global financial institutions, enterprise banks, regional banks, community banks, credit unions, new market entrants, and independent mortgage banks through sales team comprising business development representatives, account executives, field sales engineers, and customer success managers. nCino, Inc. was founded in 2011 and is headquartered in Wilmington, North Carolina.",
    "ceo": "Mr. Pierre  Naude",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1791",
    "phone": "888 676 2466",
    "address": "6770 Parker Farm Drive",
    "city": "Wilmington",
    "state": "NC",
    "zip": "28405",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NCNO.png",
    "ipoDate": "2020-07-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]