[
  {
    "symbol": "NCR",
    "price": 24.67,
    "beta": 1.648591,
    "volAvg": 1336996,
    "mktCap": 3463668000,
    "lastDiv": 26.08,
    "range": "18.06-35.42",
    "changes": -0.1,
    "companyName": "NCR Corporation",
    "currency": "USD",
    "cik": "0000070866",
    "isin": "US62886E1082",
    "cusip": "62886E108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.ncr.com",
    "description": "NCR Corporation provides various software and services worldwide. It operates through Banking, Retail, Hospitality, and Telecommunications and Technology segments. The company offers managed services and ATM-as-a-Service that allow banks to run their end-to-end ATM channels; software, services, and hardware; and digital banking solutions for financial institution's consumer and business customers. It also provides solutions for banking channel services, transaction processing, imaging, and branch services. In addition, the company offers solutions for retail industry comprising comprehensive API-point of sale (POS) retail software platforms and applications, hardware terminals and peripherals, payment processing solutions, and consumer engagement solutions, as well as self-service kiosks, which consists of self-checkout (SCO). Further, it provides technology solutions to customers in the hospitality industry comprising table-service, quick-service, and fast casual restaurants. The company also offers cloud-based software applications for point-of-sale, back office, payment processing, kitchen production, restaurant management, eCommerce, and consumer marketing and loyalty; and hospitality-oriented hardware products, such as POS terminals, kitchen display systems, handheld devices, printers, and peripherals. Additionally, NCR Corporation provides managed network and infrastructure services to enterprise clients, as well as professional, field, and remote services for network technologies. The company also offers solutions for customer account opening and onboarding across digital, branch, and call center channels. NCR Corporation was founded in 1881 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. Michael Dale Hayford CPA",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "35000",
    "phone": "937 445 1936",
    "address": "864 Spring Street Northwest",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30308",
    "dcfDiff": 1.72617,
    "dcf": 25.3438,
    "image": "https://financialmodelingprep.com/image-stock/NCR.png",
    "ipoDate": "1996-12-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]