[
  {
    "symbol": "NDAQ",
    "price": 49.58,
    "beta": 0.972887,
    "volAvg": 3186325,
    "mktCap": 24332128303,
    "lastDiv": 0.88,
    "range": "48.95-69.22",
    "changes": -0.24,
    "companyName": "Nasdaq, Inc.",
    "currency": "USD",
    "cik": "0001120193",
    "isin": "US6311031081",
    "cusip": "631103108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Financial Data & Stock Exchanges",
    "website": "https://www.nasdaq.com",
    "description": "Nasdaq, Inc. operates as a technology company that serves capital markets and other industries worldwide. The Market Technology segment includes anti financial crime technology business, which offers Nasdaq Trade Surveillance, a SaaS solution for brokers and other market participants to assist them in complying with market rules, regulations, and internal market surveillance policies; Nasdaq Automated Investigator, a cloud-deployed anti-money laundering tool; and Verafin, a SaaS technology provider of anti-financial crime management solutions. This segment also handles assets, such as cash equities, equity derivatives, currencies, interest-bearing securities, commodities, energy products, and digital currencies. The Investment Intelligence segment sells and distributes historical and real-time market data; develops and licenses Nasdaq-branded indexes and financial products; and provides investment insights and workflow solutions. The Corporate Platforms segment operates listing platforms; and offers investor relations intelligence and governance solutions. As of December 31, 2021, it had 4,178 companies listed securities on The Nasdaq Stock Market, including 1,632 listings on The Nasdaq Global Select Market; 1,169 on The Nasdaq Global Market; and 1,377 on The Nasdaq Capital Market. The Market Services segment includes equity derivative trading and clearing, cash equity trading, fixed income and commodities trading and clearing, and trade management service businesses. This segment operates various exchanges and other marketplace facilities across various asset classes, which include derivatives, commodities, cash equity, debt, structured products, and exchange traded products; and provides broker, clearing, settlement, and central depository services. The company was formerly known as The NASDAQ OMX Group, Inc. and changed its name to Nasdaq, Inc. in September 2015. Nasdaq, Inc. was founded in 1971 and is headquartered in New York, New York.",
    "ceo": "Ms. Adena T. Friedman",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "6486",
    "phone": "212 401 8700",
    "address": "151 West 42nd Street",
    "city": "New York",
    "state": "NY",
    "zip": "10036",
    "dcfDiff": 7.8147,
    "dcf": 68.3147,
    "image": "https://financialmodelingprep.com/image-stock/NDAQ.png",
    "ipoDate": "2002-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]