[
  {
    "symbol": "NEE",
    "price": 73.44,
    "beta": 0.469014,
    "volAvg": 7134567,
    "mktCap": 148599967150,
    "lastDiv": 1.87,
    "range": "69.64-91.35",
    "changes": -0.47,
    "companyName": "NextEra Energy, Inc.",
    "currency": "USD",
    "cik": "0000753308",
    "isin": "US65339F1012",
    "cusip": "65339F101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.nexteraenergy.com",
    "description": "NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear, coal, and natural gas facilities. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. As of December 31, 2021, the company had approximately 28,564 megawatts of net generating capacity; approximately 77,000 circuit miles of transmission and distribution lines; and 696 substations. It serves approximately 11 million people through approximately 5.7 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. The company was founded in 1925 and is headquartered in Juno Beach, Florida.",
    "ceo": "Mr. John W. Ketchum",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "15300",
    "phone": "561 694 4000",
    "address": "700 Universe Boulevard",
    "city": "Juno Beach",
    "state": "FL",
    "zip": "33408",
    "dcfDiff": 8.344,
    "dcf": 83.924,
    "image": "https://financialmodelingprep.com/image-stock/NEE.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]