[
  {
    "symbol": "NEO",
    "price": 16.19,
    "beta": 1.097887,
    "volAvg": 1045375,
    "mktCap": 2065487820,
    "lastDiv": 0.4,
    "range": "6.0-20.54",
    "changes": -0.06,
    "companyName": "NeoGenomics, Inc.",
    "currency": "USD",
    "cik": "0001077183",
    "isin": "US64049M2098",
    "cusip": "64049M209",
    "exchange": "NASDAQ Capital Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Diagnostics & Research",
    "website": "https://www.neogenomics.com",
    "description": "NeoGenomics, Inc. operates a network of cancer-focused testing laboratories in the United States, Europe, and Asia. It operates through, Clinical Services and Pharma Services segments. The company offers testing services to hospitals, reference labs, pathologists, oncologists, clinicians, pharmaceutical firms, and researchers. It provides cytogenetics testing services to study normal and abnormal chromosomes and their relationship to diseases; fluorescence in-situ hybridization testing services that focus on detecting and locating the presence or absence of specific DNA sequences and genes on chromosomes; flow cytometry testing services to measure the characteristics of cell populations; and immunohistochemistry and digital imaging testing services to localize cellular proteins in tissue section, as well as to allow clients to visualize scanned slides, and perform quantitative analysis for various stains. The company also provides molecular testing services, which focus on the analysis of DNA and/or RNA, and the structure and function of genes at the molecular level; morphologic analysis, which is the process of analyzing cells under the microscope by a pathologist for the purpose of diagnosis; and testing services in support of its pharmaceutical clients' oncology programs covering discovery and commercialization, as well as acts as a reference laboratory supplying anatomic pathology testing services. It has a strategic alliance agreement and laboratory services agreement with Inivata Limited. The company was founded in 2001 and is headquartered in Fort Myers, Florida.",
    "ceo": "Mr. Christopher Michael Smith BSc",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "2100",
    "phone": "239 768 0600",
    "address": "9490 NeoGenomics Way",
    "city": "Fort Myers",
    "state": "FL",
    "zip": "33912",
    "dcfDiff": 1.38106,
    "dcf": 12.8911,
    "image": "https://financialmodelingprep.com/image-stock/NEO.png",
    "ipoDate": "2004-03-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]