[
  {
    "symbol": "NET",
    "price": 66.48,
    "beta": 0.987753,
    "volAvg": 5752138,
    "mktCap": 22065508962,
    "lastDiv": 0,
    "range": "37.37-80.99",
    "changes": 2.55,
    "companyName": "Cloudflare, Inc.",
    "currency": "USD",
    "cik": "0001477333",
    "isin": "US18915M1071",
    "cusip": "18915M107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.cloudflare.com",
    "description": "CloudFlare, Inc. operates as a cloud services provider that delivers a range of services to businesses worldwide. The company offers an integrated cloud-based security solution to secure a range of combination of platforms, including public cloud, private cloud, on-premise, software-as-a-service applications, and IoT devices. Its security products comprise cloud firewall, bot management, distributed denial of service, IoT, SSL/TLS, secure origin connection, and rate limiting products. The company also offers performance solutions, which include content delivery and intelligent routing, as well as content, mobile, and image optimization solutions. In addition, it provides reliability solutions comprising load balancing, anycast network, virtual backbone, DNS, DNS resolver, online, and virtual waiting room solutions. Further, the company offers Cloudflare internal infrastructure solutions, including on-ramps, which connect users, devices, or locations to its network; and filters, which are the products that protect, inspect, and privilege data. Additionally, it provides developer-based solutions, such as serverless computing/programmable network, website development, domain registration, Cloudflare apps, analytics, and data localization management; Consumer DNS Resolver, a consumer app to browse the Internet; and Consumer VPN for consumers to secure and accelerate traffic on mobile devices. The company serves customers in the technology, healthcare, financial services, consumer and retail, and non-profit industries, as well as government. CloudFlare, Inc. was incorporated in 2009 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Matthew  Prince",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3394",
    "phone": "888 993 5273",
    "address": "101 Townsend Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94107",
    "dcfDiff": 6.79243,
    "dcf": 46.3176,
    "image": "https://financialmodelingprep.com/image-stock/NET.png",
    "ipoDate": "2019-09-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]