[
  {
    "symbol": "NEU",
    "price": 398.54,
    "beta": 0.379225,
    "volAvg": 33420,
    "mktCap": 3836330098,
    "lastDiv": 9,
    "range": "280.28-411.55",
    "changes": -0.66,
    "companyName": "NewMarket Corporation",
    "currency": "USD",
    "cik": "0001282637",
    "isin": "US6515871076",
    "cusip": "651587107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.newmarket.com",
    "description": "NewMarket Corporation, through its subsidiaries, engages in the petroleum additives business. The company offers lubricant additives for use in various vehicle and industrial applications, including engine oils, transmission fluids, off-road powertrain and hydraulic systems, gear oils, hydraulic oils, turbine oils, and other applications where metal-to-metal moving parts are utilized; engine oil additives designed for passenger cars, motorcycles, on and off-road heavy duty commercial equipment, locomotives, and engines in ocean-going vessels; driveline additives designed for products, such as transmission fluids, axle fluids, and off-road powertrain fluids; and industrial additives designed for products for industrial applications consisting of hydraulic fluids, grease, industrial gear fluids, and industrial specialty applications, such as turbine oils. It also provides fuel additives that are used to enhance the oil refining process and the performance of gasoline, diesel, biofuels, and other fuels to industry, government, original equipment manufacturers, and individual customers. In addition, the company engages in the antiknock compounds business, as well as contracted manufacturing and services activities; and owns and manages a real property in Virginia. It operates in North America, Latin America, the Asia Pacific, Europe, the Middle East, Africa, and India. NewMarket Corporation was founded in 1887 and is headquartered in Richmond, Virginia.",
    "ceo": "Mr. Thomas E. Gottwald",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "2058",
    "phone": "804 788 5000",
    "address": "330 South Fourth Street",
    "city": "Richmond",
    "state": "VA",
    "zip": "23219-4350",
    "dcfDiff": 19.176,
    "dcf": 320.924,
    "image": "https://financialmodelingprep.com/image-stock/NEU.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]