[
  {
    "symbol": "NEX",
    "price": 8.82,
    "beta": 2.088732,
    "volAvg": 3599125,
    "mktCap": 2012812200,
    "lastDiv": 0,
    "range": "6.66-11.36",
    "changes": 0.03,
    "companyName": "NexTier Oilfield Solutions Inc.",
    "currency": "USD",
    "cik": "0001688476",
    "isin": "US65290C1053",
    "cusip": "65290C105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Equipment & Services",
    "website": "https://nextierofs.com",
    "description": "NexTier Oilfield Solutions Inc., through its subsidiaries, provides well completion and production services in various active and demanding basins. The company operates through two segments, Completion Services, and Well Construction and Intervention Services. The Completion Services segment offers hydraulic fracturing services to enhance production of oil and natural gas from formations with low permeability and restricted flow of hydrocarbons; wireline services; and perforating, pumpdown, pipe recovery, pressure pumping, and wellsite make-up and pressure testing services. As of December 31, 2021, it had approximately 2.1 million of fracturing hydraulic horsepower, 101 wireline trucks, and 76 pumpdown units. The Well Construction and Intervention Services segment provides cementing services that incorporate custom engineered mixing and blending equipment to ensure precision and accuracy in providing annulus isolation and hydraulic seal, while protecting fresh water zones from its customers' zone of interest; and engineering software and technical guidance for remedial cementing applications, and acidizing to optimize the performance of its customers' wells. This segment also offers coiled tubing services to help customers in accomplishing various goals in their horizontal completion, workover, and well maintenance projects. As of December 31, 2021, it had approximately 17 coiled tubing units and 74 cementing units. The company serves integrated and large independent oil and natural gas exploration and production companies in the United States and internationally. NexTier Oilfield Solutions Inc. was founded in 1973 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Robert Wayne Drummond Jr.",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "4302",
    "phone": "713 325 6000",
    "address": "3990 Rogerdale Road",
    "city": "Houston",
    "state": "TX",
    "zip": "77042",
    "dcfDiff": 1.65329,
    "dcf": 10.5033,
    "image": "https://financialmodelingprep.com/image-stock/NEX.png",
    "ipoDate": "2017-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]