[
  {
    "symbol": "NFE",
    "price": 26.63,
    "beta": 1.595079,
    "volAvg": 1316946,
    "mktCap": 5459948900,
    "lastDiv": 0.4,
    "range": "25.06-63.06",
    "changes": -0.51,
    "companyName": "New Fortress Energy Inc.",
    "currency": "USD",
    "cik": "0001749723",
    "isin": "US6443931000",
    "cusip": "644393100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Utilities—Regulated Gas",
    "website": "https://www.newfortressenergy.com",
    "description": "New Fortress Energy Inc. operates as an integrated gas-to-power infrastructure company that provides energy and development services to end-users worldwide. The company operates in two segments, Terminals and Infrastructure, and Ships. The Terminals and Infrastructure segment engages in the natural gas procurement and liquefaction; and shipping, logistics, facilities and conversion, or development of natural gas-fired power generation. The Ships segment offers floating storage and regasification units, and liquefied natural gas (LNG) carriers which are leased to customers under long-term or spot arrangements. The company operates LNG storage and regasification facility at the Port of Montego Bay, Jamaica; marine LNG storage and regasification facility in Old Harbour, Jamaica; landed micro-fuel handling facility in San Juan, Puerto Rico; marine LNG storage and regasification facility in Sergipe, Brazil; and LNG receiving facility in La Paz, Mexico, as well as Miami facility. New Fortress Energy Inc. was founded in 1998 and is based in New York, New York.",
    "ceo": "Mr. Wesley Robert Edens",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "577",
    "phone": "516 268 7400",
    "address": "111 West 19th Street",
    "city": "New York",
    "state": "NY",
    "zip": "10011",
    "dcfDiff": 11.3282,
    "dcf": 49.4982,
    "image": "https://financialmodelingprep.com/image-stock/NFE.png",
    "ipoDate": "2019-01-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]