[
  {
    "symbol": "NFG",
    "price": 50.71,
    "beta": 0.694366,
    "volAvg": 485877,
    "mktCap": 4655380840,
    "lastDiv": 1.98,
    "range": "49.27-74.62",
    "changes": 0.07,
    "companyName": "National Fuel Gas Company",
    "currency": "USD",
    "cik": "0000070145",
    "isin": "US6361801011",
    "cusip": "636180101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.nationalfuel.com",
    "description": "National Fuel Gas Company operates as a diversified energy company. It operates through four segments: Exploration and Production, Pipeline and Storage, Gathering, and Utility. The Exploration and Production segment explores for, develops, and produces natural gas and oil in California and in the Appalachian region of the United States. As of September 30, 2021, it had proved developed and undeveloped reserves of 21,537 thousand barrels of oil and 3,723,433 million cubic feet of natural gas. The Pipeline and Storage segment provides interstate natural gas transportation and storage services through an integrated gas pipeline system in Pennsylvania and New York; and owns and operates underground natural gas storage fields. This segment also transports natural gas for National Fuel Gas Distribution Corporation, as well as for other utilities, industrial companies, and power producers in New York State; and owns and operates the Empire Pipeline. The Gathering segment builds, owns, and operates natural gas processing and pipeline gathering facilities in the Appalachian region, as well as provides gathering services to Seneca Resources Company, LLC. The Utility segment sells natural gas or provides natural gas transportation services to approximately 753,000 customers in Buffalo, Niagara Falls, and Jamestown, New York; and Erie and Sharon, Pennsylvania. The company markets gas to industrial, wholesale, commercial, public authority, and residential customers primarily in western and central New York, and northwestern Pennsylvania. As of September 30, 2021, the company also owned approximately 95,000 acres of timber property; and managed approximately 2,500 additional acres of timber cutting rights. National Fuel Gas Company was incorporated in 1902 and is headquartered in Williamsville, New York.",
    "ceo": "Mr. David P. Bauer",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "2132",
    "phone": "716 857 7000",
    "address": "6363 Main Street",
    "city": "Williamsville",
    "state": "NY",
    "zip": "14221",
    "dcfDiff": 7.37387,
    "dcf": 64.4939,
    "image": "https://financialmodelingprep.com/image-stock/NFG.png",
    "ipoDate": "1973-05-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]