[
  {
    "symbol": "NGG",
    "price": 67.07,
    "beta": 0.293869,
    "volAvg": 366577,
    "mktCap": 49340379240,
    "lastDiv": 3.12,
    "range": "47.22-74.48",
    "changes": -0.5,
    "companyName": "National Grid plc",
    "currency": "USD",
    "cik": "0001004315",
    "isin": "US6362744095",
    "cusip": "636274409",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.nationalgrid.com",
    "description": "National Grid plc transmits and distributes electricity and gas. The company operates through UK Electricity Transmission, UK Electricity Distribution, UK Electricity System Operator, New England, and New York segments. The UK Electricity Transmission segment provides electricity transmission and construction work services in England and Wales. The UK Electricity Distribution segment offers electricity distribution services in Midlands, and South West of England and South Wales. The UK Electricity System Operator segment provides balancing services for supply and demand of electricity on Great Britain's electricity transmission system; and acts as an agent on behalf of transmission operators. The New England segment offers electricity and gas distribution, and electricity transmission services in New England. The New York segment provides electricity and gas distribution, and electricity transmission services in New York. It also engages in the provision of transmission services through electricity interconnectors and LNG importation at the Isle of Grain; sale of renewables projects; and leasing and sale of commercial property, as well as insurance activities in the United Kingdom. The company was founded in 1990 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. John  Pettigrew FEI, FIET",
    "sector": "Utilities",
    "country": "GB",
    "fullTimeEmployees": "29292",
    "phone": "44 20 7004 3000",
    "address": "1-3 Strand",
    "city": "London",
    "state": null,
    "zip": "WC2N 5EH",
    "dcfDiff": 2.67291,
    "dcf": 60.9671,
    "image": "https://financialmodelingprep.com/image-stock/NGG.png",
    "ipoDate": "2005-08-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]