[
  {
    "symbol": "NHNKY",
    "price": 13.32,
    "beta": -0.067432,
    "volAvg": 2712,
    "mktCap": 2241129853,
    "lastDiv": 0.25,
    "range": "9.95-14.56",
    "changes": 0.12,
    "companyName": "Nihon Kohden Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US65412C1080",
    "cusip": "65412C108",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Medical Devices",
    "website": "https://www.nihonkohden.com",
    "description": "Nihon Kohden Corporation engages in research and development, production, sale, repair, and maintenance of medical electronic equipment in Japan, Americas, Europe, rest of Asia, and internationally. The company offers physiological measuring equipment, including electroencephalographs, electrocardiographs, evoked potential and electromyogram measuring instruments, and polygraphs for cath labs, as well as diagnostic information systems and related consumables, such as recording papers, electrodes and catheters, and maintenance services. It also provides patient monitors systems comprising central monitors, bedside monitors, wireless monitors, remote access software, and other equipment; and clinical information systems and related consumables, such as electrodes and sensors. In addition, the company offers treatment equipment, which include defibrillators, automated external defibrillators (AED), ventilators, pacemakers, anesthesia machines, cochlear implants, and related consumables and services, which include AED pads and batteries; and other medical equipment, including hematology and clinical chemistry analyzers, ultrasound diagnostic equipment, and equipment for research and others, as well as consumables, including test reagents, and installation and maintenance services. Additionally, it engages in insurance brokerage and technology licensing business. The company was incorporated in 1951 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Hirokazu  Ogino",
    "sector": "Healthcare",
    "country": "JP",
    "fullTimeEmployees": "5639",
    "phone": "81 3 5996 8036",
    "address": "1-31-4 Nishiochiai",
    "city": "Tokyo",
    "state": null,
    "zip": "161-8560",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NHNKY.png",
    "ipoDate": "2013-09-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]