[
  {
    "symbol": "NICE",
    "price": 206.11,
    "beta": 0.305136,
    "volAvg": 416695,
    "mktCap": 13460632086,
    "lastDiv": 2.56,
    "range": "164.65-235.11",
    "changes": 0.42,
    "companyName": "NICE Ltd.",
    "currency": "USD",
    "cik": "0001003935",
    "isin": "US6536561086",
    "cusip": "653656108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.nice.com",
    "description": "NICE Ltd., together with its subsidiaries, provides cloud platforms for AI-driven digital business solutions worldwide. It offers CXone, a cloud native open platform that supports contact centers ranging from small single sites to distributed remote agents and enterprises; Enlighten, an AI engine for CX that discovers automation opportunities for self-service; digital-entry points solutions that enable organizations to address consumers' needs; and journey orchestration solutions that empower organizations to connect and route customers to deal with the customer's request, and connecting them using real time AI-based routing. The company also provides smart self service solutions that empower organizations to build intelligent automated conversations based on data; and prepared agent solutions and tools enable contact center agents to guide and alert them in real time so they can provide resolutions; complete performance solutions that help organizations to record structured and unstructured customer interaction and transaction data; and NICE Evidencentral, an digital evidence management platform for public safety emergency communications, law enforcement, and criminal justice helps agencies. In addition, it offers X-Sight, is an open and flexible AI-cloud platform for financial crime and compliance; Xceed, a cloud platform for comprehensive AML and fraud prevention for small and mid-sized organizations; data intelligence solutions that enable organizations to turn raw data into comprehensive actionable intelligence to prevent and detect financial crimes; AI and analytics technologies to detect and prevent financial crimes in real-time; money laundering and fraud prevention solutions that help organizations adhere to capital markets compliance and anti-money laundering compliance regulations; intelligent investigations solutions; and self-service solutions that provide organizations with customization and self-development capabilities. The company was formerly known as NICE-Systems Ltd. and changed its name to NICE Ltd. in June 2016. NICE Ltd. was founded in 1986 and is based in Ra'anana, Israel.",
    "ceo": "Mr. Barak  Eilam",
    "sector": "Technology",
    "country": "IL",
    "fullTimeEmployees": "7926",
    "phone": "972 9 775 3151",
    "address": "13 Zarchin Street",
    "city": "Ra'anana",
    "state": null,
    "zip": "4310602",
    "dcfDiff": 12.7218,
    "dcf": 200.828,
    "image": "https://financialmodelingprep.com/image-stock/NICE.png",
    "ipoDate": "1996-01-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]