[
  {
    "symbol": "NINOY",
    "price": 12.96,
    "beta": 0.478544,
    "volAvg": 5174,
    "mktCap": 4506140160,
    "lastDiv": 0.29,
    "range": "8.55-13.18",
    "changes": 0.12,
    "companyName": "Nikon Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US6541112024",
    "cusip": "654111202",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Leisure",
    "website": "https://www.nikon.com",
    "description": "Nikon Corporation manufactures and sells optical instruments in Japan, North America, Europe, China, Thailand, and internationally. It operates through three segments: Imaging Products Business, Precision Equipment Business, and Healthcare Business. The Imaging Products Business segment develops, manufacture, sells, and services digital SLR cameras, compact digital cameras, and interchangeable camera lenses. The Precision Equipment Business segment provides FPD lithography systems and semiconductor lithography systems. The Healthcare Business segment offers biological microscopes, cell culture observation systems, and ultra-wide field retinal imaging devices. In addition, the company provides industrial microscopes, measuring instruments, non-contact 3D metrology systems, X-ray/CT inspection systems, and surveying instruments; and customized products, glass, encoders, and ophthalmic lenses. Further, it offers photomask substrates, camera components, sport optics products, and molded optical glasses; and develops and supports computer software. Nikon Corporation was incorporated in 1917 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Toshikazu  Umatate",
    "sector": "Consumer Cyclical",
    "country": "JP",
    "fullTimeEmployees": "18437",
    "phone": "81 3 6433 3600",
    "address": "Shinagawa Intercity Tower C",
    "city": "Tokyo",
    "state": null,
    "zip": "108-6290",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NINOY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]