[
  {
    "symbol": "NIO",
    "price": 9.52,
    "beta": 1.917549,
    "volAvg": 52364054,
    "mktCap": 16549568838,
    "lastDiv": 0,
    "range": "7.0-23.28",
    "changes": 0.18,
    "companyName": "NIO Inc.",
    "currency": "USD",
    "cik": "0001736541",
    "isin": "US62914V1061",
    "cusip": "62914V106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Auto Manufacturers",
    "website": "https://www.nio.com",
    "description": "NIO Inc. designs, develops, manufactures, and sells smart electric vehicles in China. It offers five, six, and seven-seater electric SUVs, as well as smart electric sedans. The company is also involved in the provision of energy and service packages to its users; design and technology development activities; manufacture of e-powertrains, battery packs, and components; and sales and after sales management activities. In addition, it offers power solutions, including Power Home, a home charging solution; Power Swap, a battery swapping service; Power Charger, a fast-charging solution; Power Mobile, a mobile charging service through charging vans; Power Map, an application that provides access to a network of public chargers and their real-time information; and One Click for Power valet service, where it offers vehicle pick up, charging, and swapping services. Further, the company provides repair, maintenance, and bodywork services through its NIO service centers and authorized third-party service centers; statutory and third-party liability insurance, and vehicle damage insurance through third-party insurers; courtesy vehicle services; roadside assistance; data packages; and auto financing and financial leasing services. Additionally, it offers NIO Certified, a used vehicle inspection, evaluation, acquisition, and sales service. The company was formerly known as NextEV Inc. and changed its name to NIO Inc. in July 2017. NIO Inc. was incorporated in 2014 and is headquartered in Shanghai, China.",
    "ceo": "Mr. William  Li",
    "sector": "Consumer Cyclical",
    "country": "CN",
    "fullTimeEmployees": "26763",
    "phone": "86 21 6908 2018",
    "address": "Building 20",
    "city": "Shanghai",
    "state": null,
    "zip": "201804",
    "dcfDiff": 10.2754,
    "dcf": 22.9854,
    "image": "https://financialmodelingprep.com/image-stock/NIO.png",
    "ipoDate": "2018-09-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]