[
  {
    "symbol": "NJR",
    "price": 46.46,
    "beta": 0.669366,
    "volAvg": 553567,
    "mktCap": 4504970484,
    "lastDiv": 1.56,
    "range": "38.07-55.84",
    "changes": -0.17,
    "companyName": "New Jersey Resources Corporation",
    "currency": "USD",
    "cik": "0000356309",
    "isin": "US6460251068",
    "cusip": "646025106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Gas",
    "website": "https://www.njresources.com",
    "description": "New Jersey Resources Corporation, an energy services holding company, provides regulated gas distribution, and retail and wholesale energy services. The company operates through four segments: Natural Gas Distribution, Clean Energy Ventures, Energy Services, and Storage and Transportation. The Natural Gas Distribution segment offers regulated natural gas utility services to approximately 564,000 residential and commercial customers throughout Burlington, Middlesex, Monmouth, Morris, Ocean, and Sussex counties in New Jersey; provides capacity and storage management services; and participates in the off-system sales and capacity release markets. The Clean Energy Ventures segment invests in, owns, and operates commercial and residential solar projects situated in New Jersey, Connecticut, Rhode Island, and New York. The Energy Services segment offers unregulated wholesale energy management services to other energy companies and natural gas producers, as well as maintains and transacts a portfolio of physical assets consisting of natural gas storage and transportation contracts in the United States and Canada. The Storage and Transportation segment invests in natural gas transportation and storage facilities. It provides heating, ventilation, and cooling services; holds commercial real estate properties; and offers solar equipment installation, and plumbing repair and installation services, as well as engages in the water appliance sale, installation, and servicing activities. The company was incorporated in 1981 and is headquartered in Wall, New Jersey.",
    "ceo": "Mr. Stephen D. Westhoven",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "1288",
    "phone": "732 938 1000",
    "address": "1415 Wyckoff Road",
    "city": "Wall",
    "state": "NJ",
    "zip": "07719",
    "dcfDiff": 0.460817,
    "dcf": 48.9792,
    "image": "https://financialmodelingprep.com/image-stock/NJR.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]