[
  {
    "symbol": "NKE",
    "price": 113.03,
    "beta": 1.113732,
    "volAvg": 7126414,
    "mktCap": 173725973709,
    "lastDiv": 1.36,
    "range": "82.22-131.31",
    "changes": -0.58,
    "companyName": "NIKE, Inc.",
    "currency": "USD",
    "cik": "0000320187",
    "isin": "US6541061031",
    "cusip": "654106103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Footwear & Accessories",
    "website": "https://investors.nike.com",
    "description": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells men's, women's, and kids athletic footwear, apparel, equipment, and accessories worldwide. The company provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; and casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. In addition, it sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. The company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel. Additionally, it licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. The company sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
    "ceo": "Mr. John J. Donahoe II",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "79100",
    "phone": "503 671 6453",
    "address": "One Bowerman Drive",
    "city": "Beaverton",
    "state": "OR",
    "zip": "97005-6453",
    "dcfDiff": 17.5555,
    "dcf": 109.975,
    "image": "https://financialmodelingprep.com/image-stock/NKE.png",
    "ipoDate": "1980-12-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]