[
  {
    "symbol": "NMR",
    "price": 3.87,
    "beta": 0.68544,
    "volAvg": 1034306,
    "mktCap": 11796649667,
    "lastDiv": 1.311,
    "range": "3.0-4.23",
    "changes": 0.09,
    "companyName": "Nomura Holdings, Inc.",
    "currency": "USD",
    "cik": "0001163653",
    "isin": "US65535H2085",
    "cusip": "65535H208",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.nomuraholdings.com",
    "description": "Nomura Holdings, Inc. provides various financial services to individuals, corporations, financial institutions, governments, and governmental agencies worldwide. It operates through three segments: Retail, Investment Management, and Wholesale. The Retail segment offers various financial products and investment services. As of March 31, 2022, this segment operated a network of 119 branches. The Investment Management segment engages in the management of funds, investment trusts, and other investment vehicles; and provision of investment advisory, custodial, and administrative services. The Wholesale segment is involved in the research, sale, trading, agency execution, and market-making of fixed income and equity-related products. It also engages in underwriting various securities and other financial instruments, such as various classes of shares, convertible and exchangeable securities, investment grade and high yield debts, sovereign and emerging market debts, structured securities, and other securities; arranging private placements, as well as other capital raising activities; and the provision of financial advisory services on business transactions comprising mergers and acquisitions, divestitures, spin-offs, capital structuring, corporate defense activities, leveraged buyouts, and risk solutions. In addition, this segment offers various financial instruments. The company was formerly known as The Nomura Securities Co., Ltd. and changed its name to Nomura Holdings, Inc. in October 2001. Nomura Holdings, Inc. was incorporated in 1925 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Kentaro  Okuda",
    "sector": "Financial Services",
    "country": "JP",
    "fullTimeEmployees": "26585",
    "phone": "81 3 5255 1000",
    "address": "13-1, Nihonbashi 1-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "103-8645",
    "dcfDiff": 1155.04,
    "dcf": 1159.09,
    "image": "https://financialmodelingprep.com/image-stock/NMR.png",
    "ipoDate": "2001-12-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]