[
  {
    "symbol": "NNCHY",
    "price": 43.06,
    "beta": 0.710344,
    "volAvg": 10,
    "mktCap": 6027496084,
    "lastDiv": 1.04,
    "range": "42.43-58.62",
    "changes": -0.825,
    "companyName": "Nissan Chemical Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US65476F1049",
    "cusip": "65476F104",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Chemicals",
    "website": "https://www.nissanchem.co.jp",
    "description": "Nissan Chemical Corporation engages in the chemicals, performance materials, agricultural chemicals, and pharmaceuticals businesses in Japan and internationally. Its chemical products include MELAMINE, an adhesive agent; high purity chemicals; AdBlue, an urea solution; ammonia, sulfuric, and nitric acid; TEPIC, an epoxy compound; Melamine Cyanurate, a salt of melamine and iso cyanuric acid; Nissan Reishi, a health food; phenylphosphonic acid; HI-LITE, a chlorinated isocyanulate; OPTBEADS, a melamine-formaldehyde resin and silica; and FINEOXOCOL, a saturated fatty alcohol and acid. The company also offers performance materials comprising display, semiconductor, and inorganic materials; agricultural chemicals, such as herbicides, insecticides, fungicides, etc. for use on agricultural land, as well as in golf courses and parks; and drug substances for antiparasite drugs for animals. In addition, it provides pharmaceutical products, such as LIVALO, a cholesterol reduction agent; LANDEL and FINTE, a dual type calcium antagonist that blocks calcium channels; and custom manufacturing and process researching services for pharmaceutical ingredients. Further, the company develops healthcare, information and communication materials, and environmental and energy materials. The company was formerly known as Nissan Chemical Industries, Ltd. and changed its name to Nissan Chemical Corporation in July 2018. Nissan Chemical Corporation was founded in 1887 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Kojiro  Kinoshita",
    "sector": "Basic Materials",
    "country": "JP",
    "fullTimeEmployees": "2737",
    "phone": "81 3 4463 8111",
    "address": "5-1, Nihonbashi 2-Chome",
    "city": "Tokyo",
    "state": null,
    "zip": "103-6119",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NNCHY.png",
    "ipoDate": "2014-03-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]