[
  {
    "symbol": "NNGRY",
    "price": 18.47,
    "beta": 0.795019,
    "volAvg": 79948,
    "mktCap": 10207427473,
    "lastDiv": 1.48,
    "range": "17.13-24.5",
    "changes": -0.09,
    "companyName": "NN Group N.V.",
    "currency": "USD",
    "cik": null,
    "isin": "US6293341037",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Insurance—Diversified",
    "website": "https://www.nn-group.com",
    "description": "NN Group N.V., a financial services company, primarily provides life insurance products in the Netherlands and internationally. The company operates through Netherlands Life, Netherlands Non-life, Insurance Europe, Japan Life, Banking, and Other segments. It offers group and individual life insurance, and pension products; non-life insurance products, including motor, fire, liability, transport, travel, and disability and accident insurance; employee benefits, and health insurance products; corporate-owned life insurance products; and single premium variable annuity individual life insurance products. The company also provides banking services, including mortgage loans, online savings accounts, bank annuities, consumer lending, and retail investment products, as well as administration and management services; reinsurance services; and retirement products and services. It offers its products to individuals, small and medium-sized enterprises, retail customers, and institutional customers directly, as well as through tied agents, bancassurance partners, brokers, and direct channels. The company was formerly known as ING Insurance Topholding N.V. and changed its name to NN Group N.V. in March 2014. NN Group N.V. was founded in 1845 and is headquartered in the Hague, the Netherlands.",
    "ceo": "Dr. David E. Knibbe",
    "sector": "Financial Services",
    "country": "NL",
    "fullTimeEmployees": "11917",
    "phone": "31 70 513 0303",
    "address": "Schenkkade 65",
    "city": "The Hague",
    "state": null,
    "zip": "2595 AS",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NNGRY.png",
    "ipoDate": "2018-02-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]