[
  {
    "symbol": "NNI",
    "price": 94.84,
    "beta": 0.817253,
    "volAvg": 46111,
    "mktCap": 3536498149,
    "lastDiv": 1.04,
    "range": "78.41-101.6",
    "changes": -0.77,
    "companyName": "Nelnet, Inc.",
    "currency": "USD",
    "cik": "0001258602",
    "isin": "US64031N1081",
    "cusip": "64031N108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Credit Services",
    "website": "https://www.nelnet.com",
    "description": "Nelnet, Inc. engages in loan servicing, communications, education technology, services, and payment processing businesses worldwide. The Loan Servicing and Systems segment provides loan conversion, application processing, borrower updates, customer service, payment processing, due diligence procedures, funds management reconciliation, and claim processing services. This segment also provides student loan servicing software; business process outsourcing services specialized in contact center management, such as inbound calls, outreach campaigns and sales, and interacting with customers through multi-channels. The Education Technology, Services, and Payment Processing segment offers financial management services; school information system software; website design and cost effective admissions software; FACTS Giving, a donation platform; and customized professional development and coaching services, educational instruction services, and technology products that aid in teacher and student evaluations. It also offers tuition payment plans, and service and technology for student billings, payments, and refunds; solutions for in-person, online, and mobile payment experiences on campus; payment processing services, such as credit card and electronic transfer; faith community engagement, giving management, and learning management services and technologies; and an integrated commerce payment platform, financial management, and tuition payment plan services, as well as a school management platform that provides administrative, information management, financial management, and communication functions for K-12 schools. The Communications segment provides fiber optic service to homes and businesses for internet, television, and telephone services. The Asset Generation and Management segment acquires, manages, and owns loan assets. The Nelnet Bank segment operates internet industrial banks. The company was founded in 1978 and is headquartered in Lincoln, Nebraska.",
    "ceo": "Mr. Michael Sullivan Dunlap",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "8237",
    "phone": "402 458 2370",
    "address": "121 South 13th Street",
    "city": "Lincoln",
    "state": "NE",
    "zip": "68508",
    "dcfDiff": 7.78522,
    "dcf": 101.845,
    "image": "https://financialmodelingprep.com/image-stock/NNI.png",
    "ipoDate": "2003-12-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]