[
  {
    "symbol": "NOC",
    "price": 442.66,
    "beta": 0.504225,
    "volAvg": 685672,
    "mktCap": 67221908481,
    "lastDiv": 7.48,
    "range": "429.1-556.27",
    "changes": -5.78,
    "companyName": "Northrop Grumman Corporation",
    "currency": "USD",
    "cik": "0001133421",
    "isin": "US6668071029",
    "cusip": "666807102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.northropgrumman.com",
    "description": "Northrop Grumman Corporation operates as an aerospace and defense company worldwide. The company's Aeronautics Systems segment designs, develops, manufactures, integrates, and sustains aircraft systems. This segment also offers unmanned autonomous aircraft systems, including high-altitude long-endurance strategic ISR systems and vertical take-off and landing tactical ISR systems; and strategic long-range strike aircraft, tactical fighter and air dominance aircraft, and airborne battle management and command and control systems. Its Defense Systems segment designs, develops, and produces weapons and mission systems. It offers products and services, such as integrated battle management systems, weapons systems and aircraft, and mission systems. This segment also provides command and control and weapons systems, including munitions and missiles; precision strike weapons; propulsion, such as air-breathing and hypersonic systems; gun systems and precision munitions; life cycle service and support for software, weapons systems, and aircraft; and logistics support, sustainment, operation, and modernization for air, sea, and ground systems. The company's Mission Systems segment offers cyber, command, control, communications and computers, intelligence, surveillance, and reconnaissance systems; radar, electro-optical/infrared and acoustic sensors; electronic warfare systems; advanced communications and network systems; cyber solutions; intelligence processing systems; navigation; and maritime power, propulsion, and payload launch systems. This segment also provides airborne multifunction sensors; maritime/land systems and sensors; navigation, targeting, and survivability solutions; and networked information solutions. Its Space Systems segment offers satellites and payloads; ground systems; missile defense systems and interceptors; launch vehicles and related propulsion systems; and strategic missiles. The company was founded in 1939 and is based in Falls Church, Virginia.",
    "ceo": "Ms. Kathy J. Warden",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "95000",
    "phone": "703 280 2900",
    "address": "2980 Fairview Park Drive",
    "city": "Falls Church",
    "state": "VA",
    "zip": "22042",
    "dcfDiff": 112.228,
    "dcf": 549.878,
    "image": "https://financialmodelingprep.com/image-stock/NOC.png",
    "ipoDate": "1981-12-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]