[
  {
    "symbol": "NOK",
    "price": 4.14,
    "beta": 0.668582,
    "volAvg": 16148311,
    "mktCap": 23021339996,
    "lastDiv": 0.12,
    "range": "3.93-5.28",
    "changes": 0.02,
    "companyName": "Nokia Oyj",
    "currency": "USD",
    "cik": "0000924613",
    "isin": "US6549022043",
    "cusip": "654902204",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Communication Equipment",
    "website": "https://www.nokia.com",
    "description": "Nokia Oyj provides mobile, fixed, and cloud network solutions worldwide. The company operates through four segments: Mobile Networks, Network Infrastructure, Cloud and Network Services, and Nokia Technologies. It offers products and services for radio access networks covering technologies from 2G to 5G, and microwave radio links for transport networks. The company provides fixed networking solutions, such as fiber and copper-based access infrastructure, and cloud and virtualization services, as well as wi-fi portfolio, including mesh solutions and cloud-based controllers; IP routing solutions for IP aggregation, and edge and core applications for residential, business, mobile, and industrial services; a portfolio of optical networks comprising portfolio coherent optical transponders, optical transport network switchers, wavelength-division multiplexers, reconfigurable optical add-drop multiplexer solutions, and optical line systems for metro access and aggregation, data center interconnect, regional, and long-haul/ultra-long-haul applications; and submarine networks. In addition, it offers business applications software, cloud and cognitive services, core networks software, and enterprise solutions. Further, the company provides hardware, software, and services, as well as licensing of intellectual property, including patents, technologies, and the Nokia brand. It serves communications service providers, webscales, hyperscalers, digital industries, and government. Nokia Oyj was founded in 1865 and is headquartered in Espoo, Finland.",
    "ceo": "Mr. Pekka Ilmari Lundmark M.Sc.(Eng.)",
    "sector": "Technology",
    "country": "FI",
    "fullTimeEmployees": "86896",
    "phone": "358 1044 88000",
    "address": "Karakaari 7",
    "city": "Espoo",
    "state": null,
    "zip": "02610",
    "dcfDiff": 1.17218,
    "dcf": 5.90218,
    "image": "https://financialmodelingprep.com/image-stock/NOK.png",
    "ipoDate": "1994-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]