[
  {
    "symbol": "NOV",
    "price": 15.8,
    "beta": 1.898239,
    "volAvg": 4886606,
    "mktCap": 6220854874,
    "lastDiv": 0.2,
    "range": "13.98-24.83",
    "changes": -0.02,
    "companyName": "NOV Inc.",
    "currency": "USD",
    "cik": "0001021860",
    "isin": "US6370711011",
    "cusip": "62955J103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Equipment & Services",
    "website": "https://www.nov.com",
    "description": "NOV Inc. designs, constructs, manufactures, and sells systems, components, and products for oil and gas drilling and production, and industrial and renewable energy sectors worldwide. The company operates through three segments: Wellbore Technologies, Completion & Production Solutions, and Rig Technologies. It also provides solids control and waste management equipment and services; portable power generation products; drill and wired pipes; drilling optimization and automation services; tubular inspection, repair, and coating services; instrumentation; measuring and monitoring services; downhole and fishing tools; steerable technologies; and drill bits. The company offers equipment and technologies for hydraulic fracture stimulation, including downhole multistage fracturing tools, pressure pumping trucks, blenders, sanders, hydration and injection units, flowline, and manifolds; coiled tubing units, and wireline units and tools; connections and liner hangers; onshore production consists of composite pipe, surface transfer and progressive cavity pumps, and artificial lift systems; and offshore production, such as floating production systems and subsea production technologies, as well as manufactures industrial pumps and mixers. It also provides substructures, derricks, and masts; cranes; jacking systems; pipe lifting, racking, rotating, and assembly systems; mud pumps; pressure control equipment; drives and generators; rig instrumentation and control systems; mooring, anchor, and deck handling machinery; equipment components for offshore wind construction vessels; and pipelay and construction systems. NOV Inc. offers spare parts, repair, and rentals as well as comprehensive remote equipment monitoring, technical support, field service, and customer training. The company was formerly known as National Oilwell Varco, Inc. and changed its name to NOV Inc. in January 2021. NOV Inc. was founded in 1862 and is based in Houston, Texas.",
    "ceo": "Mr. Clay C. Williams",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "32307",
    "phone": "713 346 7500",
    "address": "7909 Parkwood Circle Drive",
    "city": "Houston",
    "state": "TX",
    "zip": "77036-6565",
    "dcfDiff": 2.46323,
    "dcf": 26.4132,
    "image": "https://financialmodelingprep.com/image-stock/NOV.png",
    "ipoDate": "1996-10-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]