[
  {
    "symbol": "NOVT",
    "price": 178.22,
    "beta": 1.289084,
    "volAvg": 131256,
    "mktCap": 6381274032,
    "lastDiv": 0,
    "range": "111.02-178.77",
    "changes": 1.31,
    "companyName": "Novanta Inc.",
    "currency": "USD",
    "cik": "0001076930",
    "isin": "CA67000B1040",
    "cusip": "67000B104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.novanta.com",
    "description": "Novanta Inc., together with its subsidiaries, designs, manufactures, markets, and sells photonics, vision, and precision motion components and sub-systems to original equipment manufacturers in the medical and industrial markets worldwide. The company's Photonics segment offers photonics-based solutions, including laser scanning and beam delivery, CO2 laser, solid state laser, ultrafast laser, and optical light engine products serving photonics-based applications for industrial processing, metrology, medical and life science imaging, DNA sequencing, and medical laser procedures. It's Vision segment provides a range of medical grade technologies, including medical insufflators, pumps, and related disposables; visualization solutions; wireless technologies, video recorders, and video integration technologies for operating room integrations; optical data collection and machine vision technologies; radio frequency identification technologies; thermal chart recorders; spectrometry technologies; and embedded touch screen solutions. In addition, its Precision Motion segment offers optical and inductive encoders, precision motors, servo drives and motion control solutions, integrated stepper motors, intelligent robotic end-of-arm technology solutions, air bearings, and air bearing spindles. The company sells its products through its direct sales force, resellers, distributors, and system integrators under the Cambridge Technology, Synrad, Laser Quantum, ARGES, WOM, NDS, NDSsi, Med X Change, Reach Technology, JADAK, ThingMagic, Photo Research, Celera Motion, MicroE, Zettlex, Applimotion, Ingenia, and Westwind brands. The company was formerly known as GSI Group, Inc. and changed its name to Novanta Inc. in May 2016. Novanta Inc. was founded in 1968 and is headquartered in Bedford, Massachusetts.",
    "ceo": "Mr. Matthijs  Glastra",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3000",
    "phone": "781 266 5700",
    "address": "125 Middlesex Turnpike",
    "city": "Bedford",
    "state": "MA",
    "zip": "01730",
    "dcfDiff": 2.53912,
    "dcf": 158.231,
    "image": "https://financialmodelingprep.com/image-stock/NOVT.png",
    "ipoDate": "1999-03-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]