[
  {
    "symbol": "NOW",
    "price": 548.67,
    "beta": 1.030633,
    "volAvg": 1642901,
    "mktCap": 111786025800,
    "lastDiv": 0,
    "range": "337.0-576.68",
    "changes": 8.71,
    "companyName": "ServiceNow, Inc.",
    "currency": "USD",
    "cik": "0001373715",
    "isin": "US81762P1021",
    "cusip": "81762P102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.servicenow.com",
    "description": "ServiceNow, Inc. provides enterprise cloud computing solutions that defines, structures, consolidates, manages, and automates services for enterprises worldwide. It operates the Now platform for workflow automation, artificial intelligence, machine learning, robotic process automation, performance analytics, electronic service catalogs and portals, configuration management systems, data benchmarking, encryption, and collaboration and development tools. The company also provides information technology (IT) service management applications; IT service management product suite for enterprise's employees, customers, and partners; IT business management product suite; IT operations management product that connects a customer's physical and cloud-based IT infrastructure; IT Asset Management to automate IT asset lifecycles; and security operations that connects with internal and third party. In addition, it offers governance, risk, and compliance product to manage risk and resilience; human resources, legal, and workplace service delivery products; safe workplace applications; customer service management product; and field service management applications. Further, it provides App Engine product; IntegrationHub enables application to extend workflows; and professional, industry solutions, and customer support services. It serves government, financial services, healthcare, telecommunications, manufacturing, IT services, technology, oil and gas, education, and consumer products through direct sales team and resale partners. It has a strategic partnership with Celonis to help customers identify and prioritize processes that are suitable for automation. The company was formerly known as Service-now.com and changed its name to ServiceNow, Inc. in May 2012. The company was founded in 2004 and is headquartered in Santa Clara, California.",
    "ceo": "Mr. William R. McDermott",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "20433",
    "phone": "408 501 8550",
    "address": "2225 Lawson Lane",
    "city": "Santa Clara",
    "state": "CA",
    "zip": "95054",
    "dcfDiff": 62.9677,
    "dcf": 395.892,
    "image": "https://financialmodelingprep.com/image-stock/NOW.png",
    "ipoDate": "2012-06-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]