[
  {
    "symbol": "NPNYY",
    "price": 4.41,
    "beta": 1.457088,
    "volAvg": 53422,
    "mktCap": 11205236206,
    "lastDiv": 1.13,
    "range": "3.006667-5.703333",
    "changes": -0.05,
    "companyName": "Nippon Yusen Kabushiki Kaisha",
    "currency": "USD",
    "cik": null,
    "isin": "US6546333047",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Marine Shipping",
    "website": "https://www.nyk.com",
    "description": "Nippon Yusen Kabushiki Kaisha provides marine, land, and air transportation services worldwide. The company offers various logistics services, including liner trading services, such as container shipping, and terminal and stevedoring services for containerships, car carriers, and cruise ships; and air cargo transportation services. It also provides bulk shipping services comprising transport services for finished automobiles, heavy construction machines, and used cars; transportation services for bulk freight, which include iron ore, coal, and wood chips; and transportation services for crude oil, petroleum products, chemicals, LNG, LPG, and ammonia for oil, petrochemical, and energy companies. In addition, the company is involved in the upstream areas of the supply chain for oil and natural gas. Further, it operates Asuka II, a luxury cruise ship; and manages commercial and residential buildings. Nippon Yusen Kabushiki Kaisha was incorporated in 1885 and is headquartered in Tokyo, Japan.",
    "ceo": "Takaya  Soga",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "35502",
    "phone": "81 3 3284 5151",
    "address": "3-2, Marunouchi 2-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "100-0005",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NPNYY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]