[
  {
    "symbol": "NPO",
    "price": 129.54,
    "beta": 1.442605,
    "volAvg": 127341,
    "mktCap": 2704510212,
    "lastDiv": 1.16,
    "range": "76.14-129.75",
    "changes": 1.83,
    "companyName": "EnPro Industries, Inc.",
    "currency": "USD",
    "cik": "0001164863",
    "isin": "US29355X1072",
    "cusip": "29355X107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.enproindustries.com",
    "description": "EnPro Industries, Inc. engages in the design, development, manufacture, marketing, and service of engineered industrial products in the United States, Europe, and internationally. It operates through three segments: Sealing Technologies, Advanced Surface Technologies, and Engineered Materials. The Sealing Technologies segment offers single-use hygienic seals, tubing, components and assemblies; metallic, non-metallic, and composite material gaskets; compression packing products; hydraulic components; expansion joints; wall penetration products; and dynamic, flange, resilient metal, elastomeric, and custom-engineered mechanical seals for chemical and petrochemical processing, pulp and paper processing, power generation, food and pharmaceutical processing, primary metal manufacturing, mining, water and waste treatment, heavy-duty trucking, aerospace, medical, filtration, and semiconductor fabrication industries. This segment also provides aseptic fluid transfer products for the pharmaceutical and biopharmaceutical industries. The Advanced Surface Technologies segment offers cleaning, coating, testing, refurbishment, and verification services for critical components and assemblies used in semiconductor manufacturing equipment, as well as for critical applications in the space, aerospace, and defense markets; and specialized optical filters and thin-film coatings for various applications in the industrial technology, life sciences, and semiconductor markets. The Engineered Materials segment provides self-lubricating, non-rolling, metal polymer, engineered plastics, and fiber reinforced composite bearing products for various applications in the automotive, pharmaceutical, pulp and paper, natural gas, health, power generation, machine tools, air treatment, refining, petrochemical, and general industrial markets. The company was incorporated in 2002 and is headquartered in Charlotte, North Carolina.",
    "ceo": "Mr. Eric A. Vaillancourt",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "3500",
    "phone": "704 731 1500",
    "address": "5605 Carnegie Boulevard",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28209",
    "dcfDiff": 19.5278,
    "dcf": 134.778,
    "image": "https://financialmodelingprep.com/image-stock/NPO.png",
    "ipoDate": "2002-05-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]