[
  {
    "symbol": "NPSCY",
    "price": 6.76,
    "beta": 1.39157,
    "volAvg": 28283,
    "mktCap": 18674635633,
    "lastDiv": 0.44,
    "range": "4.506667-9.64",
    "changes": -0.01,
    "companyName": "Nippon Steel Corporation",
    "currency": "USD",
    "cik": "0001140471",
    "isin": "US65461T1016",
    "cusip": "654619105",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Steel",
    "website": "https://www.nipponsteel.com",
    "description": "Nippon Steel Corporation, together with its subsidiaries, engages in steelmaking and steel fabrication, engineering and construction, chemicals and materials, and system solutions businesses in Japan and internationally. The company's steelmaking and steel fabrication business offers steel plates, sheets, and slags; bar and rod materials; structural steel; pipes and tubes; titanium and stainless products; and railway, automotive, and machinery parts for applications in automotive, energy, infrastructure, and consumer electronics markets. Its engineering and construction business cover the manufacture and sale of industrial machinery; equipment and steel structures; construction projects under contract; waste processing and recycling; and supply of electricity, gas, and heat. The company's chemicals and materials comprise the manufacture and sale of coal-based chemical products, petrochemicals, electronic materials, materials and components for semiconductors and electronic parts, carbon fiber and composite products, and products that utilize technologies for metal processing. Its system solutions business includes computer systems engineering and consulting services; and IT-enabled outsourcing and other services. The company was formerly known as Nippon Steel & Sumitomo Metal Corporation and changed its name to Nippon Steel Corporation in April 2019. Nippon Steel Corporation was founded in 1950 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Eiji  Hashimoto",
    "sector": "Basic Materials",
    "country": "JP",
    "fullTimeEmployees": "106528",
    "phone": "81 3 6867 4111",
    "address": "2-6-1, Marunouchi",
    "city": "Tokyo",
    "state": null,
    "zip": "100-8071",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NPSCY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]