[
  {
    "symbol": "NPSKY",
    "price": 12.235,
    "beta": 0.716475,
    "volAvg": 1198,
    "mktCap": 2999838377,
    "lastDiv": 0.44,
    "range": "9.65-13.21",
    "changes": -0.475,
    "companyName": "NSK Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US6701841008",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Auto Parts",
    "website": "https://www.nsk.com/index.html",
    "description": "NSK Ltd., together with its subsidiaries, manufactures and sells industrial machinery bearings, automotive products, and precision machinery and parts worldwide. Its products include ball bearings; roller bearings; bearing units; super precision bearings; bearings for steel industry, mining and construction, papermaking machines, and pumps and compressors; and bearings for special environments, including sanitary, corrosive, vacuum, clean, high-temperature, non-magnetic requirement, and dust-contaminated environments. The company also provides automotive products, which comprise chassis products, such as electric power steerings, steering column and intermediate shafts, and hub unit bearings; power train products comprising engine parts and electrical accessories; and drive train products consisting of automatic and manual transmission, products for motorcycles and all-terrain vehicles, half toroidal CVT POWERTOROS units, and differential gear and propeller shafts. In addition, it offers precision machine components, including ball screws, linear guides, monocarriers, XY tables, and spindles; and accessories, including ball screw support bearings, air bearings, and clean grease, as well as support units for heavy and light loads, machine tools, and small equipment. Further, the company provides megatorque motors; maintenance and repair services; design, development, sales, and maintenance services for computer systems and networks; and sells industrial machinery bearings and automotive components. It serves agriculture, automotive, cement, food processing machinery, industrial motor, gearbox, injection molding machine, machine tool, medical device, mining and construction, motorcycle, office equipment, palm oil, papermaking machinery, pump and compressor, railway, semiconductor, steel, sugar, and wind turbine industries. NSK Ltd. was founded in 1914 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Akitoshi  Ichii",
    "sector": "Consumer Cyclical",
    "country": "JP",
    "fullTimeEmployees": "29882",
    "phone": "81 3 3779 7111",
    "address": "Nissei Building",
    "city": "Tokyo",
    "state": null,
    "zip": "141-8560",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NPSKY.png",
    "ipoDate": "2007-10-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]