[
  {
    "symbol": "NRDBY",
    "price": 10.58,
    "beta": 0.860153,
    "volAvg": 135570,
    "mktCap": 37856825815,
    "lastDiv": 1.63,
    "range": "8.33-12.92",
    "changes": -0.05,
    "companyName": "Nordea Bank Abp",
    "currency": "USD",
    "cik": null,
    "isin": "US65558R1095",
    "cusip": "65557A107",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.nordea.com",
    "description": "Nordea Bank Abp offers banking products and services in Sweden, Finland, Norway, Denmark, and internationally. It operates through Personal Banking, Business Banking, Large Corporates and Institutions, and Asset and Wealth Management segments. The Personal Banking segment provides various financial services to household customers through internet and mobile banking, over the phone, online meetings, and branch offices. The Business Banking segment offers payments, cash management, cards, working capital management, and finance solutions to corporate and personal customers. The Large Corporates and Institutions segment provides financing, cash management and payment, investment banking, and securities services, as well as capital market products to corporate and institutional customers. The Asset and Wealth Management segment offers investment, savings, and risk management solutions to high net worth individuals and institutional investors. This segment also offers life and pensions products and services. The company was founded in 1820 and is headquartered in Helsinki, Finland.",
    "ceo": "Mr. Frank  Vang-Jensen",
    "sector": "Financial Services",
    "country": "FI",
    "fullTimeEmployees": "28922",
    "phone": "358 2007 0000",
    "address": "Satamaradankatu 5",
    "city": "Helsinki",
    "state": null,
    "zip": "00020",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NRDBY.png",
    "ipoDate": "2009-04-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]