[
  {
    "symbol": "NRILY",
    "price": 27.69,
    "beta": 0.515325,
    "volAvg": 149483,
    "mktCap": 16462092217,
    "lastDiv": 0.32,
    "range": "20.75-31.9",
    "changes": 0.49,
    "companyName": "Nomura Research Institute, Ltd.",
    "currency": "USD",
    "cik": "0001179493",
    "isin": "US65538C1071",
    "cusip": "65538C206",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Information Technology Services",
    "website": "https://www.nri.com",
    "description": "Nomura Research Institute, Ltd. provides consulting, financial information technology (IT) solution, industrial IT solution, and IT platform services in Japan. Its Consulting segment offers management, operational, and system consulting services for enterprise and government agencies. This segment is also involved in the research, future projection, and recommendations related to society, economics, business, technology, etc. The company's Financial IT Solutions segment provides system consulting, development, and management solutions, as well as shared online services for the financial institutions, including the securities, insurance, banking, asset management, and other financial sectors. Its Industrial IT Solutions segment offers system consulting, development, and management solutions, as well as shared online services primarily for the distribution, manufacturing, service, and public sectors. The company's IT Platform Services segment engages in the data center operation activities and construction of platforms and networks to the Financial IT and Industrial IT Solutions segments, as well as provides IT platform solutions and information security services to external clients. This segment is also involved in research related to advance IT, etc. The company was founded in 1965 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Shingo  Konomoto",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "16512",
    "phone": "81 3 5533 2111",
    "address": "Otemachi Financial City Grand Cube",
    "city": "Tokyo",
    "state": null,
    "zip": "100-0004",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NRILY.png",
    "ipoDate": "2010-10-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]