[
  {
    "symbol": "NSC",
    "price": 223.16,
    "beta": 1.285211,
    "volAvg": 1439622,
    "mktCap": 50800142400,
    "lastDiv": 5.4,
    "range": "196.33-264.22",
    "changes": 0.57,
    "companyName": "Norfolk Southern Corporation",
    "currency": "USD",
    "cik": "0000702165",
    "isin": "US6558441084",
    "cusip": "655844108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Railroads",
    "website": "https://www.norfolksouthern.com",
    "description": "Norfolk Southern Corporation, together with its subsidiaries, engages in the rail transportation of raw materials, intermediate products, and finished goods in the United States. The company transports agriculture, forest, and consumer products comprising soybeans, wheat, corn, fertilizers, livestock and poultry feed, food products, food oils, flour, sweeteners, ethanol, lumber and wood products, pulp board and paper products, wood fibers, wood pulp, scrap paper, beverages, canned goods, and consumer products; chemicals consist of sulfur and related chemicals, petroleum products, chlorine and bleaching compounds, plastics, rubber, industrial chemicals, chemical wastes, and sand; metals and construction materials, such as steel, aluminum products, machinery, scrap metals, cement, aggregates, minerals, clay, transportation equipment, and military-related products; and automotive, including finished motor vehicles and automotive parts, as well as coal. It also transports overseas freight through various Atlantic and Gulf Coast ports; and provides commuter rail passenger transportation services and operates an intermodal network. As of December 31, 2021, the company operated approximately 19,300 route miles in 22 states and the District of Columbia. Norfolk Southern Corporation was incorporated in 1980 and is based in Atlanta, Georgia.",
    "ceo": "Mr. Alan H. Shaw",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "19300",
    "phone": "855 667 3655",
    "address": "650 West Peachtree Street NW",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30308-1925",
    "dcfDiff": 13.855,
    "dcf": 252.665,
    "image": "https://financialmodelingprep.com/image-stock/NSC.png",
    "ipoDate": "1982-06-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]