[
  {
    "symbol": "NSIT",
    "price": 143.43,
    "beta": 1.537323,
    "volAvg": 342180,
    "mktCap": 4770826032,
    "lastDiv": 0,
    "range": "81.11-147.15",
    "changes": 0.12,
    "companyName": "Insight Enterprises, Inc.",
    "currency": "USD",
    "cik": "0000932696",
    "isin": "US45765U1034",
    "cusip": "45765U103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Electronics & Computer Distribution",
    "website": "https://www.insight.com",
    "description": "IInsight Enterprises, Inc., together with its subsidiaries, provides information technology (IT) hardware, software, and services solutions in the United States, Canada, Europe, the Middle East, Africa, and the Asia-Pacific. The company's solution portfolio includes cloud enablement, data and AI, DevOps, digital strategy, intelligent applications and edge, and IoT solutions, as well as transformation services. It also offers cloud and data center transformation; connected workplace; and supply chain optimization solutions. In addition, the company provides software maintenance solutions that offers clients to obtain software upgrades, bug fixes, help desk, and other support services; vendor direct support services; and offers Software-as-a-Service subscription products. Further, it designs, procures, deploys, implements, and manages solutions that combine hardware, software, and services to help businesses. Additionally, the company sources, procures, stages, configures, integrates, tests, refurbishes, and redeploys IT products spanning endpoints to infrastructure; and offers software life cycle, and hardware warranty services. It serves construction technology, enterprise business, financial services, health care and life sciences, manufacturing technology, retails and restaurants, service providers, small to medium business, and travel and tourism industries. The company was founded in 1988 and is headquartered in Tempe, Arizona.",
    "ceo": "Ms. Joyce A. Mullen",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "13448",
    "phone": "480 333 3000",
    "address": "6820 South Harl Avenue",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85283",
    "dcfDiff": 6.64308,
    "dcf": 105.167,
    "image": "https://financialmodelingprep.com/image-stock/NSIT.png",
    "ipoDate": "1995-01-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]