[
  {
    "symbol": "NSP",
    "price": 115.13,
    "beta": 1.24014,
    "volAvg": 267633,
    "mktCap": 4399704463,
    "lastDiv": 2.28,
    "range": "95.68-131.09",
    "changes": -2.04,
    "companyName": "Insperity, Inc.",
    "currency": "USD",
    "cik": "0001000753",
    "isin": "US45778Q1076",
    "cusip": "45778Q107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Staffing & Employment Services",
    "website": "https://www.insperity.com",
    "description": "Insperity, Inc. provides human resources (HR) and business solutions to improve business performance for small and medium-sized businesses. The company offers its HR services through its Workforce Optimization and Workforce Synchronization solutions that include a range of human resources functions, such as payroll and employment administration, employee benefits, workers' compensation, government compliance, performance management, and training and development services. It also provides Insperity Premier, a cloud-based human capital management platform that offers professional employer organization HR outsourcing solutions to its clients; personnel record management services; and employer liability management services, as well as solutions for middle market. In addition, the company offers MarketPlace, an e-commerce portal that offers a range of products and services; and Workforce Acceleration, a human capital management and payroll services solution; time and attendance; performance management; organizational planning; recruiting; employment screening; retirement; and insurance services. As of December 31, 2021, it operated through 85 sales offices in the United States. The company was formerly known as Administaff, Inc. and changed its name to Insperity, Inc. in March 2011. The company was founded in 1986 and is headquartered in Kingwood, Texas.",
    "ceo": "Mr. Paul J. Sarvadi",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "306691",
    "phone": "281 358 8986",
    "address": "19001 Crescent Springs Drive",
    "city": "Kingwood",
    "state": "TX",
    "zip": "77339",
    "dcfDiff": 24.9096,
    "dcf": 133.51,
    "image": "https://financialmodelingprep.com/image-stock/NSP.png",
    "ipoDate": "1997-01-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]