[
  {
    "symbol": "NTAP",
    "price": 75.23,
    "beta": 1.17676,
    "volAvg": 2223233,
    "mktCap": 15981184732,
    "lastDiv": 2,
    "range": "58.08-79.09",
    "changes": 0.25,
    "companyName": "NetApp, Inc.",
    "currency": "USD",
    "cik": "0001002047",
    "isin": "US64110D1046",
    "cusip": "64110D104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Computer Hardware",
    "website": "https://www.netapp.com",
    "description": "NetApp, Inc. provides cloud-led and data-centric services to manage and share data on-premises, and private and public clouds worldwide. It operates in two segments, Hybrid Cloud and Public Could. The company offers intelligent data management software, such as NetApp ONTAP, NetApp Snapshot, NetApp SnapCenter Backup Management, NetApp SnapMirror Data Replication, NetApp SnapLock Data Compliance, NetApp ElementOS software, and NetApp SANtricity software; and storage infrastructure solutions, including NetApp All-Flash FAS series, NetApp Fabric Attached Storage, NetApp FlexPod, NetApp E/EF series, NetApp StorageGRID, and NetApp SolidFire. It also provides cloud storage and data services comprising NetApp Cloud Volumes ONTAP, Azure NetApp Files, Amazon FSx for NetApp ONTAP, NetApp Cloud Volumes Service for Google Cloud, NetApp Cloud Sync, NetApp Cloud Tiering, NetApp Cloud Backup, NetApp Cloud Data Sense, and NetApp Cloud Volumes Edge Cache; and cloud operations services, such as NetApp Cloud Insights, Spot Ocean Kubernetes Suite, Spot Security, Spot Eco, and Spot CloudCheckr. In addition, the company offers application-aware data management service under the NetApp Astra name; and professional and support services, such as strategic consulting, professional, managed, and support services. Further, it provides assessment, design, implementation, and migration services. The company serves the energy, financial service, government, technology, internet, life science, healthcare service, manufacturing, media, entertainment, animation, video postproduction, and telecommunication markets through a direct sales force and an ecosystem of partners. NetApp, Inc. was incorporated in 1992 and is headquartered in San Jose, California.",
    "ceo": "Mr. George  Kurian",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "12000",
    "phone": "408 822 6000",
    "address": "3060 Olsen Drive",
    "city": "San Jose",
    "state": "CA",
    "zip": "95128",
    "dcfDiff": 27.0198,
    "dcf": 92.5598,
    "image": "https://financialmodelingprep.com/image-stock/NTAP.png",
    "ipoDate": "1995-11-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]