[
  {
    "symbol": "NTDTY",
    "price": 13.815,
    "beta": 0.838314,
    "volAvg": 5777,
    "mktCap": 19375399129,
    "lastDiv": 0.16,
    "range": "12.25-16.34",
    "changes": 0.155,
    "companyName": "NTT DATA Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US6294361067",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Information Technology Services",
    "website": "https://www.nttdata.com",
    "description": "NTT DATA Corporation provides IT and business services worldwide. The company operates through Public & Social Infrastructure, Financial, Enterprise & Solutions, North America, and EMEA & LATAM segments. It offers cloud, cybersecurity, data and intelligence, salesforce, and application development and management services, as well as maintenance support services. The company also provides advisory, technical consulting, business process consulting, ongoing platform support, and industry-specific services. It serves various industries, such as government agencies and municipalities, manufacturing, healthcare and life sciences, automobile, banking and financial institution, electronics and high-tech field, insurance, transportation and logistics, telecommunication, media and entertainment, wholesale, retail, education, service, energy and utility, fundamental technologies, natural resources, and consumer products. The company was formerly known as NTT Data Communications Systems Corporation and changed its name to NTT DATA Corporation in 1996. NTT DATA Corporation was founded in 1967 and is headquartered in Tokyo, Japan. NTT DATA Corporation is a subsidiary of Nippon Telegraph and Telephone Corporation.",
    "ceo": "Mr. Yo  Honma",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "195106",
    "phone": "81 3 5546 8202",
    "address": "Toyosu Center Building",
    "city": "Tokyo",
    "state": null,
    "zip": "135-6033",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NTDTY.png",
    "ipoDate": "2010-10-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]