[
  {
    "symbol": "NTIOF",
    "price": 73.11,
    "beta": 1.101972,
    "volAvg": 15206,
    "mktCap": 24701602005,
    "lastDiv": 3.09,
    "range": "59.42-76.34",
    "changes": -0.535,
    "companyName": "National Bank of Canada",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Diversified",
    "website": "https://www.nbc.ca",
    "description": "National Bank of Canada provides various financial products and services to retail, commercial, corporate, and institutional clients in Canada and internationally. It operates through four segments: Personal and Commercial, Wealth Management, Financial Markets, and U.S. Specialty Finance and International. The Personal and Commercial segment offers personal banking services, including transaction solutions, mortgage loans and home equity lines of credit, consumer loans, payment solutions, and savings and investment solutions; various insurance products; and commercial banking services comprise credit, and deposit and investment solutions, as well as international trade, foreign exchange transactions, payroll, cash management, insurance, electronic transactions, and complimentary services. The Wealth Management segment comprises investment solutions, trust services, banking services, lending services, and other wealth management solutions. The Financial Markets segment offers corporate banking, advisory, and capital markets services; and project financing, debt, and equity underwriting; advisory services in the areas of mergers and acquisitions, and financing. The U.S. Specialty Finance and International segment provides specialty finance products; financial products and services to individuals and businesses in Cambodia; and investment solutions, guaranteed investment certificates, mutual funds, notes, structured products, and monetization. It provides its services through a network of 384 branches and 927 banking machines. National Bank of Canada was founded in 1859 and is based in Montreal, Canada.",
    "ceo": "Mr. Laurent  Ferreira",
    "sector": "Financial Services",
    "country": "CA",
    "fullTimeEmployees": "28170",
    "phone": null,
    "address": "600 De La Gauchetière Street West",
    "city": "Montreal",
    "state": "QC",
    "zip": "H3B 4L2",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NTIOF.png",
    "ipoDate": "2010-04-26",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]