[
  {
    "symbol": "NTLA",
    "price": 42.15,
    "beta": 1.833098,
    "volAvg": 1034991,
    "mktCap": 3715143150,
    "lastDiv": 0,
    "range": "32.435-76.45",
    "changes": 1.35,
    "companyName": "Intellia Therapeutics, Inc.",
    "currency": "USD",
    "cik": "0001652130",
    "isin": "US45826J1051",
    "cusip": "45826J105",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.intelliatx.com",
    "description": "Intellia Therapeutics, Inc., a genome editing company, focuses on the development of therapeutics. The company's in vivo programs include NTLA-2001, which is in Phase 1 clinical trial for the treatment of transthyretin amyloidosis; and NTLA-2002 for the treatment of hereditary angioedema, as well as other liver-focused programs comprising hemophilia A and hemophilia B, hyperoxaluria Type 1, and alpha-1 antitrypsin deficiency. Its ex vivo pipeline includes NTLA-5001 for the treatment of acute myeloid leukemia; and proprietary programs focused on developing engineered cell therapies to treat various oncological and autoimmune disorders. In addition, it offers tools comprising of Clustered, Regularly Interspaced Short Palindromic Repeats/CRISPR associated 9 (CRISPR/Cas9) system. Intellia Therapeutics, Inc. has license and collaboration agreements with Novartis Institutes for BioMedical Research, Inc. to engineer hematopoietic stem cells for the treatment of sickle cell disease; Regeneron Pharmaceuticals, Inc. to co-develop potential products for the treatment of hemophilia A and hemophilia B; Ospedale San Raffaele; and a strategic collaboration with SparingVision SAS to develop novel genomic medicines utilizing CRISPR/Cas9 technology for the treatment of ocular diseases. The company was formerly known as AZRN, Inc. Intellia Therapeutics, Inc. was incorporated in 2014 and is headquartered in Cambridge, Massachusetts.",
    "ceo": "Dr. John M. Leonard M.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "598",
    "phone": "857 285 6200",
    "address": "40 Erie Street",
    "city": "Cambridge",
    "state": "MA",
    "zip": "02139",
    "dcfDiff": 8.98419,
    "dcf": 50.6142,
    "image": "https://financialmodelingprep.com/image-stock/NTLA.png",
    "ipoDate": "2016-05-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]