[
  {
    "symbol": "NTNX",
    "price": 27.1,
    "beta": 1.344718,
    "volAvg": 1348816,
    "mktCap": 6389069117,
    "lastDiv": 0,
    "range": "13.98-33.734",
    "changes": 0.03,
    "companyName": "Nutanix, Inc.",
    "currency": "USD",
    "cik": "0001618732",
    "isin": "US67059N1081",
    "cusip": "67059N108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.nutanix.com",
    "description": "Nutanix, Inc. provides an enterprise cloud platform in North America, Europe, the Asia Pacific, the Middle East, Latin America, and Africa. The company offers Acropolis converges virtualization, enterprise storage services, and networking visualization and security services; Acropolis Hypervisor, an enterprise-grade virtualization solution; Nutanix Karbon for automated deployment and management of Kubernetes clusters to simplify the provisioning, operations, and lifecycle management of cloud-native environments; and Nutanix Clusters solution. It also offers Prism Pro; Nutanix Beam, a cloud governance; and Nutanix Calm, an application marketplace, which provides automation services that streamline application lifecycle management and deliver powerful hybrid cloud orchestration. In addition, the company provides Nutanix Files, an enterprise-grade NFS and SMB files services; Nutanix Objects, a S3-compatible object services; Nutanix Era, a database automation and database-as-a-service solution; and Nutanix Frame, a desktop-as-a-service product to deliver virtual apps or desktops to users from multiple public cloud environments and/or an enterprises private cloud datacenter. Further, it offers products support, and consulting and implementation services. It serves customers in a range of industries, including automotive, consumer goods, education, energy, financial services, healthcare, manufacturing, media, public sector, retail, technology, and telecommunications, as well as service providers. The company was incorporated in 2009 and is headquartered in San Jose, California.",
    "ceo": "Dr. Rajiv  Ramaswami Ph.D.",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "6450",
    "phone": "408 216 8360",
    "address": "1740 Technology Drive",
    "city": "San Jose",
    "state": "CA",
    "zip": "95110",
    "dcfDiff": 1.30381,
    "dcf": 29.2838,
    "image": "https://financialmodelingprep.com/image-stock/NTNX.png",
    "ipoDate": "2016-09-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]