[
  {
    "symbol": "NTRA",
    "price": 51.48,
    "beta": 1.218661,
    "volAvg": 1128724,
    "mktCap": 5884266960,
    "lastDiv": 0,
    "range": "34.002-59.75",
    "changes": 0.69,
    "companyName": "Natera, Inc.",
    "currency": "USD",
    "cik": "0001604821",
    "isin": "US6323071042",
    "cusip": "632307104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Diagnostics & Research",
    "website": "https://www.natera.com",
    "description": "Natera, Inc., a diagnostics company, develops and commercializes molecular testing services worldwide. It offers Panorama, a non-invasive prenatal test that screens for chromosomal abnormalities of a fetus with a blood draw from the mother, as well as twin pregnancies for zygosity; Vistara, a single-gene mutations screening test to identify single-gene disorder; Horizon carrier screening to determine carrier status for various genetic diseases; and Spectrum to identify chromosomal anomalies or inherited genetic conditions during an in vitro fertilization cycle. The company also provides Anora miscarriage test products to analyze fetal chromosomes to understand the cause of miscarriage; and non-invasive paternity testing products to determine paternity by gestation using a blood draw from the pregnant mother and alleged father. In addition, it offers Constellation, a cloud-based software product that enables laboratory customers to gain access through the cloud to the company's algorithms and bioinformatics in order to validate and launch tests; Signatera, a circulating tumor DNA technology that screen for a generic set of mutations independent of an individual's tumor; and Prospera used to assess organ transplant rejection. The company offers products through its direct sales force, as well as through a network of approximately 100 laboratory and distribution partners. It has a partnership agreement with BGI Genomics Co., Ltd. to develop, manufacture, and commercialize NGS-based genetic testing assays; and Foundation Medicine, Inc. to develop and commercialize personalized circulating tumor DNA monitoring assays. The company was formerly known as Gene Security Network, Inc. and changed its name to Natera, Inc. in 2012. Natera, Inc. was founded in 2003 and is based in Austin, Texas.",
    "ceo": "Mr. Steven Leonard Chapman",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "2958",
    "phone": "650 249 9090",
    "address": "13011 McCallen Pass Building A",
    "city": "San Carlos",
    "state": "CA",
    "zip": "78753",
    "dcfDiff": 7.51816,
    "dcf": 36.2218,
    "image": "https://financialmodelingprep.com/image-stock/NTRA.png",
    "ipoDate": "2015-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]