[
  {
    "symbol": "NTTYY",
    "price": 30.58,
    "beta": 0.206896,
    "volAvg": 120058,
    "mktCap": 104292787625,
    "lastDiv": 0.88,
    "range": "25.72-31.77",
    "changes": 1.43,
    "companyName": "Nippon Telegraph and Telephone Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US6546241059",
    "cusip": "654624105",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://group.ntt",
    "description": "Nippon Telegraph and Telephone Corporation provides fixed voice-related, mobile voice-related, IP/packet communications, and system integration services in Japan and internationally. The company's Mobile Communications Business segment offers mobile phone services and related services, including movie and music distribution, e-book, and finance and payment services, as well as smart life area and internet connection services. Its Regional Communications Business segment provides intra-prefectural communications services, and FTTH and other services. The company's Long Distance and International Communications Business segment offers inter-prefectural communications services, international communications services, and services related to the solutions business and related services. This segment primarily provides cloud, data center, migration and maintenance support, IT system building, professional security, ICT, network, managed, mobile connectivity, and other services, as well as teleconference, web conference, and video conference services. Its Data Communications Business segment offers network system and system integration services comprising ERP services, ICT outsourcing, consulting, system design and development, and other services. The company's Other Business segment engages in the acquisition, development, construction, lease, and management of real estate; design, management, and maintenance of buildings, equipment, and electric power facilities; development of smart energy solutions and energy management systems; credit card transaction settlement activities; development, production, operation, and maintenance of information communications systems and software; billing and collection of charges for communications and other activities; design and development of systems; finance; and technology transfer and technical consulting businesses. It also sells telecommunications equipment. The company was founded in 1952 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Akira  Shimada",
    "sector": "Communication Services",
    "country": "JP",
    "fullTimeEmployees": "338650",
    "phone": "81 3 6838 5111",
    "address": "East Tower",
    "city": "Tokyo",
    "state": null,
    "zip": "100-8116",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NTTYY.png",
    "ipoDate": "1994-09-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]