[
  {
    "symbol": "NU",
    "price": 7.8,
    "beta": 0,
    "volAvg": 27563079,
    "mktCap": 36619362749,
    "lastDiv": 0,
    "range": "3.39-7.99",
    "changes": 0.15,
    "companyName": "Nu Holdings Ltd.",
    "currency": "USD",
    "cik": "0001691493",
    "isin": "KYG6683N1034",
    "cusip": "G6683N103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.nubank.com.br",
    "description": "Nu Holdings Ltd. operates as a digital financial services platform and technology company primarily in Brazil, Mexico, and Colombia. It offers Nu credit and debit cards; Ultraviolet credit and debit cards; and mobile payment solutions for NuAccount customers to make and receive transfers, pay bills, and make everyday purchases through their mobile phones. The company provides savings solutions, such as Nu Personal Accounts, a digital account solution that supports all personal finance activities, from daily purchases and money transfers to savings; and Nu business accounts designed specifically for entrepreneur customers and their businesses. In addition, it offers NuInvest, an investment product that provides equity, fixed-income, options, and ETF products, as well as multimarket funds with curated asset allocations based on the customer's risk profile and financial position; personal unsecured loans; in-app buy now pay later' solution for Nu card customers to pay credit and debit purchases, and banking payment slips over time in up to twelve installments; and NuInsurance protecting solutions to help its customers secure life insurance and funeral benefits. The company was founded in 2013 and is headquartered in Sao Paulo, Brazil.",
    "ceo": "Mr. David  Velez-Osomo",
    "sector": "Financial Services",
    "country": "BR",
    "fullTimeEmployees": "5403",
    "phone": null,
    "address": "Rua Capote Valente, 39",
    "city": "São Paulo",
    "state": "SP",
    "zip": "5409-0000",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NU.png",
    "ipoDate": "2021-12-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]