[
  {
    "symbol": "NUVA",
    "price": 40.75,
    "beta": 1.075704,
    "volAvg": 849585,
    "mktCap": 2137304900,
    "lastDiv": 0,
    "range": "35.17-54.62",
    "changes": 0.23,
    "companyName": "NuVasive, Inc.",
    "currency": "USD",
    "cik": "0001142596",
    "isin": "US6707041058",
    "cusip": "670704105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Devices",
    "website": "https://www.nuvasive.com",
    "description": "NuVasive, Inc., a medical technology company, develops, manufactures, and sells procedural solutions for spine surgery. It provides surgical access instruments, including Maxcess integrated split-blade retractor system that enable less-invasive surgical techniques by minimizing soft tissue disruption during spine surgery; specialized spinal implants to advance spinal fusion by enhancing the osseointegration and biomechanical properties of implant materials, including porous titanium and porous polyetheretherketone; and fixation system that facilitates the preservation and restoration of patient alignment. The company also offers cervical total disc replacement technology for cervical spinal fusion surgery; neuromonitoring systems, which use proprietary software-driven nerve detection and avoidance technology, and its intraoperative neuromonitoring services and support; and Pulse platform, a software ecosystem that integrates multiple hardware technologies into a single, condensed footprint in the operating room. In addition, it provides expandable growing rod implant systems for the treatment of early-onset scoliosis; various biologics that are used to aid in the spinal fusion or bone healing process; Precice, an intramedullary implant device that utilizes the MAGEC technology to non-invasively lengthen the femur and tibia; and onsite and remote monitoring of the neurological systems of patients undergoing spinal and brain-related surgeries. The company sells its products to patients, surgeons, hospitals, and insurers through independent sales agents, directly employed sales personnel, and distributors in the United States and internationally. NuVasive, Inc. was incorporated in 1997 and is headquartered in San Diego, California.",
    "ceo": "Mr. J. Christopher Barry",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "3000",
    "phone": "858 909 1800",
    "address": "7475 Lusk Boulevard",
    "city": "San Diego",
    "state": "CA",
    "zip": "92121",
    "dcfDiff": 4.88373,
    "dcf": 41.0263,
    "image": "https://financialmodelingprep.com/image-stock/NUVA.png",
    "ipoDate": "2004-05-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]