[
  {
    "symbol": "NVR",
    "price": 6312.91,
    "beta": 0.995774,
    "volAvg": 24600,
    "mktCap": 20497703125,
    "lastDiv": 1.5819999999999999,
    "range": "3816.56-6386.62",
    "changes": -17.29,
    "companyName": "NVR, Inc.",
    "currency": "USD",
    "cik": "0000906163",
    "isin": "US62944T1051",
    "cusip": "62944T105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Residential Construction",
    "website": "https://www.nvrinc.com",
    "description": "NVR, Inc. operates as a homebuilder in the United States. The company operates in two segments, Homebuilding and Mortgage Banking. It engages in the construction and sale of single-family detached homes, townhomes, and condominium buildings under the Ryan Homes, NVHomes, and Heartland Homes names. The company markets its Ryan Homes products to first-time and first-time move-up buyers; and NVHomes and Heartland Homes products to move-up and luxury buyers. It also provides various mortgage related services to its homebuilding customers, as well as brokers title insurance; performs title searches in connection with mortgage loan closings; and sells mortgage loans to investors in the secondary markets on a servicing released basis. The company primarily serves in Maryland, Virginia, West Virginia, Delaware, New Jersey, Eastern Pennsylvania, New York, Ohio, Western Pennsylvania, Indiana, Illinois, North Carolina, South Carolina, Florida, Tennessee, and Washington, D.C. NVR, Inc. was founded in 1980 and is headquartered in Reston, Virginia.",
    "ceo": "Mr. Eugene James Bredow",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "6550",
    "phone": "703 956 4000",
    "address": "Plaza America Tower I",
    "city": "Reston",
    "state": "VA",
    "zip": "20190",
    "dcfDiff": 130.281,
    "dcf": 4991.73,
    "image": "https://financialmodelingprep.com/image-stock/NVR.png",
    "ipoDate": "1985-07-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]