[
  {
    "symbol": "NVS",
    "price": 98.44,
    "beta": 0.47318,
    "volAvg": 2007575,
    "mktCap": 208654406825,
    "lastDiv": 3.5,
    "range": "74.09-105.56",
    "changes": -0.74,
    "companyName": "Novartis AG",
    "currency": "USD",
    "cik": "0001114448",
    "isin": "US66987V1098",
    "cusip": "66987V109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.novartis.com",
    "description": "Novartis AG researches, develops, manufactures, and markets healthcare products worldwide. The company operates through two segments, Innovative Medicines and Sandoz. The Innovative Medicines segment offers prescription medicines for patients and healthcare providers. It also provides ophthalmology, neuroscience, immunology, hepatology, dermatology, respiratory, cardiovascular, renal, and metabolism medicine products. The Sandoz segment develops, manufactures, and markets finished dosage form medicines; active ingredients and finished dosage forms of small molecule pharmaceuticals to third parties; and retail generics and anti-infectives. It also provides active pharmaceutical ingredients and intermediates primarily antibiotics; protein- or other biotechnology-based products, including biosimilars; and biotechnology manufacturing services. Novartis AG has a license and collaboration agreement with Alnylam Pharmaceuticals to develop, manufacture, and commercialize inclisiran; and a clinical collaboration with Kura Oncology, Inc. to evaluate the combination of Tipifarnib and Alpelisib in patients with head and neck squamous cell carcinoma. The company was incorporated in 1996 and is headquartered in Basel, Switzerland.",
    "ceo": "Dr. Vasant  Narasimhan",
    "sector": "Healthcare",
    "country": "CH",
    "fullTimeEmployees": "103000",
    "phone": "41 61 324 1111",
    "address": "Lichtstrasse 35",
    "city": "Basel",
    "state": null,
    "zip": "4056",
    "dcfDiff": 2.78982,
    "dcf": 92.2798,
    "image": "https://financialmodelingprep.com/image-stock/NVS.png",
    "ipoDate": "1996-11-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]