[
  {
    "symbol": "NVST",
    "price": 33.65,
    "beta": 1.430551,
    "volAvg": 2113962,
    "mktCap": 5508572300,
    "lastDiv": 0,
    "range": "31.2-43.29",
    "changes": -0.17,
    "companyName": "Envista Holdings Corporation",
    "currency": "USD",
    "cik": "0001757073",
    "isin": "US29415F1049",
    "cusip": "29415F104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.envistaco.com",
    "description": "Envista Holdings Corporation, together with its subsidiaries, engages in the development, sale, and marketing of dental products in the United States, China, and internationally. The company operates in two segments, Specialty Products & Technologies and Equipment & Consumables. The company's Specialty Products & Technologies segment provides dental implant systems, guided surgery systems, biomaterials, and prefabricated and custom-built prosthetics to oral surgeons, prosthodontists, and periodontists under the Nobel Biocare, Alpha-Bio Tec, Implant Direct, Nobel Procera, and Orascoptic brands; and brackets and wires, tubes and bands, archwires, clear aligners, digital orthodontic treatments, retainers, and other orthodontic laboratory products under the Damon, Insignia, AOA, and Spark brands. This segment also offers software packages, which include DTX Studio Implant for treatment planning of dental implants; TX Studio Lab for prosthetics treatment planning; and DTX Studio Clinic to store and access a various clinical patient images. The company's Equipment & Consumables segment provides dental equipment and supplies, including digital imaging systems, sensors, software, and other visualization/magnification systems; endodontic systems and related consumables; restorative materials, rotary burs, impression materials, bonding agents, and cements; and infection prevention products. This segment offers its products under the Dexis, Gendex, i-CAT, Kerr, Metrex, Total Care, Pentron, Optibond, Harmonize, Sonicfill, Sybron Endo, and CaviWipes to dental offices, clinics, and hospitals. Envista Holdings Corporation was incorporated in 2018 and is headquartered in Brea, California.",
    "ceo": "Mr. Amir  Aghdaei",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "12700",
    "phone": "714 817 7000",
    "address": "Building E",
    "city": "Brea",
    "state": "CA",
    "zip": "92821-6208",
    "dcfDiff": 3.88504,
    "dcf": 42.225,
    "image": "https://financialmodelingprep.com/image-stock/NVST.png",
    "ipoDate": "2019-09-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]