[
  {
    "symbol": "NVT",
    "price": 50.77,
    "beta": 1.29507,
    "volAvg": 1037362,
    "mktCap": 8410913996,
    "lastDiv": 0.7,
    "range": "29.19-50.99",
    "changes": -0.01,
    "companyName": "nVent Electric plc",
    "currency": "USD",
    "cik": "0001720635",
    "isin": "IE00BDVJJQ56",
    "cusip": "G6700G107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electrical Equipment & Parts",
    "website": "https://www.nvent.com",
    "description": "nVent Electric plc designs, manufactures, markets, installs, and services electrical connection and protection products worldwide. The company operates through three segments: Enclosures, Electrical & Fastening Solutions, and Thermal Management. The Enclosures segment provides solutions to connect and protect critical electronics, communication, control, and power equipment; physical infrastructure solutions to host, connect, and protect server and network equipment; and indoor and outdoor protection for test and measurement and aerospace and defense applications in industrial, infrastructure, commercial, and energy verticals. Its products also include metallic and non-metallic enclosures, cabinets, sub racks, and backplanes. The Electrical & Fastening Solutions segment offers fastening solutions to connect and protect electrical and mechanical systems, and civil structures. It also provides engineered electrical and fastening products. The Thermal Management segment offers electric thermal solutions that connect and protect buildings, infrastructure, industrial processes, and people. This segment provides thermal management systems comprising heat tracing, floor heating, fire-rated and specialty wiring, sensing, and snow melting and de-icing solutions. The company sells its products under the CADDY, ERICO, HOFFMAN, RAYCHEM, SCHROFF, and TRACER brands. nVent Electric plc markets its products through electrical distributors, data center contractors, original equipment manufacturers, and maintenance contractors. It serves the energy, industrial, infrastructure, and commercial and residential sectors. The company was founded in 1903 and is based in London, the United Kingdom.",
    "ceo": "Ms. Beth A. Wozniak",
    "sector": "Industrials",
    "country": "GB",
    "fullTimeEmployees": "9900",
    "phone": "44 20 3966 0279",
    "address": "The Mille",
    "city": "London",
    "state": null,
    "zip": "TW8 9DW",
    "dcfDiff": 0.271004,
    "dcf": 39.291,
    "image": "https://financialmodelingprep.com/image-stock/NVT.png",
    "ipoDate": "2018-04-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]