[
  {
    "symbol": "NVZMY",
    "price": 46.46,
    "beta": 0.431034,
    "volAvg": 27220,
    "mktCap": 12850789912,
    "lastDiv": 0.85,
    "range": "45.97-64.29",
    "changes": -0.13,
    "companyName": "Novozymes A/S",
    "currency": "USD",
    "cik": null,
    "isin": "US6701081092",
    "cusip": "670108109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Chemicals",
    "website": "https://www.novozymes.com",
    "description": "Novozymes A/S produces and sells industrial enzymes, microorganisms, and probiotics in Europe, the Middle East, Africa, North America, the Asia Pacific, and Latin America. The company offers baking, beverages, dairy, starch, and protein solutions for the food and beverage industry; laundry, dishwashing, and professional cleaning solutions for the household care industry; agriculture solutions, including crop production, and animal health and nutrition solutions; bioyield and biocontrol solutions for crops; and grain and technical processing solutions, as well as bio energy solutions for liquefaction, saccharifaction, fermentation, fiber conversion, and biomass conversion. It also provides textile solutions, such as biopreparation, biopolishing, bleach clean-up, denim abrasion and finishing, and desizing solutions. In addition, the company offers solutions for pulp & paper, including fiber modification, bleach boosting, deposit control, starch modification, and deinking; leather solutions comprising acid bating, area expansion, bating, degreasing, soaking, and unhairing and liming; and water and waste management solutions, which consist of bioaugmentation, biogas, and sludge management. Further, it provides pharmaceutical solutions, including lipases, immobilized lipases, and proteases for biocatalysis, as well as rTrypsin for cell culture; and human health and protein solutions. The company was founded in 1925 and is headquartered in Bagsvaerd, Denmark.",
    "ceo": "Ms. Ester  Baiget",
    "sector": "Basic Materials",
    "country": "DK",
    "fullTimeEmployees": "6790",
    "phone": "45 44 46 00 00",
    "address": "Krogshoejvej 36",
    "city": "Bagsvaerd",
    "state": null,
    "zip": "2880",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NVZMY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]