[
  {
    "symbol": "NWE",
    "price": 56.91,
    "beta": 0.459154,
    "volAvg": 287883,
    "mktCap": 3402927759,
    "lastDiv": 2.56,
    "range": "48.68-61.24",
    "changes": -0.62,
    "companyName": "NorthWestern Corporation",
    "currency": "USD",
    "cik": "0000073088",
    "isin": "US6680743050",
    "cusip": "668074305",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Utilities—Diversified",
    "website": "https://www.northwesternenergy.com",
    "description": "NorthWestern Corporation, doing business as NorthWestern Energy, provides electricity and natural gas to residential, commercial, and various industrial customers. The company operates through Electric and Natural Gas segments. It generates, purchases, transmits, and distributes electricity; and produces, purchases, stores, transmits, and distributes natural gas, as well as owns municipal franchises to provide natural gas service in the communities.  The company operates 6,819 miles of electric transmission and 18,177 miles of electric distribution lines with approximately 400 transmission and distribution substations; and 2,166 miles of natural gas transmission and 4,945 miles of natural gas distribution lines with approximately 138 city gate stations in Montana. It also operates 1,308 miles of electric transmission and 2,320 miles of electric distribution lines in South Dakota; and 55 miles of natural gas transmission and 2,517 miles of natural gas distribution lines in South Dakota and Nebraska. The company serves approximately 753,600 customers in Montana, South Dakota, Nebraska, and Yellowstone National Park. NorthWestern Corporation was incorporated in 1923 and is based in Sioux Falls, South Dakota.",
    "ceo": "Mr. Brian B. Bird",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "1530",
    "phone": "605 978 2900",
    "address": "3010 West 69th Street",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57108",
    "dcfDiff": 0.684384,
    "dcf": 56.0456,
    "image": "https://financialmodelingprep.com/image-stock/NWE.png",
    "ipoDate": "2007-12-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]