[
  {
    "symbol": "NWG",
    "price": 5.93,
    "beta": 1.292337,
    "volAvg": 1550509,
    "mktCap": 26512140785,
    "lastDiv": 0.34,
    "range": "4.71-7.8",
    "changes": 0.04,
    "companyName": "NatWest Group plc",
    "currency": "USD",
    "cik": "0000844150",
    "isin": "US6390571080",
    "cusip": "639057108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.natwestgroup.com",
    "description": "NatWest Group plc, together with its subsidiaries, provides banking and financial products and services to personal, commercial, corporate, and institutional customers in the United Kingdom and internationally. It operates through Retail Banking, Commercial Banking, Private Banking, RBS International, and NatWest Markets segments. The Retail Banking segment offers a range of banking products and related financial services, such as current accounts, mortgages, personal unsecured lending, and personal deposits, as well as mobile and online banking services. The Commercial Banking segment offers banking and financing solutions to start-up, SME, commercial, corporate, and institutional customers. The Private Banking segment provides private banking and wealth management products for high-net-worth individuals and their business interests. The RBS International segment offers banking various products and services to institutional customers. It also operates in wholesale branches and fund depositary service businesses. The NatWest Markets segment provides services to corporate and institutional customers for the management of financial risks for achieving short-term and long-term sustainable financial goals. NatWest Group plc operates approximately 800 branches and 16,000 physical points of presence. The company was formerly known as The Royal Bank of Scotland Group plc and changed its name to NatWest Group plc in July 2020. NatWest Group plc was founded in 1727 and is headquartered in Edinburgh, the United Kingdom.",
    "ceo": "Ms. Alison Marie Rose-Slade B.A.",
    "sector": "Financial Services",
    "country": "GB",
    "fullTimeEmployees": "61800",
    "phone": "44 13 1626 3263",
    "address": "Gogarburn",
    "city": "Edinburgh",
    "state": null,
    "zip": "EH12 1HQ",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/NWG.png",
    "ipoDate": "2007-10-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]