[
  {
    "symbol": "NWL",
    "price": 8.99,
    "beta": 0.939788,
    "volAvg": 6619509,
    "mktCap": 3722759000,
    "lastDiv": 0.28,
    "range": "7.8-21.55",
    "changes": 0.16,
    "companyName": "Newell Brands Inc.",
    "currency": "USD",
    "cik": "0000814453",
    "isin": "US6512291062",
    "cusip": "651229106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Household & Personal Products",
    "website": "https://www.newellbrands.com",
    "description": "Newell Brands Inc. designs, manufactures, sources, and distributes consumer and commercial products worldwide. It operates in five segments: Commercial Solutions, Home Appliances, Home Solutions, Learning and Development, and Outdoor and Recreation. The Commercial Solutions segment provides commercial cleaning and maintenance solutions; closet and garage organization products; hygiene systems and material handling solutions; and home and security, and smoke and carbon monoxide alarms products under the BRK, First Alert, Mapa, Quickie, Rubbermaid, Rubbermaid Commercial Products, and Spontex brands. The Home Appliances segment offers kitchen appliances under the Crock-Pot, Mr. Coffee, Oster, and Sunbeam brands. The Home Solutions segment provides food and home storage; fresh preserving; vacuum sealing; and gourmet cookware, bakeware, cutlery, and home fragrance products under the Ball, Calphalon, Chesapeake Bay Candle, FoodSaver, Rubbermaid, Sistema, WoodWick, and Yankee Candle brands. The Learning and Development segment offers writing instruments, including markers and highlighters, pens, and pencils; art products; activity-based adhesive and cutting products; labeling solutions; and baby gear and infant care products under the Aprica, Baby Jogger, Graco, NUK, Tigex, Dymo, Elmer's, EXPO, Graco, Mr. Sketch, NUK, Paper Mate, Parker, Prismacolor, Sharpie, Waterman, and X-Acto brands. The Outdoor and Recreation segment provides outdoor and outdoor-related products under the Campingaz, Coleman, Contigo, ExOfficio, and Marmot brands. It serves warehouse clubs, department and drug/grocery stores, mass merchants, home centers, office superstores and supply stores, contract stationers, and distributors, e-commerce, sporting goods, specialty, and travel retailers. The company was formerly known as Newell Rubbermaid Inc. and changed its name to Newell Brands Inc. in April 2016. Newell Brands Inc. was founded in 1903 and is based in Atlanta, Georgia.",
    "ceo": "Mr. Christopher H. Peterson",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "28000",
    "phone": "770 418 7000",
    "address": "6655 Peachtree Dunwoody Road",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30328",
    "dcfDiff": 1.75251,
    "dcf": 14.0875,
    "image": "https://financialmodelingprep.com/image-stock/NWL.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]