[
  {
    "symbol": "NXPI",
    "price": 197.56,
    "beta": 1.513028,
    "volAvg": 2232209,
    "mktCap": 51314828660,
    "lastDiv": 4.06,
    "range": "132.08-200.5",
    "changes": -2.76,
    "companyName": "NXP Semiconductors N.V.",
    "currency": "USD",
    "cik": "0001413447",
    "isin": "NL0009538784",
    "cusip": "N6596X109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.nxp.com",
    "description": "NXP Semiconductors N.V. offers various semiconductor products. The company's product portfolio includes microcontrollers; application processors, including i.MX application processors, and i.MX 8 and 9 family of applications processors; communication processors; wireless connectivity solutions, such as near field communications, ultra-wideband, Bluetooth low-energy, Zigbee, and Wi-Fi and Wi-Fi/Bluetooth integrated SoCs; analog and interface devices; radio frequency power amplifiers; and security controllers, as well as semiconductor-based environmental and inertial sensors, including pressure, inertial, magnetic, and gyroscopic sensors. The company's product solutions are used in a range of applications, including automotive, industrial and Internet of Things, mobile, and communication infrastructure. The company markets its products to various original equipment manufacturers, contract manufacturers, and distributors. It operates in China, the Netherlands, the United States, Singapore, Germany, Japan, South Korea, Malaysia, and internationally. The company was formerly known as KASLION Acquisition B.V and changed its name to NXP Semiconductors N.V. in May 2010. NXP Semiconductors N.V. was incorporated in 2006 and is headquartered in Eindhoven, the Netherlands.",
    "ceo": "Mr. Kurt  Sievers",
    "sector": "Technology",
    "country": "NL",
    "fullTimeEmployees": "34500",
    "phone": "31 40 272 9999",
    "address": "High Tech Campus 60",
    "city": "Eindhoven",
    "state": null,
    "zip": "5656 AG",
    "dcfDiff": 2.15172,
    "dcf": 179.388,
    "image": "https://financialmodelingprep.com/image-stock/NXPI.png",
    "ipoDate": "2010-08-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]