[
  {
    "symbol": "NXST",
    "price": 166,
    "beta": 1.473239,
    "volAvg": 282535,
    "mktCap": 5952212200,
    "lastDiv": 5.4,
    "range": "148.0-217.76",
    "changes": -1.885,
    "companyName": "Nexstar Media Group, Inc.",
    "currency": "USD",
    "cik": "0001142417",
    "isin": "US65336K1034",
    "cusip": "65336K103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Entertainment",
    "website": "https://www.nexstar.tv",
    "description": "Nexstar Media Group, Inc., a television broadcasting and digital media company, focuses on the acquisition, development, and operation of television stations and interactive community websites and digital media services in the United States. The company offers free programming to television viewing audiences. As of December 31, 2020, it provided sales, programming, and other services through various local service agreements to 37 power television stations owned by independent third parties; and owned, operated, programmed, or provided sales and other services to 198 television stations. The company also offers video and display advertising platforms that are delivered locally or nationally through its own and various third party websites and mobile applications, as well as owns WGN America, a national general entertainment cable network. Its stations are affiliates of ABC, NBC, FOX, CBS, The CW, MyNetworkTV, and other broadcast television networks. The company was formerly known as Nexstar Broadcasting Group, Inc. and changed its name to Nexstar Media Group, Inc. in January 2017. Nexstar Media Group, Inc. was founded in 1996 and is headquartered in Irving, Texas.",
    "ceo": "Mr. Perry A. Sook",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "11666",
    "phone": "972 373 8800",
    "address": "545 East John Carpenter Freeway",
    "city": "Irving",
    "state": "TX",
    "zip": "75062",
    "dcfDiff": 30.7446,
    "dcf": 173.605,
    "image": "https://financialmodelingprep.com/image-stock/NXST.png",
    "ipoDate": "2003-11-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]