[
  {
    "symbol": "NYCB",
    "price": 11.19,
    "beta": 1.055633,
    "volAvg": 13780008,
    "mktCap": 8080590119,
    "lastDiv": 0.68,
    "range": "5.81-11.225",
    "changes": 0.17,
    "companyName": "New York Community Bancorp, Inc.",
    "currency": "USD",
    "cik": "0000910073",
    "isin": "US6494451031",
    "cusip": "649445103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.mynycb.com",
    "description": "New York Community Bancorp, Inc. operates as the bank holding company for New York Community Bank that provides banking products and services in Metro New York, New Jersey, Ohio, Florida, and Arizona. The company accepts various deposit products, such as interest-bearing checking and money market, savings, non-interest-bearing, and individual retirement accounts, as well as certificates of deposit. Its loan products include multi-family loans; commercial real estate loans; specialty finance loans and leases; and commercial and industrial loans; acquisition, development, and construction loans; one-to-four family loans; and consumer loans. The company also offers annuities, life and long-term care insurance products, and mutual funds; cash management products; and online, mobile, and phone banking services. It primarily serves individuals, small and mid-size businesses, and professional associations through a network of 237 branches and 333 ATM locations. The company was formerly known as Queens County Bancorp, Inc. and changed its name to New York Community Bancorp, Inc. in November 2000. New York Community Bancorp, Inc. was founded in 1859 and is based in Hicksville, New York.",
    "ceo": "Mr. Thomas Robert Cangemi CPA",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "7497",
    "phone": "516 683 4100",
    "address": "102 Duffy Avenue",
    "city": "Hicksville",
    "state": "NY",
    "zip": "11801",
    "dcfDiff": 16.7487,
    "dcf": 26.6287,
    "image": "https://financialmodelingprep.com/image-stock/NYCB.png",
    "ipoDate": "1993-11-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]