[
  {
    "symbol": "NYT",
    "price": 39.65,
    "beta": 0.987323,
    "volAvg": 933401,
    "mktCap": 6498437067,
    "lastDiv": 0.44,
    "range": "27.59-42.4",
    "changes": 0.75,
    "companyName": "The New York Times Company",
    "currency": "USD",
    "cik": "0000071691",
    "isin": "US6501111073",
    "cusip": "650111107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Publishing",
    "website": "https://www.nytco.com",
    "description": "The New York Times Company, together with its subsidiaries, provides news and information for readers and viewers across various platforms worldwide. It offers The New York Times (The Times), a daily and Sunday newspaper in the United States, as well as international edition of The Times; and operates the NYTimes.com Website. The company also transmits articles, graphics, and photographs from The Times and other publications to approximately 1,500 newspapers, magazines, and websites; licenses electronic databases to resellers in the business, professional, and library markets; and offers magazine licensing, news digests, book development, and rights and permissions. In addition, it engages in the live events business, which hosts physical and virtual live events to connect audiences with journalists and outside thought leaders; direct-sold website, mobile application, podcast, email, and video advertisements, as well as digital advertising services; operates Wirecutter, a product review and recommendation products; develops mobile applications, including games and cooking products; prints and distributes products for third parties; and offers other products and services. The company was founded in 1851 and is headquartered in New York, New York.",
    "ceo": "Ms. Meredith A. Kopit Levien",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "5800",
    "phone": "212 556 1234",
    "address": "620 Eighth Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10018",
    "dcfDiff": 2.02727,
    "dcf": 36.6873,
    "image": "https://financialmodelingprep.com/image-stock/NYT.png",
    "ipoDate": "1973-05-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]