[
  {
    "symbol": "OC",
    "price": 128.04,
    "beta": 1.416197,
    "volAvg": 889532,
    "mktCap": 11537607576,
    "lastDiv": 2.08,
    "range": "73.36-129.0",
    "changes": -0.23,
    "companyName": "Owens Corning",
    "currency": "USD",
    "cik": "0001370946",
    "isin": "US6907421019",
    "cusip": "690742101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.owenscorning.com",
    "description": "Owens Corning manufactures and markets insulation, roofing, and fiberglass composite materials in the United States, Canada, Europe, the Asia Pacific, and internationally. It operates in three segments: Composites, Insulation, and Roofing. The Composites segment manufactures, fabricates, and sells glass reinforcements in the form of fiber; and glass fiber products in the form of fabrics, non-wovens, and other specialized products. Its products are used in building structures, roofing shingles, tubs and showers, pools, flooring, pipes and tanks, poles, electrical equipment, and wind-energy turbine blades applications in the building and construction, renewable energy, and infrastructure markets. This segment sells its products directly to parts molders, fabricators, and shingle manufacturers. The Insulation segment manufactures and sells insulation products for residential, commercial, industrial, and other markets for thermal and acoustical applications; and glass fiber pipe insulation, flexible duct media, bonded and granulated mineral fiber insulation, cellular glass insulation, and foam insulation products used in construction applications. This segment sells its products primarily to the insulation installers, home centers, lumberyards, retailers, and distributors under the Thermafiber, FOAMULAR, FOAMGLAS, Paroc, Owens Corning PINK, and FIBERGLAS Insulation brand names. The Roofing segment manufactures and sells aminate and strip asphalt roofing shingles, oxidized asphalt materials, and roofing components used in residential and commercial construction, and specialty applications, as well as synthetic packaging materials. This segment sells its products through distributors, home centers, lumberyards, retailers, and contractors, as well as to roofing contractors for built-up roofing asphalt systems; and manufacturers in automotive, chemical, rubber, and construction industries. Owens Corning was incorporated in 1938 and is headquartered in Toledo, Ohio.",
    "ceo": "Mr. Brian D. Chambers",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "19000",
    "phone": "419 248 8000",
    "address": "One Owens Corning Parkway",
    "city": "Toledo",
    "state": "OH",
    "zip": "43659",
    "dcfDiff": 6.74463,
    "dcf": 98.8546,
    "image": "https://financialmodelingprep.com/image-stock/OC.png",
    "ipoDate": "2006-11-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]