[
  {
    "symbol": "OFC",
    "price": 23.6,
    "beta": 1.044014,
    "volAvg": 751516,
    "mktCap": 2655330400,
    "lastDiv": 1.14,
    "range": "21.59-28.69",
    "changes": -0.33,
    "companyName": "Corporate Office Properties Trust",
    "currency": "USD",
    "cik": "0000860546",
    "isin": "US22002T1088",
    "cusip": "22002T108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "REIT—Office",
    "website": "https://www.copt.com",
    "description": "COPT is a REIT that owns, manages, leases, develops and selectively acquires office and data center properties. The majority of its portfolio is in locations that support the United States Government and its contractors, most of whom are engaged in national security, defense and information technology (IT) related activities servicing what it believes are growing, durable, priority missions (Defense/IT Locations). The Company also owns a portfolio of office properties located in select urban/urban-like submarkets in the Greater Washington, DC/Baltimore region with durable Class-A office fundamentals and characteristics (Regional Office Properties). As of December 31, 2020, the Company derived 87% of its core portfolio annualized rental revenue from Defense/IT Locations and 13% from its Regional Office Properties. As of the same date and including 17 properties owned through unconsolidated joint ventures, COPT's core portfolio of 179 office and data center shell properties encompassed 20.8 million square feet and was 95.0% leased; the Company also owned one wholesale data center with a critical load of 19.25 megawatts that was 86.7% leased.",
    "ceo": "Mr. Stephen E. Budorick",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "395",
    "phone": "443-285-5400",
    "address": "6711 Columbia Gateway Drive",
    "city": "Columbia",
    "state": "MD",
    "zip": "21046",
    "dcfDiff": 0.811291,
    "dcf": 27.4387,
    "image": "https://financialmodelingprep.com/image-stock/OFC.png",
    "ipoDate": "1991-12-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": true
  }
]