[
  {
    "symbol": "OGN",
    "price": 20.42,
    "beta": 0.72007,
    "volAvg": 2015077,
    "mktCap": 5208366040,
    "lastDiv": 1.12,
    "range": "18.87-35.05",
    "changes": -0.2,
    "companyName": "Organon & Co.",
    "currency": "USD",
    "cik": "0001821825",
    "isin": "US68622V1061",
    "cusip": "68622V106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.organon.com",
    "description": "Organon & Co., a health care company, develops and delivers health solutions through a portfolio of prescription therapies in the United States and internationally. Its women's health portfolio comprises contraception and fertility brands, such as Nexplanon/Implanon, a long-acting reversible contraceptive. The company's biosimilars portfolio consists of three immunology products, such as Brenzys, Renflexis, and Hadlima, as well as two oncology products, including Ontruzant and Aybintio. It also offers cardiovascular products, consisting of several cholesterol-modifying medicines under the Zetia, Ezetrol, Vytorin, Inegy, Rosuzet, and Zocor brands; Cozaar and Hyzaar for the treatment of hypertension; respiratory products for various treatments to control and prevent symptoms caused by asthma under the Singulair, Dulera, Zenhale, and Asmanex brand names; and Singulair, Nasonex, Clarinex, and Aerius for treating seasonal allergic rhinitis. In addition, the company provides dermatology products under the Diprosone and Elocon brand; bone health portfolio, including Fosamax brand name; non-opioid pain management products under the Arcoxia, Diprospan, and Celestone brand names; Proscar for the treatment of symptomatic benign prostatic hyperplasia; and Propecia for the treatment of male pattern hair loss. The company sells its products primarily to drug wholesalers and retailers, hospitals, and government agencies, as well as managed health care providers, such as health maintenance organizations, pharmacy benefit managers, and other institutions. Organon & Co. was incorporated in 2020 and is based in Jersey City, New Jersey.",
    "ceo": "Mr. Kevin  Ali",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "10000",
    "phone": "551 430 6000",
    "address": "30 Hudson Street",
    "city": "Jersey City",
    "state": "NJ",
    "zip": "07302",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/OGN.png",
    "ipoDate": "2021-05-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]