[
  {
    "symbol": "OKTA",
    "price": 69.59,
    "beta": 1.112676,
    "volAvg": 2584250,
    "mktCap": 11298632609,
    "lastDiv": 0,
    "range": "44.12-110.94",
    "changes": 0.36,
    "companyName": "Okta, Inc.",
    "currency": "USD",
    "cik": "0001660134",
    "isin": "US6792951054",
    "cusip": "679295105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.okta.com",
    "description": "Okta, Inc. provides identity solutions for enterprises, small and medium-sized businesses, universities, non-profits, and government agencies in the United States and internationally. The company offers Okta Identity Cloud, a platform that offers a suite of products and services, such as Universal Directory, a cloud-based system of record to store and secure user, application, and device profiles for an organization; Single Sign-On that enables users to access applications in the cloud or on-premise from various devices; Adaptive Multi-Factor Authentication provides a layer of security for cloud, mobile, Web applications, and data; Lifecycle Management that enables IT organizations or developers to manage a user's identity throughout its lifecycle; API Access Management that enables organizations to secure APIs; Access Gateway that enables organizations to extend the Okta Identity Cloud from the cloud to their existing on-premise applications; and Advanced Server Access to secure cloud infrastructure. It also provides Auth0 products, including Universal Login that allows customers to provide login experience across different applications and devices; Attack Protection, a suite of security capabilities that protect from malicious traffics; Adaptive Multi-Factor Authentication that minimizes friction to end users; Passwordless authentication enables users to login without a password and supports in various login methods; Machine to Machine provides standards-based authentication and authorization; private Cloud that allows customers to run a dedicated cloud instance of Auth0; and Organizations that enables customers to independent configurations, login experiences, and security options. It offers customer support, training, and professional services. It sells its products directly to customers through sales force and channel partners. The company was formerly known as Saasure, Inc. Okta, Inc. was incorporated in 2009 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Todd  McKinnon",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "5683",
    "phone": "888 722 7871",
    "address": "100 First Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94105",
    "dcfDiff": 21.3981,
    "dcf": 49.9819,
    "image": "https://financialmodelingprep.com/image-stock/OKTA.png",
    "ipoDate": "2017-04-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]