[
  {
    "symbol": "OLED",
    "price": 137.92,
    "beta": 1.394718,
    "volAvg": 390774,
    "mktCap": 6528319072,
    "lastDiv": 1.4,
    "range": "89.41-157.5",
    "changes": -2.85,
    "companyName": "Universal Display Corporation",
    "currency": "USD",
    "cik": "0001005284",
    "isin": "US91347P1057",
    "cusip": "91347P105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductor Equipment & Materials",
    "website": "https://oled.com",
    "description": "Universal Display Corporation engages in the research, development, and commercialization of organic light emitting diode (OLED) technologies and materials for use in display and solid-state lighting applications. It owns, exclusively licenses, or has sole rights to sublicense approximately 5,500 issued and pending patents worldwide. The company supplies its proprietary UniversalPHOLED materials to display and lighting manufacturers, and others. It is also involved in the research, development, and commercialization of other OLED device and manufacturing technologies, including FOLED that are flexible OLEDs for the fabrication of OLEDs on flexible substrates; OVJP, an organic vapor jet printing technology; thin-film encapsulation technology for the packaging of flexible OLEDs and other thin-film devices, as well as for use as a barrier film for plastic substrates; and UniversalP2OLED, which are printable phosphorescent OLEDs. In addition, the company provides technology development and support services, including third-party collaboration and support to third parties for the commercialization of their OLED products. Further, it provides contract research services in the areas of chemical materials synthesis research, development, and commercialization for non-OLED applications. Universal Display Corporation was founded in 1985 and is headquartered in Ewing, New Jersey.",
    "ceo": "Mr. Steven V. Abramson",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "443",
    "phone": "609 671 0980",
    "address": "250 Phillips Boulevard",
    "city": "Ewing",
    "state": "NJ",
    "zip": "08618",
    "dcfDiff": 18.5152,
    "dcf": 113.855,
    "image": "https://financialmodelingprep.com/image-stock/OLED.png",
    "ipoDate": "1996-04-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]