[
  {
    "symbol": "OLK",
    "price": 17.51,
    "beta": 0.827078,
    "volAvg": 106211,
    "mktCap": 2177245930,
    "lastDiv": 0,
    "range": "12.05-26.47",
    "changes": 0.22,
    "companyName": "Olink Holding AB (publ)",
    "currency": "USD",
    "cik": "0001835539",
    "isin": "US6807101000",
    "cusip": "680710100",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Diagnostics & Research",
    "website": "https://www.olink.com",
    "description": "Olink Holding AB (publ) provides various products and services for the academic, government, biopharmaceutical, biotechnology, and other institutions that focuses on life science research. Its products include Olink Explore for cardiovascular and metabolic, oncology, neurology, or inflammation diseases; Olink Target product line; and Olink Focus product line that consists of custom developed solutions for customers that has identified various proteins of interest or a protein signature to focus on. The company's products also comprise Olink Signature Q100, a qPCR readout platform; Olink Analysis services comprising study design and consultation, sample preparation and assay execution, and data processing and QC; and bioinformatics services. In addition, it provides Olink normalized protein expression (NPX) Manager, a purpose-built software that enable users to import data, validate data quality, and normalize for subsequent statistical analysis; and Olink Insight, a cloud platform for data visualization and statistical analysis of NPX data. Olink Holding AB (publ) sells its products and services through its own direct sales force in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company was formerly known as Knilo HoldCo AB and changed its name to Olink Holding AB (publ) in January 2021. The company was founded in 2004 and is headquartered in Uppsala, Sweden. Olink Holding AB (publ) is a subsidiary of Summa Equity Holding AB.",
    "ceo": "Mr. Jon  Heimer",
    "sector": "Healthcare",
    "country": "SE",
    "fullTimeEmployees": "582",
    "phone": "46 1 84 44 39 70",
    "address": "Uppsala Science Park",
    "city": "Uppsala",
    "state": null,
    "zip": "751 83",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/OLK.png",
    "ipoDate": "2021-03-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]