[
  {
    "symbol": "OLN",
    "price": 50.17,
    "beta": 1.438732,
    "volAvg": 1381361,
    "mktCap": 6485726750,
    "lastDiv": 0.8,
    "range": "41.33-64.7",
    "changes": 0.66,
    "companyName": "Olin Corporation",
    "currency": "USD",
    "cik": "0000074303",
    "isin": "US6806652052",
    "cusip": "680665205",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.olin.com",
    "description": "Olin Corporation manufactures and distributes chemical products in the United States, Europe, and internationally. It operates through three segments: Chlor Alkali Products and Vinyls; Epoxy; and Winchester. The Chlor Alkali Products and Vinyls segment offers chlorine and caustic soda, ethylene dichloride and vinyl chloride monomers, methyl chloride, methylene chloride, chloroform, carbon tetrachloride, perchloroethylene, hydrochloric acid, hydrogen, bleach products, potassium hydroxide, chlorinated organics intermediates and solvents, and sodium hypochlorite. The Epoxy segment provides epoxy materials and precursors, including aromatics, such as acetone, bisphenol, cumene, and phenol, as well as allyl chloride, epichlorohydrin, and glycerin used for the manufacturers of polymers, resins and other plastic materials, and water purification; liquid and solid epoxy resins that are used in adhesives, marines, protective coatings, composites, and flooring; and converted epoxy resins and additives for use in electrical laminates, paints and coatings, wind blades, electronics, and construction. The Winchester segment offers sporting ammunition products, including shotshells, small caliber centerfire, and rimfire ammunition products for hunters and recreational shooters, and law enforcement agencies; small caliber military ammunition products for use in infantry and mounted weapons; and industrial products comprising gauge loads and powder-actuated tool loads for maintenance applications in power and concrete industries, and powder-actuated tools in construction industry. The company markets its products through its sales force, as well as directly to various industrial customers, mass merchants, retailers, wholesalers, other distributors, and the U.S. Government and its prime contractors. Olin Corporation was incorporated in 1892 and is based in Clayton, Missouri.",
    "ceo": "Mr. Scott McDougald Sutton",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "7780",
    "phone": "314 480 1400",
    "address": "190 Carondelet Plaza",
    "city": "Clayton",
    "state": "MO",
    "zip": "63105",
    "dcfDiff": 5.20872,
    "dcf": 57.4313,
    "image": "https://financialmodelingprep.com/image-stock/OLN.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]