[
  {
    "symbol": "OMC",
    "price": 96.48,
    "beta": 0.85176,
    "volAvg": 1640358,
    "mktCap": 19249207972,
    "lastDiv": 2.8,
    "range": "61.31-97.22",
    "changes": -0.27,
    "companyName": "Omnicom Group Inc.",
    "currency": "USD",
    "cik": "0000029989",
    "isin": "US6819191064",
    "cusip": "681919106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Advertising Agencies",
    "website": "https://www.omnicomgroup.com",
    "description": "Omnicom Group Inc., together with its subsidiaries, provides advertising, marketing, and corporate communications services. It provides a range of services in the areas of advertising, customer relationship management, public relations, and healthcare. The company's services include advertising, branding, content marketing, corporate social responsibility consulting, crisis communications, custom publishing, data analytics, database management, digital/direct marketing, digital transformation, entertainment marketing, experiential marketing, field marketing, financial/corporate business-to-business advertising, graphic arts/digital imaging, healthcare marketing and communications, and in-store design services. Its services also comprise interactive marketing, investor relations, marketing research, media planning and buying, merchandising and point of sale, mobile marketing, multi-cultural marketing, non-profit marketing, organizational communications, package design, product placement, promotional marketing, public affairs, retail marketing, sales support, search engine marketing, shopper marketing, social media marketing, and sports and event marketing services. It operates in the United States, Canada, Puerto Rico, South America, Mexico, Europe, the Middle East, Africa, Australia, Greater China, India, Japan, Korea, New Zealand, Singapore, and other Asian countries. The company was incorporated in 1944 and is based in New York, New York.",
    "ceo": "Mr. John D. Wren",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "74200",
    "phone": "212 415 3600",
    "address": "280 Park Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10017",
    "dcfDiff": 15.9697,
    "dcf": 101.25,
    "image": "https://financialmodelingprep.com/image-stock/OMC.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]