[
  {
    "symbol": "OMCL",
    "price": 70.73,
    "beta": 0.891901,
    "volAvg": 394940,
    "mktCap": 3188550838,
    "lastDiv": 0,
    "range": "46.11-119.6",
    "changes": 1.59,
    "companyName": "Omnicell, Inc.",
    "currency": "USD",
    "cik": "0000926326",
    "isin": "US68213N1090",
    "cusip": "68213N109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Health Information Services",
    "website": "https://www.omnicell.com",
    "description": "Omnicell, Inc., together with its subsidiaries, provides medication management solutions and adherence tools for healthcare systems and pharmacies the United States and internationally. The company offers point of care automation solutions to improve clinician workflows in patient care areas of the healthcare system; XT Series automated dispensing systems for medications and supplies used in nursing units and other clinical areas of the hospital, as well as specialized automated dispensing systems for operating room; Omnicell Interface Software that offers interface and integration between its medication-use products or supply products, and a healthcare facility's in-house information management systems; and robotic dispensing systems for handling the stocking and retrieval of boxed medications. It also provides central pharmacy automation solutions, including automated storage and retrieval systems, such as XR2 Automated Central Pharmacy System; IV compounding robots and workflow management systems; inventory management software; and controlled substance management systems. In addition, the company provides single-dose automation solutions that fill and label a variety of patient-specific, single-dose medication blister packaging based on incoming prescriptions; fully automated and semi-automated filling equipment for institutional pharmacies to warrant automated packaging of medications; and medication blister card packaging and packaging supplies to enhance medication adherence in non-acute care settings. Further, it offers EnlivenHealth Patient Engagement, a web-based nexus of solutions. The company was formerly known as Omnicell Technologies, Inc. and changed its name to Omnicell, Inc. in 2001. Omnicell, Inc. was incorporated in 1992 and is headquartered in Mountain View, California.",
    "ceo": "Mr. Randall A. Lipps",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "3830",
    "phone": "650 251 6100",
    "address": "590 East Middlefield Road",
    "city": "Mountain View",
    "state": "CA",
    "zip": "94043",
    "dcfDiff": 1.8806,
    "dcf": 59.4206,
    "image": "https://financialmodelingprep.com/image-stock/OMCL.png",
    "ipoDate": "2001-08-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]