[
  {
    "symbol": "OMRNY",
    "price": 59.27,
    "beta": 1.08659,
    "volAvg": 8196,
    "mktCap": 11701498764,
    "lastDiv": 0.73,
    "range": "44.35-66.18",
    "changes": 0.32,
    "companyName": "OMRON Corporation",
    "currency": "USD",
    "cik": "0000800954",
    "isin": "US6821513032",
    "cusip": "682151204",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Electronic Components",
    "website": "https://www.omron.com",
    "description": "OMRON Corporation engages in industrial automation, electronic and mechanical components, social systems, and healthcare businesses worldwide. The company's Industrial Automation Business offers sensors, switches, safety and control components, relays, automation systems, motion/drives, robotics, energy conservation support/environment measure equipment, and power supplies. Its Electronic and Mechanical Components Business provides relays, switches, connectors, sensors, and components/units for amusement equipment. The company's Social Systems, Solutions and Service Business offers terminals and systems, including PV inverters and storage batteries; railway station systems, such as automated ticket gates and ticket vending machines, traffic and road management systems, payment systems, and UPS that protect equipment from unexpected power disruption; a range of solutions comprising software development and maintenance services to support the social infrastructure; and transport management systems and infrastructure monitoring systems. Its Healthcare Business offers blood pressure monitors; nebulizers; electrotherapy TENS devices; digital thermometers; body composition monitors; and other products, such as activity monitors, AEDs, etc. OMRON Corporation has an agreement with JMDC Inc. to jointly develop personalized aggravation and nursing care prevention solutions that support prescription medication treatments and patient lifestyle changes by predicting the risk of the onset of individual patient events. The company was formerly known as OMRON Tateisi Electronics Co. and changed its name to OMRON Corporation in January 1990. OMRON Corporation was founded in 1933 and is headquartered in Kyoto, Japan.",
    "ceo": "Mr. Junta  Tsujinaga",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "29020",
    "phone": "81 75 344 7000",
    "address": "Shiokoji Horikawa",
    "city": "Kyoto",
    "state": null,
    "zip": "600-8530",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/OMRNY.png",
    "ipoDate": "1996-02-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]