[
  {
    "symbol": "OMVJF",
    "price": 41.342,
    "beta": 1.450957,
    "volAvg": 62,
    "mktCap": 13521769613,
    "lastDiv": 3.01,
    "range": "38.43-52.84",
    "changes": -1.458,
    "companyName": "OMV Aktiengesellschaft",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.omv.com",
    "description": "OMV Aktiengesellschaft operates as an energy and chemicals company in Austria, Germany, Romania, Norway, New Zealand, the United Arab Emirates, the rest of Central and Eastern Europe, the rest of Europe, and internationally. The company operates through Exploration & Production, Refining & Marketing, and Chemicals & Materials segments. The Exploration & Production segment engages in the exploration, development, and production of oil and gas in the regions of Central and Eastern Europe, the Middle East and Africa, the North Sea, and the Asia Pacific. The Refining & Marketing segment is involved in the refining and marketing of fuels and other feedstock. It has 3 inland refineries in Europe; approximately 2,100 filling stations in ten European countries; and gas storage facilities in Austria and Germany, as well as a gas-fired power plant in Romania. This segment is also involved in the supply, marketing, and trading of gas in Europe and Turkey. The Chemicals & Materials segment provides advanced and circular polyolefin solutions, base chemicals, and fertilizers, as well as engages in the recycling of plastics. The company was founded in 1956 and is headquartered in Vienna, Austria.",
    "ceo": "Mr. Alfred  Stern",
    "sector": "Energy",
    "country": "AT",
    "fullTimeEmployees": "22194",
    "phone": "43 1 40440 0",
    "address": "Trabrennstrasse 6-8",
    "city": "Vienna",
    "state": null,
    "zip": "1020",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/OMVJF.png",
    "ipoDate": "2007-02-27",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]