[
  {
    "symbol": "ON",
    "price": 91.21,
    "beta": 1.73345,
    "volAvg": 6854703,
    "mktCap": 39391135600,
    "lastDiv": 0,
    "range": "44.76-93.44",
    "changes": -0.66,
    "companyName": "ON Semiconductor Corporation",
    "currency": "USD",
    "cik": "0001097864",
    "isin": "US6821891057",
    "cusip": "682189105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.onsemi.com",
    "description": "ON Semiconductor Corporation provides intelligent sensing and power solutions worldwide. Its intelligent power technologies enable the electrification of the automotive industry that allows for lighter and longer-range electric vehicles, empowers fast-charging systems, and propels sustainable energy for the solar strings, industrial power, and storage systems. The company operates through three segments the Power Solutions Group, the Advanced Solutions Group, and the Intelligent Sensing Group segments. It offers analog, discrete, module, and integrated semiconductor products that perform multiple application functions, including power switching and conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. The company also designs and develops analog, mixed-signal, advanced logic, application specific standard product and ASICs, radio frequency, and integrated power solutions for end-users in end-markets, as well as provides foundry and design services for government customers. In addition, it develops complementary metal oxide semiconductor image sensors, image signal processors, and single photon detectors, including silicon photomultipliers and single photon avalanche diode arrays, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in various end-markets. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Phoenix, Arizona.",
    "ceo": "Mr. Hassane S. El-Khoury",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "31000",
    "phone": "602 244 6600",
    "address": "5005 East McDowell Road",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85008",
    "dcfDiff": 0.773405,
    "dcf": 74.4434,
    "image": "https://financialmodelingprep.com/image-stock/ON.png",
    "ipoDate": "2000-05-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]