[
  {
    "symbol": "ONEXF",
    "price": 54.235,
    "beta": 1.405964,
    "volAvg": 12846,
    "mktCap": 4385615652,
    "lastDiv": 0.3,
    "range": "43.8-56.45",
    "changes": 0.235,
    "companyName": "Onex Corporation",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Asset Management",
    "website": "https://www.onex.com",
    "description": "Onex Corporation is a private equity firm specializing in acquisitions and platform acquisitions. The firm makes investments in buyouts, large- middle market, large-cap, mid-cap, and small-cap market and distressed companies. It also invests in recapitalization, growth capital, corporate carve-outs of subsidiaries and mission-critical supply divisions from multinational corporations, operational restructurings of undervalued businesses, and builds up. The firm seeks to invest in technology, electronics manufacturing services, industrial, aerospace, healthcare, retail, restaurants, industrials products, customer care services, metal services, building products, entertainment, gaming, cabinetry products, commercial vehicles, commercial and investment banking, financial services, commercial and multi-unit residential real estate. It invests in global businesses headquartered in North America, including United States and Canada, or Europe. The firm seeks to invest between $125 million and $1 billion in companies that have minimum revenues of $300 million. It does not consider size if the company is in an industry in which the firm already has presence. The firm seeks to make direct as well as co-investments through managed private equity, real estate and credit funds. It seeks to acquire a control position in its portfolio companies. Onex Corporation was founded in 1984 and is based in Toronto, Canada with additional offices in New York, New York; Englewood Cliffs, New Jersey; Boston, Massachusetts and London, United Kingdom.",
    "ceo": "Mr. Robert M. Le Blanc",
    "sector": "Financial Services",
    "country": "CA",
    "fullTimeEmployees": "597",
    "phone": "416-362-7711",
    "address": "161 Bay Street",
    "city": "Toronto",
    "state": "ON",
    "zip": "M5J 2S1",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ONEXF.png",
    "ipoDate": "2009-02-13",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]