[
  {
    "symbol": "ONTO",
    "price": 114.16,
    "beta": 1.298234,
    "volAvg": 291874,
    "mktCap": 5587618280,
    "lastDiv": 0,
    "range": "56.02-114.94",
    "changes": 1.37,
    "companyName": "Onto Innovation Inc.",
    "currency": "USD",
    "cik": "0000704532",
    "isin": "US6833441057",
    "cusip": "683344105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Semiconductor Equipment & Materials",
    "website": "https://www.ontoinnovation.com",
    "description": "Onto Innovation Inc. engages in the design, development, manufacture, and support of process control tools that performs macro defect inspection and 2D/3D optical metrology, lithography systems, and process control analytical software worldwide. It offers process and yield management solutions, and device packaging and test facilities through standalone systems for macro-defect inspection, packaging lithography, probe card test and analysis, and transparent and opaque thin film measurements; and process control software portfolio that includes solutions for standalone tools, groups of tools, and enterprise-or factory-wide suites. The company also provides spare parts and software licensing services. Its products are used by semiconductor and advanced packaging device manufacturers; silicon wafer; light emitting diode; vertical-cavity surface-emitting laser; micro-electromechanical system; CMOS image sensor; power device; RF filter; data storage; and various industrial and scientific applications. The company was formerly known as Rudolph Technologies, Inc. Onto Innovation Inc. was founded in 1940 and is headquartered in Wilmington, Massachusetts.",
    "ceo": "Mr. Michael P. Plisinski",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1636",
    "phone": "978 253 6200",
    "address": "16 Jonspin Road",
    "city": "Wilmington",
    "state": "MA",
    "zip": "01887",
    "dcfDiff": 4.11804,
    "dcf": 82.238,
    "image": "https://financialmodelingprep.com/image-stock/ONTO.png",
    "ipoDate": "2019-10-28",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]