[
  {
    "symbol": "OPCH",
    "price": 31.29,
    "beta": 1.275453,
    "volAvg": 3119646,
    "mktCap": 5628007140,
    "lastDiv": 0,
    "range": "24.23-35.87",
    "changes": -0.12,
    "companyName": "Option Care Health, Inc.",
    "currency": "USD",
    "cik": "0001014739",
    "isin": "US68404L2016",
    "cusip": "68404L201",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Care Facilities",
    "website": "https://www.optioncarehealth.com",
    "description": "Option Care Health, Inc. offers home and alternate site infusion services in the United States. The company provides anti-infective therapies; home infusion services to treat heart failures; home parenteral nutrition and enteral nutrition support services for numerous acute and chronic conditions, such as stroke, cancer, and gastrointestinal diseases; immunoglobulin infusion therapies for the treatment of immune deficiencies; and treatments for chronic inflammatory disorders, including Crohn's disease, plaque psoriasis, psoriatic arthritis, rheumatoid arthritis, ulcerative colitis, and other chronic inflammatory disorders. It also offers treatments to manage the progression of neurological disorders, such as amyotrophic lateral sclerosis and duchenne muscular dystrophy; infusion therapies for bleeding disorders; therapies that women need to survive and thrive through high-risk pregnancies; and other infusion therapies to treat various conditions, including pain management, chemotherapy, and respiratory medications, as well as nursing services. Option Care Health, Inc. is headquartered in Bannockburn, Illinois.",
    "ceo": "Mr. John C. Rademacher",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "5597",
    "phone": "312 940 2443",
    "address": "3000 Lakeside Drive",
    "city": "Bannockburn",
    "state": "IL",
    "zip": "60015",
    "dcfDiff": 0.0573057,
    "dcf": 28.6973,
    "image": "https://financialmodelingprep.com/image-stock/OPCH.png",
    "ipoDate": "1996-08-15",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]