[
  {
    "symbol": "OPRA",
    "price": 18.18,
    "beta": 0.957606,
    "volAvg": 669833,
    "mktCap": 1633331196,
    "lastDiv": 0.8,
    "range": "3.92-21.75",
    "changes": 0.29,
    "companyName": "Opera Limited",
    "currency": "USD",
    "cik": "0001737450",
    "isin": "US68373M1071",
    "cusip": "68373M107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Content & Information",
    "website": "https://www.opera.com",
    "description": "Opera Limited, together with its subsidiaries, provides mobile and PC web browsers. It operates in two segments, Browser and News, and Other. The company offers mobile browser products, such as Opera Mini, Opera for Android and iOS, Opera GX Mobile, and Opera Touch; PC browsers, including Opera for Computers and Opera GX; and Opera News, an AI-powered personalized news discovery and aggregation service. It also provides browser-based cashback rewards under the Dify brand name; owns GameMaker Studio, a 2D gaming development platform; and GXC, a gaming portal. In addition, the company operates online marketing platforms, including Opera Ads, an online advertising platform; and Opera Ads Manager, designs to create, manage, and report on digital advertising campaigns in one place allowing advertisers to reach customers. It operates in Ireland, Singapore, Russia, and internationally. The company was founded in 1995 and is headquartered in Oslo, Norway. Opera Limited is a subsidiary of Kunlun Tech Limited.",
    "ceo": "Mr. Yahui  Zhou",
    "sector": "Communication Services",
    "country": "NO",
    "fullTimeEmployees": "606",
    "phone": "47 23 69 24 00",
    "address": "Vitaminveien 4",
    "city": "Oslo",
    "state": null,
    "zip": "0485",
    "dcfDiff": 0.452854,
    "dcf": 6.26715,
    "image": "https://financialmodelingprep.com/image-stock/OPRA.png",
    "ipoDate": "2018-07-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]