[
  {
    "symbol": "ORA",
    "price": 79.84,
    "beta": 0.465845,
    "volAvg": 408237,
    "mktCap": 4766919056,
    "lastDiv": 0.48,
    "range": "75.06-101.81",
    "changes": -0.79,
    "companyName": "Ormat Technologies, Inc.",
    "currency": "USD",
    "cik": "0001296445",
    "isin": "US6866881021",
    "cusip": "686688102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Renewable",
    "website": "https://www.ormat.com",
    "description": "Ormat Technologies, Inc. engages in the geothermal and recovered energy power business in the United States, Indonesia, Kenya, Turkey, Chile, Guadeloupe, Guatemala, Ethiopia, New Zealand, Honduras, and internationally. It operates through three segments: Electricity, Product, and Energy Storage. The Electricity segment develops, builds, owns, and operates geothermal, solar photovoltaic, and recovered energy-based power plants; and sells electricity. The Product segment designs, manufactures, and sells equipment for geothermal, recovered energy-based electricity generation, and remote power units, such as fossil fuel powered turbo-generators and heavy duty direct-current generators; and provides services relating to the engineering, procurement, construction, operation, and maintenance of geothermal and recovered energy-based power plants. The Product segment serves contractors; developers, owners, and operators of geothermal power plants; and owners and operators of interstate natural gas pipelines, gas processing plants, and cement plants, as well as companies in other energy-intensive industrial processes. The Energy Storage segment offers energy storage and related services, as well as services relating to the engineering, procurement, construction, operation, and maintenance of energy storage units. Ormat Technologies, Inc. was founded in 1965 and is based in Reno, Nevada.",
    "ceo": "Mr. Doron  Blachar",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "1480",
    "phone": "775 356 9029",
    "address": "6140 Plumas Street",
    "city": "Reno",
    "state": "NV",
    "zip": "89519-6075",
    "dcfDiff": 3.11708,
    "dcf": 94.6071,
    "image": "https://financialmodelingprep.com/image-stock/ORA.png",
    "ipoDate": "2004-11-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]