[
  {
    "symbol": "ORAN",
    "price": 11.47,
    "beta": 0.166283,
    "volAvg": 413470,
    "mktCap": 30504350851,
    "lastDiv": 0.75,
    "range": "8.81-13.08",
    "changes": 0.03,
    "companyName": "Orange S.A.",
    "currency": "USD",
    "cik": "0001038143",
    "isin": "US6840601065",
    "cusip": "684060106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.orange.com",
    "description": "Orange S.A. provides various fixed telephony and mobile telecommunications, data transmission, and other value-added services to customers, businesses, and other telecommunications operators in France and internationally. It operates through France; Spain and Other European Countries; The Africa and Middle East; Enterprise; International Carriers & Shared Services; and Mobile Financial Services segments.  The company offers mobile services, such as voice, SMS, and data; fixed broadband and narrowband services, as well as fixed network business solutions, including voice and data; and convergence packages. It also sells mobile handsets, mobile terminals, broadband equipment, connected devices, and accessories. In addition, the company provides IT and integration services comprising unified communication and collaboration services, such as LAN and telephony, consultancy, integration, and project management; hosting and infrastructure services, including cloud computing; customer relations management and other applications services; security services; and video conferencing, as well as sells related equipment. Further, it offers national and international roaming services; online advertising services; and mobile virtual network operators, network sharing, and mobile financial services, as well as sells equipment to external distributors and brokers. Orange S.A. markets its products and services under the Orange brand. The company was formerly known as France Telecom and changed its name to Orange S.A. in July 2013. Orange S.A. was founded in 1990 and is headquartered in Issy-les-Moulineaux, France.",
    "ceo": "Ms. Christel  Heydemann",
    "sector": "Communication Services",
    "country": "FR",
    "fullTimeEmployees": "136430",
    "phone": "33 1 44 44 22 22",
    "address": "111,  quai  du  président  Roosevelt",
    "city": "Issy-les-Moulineaux",
    "state": null,
    "zip": "92130",
    "dcfDiff": 2.79371,
    "dcf": 13.1937,
    "image": "https://financialmodelingprep.com/image-stock/ORAN.png",
    "ipoDate": "1997-10-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]