[
  {
    "symbol": "ORCL",
    "price": 116.53,
    "beta": 0.992253,
    "volAvg": 10061111,
    "mktCap": 316292714071,
    "lastDiv": 1.6,
    "range": "60.78-127.54",
    "changes": -1.31,
    "companyName": "Oracle Corporation",
    "currency": "USD",
    "cik": "0001341439",
    "isin": "US68389X1054",
    "cusip": "68389X105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.oracle.com",
    "description": "Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Advertising, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database, an enterprise database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database, MySQL HeatWave, Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.",
    "ceo": "Ms. Safra Ada Catz",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "164000",
    "phone": "737 867 1000",
    "address": "2300 Oracle Way",
    "city": "Austin",
    "state": "TX",
    "zip": "78741",
    "dcfDiff": 0.789633,
    "dcf": 89.7796,
    "image": "https://financialmodelingprep.com/image-stock/ORCL.png",
    "ipoDate": "1986-03-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]