[
  {
    "symbol": "ORINY",
    "price": 24.4,
    "beta": 0.47931,
    "volAvg": 1,
    "mktCap": 6849153395,
    "lastDiv": 0.87,
    "range": "20.0-28.05",
    "changes": 0,
    "companyName": "Orion Oyj",
    "currency": "USD",
    "cik": null,
    "isin": "US68628Y1047",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.orion.fi",
    "description": "Orion Oyj develops, manufactures, and markets human and veterinary pharmaceuticals and active pharmaceutical ingredients (APIs) in Finland, Scandinavia, other European countries, North America, and internationally. It provides prescription drugs and self-care products, including Nubeqa for the treatment of prostate cancer; dexdor and Precedex for intensive care sedative; Stalevo and Comtess/Comtan for Parkinson's disease; Simdax for acute decompensated heart failure; and Fareston for breast cancer, as well as Salmeterol/fluticasone Easyhaler, Budesonide/formoterol Easyhaler, Formoterol Easyhaler, Budesonide Easyhaler, Beclomet Easyhaler, and Buventol Easyhaler drugs for the treatment of asthma and chronic obstructive pulmonary disease. The company also offers veterinary drugs comprising Bonqat, Clevor, Domosedan, Domitor, Antisedan, Dexdomitor, Domosedan Gel, Sileo, and Tessie; and APIs for generic and proprietary drugs, as well as provides contract manufacturing services. In addition, it markets and sells veterinary drugs manufactured by other international companies. The company serves various healthcare service providers and professionals, such as specialist and general practitioners, veterinarians, pharmacies, hospitals, healthcare centers, clinics, and laboratories, as well as consumers with pets. Orion Oyj has partnership with Propeller Health to connect the Easyhaler(R) product portfolio for the treatment of asthma and COPD; and a research collaboration and license agreement with Alligator Bioscience AB (publ) to discover and develop new bispecific antibody cancer therapeutics. Orion Oyj was founded in 1917 and is headquartered in Espoo, Finland.",
    "ceo": "Dr. Liisa  Hurme",
    "sector": "Healthcare",
    "country": "FI",
    "fullTimeEmployees": "3564",
    "phone": "358 10 4261",
    "address": "Orionintie 1A",
    "city": "Espoo",
    "state": null,
    "zip": "02200",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ORINY.png",
    "ipoDate": "2014-12-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]