[
  {
    "symbol": "ORKLY",
    "price": 7.18,
    "beta": -0.111877,
    "volAvg": 35212,
    "mktCap": 7159493920,
    "lastDiv": 0.28,
    "range": "6.35-9.05",
    "changes": 0.03,
    "companyName": "Orkla ASA",
    "currency": "USD",
    "cik": null,
    "isin": "US6863311097",
    "cusip": "686331109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Packaged Foods",
    "website": "https://www.orkla.no",
    "description": "Orkla ASA engages in branded consumer goods, and industrial and financial investment businesses. The company offers branded products, including frozen pizza, ketchup, soups, sauces, bread toppings, and ready-to-eat meals through grocery retail trade, as well as the out-of-home, convenience store, and petrol station sectors. It also provides confectionery, biscuit, and snack products; and develops crispbread products, as well as energy snack meals. In addition, the company offers personal care and cleaning products; dietary supplement, sport nutrition, and weight control products; wound care products and first aid equipment; painting tools; basic garments; and professional cleaning products. Further, it operates Gymgrossisten and Bodystore e-commerce portals for health and sports nutrition products; and restaurants. Additionally, the company supplies margarine and butter blends, bread and cake improvers and mixes, yeast, marzipan, and ice cream ingredients; produces and supplies hydro power to the Nordic power market; and develops and sells real estate properties. It offers its food products under the Grandiosa, TORO, Stabburet, Felix, Paulúns, Abba, Kalles, Beauvais, Den Gamle Fabrik, Spilva, Vitana, MTR, and Eastern brands; confectionery and snacks under the KiMs, Nidar, Stratos, Göteborgs Kex, Sætre, OLW, Panda, Laima, Selga, Taffel, Adazu, and Kalev brands; health and sports nutrition under Zalo, Jif, Bliw, Grumme, Blenda, Define, Möller's, Collett, Nutrilett, Maxim, Norgesplaster, and Salvequick brands; and food ingredients under Odense, Mors Hjemmebakte, KronJäst, Bakkedal and NATURLI' brands. It has operations in Norway, Sweden, Denmark, Finland, Iceland, the Baltics, rest of Europe, and internationally. The company is headquartered in Oslo, Norway.",
    "ceo": "Mr. Nils Kloumann Selte",
    "sector": "Consumer Defensive",
    "country": "NO",
    "fullTimeEmployees": "20471",
    "phone": "47 22 54 40 00",
    "address": "Drammensveien 149",
    "city": "Oslo",
    "state": null,
    "zip": "0277",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ORKLY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]