[
  {
    "symbol": "ORLY",
    "price": 937.03,
    "beta": 0.882042,
    "volAvg": 443148,
    "mktCap": 57045355667,
    "lastDiv": 0,
    "range": "624.85-964.58",
    "changes": 1.64,
    "companyName": "O'Reilly Automotive, Inc.",
    "currency": "USD",
    "cik": "0000898173",
    "isin": "US67103H1077",
    "cusip": "67103H107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Specialty Retail",
    "website": "https://www.oreillyauto.com",
    "description": "O'Reilly Automotive, Inc., together with its subsidiaries, operates as a retailer and supplier of automotive aftermarket parts, tools, supplies, equipment, and accessories in the United States. The company provides new and remanufactured automotive hard parts and maintenance items, such as alternators, batteries, brake system components, belts, chassis parts, driveline parts, engine parts, fuel pumps, hoses, starters, temperature control, water pumps, antifreeze, appearance products, engine additives, filters, fluids, lighting products, and oil and wiper blades; and accessories, including floor mats, seat covers, and truck accessories. Its stores offer auto body paint and related materials, automotive tools, and professional service provider service equipment. The company's stores also provide enhanced services and programs comprising used oil, oil filter, and battery recycling; battery, wiper, and bulb replacement; battery diagnostic testing; electrical and module testing; check engine light code extraction; loaner tool program; drum and rotor resurfacing; custom hydraulic hoses; and professional paint shop mixing and related materials. Its stores offer do-it-yourself and professional service provider customers a selection of products for domestic and imported automobiles, vans, and trucks. As of December 31, 2021, the company owned and operated 5,759 stores in the United States, and 25 stores in Mexico. O'Reilly Automotive, Inc. was founded in 1957 and is headquartered in Springfield, Missouri.",
    "ceo": "Mr. Gregory L. Henslee",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "86774",
    "phone": "417 862 6708",
    "address": "233 South Patterson Avenue",
    "city": "Springfield",
    "state": "MO",
    "zip": "65802-2298",
    "dcfDiff": 80.4498,
    "dcf": 851.62,
    "image": "https://financialmodelingprep.com/image-stock/ORLY.png",
    "ipoDate": "1993-04-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]