[
  {
    "symbol": "OROVY",
    "price": 66.08,
    "beta": 2.012643,
    "volAvg": 1080,
    "mktCap": 8727516000,
    "lastDiv": 39.95,
    "range": "60.79-175.0",
    "changes": 1.51,
    "companyName": "Orient Overseas (International) Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Marine Shipping",
    "website": "https://www.ooilgroup.com",
    "description": "Orient Overseas (International) Limited, an investment holding company, provides container transport and logistics services in Asia, Europe, Australia, North America, and internationally. The company offers supply-chain management and distribution services; and containerised shipping services in various trade lanes comprising Trans-Pacific, Trans-Atlantic, Asia/Europe, Asia/Australia, and Intra-Asia trades. It is also involved in equipment owning and leasing, container depot and warehousing, portfolio investment, terminal operating, ship owning, cargo consolidation and forwarding, liner and freight agency, property owning, and ship management businesses; providing corporate and trucking services; and operating vessels. In addition, the company offers AI and blockchain digital data on network applications, and platform design services, as well as technology and consulting services. The company is based in Wan Chai, Hong Kong. Orient Overseas (International) Limited is a subsidiary of Faulkner Global Holdings Limited.",
    "ceo": "Mr. Xiaowen  Huang",
    "sector": "Industrials",
    "country": "HK",
    "fullTimeEmployees": "11188",
    "phone": "852 2833 3888",
    "address": "Harbour Centre",
    "city": "Wan Chai",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/OROVY.png",
    "ipoDate": "2009-10-26",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]