[
  {
    "symbol": "OSIS",
    "price": 117.6,
    "beta": 0.933802,
    "volAvg": 124396,
    "mktCap": 1967201040,
    "lastDiv": 0,
    "range": "69.31-127.07",
    "changes": -0.95,
    "companyName": "OSI Systems, Inc.",
    "currency": "USD",
    "cik": "0001039065",
    "isin": "US6710441055",
    "cusip": "671044105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Electronic Components",
    "website": "https://www.osi-systems.com",
    "description": "OSI Systems, Inc. designs and manufactures electronic systems and components worldwide. It operates in three segments: Security, Healthcare, and Optoelectronics and Manufacturing. The Security segment offers baggage and parcel inspection, cargo and vehicle inspection, hold baggage and people screening, radiation detection, and explosive and narcotics trace detection systems under the Rapiscan Systems, AS&E, and Gatekeeper names. It also provides site design, installation, training, and technical support services; and security screening solutions under the S2 name. The Healthcare segment offers patient monitoring and diagnostic cardiology systems, and related supplies and accessories under the Spacelabs name for use in critical care, emergency, and perioperative areas within hospitals, physicians' offices, medical clinics, and ambulatory surgery centers. The Optoelectronics and Manufacturing segment provides optoelectronic devices under the OSI Optoelectronics, OSI LaserDiode, OSI Laserscan, Semicoa, and Advanced Photonix names for the aerospace and defense, avionics, medical imaging and diagnostics, biochemistry analysis, pharmaceutical, nanotechnology, telecommunications, construction, and homeland security markets. It also offers electronics manufacturing services to original equipment manufacturers and end users for medical, automotive, defense, aerospace, industrial, and consumer applications under the OSI Electronics, APlus Products, Altaflex, and PFC names; and LCD displays for medical, industrial, and consumer electronics applications, as well as flex circuits for OEM customers. This segment offers laser-based remote sensing devices to detect and classify vehicles in toll and traffic management systems under the OSI Laserscan and Autosense names; and solid-state laser products for aerospace, defense, telecommunication, and medical applications under the OSI LaserDiode name. The company was incorporated in 1987 and is headquartered in Hawthorne, California.",
    "ceo": "Mr. Deepak  Chopra",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "6298",
    "phone": "310 978 0516",
    "address": "12525 Chadron Avenue",
    "city": "Hawthorne",
    "state": "CA",
    "zip": "90250",
    "dcfDiff": 1.436,
    "dcf": 92.804,
    "image": "https://financialmodelingprep.com/image-stock/OSIS.png",
    "ipoDate": "1997-10-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]