[
  {
    "symbol": "OSK",
    "price": 82.98,
    "beta": 1.379225,
    "volAvg": 539890,
    "mktCap": 5419722528,
    "lastDiv": 1.64,
    "range": "69.3-106.66",
    "changes": 0.5,
    "companyName": "Oshkosh Corporation",
    "currency": "USD",
    "cik": "0000775158",
    "isin": "US6882392011",
    "cusip": "688239201",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Farm & Heavy Construction Machinery",
    "website": "https://www.oshkoshcorp.com",
    "description": "Oshkosh Corporation designs, manufactures, and markets specialty vehicles and vehicle bodies worldwide. The company's Access Equipment segment provides aerial work platforms and telehandlers for use in various construction, industrial, institutional, and general maintenance applications. This segment also offers rental fleet loans and leases, and floor plan and retail financing through third-party funding arrangements; towing and recovery equipment; carriers and wreckers; equipment installation services; and chassis and service parts sales. Its Defense segment provides heavy, medium, and light tactical wheeled vehicles and related services for the department of defense. The company's Fire & Emergency segment offers custom and commercial firefighting vehicles and equipment; and commercial fire apparatus and emergency vehicles, such as pumpers, aerial platform, ladder and tiller trucks, tankers, rescue vehicles, wild land rough terrain response vehicles, mobile command and control centers, bomb squad vehicles, hazardous materials control vehicles, and other emergency response vehicles. This segment also provides aircraft rescue and firefighting, snow removal, and broadcast vehicles, as well as command trucks, and military simulator shelters and trailers. Its Commercial segment offers front-and rear-discharge concrete mixers for the concrete ready-mix industry; refuse collection vehicles and related components to commercial and municipal waste haulers; and field service vehicles and truck-mounted cranes for the construction, equipment dealer, building supply, utility, tire service, railroad, and mining industries. Oshkosh Corporation provides its products through direct sales representatives, dealers, and distributors. The company was formerly known as Oshkosh Truck Corporation and changed its name to Oshkosh Corporation in February 2008. Oshkosh Corporation was founded in 1917 and is headquartered in Oshkosh, Wisconsin.",
    "ceo": "Mr. John C. Pfeifer",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "15000",
    "phone": "920 502 3400",
    "address": "1917 Four Wheel Drive",
    "city": "Oshkosh",
    "state": "WI",
    "zip": "54902",
    "dcfDiff": 10.389,
    "dcf": 112.339,
    "image": "https://financialmodelingprep.com/image-stock/OSK.png",
    "ipoDate": "1985-10-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]