[
  {
    "symbol": "OTEX",
    "price": 40.77,
    "beta": 1.072887,
    "volAvg": 506004,
    "mktCap": 11038395960,
    "lastDiv": 0.97,
    "range": "24.91-43.25",
    "changes": 0.21,
    "companyName": "Open Text Corporation",
    "currency": "USD",
    "cik": "0001002638",
    "isin": "CA6837151068",
    "cusip": "683715106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.opentext.com",
    "description": "Open Text Corporation engages in the designs, develops, markets, and sells information management software and solutions. It offers content services; business network that manages data within the organization and outside the firewall; security and protection solutions for defending against cyber threats, and preparing for business continuity and response in the event of a breach; digital investigation and forensic security solutions; OpenText security solutions to address information cyber resilience needs; Carbonite and Webroot products; and OpenText Information Management software platform. The company also provides eDiscovery platform that provides forensics and unstructured data analytics; OpenText Developer Cloud; key developer API services; AI and analytics that leverages structured or unstructured data; digital process automation solutions, which enables organizations to transform into digital data-driven businesses; and OpenText Digital Experience platform. In addition, it offers customer support programs, including access to software upgrades, a knowledge base, discussions, product information, and an online mechanism to post and review trouble tickets; and consulting and learning services relating to the implementation, training, and integration of its licensed product offerings, as well as cloud services. The company serves organizations, enterprise and mid-market companies, public sector agencies, small and medium-sized businesses, and direct consumers in Canada, the United States, the United Kingdom, Germany, rest of Europe, the Middle East, Africa, and internationally. It has strategic partnerships with SAP SE, Google Cloud, Amazon AWS, Microsoft Corporation, Oracle Corporation, Salesforce.com Corporation, Accenture plc, ATOS, Capgemini Technology Services SAS, Cognizant Technology Solutions U.S. Corp., Deloitte Consulting LLP, and Tata Consultancy Services. Open Text Corporation was incorporated in 1991 and is headquartered in Waterloo, Canada.",
    "ceo": "Mr. Mark J. Barrenechea",
    "sector": "Technology",
    "country": "CA",
    "fullTimeEmployees": "25550",
    "phone": "14169560322",
    "address": "275 Frank Tompa Drive",
    "city": "Waterloo",
    "state": "ON",
    "zip": "N2L 0A1",
    "dcfDiff": 0.297256,
    "dcf": 34.2573,
    "image": "https://financialmodelingprep.com/image-stock/OTEX.png",
    "ipoDate": "1996-01-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]