[
  {
    "symbol": "OTTR",
    "price": 76.22,
    "beta": 0.509859,
    "volAvg": 180840,
    "mktCap": 3179181932,
    "lastDiv": 1.75,
    "range": "52.6-82.46",
    "changes": 0.66,
    "companyName": "Otter Tail Corporation",
    "currency": "USD",
    "cik": "0001466593",
    "isin": "US6896481032",
    "cusip": "689648103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Utilities—Diversified",
    "website": "https://www.ottertail.com",
    "description": "Otter Tail Corporation, together with its subsidiaries, engages in electric utility, manufacturing, and plastic pipe businesses in the United States. The company's Electric segment produces, transmits, distributes, and sells electric energy in Minnesota, North Dakota, and South Dakota; and operates as a participant in the Midcontinent Independent System Operator, Inc. markets. This segment generates electricity through coal, wind and hydro, and natural gas. It serves approximately 133,000 residential, industrial, and other commercial customers. Its Manufacturing segment engages in the contract machining, metal parts stamping, fabrication and painting, and production of plastic thermoformed horticultural containers, life science and industrial packaging, and material handling components, and extruded raw material stock for recreational vehicle, agricultural, construction, lawn and garden, and industrial and energy equipment industries. It also manufactures clamshell packing, blister packs, returnable pallets, and handling trays for shipping and storing odd-shaped or difficult-to-handle parts for customers in the horticulture, medical and life sciences, industrial, recreation, and electronics industries. The company's Plastics segment manufactures polyvinyl chloride pipes for municipal water, rural water, wastewater, storm drainage and water reclamation system, and other uses. This segment markets its products to wholesalers and distributors through independent sales representatives, company salespersons, and customer service representatives. The company was formerly known as Otter Tail Power Company and changed its name to Otter Tail Corporation in 2001. Otter Tail Corporation was founded in 1907 and is headquartered in Fergus Falls, Minnesota.",
    "ceo": "Mr. Charles S. MacFarlane",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "2422",
    "phone": "866 410 8780",
    "address": "215 South Cascade Street",
    "city": "Fergus Falls",
    "state": "MN",
    "zip": "56538-0496",
    "dcfDiff": 5.98243,
    "dcf": 56.6976,
    "image": "https://financialmodelingprep.com/image-stock/OTTR.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]