[
  {
    "symbol": "OVCHY",
    "price": 18.32,
    "beta": 0.675095,
    "volAvg": 16530,
    "mktCap": 41171635200,
    "lastDiv": 0.99,
    "range": "15.8-19.96",
    "changes": 0.4,
    "companyName": "Oversea-Chinese Banking Corporation Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US6903331097",
    "cusip": "690333109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.ocbc.com",
    "description": "Oversea-Chinese Banking Corporation Limited provides financial services in Singapore, Malaysia, Indonesia, Greater China, rest of the Asia Pacific, and internationally. The company's Global Consumer/Private Banking segment provides products and services to individual customers, including checking accounts, and savings and fixed deposits; housing and other personal loans; credit cards; wealth management products consisting of unit trusts, banc assurance products, and structured deposits; and brokerage services. This segment also offers investment advice and portfolio management, estate and trust planning, and wealth structuring services for high-net-worth individuals. Its Global Wholesale Banking segment provides project financing, short-term credit, working capital, and trade financing; customized and structured equity-linked financing products; cash management and custodian services; capital market solutions; corporate finance and advisory banking services; and treasury products. This segment serves corporates, public sector, and small and medium enterprises. The company's Global Treasury and Markets segment is involved in the foreign exchange activities, money market operations, and fixed income and derivatives trading, as well as provision of structured treasury products and financial solutions. Its Insurance segment provides fund management services, and life and general insurance products. The company's Others segment is involved in property and investment holding activities. The company operates approximately 430 branches and representative offices in 19 countries and regions. Oversea-Chinese Banking Corporation Limited was founded in 1912 and is headquartered in Singapore.",
    "ceo": "Ms. Pik Kuen  Wong",
    "sector": "Financial Services",
    "country": "SG",
    "fullTimeEmployees": "31604",
    "phone": "65 6363 3333",
    "address": "No. 10-00 OCBC Centre East",
    "city": "Singapore",
    "state": null,
    "zip": "049514",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/OVCHY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]