[
  {
    "symbol": "OZK",
    "price": 39.62,
    "beta": 1.355985,
    "volAvg": 1869891,
    "mktCap": 4559469600,
    "lastDiv": 1.4,
    "range": "30.72-49.52",
    "changes": 0.37,
    "companyName": "Bank OZK",
    "currency": "USD",
    "cik": "0001569650",
    "isin": "US06417N1037",
    "cusip": "06417N103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.ozk.com",
    "description": "Bank OZK provides various retail and commercial banking services. It accepts various deposit products, including non-interest-bearing checking, interest bearing transaction, business sweep, savings, money market, individual retirement, and other accounts, as well as time deposits. The company also offers real estate, consumer and business purpose, indirect recreational vehicle and marine, commercial and industrial, government guaranteed, agricultural, small business, homebuilder, and affordable housing loans; business aviation and subscription financing services; and mortgage and other lending products. In addition, it provides trust and wealth services, such as personal, custodial, investment management, and retirement accounts, as well as corporate trust services comprising trustee, paying and registered transfer agent, and other incidental services. Further, the company offers treasury management services comprising automated clearing house, wire transfer, transaction reporting, wholesale lockbox, remote deposit capture, automated credit line transfer, reconciliation, positive pay, and merchant and commercial card services, as well as zero balance and investment sweep accounts. Additionally, it provides ATMs; telephone, online, and mobile banking services; debit and credit cards; safe deposit boxes; and other products and services, as well as processes merchant debit and credit card transactions. As of December 31, 2021, it operated approximately 240 offices in Arkansas, Georgia, Florida, North Carolina, Texas, Carolina, California, New York, and Mississippi. The company was formerly known as Bank of the Ozarks and changed its name to Bank OZK in July 2018. Bank OZK was founded in 1903 and is headquartered in Little Rock, Arkansas.",
    "ceo": "Mr. George G. Gleason II",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2646",
    "phone": "501 978 2265",
    "address": "18000 Cantrell Road",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72223",
    "dcfDiff": 17.2852,
    "dcf": 62.1052,
    "image": "https://financialmodelingprep.com/image-stock/OZK.png",
    "ipoDate": "1997-07-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]