[
  {
    "symbol": "PACB",
    "price": 13,
    "beta": 1.668309,
    "volAvg": 3778901,
    "mktCap": 3248583104,
    "lastDiv": 0,
    "range": "3.89-14.3",
    "changes": 0.59,
    "companyName": "Pacific Biosciences of California, Inc.",
    "currency": "USD",
    "cik": "0001299130",
    "isin": "US69404D1081",
    "cusip": "69404D108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Devices",
    "website": "https://www.pacb.com",
    "description": "Pacific Biosciences of California, Inc. designs, develops, and manufactures sequencing systems to resolve genetically complex problems. The company provides PacBio's Systems, which conduct, monitor, and analyse biochemical sequencing reactions; consumable products, including single molecule real-time (SMRT) cells; and various reagent kits designed for specific workflow, such as template preparation kit to convert DNA into SMRTbell double-stranded DNA library formats, including molecular biology reagents, such as ligase, buffers, and exonucleases. It also offers binding kits, such as modified DNA polymerase used to bind SMRTbell libraries to the polymerase in preparation for sequencing; and sequencing kits comprise reagents required for on-instrument, real-time sequencing, including the phospholinked nucleotides. The company serves research institutions; commercial laboratories; genome centers; public health labs, hospitals and clinical research institutes, contract research organizations, and academic institutions; pharmaceutical companies; and agricultural companies. It markets its products through a direct sales force in North America and Europe, as well as through distribution partners in Asia, Europe, the Middle East, Africa, and Latin America. Pacific Biosciences of California, Inc. has a development and commercialization agreement with Invitae Corporation. The company was formerly known as Nanofluidics, Inc. and changed its name to Pacific Biosciences of California, Inc. in 2005. Pacific Biosciences of California, Inc. was incorporated in 2000 and is headquartered in Menlo Park, California.",
    "ceo": "Mr. Christian O.  Henry M.B.A.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "769",
    "phone": "650 521 8000",
    "address": "1305 O’Brien Drive",
    "city": "Menlo Park",
    "state": "CA",
    "zip": "94025",
    "dcfDiff": 0.876951,
    "dcf": 12.657,
    "image": "https://financialmodelingprep.com/image-stock/PACB.png",
    "ipoDate": "2010-10-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]