[
  {
    "symbol": "PAG",
    "price": 165.53,
    "beta": 1.221126,
    "volAvg": 307627,
    "mktCap": 11421603106,
    "lastDiv": 2.64,
    "range": "94.49-165.94",
    "changes": 2.39,
    "companyName": "Penske Automotive Group, Inc.",
    "currency": "USD",
    "cik": "0001019849",
    "isin": "US70959W1036",
    "cusip": "70959W103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Auto & Truck Dealerships",
    "website": "https://www.penskeautomotive.com",
    "description": "Penske Automotive Group, Inc., a diversified transportation services company, operates automotive and commercial truck dealerships. The company operates through four segments: Retail Automotive, Retail Commercial Truck, Other, and Non-Automotive Investments. It operates dealerships under franchise agreements with various automotive manufacturers and distributors. The company engages in the sale of new and used motor vehicles, and related products and services comprise vehicle and collision repair services, as well as placement of finance and lease contracts, third-party insurance products, and other aftermarket products; and wholesale of parts. It also operates a heavy and medium duty truck dealership, which offers Freightliner and Western Star branded trucks, as well as a range of used trucks, and maintenance and repair services. In addition, it imports and distributes Western Star heavy-duty trucks, MAN heavy and medium duty trucks, buses, and Dennis Eagle refuse collection vehicles with associated parts in Australia, New Zealand, and portions of the Pacific. Further, the company distributes diesel and gas engines, and power systems. The company operates 320 retail automotive franchises, including 146 franchises located in the United States and 174 franchises located outside of the United States; 23 CarShop used vehicle dealerships in the United States and the United Kingdom; and 37 commercial truck dealerships in Texas, Oklahoma, Tennessee, Georgia, Utah, Idaho, Kansas, Missouri, and Oregon, as well as Canada. Penske Automotive Group, Inc. was incorporated in 1990 and is headquartered in Bloomfield Hills, Michigan.",
    "ceo": "Mr. Roger S. Penske Sr.",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "27000",
    "phone": "248 648 2500",
    "address": "2555 Telegraph Road",
    "city": "Bloomfield Hills",
    "state": "MI",
    "zip": "48302-0954",
    "dcfDiff": 0.612757,
    "dcf": 125.303,
    "image": "https://financialmodelingprep.com/image-stock/PAG.png",
    "ipoDate": "1996-10-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]