[
  {
    "symbol": "PAGP",
    "price": 14.53,
    "beta": 1.591901,
    "volAvg": 2635387,
    "mktCap": 3501758987,
    "lastDiv": 1.07,
    "range": "9.39-14.66",
    "changes": 0.13,
    "companyName": "Plains GP Holdings, L.P.",
    "currency": "USD",
    "cik": "0001581990",
    "isin": "US72651A2078",
    "cusip": "72651A207",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.plainsallamerican.com",
    "description": "Plains GP Holdings, L.P., through its subsidiary, Plains All American Pipeline, L.P., owns and operates midstream energy infrastructure in the United States and Canada. The company operates in two segments, Crude Oil and Natural Gas Liquids (NGLs). The company engages in the transportation of crude oil and NGLs on pipelines, gathering systems, and trucks. As of December 31, 2021, this segment owned and leased assets comprising 18,300 miles of crude oil and NGL pipelines and gathering systems; 38 million barrels of above-ground tank capacity; and 1,275 trailers. It engages in the provision of storage, terminalling, and throughput services primarily for crude oil, NGLs, and natural gas; NGL fractionation and isomerization services; and natural gas and condensate processing services. As of December 31, 2021, this segment owned and operated approximately 74 million barrels of crude oil storage capacity; 28 million barrels of NGL storage capacity; four natural gas processing plants; a condensate processing facility; nine fractionation plants; 16 NGL rail terminals; four marine facilities; and 110 miles of pipelines. As of December 31, 2021, this segment owned 15 million barrels of crude oil and 2 NGL linefill; 3 million barrels of crude oil and 1 NGL linefill in pipelines owned by third parties and other inventory; 640 trucks and 1,275 trailers; and 3,900 NGL railcars. The company offers logistics services to producers, refiners, and other customers. PAA GP Holdings LLC operates as a general partner of the company. Plains GP Holdings, L.P. was incorporated in 2013 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Wilfred C.W. Chiang",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "5000",
    "phone": "713 646 4100",
    "address": "333 Clay Street",
    "city": "Houston",
    "state": "TX",
    "zip": "77002",
    "dcfDiff": 0.585682,
    "dcf": 14.1257,
    "image": "https://financialmodelingprep.com/image-stock/PAGP.png",
    "ipoDate": "2013-10-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]