[
  {
    "symbol": "PAGS",
    "price": 9.34,
    "beta": 1.608802,
    "volAvg": 5187201,
    "mktCap": 3028746853,
    "lastDiv": 0,
    "range": "7.51-19.49",
    "changes": -0.12,
    "companyName": "PagSeguro Digital Ltd.",
    "currency": "USD",
    "cik": "0001712807",
    "isin": "KYG687071012",
    "cusip": "G68707101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://pagseguro.uol.com.br",
    "description": "PagSeguro Digital Ltd., together with its subsidiaries, provides financial technology solutions and services for consumers, individual entrepreneurs, micro-merchants, and small and medium-sized companies in Brazil and internationally. The company's products and services include PagSeguro Ecosystem, a digital ecosystem that operates as a closed loop where its clients are able to address their primary day to day financial needs, including receiving and spending funds, and managing and growing their businesses; PagBank digital account, which offers banking services through the PagBank mobile app, as well as centralizes various cash-in options, functionalities, services, and cash-out options in a single ecosystem; and PlugPag, a tool for medium-sized and larger merchants that enables them to connect their point of sale (POS) device directly to their enterprise resource planning software or sales automation system through Bluetooth. It also offers cash-in solutions; online and in-person payment tools; and online gaming and cross-border digital services, as well as issues prepaid, credit, and cash cards. In addition, the company provides functionalities, and value-added services and features, such as purchase protection mechanisms, antifraud platform, account and business management tools, and POS app; and operates an online platform that facilitates peer-to-peer lending. Further, it is involved in processing of back-office solutions, including sales reconciliation, and gateway solutions and services, as well as the capture of credit cards with acquirers and sub acquirers. The company was founded in 2006 and is headquartered in São Paulo, Brazil.",
    "ceo": "Mr. Alexandre  Magnani",
    "sector": "Technology",
    "country": "BR",
    "fullTimeEmployees": "6751",
    "phone": "55 11 3914 9524",
    "address": "Avenida Brigadeiro Faria Lima, 1384",
    "city": "São Paulo",
    "state": "SP",
    "zip": "01451-001",
    "dcfDiff": 18.5039,
    "dcf": 28.9439,
    "image": "https://financialmodelingprep.com/image-stock/PAGS.png",
    "ipoDate": "2018-01-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]