[
  {
    "symbol": "PAM",
    "price": 41.74,
    "beta": 1.106506,
    "volAvg": 165140,
    "mktCap": 4612770797,
    "lastDiv": 0.242,
    "range": "19.25-44.3",
    "changes": -0.06,
    "companyName": "Pampa Energía S.A.",
    "currency": "USD",
    "cik": "0001469395",
    "isin": "US6976602077",
    "cusip": "697660207",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Independent Power Producers",
    "website": "https://www.pampaenergia.com",
    "description": "Pampa Energía S.A., an integrated power company, engages in the generation and transmission of electricity in Argentina. The company operates through Electricity Generation, Oil and Gas, Petrochemicals, and Holding and Other Business segments. It generates electricity through combined thermal generation plants, open-cycle gas turbines, and hydroelectric power generation systems, as well as through a wind farm. The company has an installed electricity generation capacity of approximately 4,970 megawatts; and 21,414 kilometers of high voltage electricity transmission network in Argentina. It is also involved in the exploration and production of oil and gas. In addition, the company offers petrochemicals, such as styrene, synthetic rubber, and polystyrene. As of December 31, 2020, it had approximately 12.625 thousands of barrels of oil and LNG, as well as 24.537 millions of cubic meters of natural gas; owned a refinery with an installed capacity of approximately 25.8 thousand barrels per day; and operated a network of 92 gas stations. The company was formerly known as Pampa Holding S.A. and changed its name to Pampa Energía S.A. in September 2008. Pampa Energía S.A. was incorporated in 1945 and is based in Buenos Aires, Argentina.",
    "ceo": "Mr. Gustavo  Mariani CFA",
    "sector": "Utilities",
    "country": "AR",
    "fullTimeEmployees": null,
    "phone": "54 11 4344 6000",
    "address": "MaipU 1",
    "city": "Buenos Aires",
    "state": null,
    "zip": "C1084ABA",
    "dcfDiff": 5.80271,
    "dcf": 27.9573,
    "image": "https://financialmodelingprep.com/image-stock/PAM.png",
    "ipoDate": "2009-10-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]