[
  {
    "symbol": "PARA",
    "price": 15.74,
    "beta": 1.675,
    "volAvg": 15105059,
    "mktCap": 10356321675,
    "lastDiv": 0.2,
    "range": "13.8-27.49",
    "changes": -0.14,
    "companyName": "Paramount Global",
    "currency": "USD",
    "cik": "0000813828",
    "isin": "US92556H2067",
    "cusip": "92556H206",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Entertainment",
    "website": "https://www.paramount.com",
    "description": "Paramount Global operates as a media and entertainment company worldwide. The company distributes a schedule of news and public affairs broadcasts, and sports and entertainment programming; acquires or develops, and schedules programming on the CBS Television Network that includes primetime comedies and dramas, reality, specials, kids' programs, daytime dramas, game shows, and late night programs; produces or distributes talk shows, court shows, game shows, and newsmagazines; owns and operates 29 broadcast television stations; and operates CBS Sports Network, a 24-hour cable channel that provides sports and related content, as well as streaming and cable subscription services. It also operates Paramount+, a digital subscription video on-demand and live streaming services; and creates and acquires programming for distribution and viewing on various media platforms, including subscription cable networks, subscription streaming, and premium and basic cable networks. In addition, the company develops, produces, finances, acquires, and distributes films. Paramount Global was formerly known as ViacomCBS Inc. and changed its name to Paramount Global in February 2022. The company was incorporated in 1986 and is headquartered in New York, New York. Paramount Global operates as a subsidiary of National Amusements, Inc.",
    "ceo": "Mr. Robert Marc Bakish",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "24500",
    "phone": "212 258 6000",
    "address": "1515 Broadway",
    "city": "New York",
    "state": "NY",
    "zip": "10036",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/PARA.png",
    "ipoDate": "2005-12-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]