[
  {
    "symbol": "PATH",
    "price": 17.16,
    "beta": 0.68782,
    "volAvg": 9660751,
    "mktCap": 9629539611,
    "lastDiv": 0,
    "range": "10.396-22.19",
    "changes": 0.25,
    "companyName": "UiPath Inc.",
    "currency": "USD",
    "cik": "0001734722",
    "isin": "US90364P1057",
    "cusip": "90364P105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.uipath.com",
    "description": "UiPath Inc. provides an end-to-end automation platform that offers a range of robotic process automation (RPA) solutions primarily in the United States, Romania, and Japan. The company offers a suite of interrelated software to build, manage, run, engage, measure, and govern automation within the organization. Its platform combines artificial intelligence with desktop recording, back-end mining of both human activity and system logs, and intuitive visualization tools, which enables users to discover, analyze, and identify processes to automate in a centralized portal; offers low-code development environments that allows users in an organization to create attended and unattended automations without any prior knowledge of coding; deploys robots in highly immersive attended experiences or in standalone, unattended modes behind the scenes, and can leverage native connectors built for commonly used line-of-business applications; offers centralized tools designed to manage, test, and deploy automations and ML models across the enterprise; allows customers to manage long running processes that orchestrate work between robots and humans; and enable users to track, measure, and forecast the performance of automation in their enterprise and help businesses ensure compliance with business standards. In addition, the company provides maintenance and support for its software, as well as professional services, such as training and implementation services to facilitate the adoption of its platform. It serves banking, healthcare, financial services, and government entities. UiPath Inc. was founded in 2005 and is headquartered in New York, New York.",
    "ceo": "Mr. Daniel Solomon Dines",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3833",
    "phone": "844 432 0455",
    "address": "452 5th Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10018",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/PATH.png",
    "ipoDate": "2021-04-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]