[
  {
    "symbol": "PB",
    "price": 56.47,
    "beta": 0.97676,
    "volAvg": 754887,
    "mktCap": 5323980306,
    "lastDiv": 2.2,
    "range": "55.12-78.76",
    "changes": -0.51,
    "companyName": "Prosperity Bancshares, Inc.",
    "currency": "USD",
    "cik": "0001068851",
    "isin": "US7436061052",
    "cusip": "743606105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.prosperitybankusa.com",
    "description": "Prosperity Bancshares, Inc. operates as bank holding company for the Prosperity Bank that provides financial products and services to businesses and consumers. It accepts various deposit products, such as demand, savings, money market, and time accounts, as well as and certificates of deposit. The company also offers 1-4 family residential mortgage, commercial real estate and multifamily residential, commercial and industrial, agricultural, and non-real estate agricultural loans, as well as construction, land development, and other land loans; consumer loans, including automobile, recreational vehicle, boat, home improvement, personal, and deposit account collateralized loans; and consumer durables and home equity loans, as well as loans for working capital, business expansion, and purchase of equipment and machinery. In addition, it provides internet banking, mobile banking, trust and wealth management, retail brokerage, mortgage services, and treasury management, as well as debit and credit cards. As of December 31, 2021, the company operated 273 full-service banking locations comprising 65 in the Houston area, including The Woodlands; 30 in the South Texas area including Corpus Christi and Victoria; 63 in the Dallas/Fort Worth, Texas area; 22 in the East Texas area; 29 in the Central Texas area, including Austin and San Antonio; 34 in the West Texas area, including Lubbock, Midland-Odessa and Abilene; 16 in the Bryan/College Station area; 6 in the Central Oklahoma area; and 8 in the Tulsa, Oklahoma area doing business as LegacyTexas Bank. Prosperity Bancshares, Inc. was founded in 1983 and is based in Houston, Texas.",
    "ceo": "Mr. David E. Zalman",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3651",
    "phone": "281 269 7199",
    "address": "Prosperity Bank Plaza",
    "city": "Houston",
    "state": "TX",
    "zip": "77027",
    "dcfDiff": 27.1387,
    "dcf": 101.779,
    "image": "https://financialmodelingprep.com/image-stock/PB.png",
    "ipoDate": "1998-11-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]