[
  {
    "symbol": "PBA",
    "price": 30.7,
    "beta": 1.560365,
    "volAvg": 716167,
    "mktCap": 16896788800,
    "lastDiv": 2.02,
    "range": "29.59-38.29",
    "changes": 0.08,
    "companyName": "Pembina Pipeline Corporation",
    "currency": "USD",
    "cik": "0001546066",
    "isin": "CA7063271034",
    "cusip": "706327103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.pembina.com",
    "description": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 105 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
    "ceo": "Mr. J. Scott Burrows",
    "sector": "Energy",
    "country": "CA",
    "fullTimeEmployees": "2349",
    "phone": "14032317500",
    "address": "585 - 8th Avenue South West",
    "city": "Calgary",
    "state": "AB",
    "zip": "T2P 1G1",
    "dcfDiff": 0.711819,
    "dcf": 34.8782,
    "image": "https://financialmodelingprep.com/image-stock/PBA.png",
    "ipoDate": "2010-10-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]