[
  {
    "symbol": "PBH",
    "price": 57.92,
    "beta": 0.554225,
    "volAvg": 227422,
    "mktCap": 2878195392,
    "lastDiv": 0.475,
    "range": "48.51-67.45",
    "changes": -0.23,
    "companyName": "Prestige Consumer Healthcare Inc.",
    "currency": "USD",
    "cik": "0001295947",
    "isin": "US74112D1019",
    "cusip": "74112D101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Distribution",
    "website": "https://www.prestigebrands.com",
    "description": "Prestige Consumer Healthcare Inc., together with its subsidiaries, develops, manufactures, markets, distributes, and sells over-the-counter (OTC) health and personal care products in the United States and internationally. The company operates in two segments, North American OTC Healthcare and International OTC Healthcare. It offers BC/Goody's analgesic powders, Boudreaux's Butt Paste baby ointments, Chloraseptic sore throat liquids and lozenges, Clear Eyes for eye redness relief, Compound W wart removals, DenTek for PEG oral care, Debrox ear wax removals, and Dramamine for motion sickness relief. The company also provides Fleet adult enemas/suppositories, Gaviscon upset stomach remedies, Luden's cough drops, Monistat vaginal anti-fungal, Nix lice/parasite treatments, Summer's Eve feminine hygiene, TheraTears dry eye relief, Fess nasal saline spray and washes, and Hydralyte for oral rehydration products. It sells its products through mass merchandisers; and drug, food, dollar, convenience, and club stores, as well as e-commerce channels. The company was formerly known as Prestige Brands Holdings, Inc. and changed its name to Prestige Consumer Healthcare Inc. in August 2018. Prestige Consumer Healthcare Inc. was founded in 1996 and is headquartered in Tarrytown, New York.",
    "ceo": "Mr. Ronald M. Lombardi",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "560",
    "phone": "914 524 6800",
    "address": "660 White Plains Road",
    "city": "Tarrytown",
    "state": "NY",
    "zip": "10591",
    "dcfDiff": 5.5828,
    "dcf": 60.1072,
    "image": "https://financialmodelingprep.com/image-stock/PBH.png",
    "ipoDate": "2005-02-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]