[
  {
    "symbol": "PBR",
    "price": 14.18,
    "beta": 0.960616,
    "volAvg": 21423404,
    "mktCap": 92483381176,
    "lastDiv": 5.8,
    "range": "8.88-16.32",
    "changes": -0.06,
    "companyName": "Petróleo Brasileiro S.A. - Petrobras",
    "currency": "USD",
    "cik": "0001119639",
    "isin": "US71654V4086",
    "cusip": "71654V408",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://petrobras.com.br",
    "description": "Petróleo Brasileiro S.A. - Petrobras explores for, produces, and sells oil and gas in Brazil and internationally. The company operates through Exploration and Production; Refining, Transportation and Marketing; Gas and Power; and Corporate and Other Businesses segments. It engages in prospecting, drilling, refining, processing, trading, and transporting crude oil from producing onshore and offshore oil fields, and shale or other rocks, as well as oil products, natural gas, and other liquid hydrocarbons. The Exploration and Production segment explores, develops, and produces crude oil, natural gas liquids, and natural gas primarily for supplies to the domestic refineries. The Refining, Transportation and Marketing segment engages in the refining, logistics, transport, marketing, and trading of crude oil and oil products; exportation of ethanol; and extraction and processing of shale, as well as holding interests in petrochemical companies. The Gas and Power segment is involved in the logistic and trading of natural gas and electricity; transportation and trading of LNG; generation of electricity through thermoelectric power plants; holding interests in transportation and distribution of natural gas; and fertilizer production and natural gas processing business. The Corporate and Other Businesses segment produces biodiesel and its co-products, and ethanol; and distributes oil products. Petróleo Brasileiro S.A. - Petrobras was incorporated in 1953 and is headquartered in Rio de Janeiro, Brazil.",
    "ceo": "Mr. Jean Paul Terra Prates",
    "sector": "Energy",
    "country": "BR",
    "fullTimeEmployees": "45149",
    "phone": "55 21 3224 4477",
    "address": "Avenida RepUblica do Chile, 65",
    "city": "Rio De Janeiro",
    "state": "RJ",
    "zip": "20031-912",
    "dcfDiff": 1.71485,
    "dcf": 13.0049,
    "image": "https://financialmodelingprep.com/image-stock/PBR.png",
    "ipoDate": "2000-08-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]