[
  {
    "symbol": "PCCWY",
    "price": 5.19,
    "beta": 0.454406,
    "volAvg": 2882,
    "mktCap": 4016873326,
    "lastDiv": 0.49,
    "range": "3.8-5.66",
    "changes": 0.24,
    "companyName": "PCCW Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.pccw.com",
    "description": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Singapore, and internationally. The company's services include local telephony, local data and broadband, mobile, international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, and media content services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products and services; supply of broadband internet access solutions and web services; provision of data services; software development, systems integration, consulting, and informatization activities; computer facilities management; the provision of computer and IP/IT related value-added services to business customers; and operates customer loyalty program and online merchandise sales. Additionally, the company offers IT and business process outsourcing, fintech, e-Commerce, big data analytics, managed, digital, cloud, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
    "ceo": "Mr. Tzar Kai  Li",
    "sector": "Communication Services",
    "country": "HK",
    "fullTimeEmployees": "17400",
    "phone": "852 2888 2888",
    "address": "PCCW Tower",
    "city": "Quarry Bay",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/PCCWY.png",
    "ipoDate": "2000-08-22",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]