[
  {
    "symbol": "PCG",
    "price": 16.91,
    "beta": 1.140492,
    "volAvg": 16282022,
    "mktCap": 39667139259,
    "lastDiv": 61.759999999999984,
    "range": "9.66-17.68",
    "changes": -0.03,
    "companyName": "PG&E Corporation",
    "currency": "USD",
    "cik": "0001004980",
    "isin": "US69331C1080",
    "cusip": "69331C108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.pgecorp.com",
    "description": "PG&E Corporation, through its subsidiary, Pacific Gas and Electric Company, engages in the sale and delivery of electricity and natural gas to customers in northern and central California, the United States. It generates electricity using nuclear, hydroelectric, fossil fuel-fired, fuel cell, and photovoltaic sources. As of December 31, 2021, the company owns and operates approximately 18,000 circuit miles of interconnected transmission lines; 33 electric transmission substations, approximately 108,000 circuit miles of distribution lines, 67 transmission switching substations, and 753 distribution substations; and natural gas transmission, storage, and distribution system consisting of approximately 43,800 miles of distribution pipelines, approximately 6,200 miles of backbone and local transmission pipelines, and various storage facilities. It serves residential, commercial, industrial, and agricultural customers, as well as natural gas-fired electric generation facilities. The company was incorporated in 1905 and is headquartered in San Francisco, California.",
    "ceo": "Ms. Patricia Kessler Poppe",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "26010",
    "phone": "415 973 1000",
    "address": "77 Beale Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94177",
    "dcfDiff": 0.938736,
    "dcf": 15.1213,
    "image": "https://financialmodelingprep.com/image-stock/PCG.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]