[
  {
    "symbol": "PCOR",
    "price": 65.61,
    "beta": 0.553169,
    "volAvg": 1090664,
    "mktCap": 9218073780,
    "lastDiv": 0,
    "range": "41.8-68.68",
    "changes": 1.25,
    "companyName": "Procore Technologies, Inc.",
    "currency": "USD",
    "cik": "0001611052",
    "isin": "US74275K1088",
    "cusip": "74275K108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.procore.com",
    "description": "Procore Technologies, Inc. provides a cloud-based construction management platform and related software products in the United States and internationally. The company's platform enables owners, general and specialty contractors, architects, and engineers to collaborate on construction projects. It offers Preconstruction that facilitates collaboration between internal and external stakeholders during the planning, budgeting, estimating, bidding, and partner selection phase of a construction project; and Project Management, which enables real-time collaboration, information storage, design, BIM model clash detection, and regulation compliance for teams on the jobsite and in the back office. The company also provides Resource Management that helps contractors to schedule, track, and forecast labor productivity, enhance time management, communication with workforces, and manage profitability on construction projects; and Financial Management, which provides customers with visibility into the financial health of their individual construction projects and portfolios, as well as facilitates untethered access to financial data, linking the field, and the office in real-time. It serves owners, general contractors, and specialty contractors operating in the commercial, residential, industrial, and infrastructure segments of the construction industry. The company primarily sells subscriptions to access its products on computers, smartphones, and tablets through any web browser or from its mobile application available for iOS and Android platforms through its direct sales team. Procore Technologies, Inc. was incorporated in 2002 and is headquartered in Carpinteria, California.",
    "ceo": "Mr. Craig F. Courtemanche Jr.",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3568",
    "phone": "866 477 6267",
    "address": "6309 Carpinteria Avenue",
    "city": "Carpinteria",
    "state": "CA",
    "zip": "93013",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/PCOR.png",
    "ipoDate": "2021-05-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]