[
  {
    "symbol": "PCRFY",
    "price": 11.98,
    "beta": 0.948275,
    "volAvg": 175291,
    "mktCap": 27962517617,
    "lastDiv": 0.22,
    "range": "6.66-12.17",
    "changes": 0.11,
    "companyName": "Panasonic Holdings Corporation",
    "currency": "USD",
    "cik": "0000063271",
    "isin": "US69832A2050",
    "cusip": "69832A205",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Consumer Electronics",
    "website": "https://holdings.panasonic/global",
    "description": "Panasonic Holdings Corporation, together with its subsidiaries, develops, manufactures, sells, and services various electrical and electronic products worldwide. It operates through Appliances, Life Solutions, Connected Solutions, Automotive, and Industrial Solutions segments. The Appliances segment offers air conditioners, refrigerators, washing machines, vacuum cleaners, microwave ovens, rice cookers, personal care products, TVs, digital cameras, video equipment, home audio equipment, fixed-phones, show cases, compressors, and fuel cells. The Life Solutions segment provides lighting fixtures, lamps, wiring devices, solar photovoltaic systems, spatial sterilizing/deodorizing equipment, interior and exterior furnishing materials, ventilation and air conditioning equipment, air purifiers, bicycles, and nursing care related products, as well as kitchen and bath products. The Connected Solutions segment offers aircraft in-flight entertainment systems and communications services, electronic component mounting machines, welding equipment, PCs and tablets, projectors, and professional AV systems, as well as solutions for various industries. The Automotive segment provides automotive-use infotainment systems, head-up displays, automotive audio systems, automotive switches, vehicle camera modules, advanced driver assistance systems, automotive mirrors, and cylindrical and prismatic lithium-ion batteries, as well as devices and systems for electric automobiles. The Industrial Solutions segment offers relays, switches, power supply products, industrial motors and sensors, capacitors, coils, resistors, electronic circuit board materials, semiconductors, and LCD panels, as well as small lithiumion, dry, and micro batteries. The company was formerly known as Panasonic Corporation. Panasonic Holdings Corporation was founded in 1918 and is headquartered in Kadoma, Japan.",
    "ceo": "Masahiro  Shinada",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "233391",
    "phone": "81 6 6908 1121",
    "address": "1006, Oaza Kadoma",
    "city": "Kadoma",
    "state": null,
    "zip": "571-8501",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/PCRFY.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]