[
  {
    "symbol": "PCTY",
    "price": 179.21,
    "beta": 1.082042,
    "volAvg": 470279,
    "mktCap": 10002516545,
    "lastDiv": 0,
    "range": "160.0-276.88",
    "changes": -0.36,
    "companyName": "Paylocity Holding Corporation",
    "currency": "USD",
    "cik": "0001591698",
    "isin": "US70438V1061",
    "cusip": "70438V106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.paylocity.com",
    "description": "Paylocity Holding Corporation provides cloud-based human capital management and payroll software solutions for workforce in the United States. The company offers Payroll and Tax Services solution to simplifies payroll, automates processes, and manages compliance requirements within one system; and expense management, on demand payment, and garnishment solutions. It also provides human capital management and employee self-service solutions, document library, compliance dashboard, and HR edge; time and attendance solution; schedule tracking services; and time collection devices, including kiosks, time clocks, and mobile and web applications. In addition, the company offers talent management solutions comprising recruiting and onboarding, as well as learning, performance, and compensation management; employee benefits management and third-party administrative solutions; employee experiences solutions, including community, premium video, survey, and peer recognition; and insights and recommendations solutions, such as modern workforce index, data insights, and reporting. Further, it provides implementation and training, client, and tax and regulatory services. The company serves for-profit and non-profit organizations across industries, including business services, financial services, healthcare, manufacturing, restaurants, retail, technology, and others. It sells its products through sales representatives. The company was founded in 1997 and is headquartered in Schaumburg, Illinois.",
    "ceo": "Mr. Steven R. Beauchamp",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "5300",
    "phone": "847 463 3200",
    "address": "1400 American Lane",
    "city": "Schaumburg",
    "state": "IL",
    "zip": "60173",
    "dcfDiff": 2.67269,
    "dcf": 209.293,
    "image": "https://financialmodelingprep.com/image-stock/PCTY.png",
    "ipoDate": "2014-03-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]