[
  {
    "symbol": "PDCO",
    "price": 32.42,
    "beta": 1.222183,
    "volAvg": 843148,
    "mktCap": 3089431480,
    "lastDiv": 1.04,
    "range": "23.87-32.97",
    "changes": 0.15,
    "companyName": "Patterson Companies, Inc.",
    "currency": "USD",
    "cik": "0000891024",
    "isin": "US7033951036",
    "cusip": "703395103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Distribution",
    "website": "https://www.pattersoncompanies.com",
    "description": "Patterson Companies, Inc. engages in distribution of dental and animal health products in the United States, the United Kingdom, and Canada. The company operates through three segments: Dental, Animal Health, and Corporate segments. The Dental segment offers consumable products, including infection control, restorative materials, and instruments; basic and advanced technology and dental equipment; practice optimization solutions, such as practice management software, e-commerce, revenue cycle management, patient engagement solutions, and clinical and patient education systems. It also provides a range of related services comprising software and design services, maintenance and repair, and equipment financing. The Animal Health segment distributes biologicals, pharmaceuticals, vaccines, parasiticides, diagnostics, prescription and non-prescription diets, nutritional's, consumable supplies, equipment, and software, as well as value-added services. This segment also provides private label portfolio of products to veterinarians, producers, and retailers under the Aspen, First Companion, and Patterson Veterinary brands. The Corporate segment offers customer financing services; and sells other miscellaneous products. It serves dentists, laboratories, institutions, other healthcare professionals, veterinarians, other animal health professionals, production animal operators, and animal health product retailers. The company was formerly known as Patterson Dental Company and changed its name to Patterson Companies, Inc. in June 2004. Patterson Companies, Inc. was founded in 1877 and is headquartered in Saint Paul, Minnesota.",
    "ceo": "Mr. Donald J. Zurbay",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "7600",
    "phone": "651 686 1600",
    "address": "1031 Mendota Heights Road",
    "city": "Saint Paul",
    "state": "MN",
    "zip": "55120",
    "dcfDiff": 0.428125,
    "dcf": 30.0019,
    "image": "https://financialmodelingprep.com/image-stock/PDCO.png",
    "ipoDate": "1992-10-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]