[
  {
    "symbol": "PDYPY",
    "price": 99.67,
    "beta": 0.881226,
    "volAvg": 20004,
    "mktCap": 35190883985,
    "lastDiv": 3.2210000000000005,
    "range": "43.71-104.21",
    "changes": 0.48,
    "companyName": "Flutter Entertainment plc",
    "currency": "USD",
    "cik": null,
    "isin": "US3440441026",
    "cusip": "695274209",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Gambling",
    "website": "https://www.flutter.com",
    "description": "Flutter Entertainment plc operates as a sports betting and gaming company in the United Kingdom, Ireland, Australia, the United States, and internationally. The company operates through four segments: UK & Ireland, Australia, International, and US. It offers sportsbooks and exchange sports betting products, daily fantasy sports products, and pari-mutuel betting products; fixed odds games betting products; online games and casinos; peer-to-peer games, including online bingo, rummy, and poker; and business-to-business services. The company also operates HRTV, a horseracing television network, as well as offers treasury; risk management; and horse racing broadcasting and advanced deposit wagering services. It provides sports betting and gaming services through paddypower.com, betfair.com, sportsbet.com.au, tvg.com, us.betfair.com, fanduel.com, pokerstars.com, Skybet.com, tombola.com, and adjarabet.com websites under the Paddy Power, Betfair, Sportsbet, TVG, FanDuel, Sky Betting & Gaming, PokerStars, Tombola, and Adjarabet brands, as well as BetStars, Sky Bet, Sky Vegas, FOX Bet, Stardust, Sky Bingo, and Junglee Games brands; and betting shops, and live poker tours and events. The company was formerly known as Paddy Power Betfair plc and changed its name to Flutter Entertainment plc in May 2019. Flutter Entertainment plc was incorporated in 1958 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Jeremy Peter Jackson",
    "sector": "Consumer Cyclical",
    "country": "IE",
    "fullTimeEmployees": "22000",
    "phone": "353 1 905 1000",
    "address": "Belfield Office Park",
    "city": "Dublin",
    "state": null,
    "zip": "4",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/PDYPY.png",
    "ipoDate": "2015-07-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]