[
  {
    "symbol": "PEG",
    "price": 61.5,
    "beta": 0.582394,
    "volAvg": 2524637,
    "mktCap": 30686347008,
    "lastDiv": 2.28,
    "range": "52.51-69.94",
    "changes": -1.22,
    "companyName": "Public Service Enterprise Group Incorporated",
    "currency": "USD",
    "cik": "0000788784",
    "isin": "US7445731067",
    "cusip": "744573106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.pseg.com",
    "description": "Public Service Enterprise Group Incorporated, through its subsidiaries, operates as an energy company primarily in the Northeastern and Mid-Atlantic United States. It operates through two segments, PSE&G and PSEG Power. The PSE&G segment transmits electricity; distributes electricity and gas to residential, commercial, and industrial customers, as well as invests in solar generation projects, and energy efficiency and related programs; and offers appliance services and repairs. As of December 31, 2021, it had electric transmission and distribution system of 25,000 circuit miles and 862,000 poles; 56 switching stations with an installed capacity of 39,353 megavolt-amperes (MVA), and 235 substations with an installed capacity of 9,285 MVA; four electric distribution headquarters and five electric sub-headquarters; and 18,000 miles of gas mains, 12 gas distribution headquarters, two sub-headquarters, and one meter shop, as well as 58 natural gas metering and regulating stations. Public Service Enterprise Group Incorporated was incorporated in 1985 and is based in Newark, New Jersey.",
    "ceo": "Mr. Ralph A. LaRossa",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "12525",
    "phone": "973 430 7000",
    "address": "80 Park Plaza",
    "city": "Newark",
    "state": "NJ",
    "zip": "07102",
    "dcfDiff": 1.16659,
    "dcf": 59.4634,
    "image": "https://financialmodelingprep.com/image-stock/PEG.png",
    "ipoDate": "1980-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]