[
  {
    "symbol": "PEN",
    "price": 329.43,
    "beta": 0.517253,
    "volAvg": 351443,
    "mktCap": 12577275027,
    "lastDiv": 0,
    "range": "118.65-344.81",
    "changes": 2.08,
    "companyName": "Penumbra, Inc.",
    "currency": "USD",
    "cik": "0001321732",
    "isin": "US70975L1070",
    "cusip": "70975L107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.penumbrainc.com",
    "description": "Penumbra, Inc. designs, develops, manufactures, and markets medical devices in the United States and internationally. The company offers aspiration based thrombectomy systems and accessory devices, including revascularization device for mechanical thrombectomy, such as Penumbra System under the Penumbra RED, JET, ACE, 3D Revascularization Device, and Penumbra ENGINE brands, as well as components and accessories; neurovascular embolization coiling systems to treat patients with various sizes of aneurysms and other neurovascular lesions under the Penumbra Coil 400, POD400, PAC400, and Penumbra SMART Coil brand names; and neurovascular access systems designed to provide intracranial access for use in a range of neurovascular therapies under the Neuron, Neuron MAX, Select, BENCHMARK, BMX96, DDC, and PX SLIM brands. It also provides neurosurgical aspiration tools for the removal of tissue and fluids under the Artemis Neuro Evacuation Device brand; aspiration-based thrombectomy systems for vascular applications under the Indigo System brand; and detachable embolic coil systems for peripheral embolization under the Ruby Coil and Ruby LP brand names. In addition, the company offers microcatheter for the delivery of detachable coils and occlusion devices under the LANTERN brand; and detachable, microcatheter-deliverable occlusion devices designed primarily to occlude peripheral vessels under the POD (Penumbra Occlusion Device) brand, as well as immersive computer-based technologies and immersive therapeutics to promote health, motor function, and cognition under the Real Immersive System brand; and a complementary device for use with Ruby Coil and POD for vessel occlusion under the Packing Coil and Packing Coil LP brands. The company sells its products through direct sales organizations and distributors. Penumbra, Inc. was incorporated in 2004 and is headquartered in Alameda, California.",
    "ceo": "Mr. Adam  Elsesser",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "3900",
    "phone": "510 748 3200",
    "address": "One Penumbra Place",
    "city": "Alameda",
    "state": "CA",
    "zip": "94502",
    "dcfDiff": 56.3598,
    "dcf": 194.08,
    "image": "https://financialmodelingprep.com/image-stock/PEN.png",
    "ipoDate": "2015-09-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]