[
  {
    "symbol": "PEP",
    "price": 183.7,
    "beta": 0.548943,
    "volAvg": 4350483,
    "mktCap": 253081650061,
    "lastDiv": 5.06,
    "range": "160.98-196.88",
    "changes": -2.52,
    "companyName": "PepsiCo, Inc.",
    "currency": "USD",
    "cik": "0000077476",
    "isin": "US7134481081",
    "cusip": "713448108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Beverages—Non-Alcoholic",
    "website": "https://www.pepsico.com",
    "description": "PepsiCo, Inc. manufactures, markets, distributes, and sells various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, simply granola, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is headquartered in Purchase, New York.",
    "ceo": "Mr. Ramon Luis Laguarta",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "315000",
    "phone": "914 253 2000",
    "address": "700 Anderson Hill Road",
    "city": "Purchase",
    "state": "NY",
    "zip": "10577",
    "dcfDiff": 19.2288,
    "dcf": 188.849,
    "image": "https://financialmodelingprep.com/image-stock/PEP.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]