[
  {
    "symbol": "PFE",
    "price": 36.29,
    "beta": 0.589084,
    "volAvg": 25668464,
    "mktCap": 204868298158,
    "lastDiv": 1.64,
    "range": "36.0334-54.93",
    "changes": -0.13,
    "companyName": "Pfizer Inc.",
    "currency": "USD",
    "cik": "0000078003",
    "isin": "US7170811035",
    "cusip": "717081103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.pfizer.com",
    "description": "Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products worldwide. It offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic and women's health under the Premarin family and Eliquis brands; biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Sutent, Inlyta, Retacrit, Lorbrena, and Braftovi brands; and sterile injectable and anti-infective medicines, and oral COVID-19 treatment under the Sulperazon, Medrol, Zavicefta, Zithromax, Vfend, Panzyga, and Paxlovid brands. The company also provides medicines and vaccines in various therapeutic areas, such as pneumococcal disease, meningococcal disease, tick-borne encephalitis, and COVID-19 under the Comirnaty/BNT162b2, Nimenrix, FSME/IMMUN-TicoVac, Trumenba, and the Prevnar family brands; biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Eucrisa/Staquis, and Cibinqo brands; and amyloidosis, hemophilia, and endocrine diseases under the Vyndaqel/Vyndamax, BeneFIX, and Genotropin brands. In addition, the company is involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, and individual provider offices, as well as disease control and prevention centers. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Myovant Sciences Ltd.; Akcea Therapeutics, Inc; Merck KGaA; Valneva SE; BioNTech SE; and Arvinas, Inc. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.",
    "ceo": "Dr. Albert  Bourla D.V.M., DVM, Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "83000",
    "phone": "212 733 2323",
    "address": "235 East 42nd Street",
    "city": "New York",
    "state": "NY",
    "zip": "10017",
    "dcfDiff": 4.73058,
    "dcf": 48.5206,
    "image": "https://financialmodelingprep.com/image-stock/PFE.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]