[
  {
    "symbol": "PFGC",
    "price": 59.65,
    "beta": 1.360915,
    "volAvg": 962270,
    "mktCap": 9314108900,
    "lastDiv": 0,
    "range": "42.77-63.22",
    "changes": 0.26,
    "companyName": "Performance Food Group Company",
    "currency": "USD",
    "cik": "0001618673",
    "isin": "US71377A1034",
    "cusip": "71377A103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Food Distribution",
    "website": "https://www.pfgc.com",
    "description": "Performance Food Group Company, through its subsidiaries, markets and distributes food and food-related products in the United States. It operates through three segments: Foodservice, Vistar, and Convenience. The company offers a range of frozen foods, groceries, candy, snacks, beverages, cigarettes, and other tobacco products; beef, pork, poultry, and seafood; and health and beauty care products. It also sells disposables, cleaning and kitchen supplies, and related products. In addition, the company offers value-added services, such as product selection and procurement, menu development, and operational strategy. It serves independent and chain restaurants, schools, business and industry locations, hospitals, vending distributors, office coffee service distributors, retailers, convenience stores, theaters, hospitality providers, concessionaires, airport gift shops, college bookstores, corrections facilities, and impulse locations, as well as franchises and other institutional customers. Performance Food Group Company was founded in 1885 and is headquartered in Richmond, Virginia.",
    "ceo": "Mr. George L. Holm",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "35000",
    "phone": "804 484 7700",
    "address": "12500 West Creek Parkway",
    "city": "Richmond",
    "state": "VA",
    "zip": "23238",
    "dcfDiff": 1.57679,
    "dcf": 58.2932,
    "image": "https://financialmodelingprep.com/image-stock/PFGC.png",
    "ipoDate": "2015-09-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]