[
  {
    "symbol": "PFSI",
    "price": 71.9,
    "beta": 1.470422,
    "volAvg": 353633,
    "mktCap": 3589578740,
    "lastDiv": 0.8,
    "range": "41.77-73.79",
    "changes": 1.43,
    "companyName": "PennyMac Financial Services, Inc.",
    "currency": "USD",
    "cik": "0001745916",
    "isin": "US70932M1071",
    "cusip": "70932M107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Mortgage Finance",
    "website": "https://ir.pennymacfinancial.com",
    "description": "PennyMac Financial Services, Inc., through its subsidiaries, engages in the mortgage banking and investment management activities in the United States. It operates through three segments: Production, Servicing, and Investment Management. The Production segment is involved in the origination, acquisition, and sale of loans. It sources first-lien residential conventional and government-insured or guaranteed mortgage loans. The Servicing segment engages in the servicing of newly originated loans, and execution and management of early buyout transactions and servicing of loans. It performs loan administration, collection, and default management activities, including the collection and remittance of loan payments, response to customer inquiries, accounting for principal and interest, holding custodial funds for the payment of property taxes and insurance premiums, counseling delinquent borrowers, and supervising foreclosures and property dispositions, as well as administers loss mitigation activities, such as modification and forbearance programs. The Investment Management segment is involved in sourcing, performing diligence, bidding, and closing investment asset acquisitions; managing correspondent production activities for PennyMac Mortgage Investment Trust; and managing acquired assets. PennyMac Financial Services, Inc. was founded in 2008 and is headquartered in Westlake Village, California.",
    "ceo": "Mr. David A. Spector",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4168",
    "phone": "818 224 7442",
    "address": "3043 Townsgate Road",
    "city": "Westlake Village",
    "state": "CA",
    "zip": "91361",
    "dcfDiff": 5.62006,
    "dcf": 60.3499,
    "image": "https://financialmodelingprep.com/image-stock/PFSI.png",
    "ipoDate": "2013-05-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]