[
  {
    "symbol": "PGR",
    "price": 131.69,
    "beta": 0.498943,
    "volAvg": 2835330,
    "mktCap": 77091326000,
    "lastDiv": 0.4,
    "range": "109.42-149.87",
    "changes": -0.96,
    "companyName": "The Progressive Corporation",
    "currency": "USD",
    "cik": "0000080661",
    "isin": "US7433151039",
    "cusip": "743315103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.progressive.com",
    "description": "The Progressive Corporation, an insurance holding company, provides personal and commercial auto, personal residential and commercial property, general liability, and other specialty property-casualty insurance products and related services in the United States. It operates in three segments: Personal Lines, Commercial Lines, and Property. The Personal Lines segment writes insurance for personal autos and recreational vehicles (RV). This segment's products include personal auto insurance; and special lines products, including insurance for motorcycles, ATVs, RVs, watercrafts, snowmobiles, and related products. The Commercial Lines segment provides auto-related primary liability and physical damage insurance, and business-related general liability and property insurance for autos, vans, pick-up trucks, and dump trucks used by small businesses; tractors, trailers, and straight trucks primarily used by regional general freight and expeditor-type businesses, and long-haul operators; dump trucks, log trucks, and garbage trucks used by dirt, sand and gravel, logging, and coal-type businesses; and tow trucks and wreckers used in towing services and gas/service station businesses; as well as non-fleet and airport taxis, and black-car services. The Property segment writes residential property insurance for homeowners, other property owners, and renters, as well as offers personal umbrella insurance, and primary and excess flood insurance. The company also offers policy issuance and claims adjusting services; and acts as an agent to homeowner general liability, workers' compensation insurance, and other products. In addition, it provides reinsurance services. The company sells its products through independent insurance agencies, as well as directly on Internet through mobile devices, and over the phone. The Progressive Corporation was founded in 1937 and is headquartered in Mayfield, Ohio.",
    "ceo": "Ms. Susan Patricia Griffith",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "55100",
    "phone": "440 461 5000",
    "address": "6300 Wilson Mills Road",
    "city": "Mayfield",
    "state": "OH",
    "zip": "44143",
    "dcfDiff": 4.94001,
    "dcf": 130.13,
    "image": "https://financialmodelingprep.com/image-stock/PGR.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]