[
  {
    "symbol": "PHG",
    "price": 21.03,
    "beta": 0.845593,
    "volAvg": 1154250,
    "mktCap": 19366737636,
    "lastDiv": 0.9387,
    "range": "11.75-22.34",
    "changes": 0.08,
    "companyName": "Koninklijke Philips N.V.",
    "currency": "USD",
    "cik": "0000313216",
    "isin": "US5004723038",
    "cusip": "500472303",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.philips.com",
    "description": "Koninklijke Philips N.V. operates as a health technology company in North America and internationally. It operates through Diagnosis & Treatment Businesses, Connected Care Businesses, and Personal Health Businesses segments. The company provides diagnostic imaging solutions, includes magnetic resonance imaging, computed tomography (CT) systems, X-ray systems, and detector-based spectral CT solutions, as well as molecular and hybrid imaging solutions for nuclear medicine; integrated interventional systems; echography solutions focused on diagnosis, treatment planning and guidance for cardiology, general imaging, obstetrics/gynecology, and point-of-care applications; proprietary software to enable diagnostics and intervention; and enterprise diagnostic informatics products and services. It also offers acute patient management solutions; emergency care solutions; sleep and respiratory care solutions; and electronic medical record and care management solutions. In addition, the company provides power toothbrushes, brush heads, and interdental cleaning and teeth whitening products; infant feeding and digital parental solutions; and male grooming and beauty products and solutions. It has a strategic collaboration with Ibex Medical Analytics Ltd. to jointly promote the digital pathology and AI solutions to hospitals, health networks, and pathology laboratories worldwide, as well as a strategic partnership agreement with NICO.LAB. The company was formerly known as Koninklijke Philips Electronics N.V. and changed its name to Koninklijke Philips N.V. in May 2013. Koninklijke Philips N.V. was founded in 1891 and is headquartered in Amsterdam, the Netherlands.",
    "ceo": "Mr. Roy  Jakobs",
    "sector": "Healthcare",
    "country": "NL",
    "fullTimeEmployees": "73712",
    "phone": "31 20 597 7777",
    "address": "Philips Center",
    "city": "Amsterdam",
    "state": null,
    "zip": "1096 BC",
    "dcfDiff": 0.398272,
    "dcf": 16.5917,
    "image": "https://financialmodelingprep.com/image-stock/PHG.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]