[
  {
    "symbol": "PHI",
    "price": 23.82,
    "beta": 0.197945,
    "volAvg": 61580,
    "mktCap": 5146453920,
    "lastDiv": 2.4,
    "range": "20.2-32.27",
    "changes": -0.14,
    "companyName": "PLDT Inc.",
    "currency": "USD",
    "cik": "0000078150",
    "isin": "US69344D4088",
    "cusip": "69344D408",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://main.pldt.com",
    "description": "PLDT Inc. provides telecommunications and digital services in the Philippines. It operates through three segments: Wireless, Fixed Line, and Others. The company offers cellular mobile, Internet broadband distribution, operations support, software development, and satellite information and messaging services; and sells Wi-Fi access equipment. It also provides fixed line telecommunications services; business infrastructure and solutions; intelligent data processing and implementation, and data analytics insight generation services; and information and communications infrastructure for Internet-based services, e-commerce, customer relationship management, and information technology (IT) related services. In addition, the company offers managed IT outsourcing, Internet-based purchasing, IT consulting and professional, bills printing and other related value-added, and air transportation services; distributes Filipino channels and content services; and provides full-services customer rewards and loyalty programs. Further, it engages in the sale of mobile handsets, broadband data routers, tablets, and accessories, as well as provides domestic leased lines and alternative messaging solutions, such as over-the-top services, social media, and messenger application. As of December 31, 2021, it had 71,221,952 mobile broadband subscribers; 3,619,372 fixed line subscribers; and 2.8 million broadband subscribers. The company was formerly known as Philippine Long Distance Telephone Company and changed its name to PLDT Inc. in July 2016. PLDT Inc. was incorporated in 1928 and is headquartered in Makati City, the Philippines.",
    "ceo": "Mr. Alfredo S. Panlilio",
    "sector": "Communication Services",
    "country": "PH",
    "fullTimeEmployees": "16463",
    "phone": "63 2 8816 8024",
    "address": "Ramon Cojuangco Building",
    "city": "Makati City",
    "state": null,
    "zip": "1200",
    "dcfDiff": 112.032,
    "dcf": 138.392,
    "image": "https://financialmodelingprep.com/image-stock/PHI.png",
    "ipoDate": "1973-05-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]