[
  {
    "symbol": "PHM",
    "price": 77.72,
    "beta": 1.34507,
    "volAvg": 2903956,
    "mktCap": 17348969280,
    "lastDiv": 0.64,
    "range": "35.99-79.145",
    "changes": -0.95,
    "companyName": "PulteGroup, Inc.",
    "currency": "USD",
    "cik": "0000822416",
    "isin": "US7458671010",
    "cusip": "745867101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Residential Construction",
    "website": "https://www.pultegroup.com",
    "description": "PulteGroup, Inc., through its subsidiaries, primarily engages in the homebuilding business in the United States. It acquires and develops land primarily for residential purposes; and constructs housing on such land. The company also offers various home designs, including single-family detached, townhomes, condominiums, and duplexes under the Centex, Pulte Homes, Del Webb, DiVosta Homes, American West, and John Wieland Homes and Neighborhoods brand names. As of December 31, 2021, it controlled 228,296 lots, of which 109,078 were owned and 119,218 were under land option agreements. In addition, the company arranges financing through the origination of mortgage loans primarily for homebuyers; sells the servicing rights for the originated loans; and provides title insurance policies, and examination and closing services to homebuyers. PulteGroup, Inc. was formerly known as Pulte Homes, Inc. and changed its name to PulteGroup, Inc. in March 2010. The company was founded in 1950 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. Ryan R. Marshall",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "6524",
    "phone": "404 978 6400",
    "address": "3350 Peachtree Road NE",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30326",
    "dcfDiff": 3.36546,
    "dcf": 49.2545,
    "image": "https://financialmodelingprep.com/image-stock/PHM.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]