[
  {
    "symbol": "PI",
    "price": 82.84,
    "beta": 2.191549,
    "volAvg": 681045,
    "mktCap": 2208779488,
    "lastDiv": 0,
    "range": "52.3-144.9",
    "changes": -1.37,
    "companyName": "Impinj, Inc.",
    "currency": "USD",
    "cik": "0001114995",
    "isin": "US4532041096",
    "cusip": "453204109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Communication Equipment",
    "website": "https://www.impinj.com",
    "description": "Impinj, Inc. operates a cloud connectivity platform in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. Its platform, which comprises multiple product families, wirelessly connects individual items and delivers data about the connected items to business and consumer applications. The company's platform comprises endpoint ICs, a miniature radios-on-a-chip that attaches to a host item and includes a number to identify the item. Its platform also consists of systems products that comprise reader ICs, readers, and gateways to wirelessly provide power to and communicate bidirectionally with endpoint ICs on host items, as well as to read, write, authenticate, and engage the endpoint ICs on those items; and software and algorithms that enables its partners to deliver use cases, such as retail self-checkout and loss prevention, and warehouse pallet and carton tracking to end-users. The company primarily serves retail, supply chain and logistics, aviation, automotive, healthcare, industrial and manufacturing, sports, food, datacenter, travel, banking, and linen and uniform tracking sectors through distributors, system integrators, value-added resellers, and software solution partners. Impinj, Inc. was incorporated in 2000 and is headquartered in Seattle, Washington.",
    "ceo": "Dr. Chris  Diorio Ph.D.",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "389",
    "phone": "206 517 5300",
    "address": "400 Fairview Avenue North",
    "city": "Seattle",
    "state": "WA",
    "zip": "98109",
    "dcfDiff": 11.0474,
    "dcf": 117.503,
    "image": "https://financialmodelingprep.com/image-stock/PI.png",
    "ipoDate": "2016-07-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]