[
  {
    "symbol": "PII",
    "price": 118.26,
    "beta": 1.606338,
    "volAvg": 566296,
    "mktCap": 6729774516,
    "lastDiv": 2.6,
    "range": "91.86-123.87",
    "changes": -0.04,
    "companyName": "Polaris Inc.",
    "currency": "USD",
    "cik": "0000931015",
    "isin": "US7310681025",
    "cusip": "731068102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Recreational Vehicles",
    "website": "https://www.polaris.com",
    "description": "Polaris Inc. designs, engineers, manufactures, and markets power sports vehicles worldwide. It operates through three segments: Off-Road, On-Road and Marine. The company offers off-road vehicles (ORVs), including all-terrain vehicles and side-by-side vehicles; snowmobiles and snow bikes conversion kit systems; motorcycles; and low emission, light duty hauling, passenger, and industrial vehicles. It also provides quadricycles and moto-roadsters; ORV accessories comprising winches, bumper, plows, racks, wheels and tires, pull-behinds, cab systems, lighting and audio systems, cargo box accessories, tracks, and oil; snowmobile accessories, which include covers, traction products, electric starters, reverse kits, tracks, bags, windshields, oil, and lubricants; and motorcycle accessories, such as saddle bags, handlebars, backrests, exhausts, windshields, seats, oil, and various chrome accessories. In addition, the company offers gear and apparel, such as helmets, jackets, gloves, pants, hats, goggles, boots, bibs, and leathers; and pontoon and deck boats. The company provides its products through dealers and distributors, and online; and aftermarket parts, garments, and accessories through 101 brick-and-mortar retail centers, call centers, and e-commerce sites. The company was formerly known as Polaris Industries Inc. Polaris Inc. was founded in 1954 and is headquartered in Medina, Minnesota.",
    "ceo": "Mr. Michael T. Speetzen",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "16200",
    "phone": "763 542 0500",
    "address": "2100 Highway 55",
    "city": "Medina",
    "state": "MN",
    "zip": "55340",
    "dcfDiff": 10.9312,
    "dcf": 118.111,
    "image": "https://financialmodelingprep.com/image-stock/PII.png",
    "ipoDate": "1987-09-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]