[
  {
    "symbol": "PINC",
    "price": 27.21,
    "beta": 0.291197,
    "volAvg": 860150,
    "mktCap": 3240112380,
    "lastDiv": 0.84,
    "range": "24.88-38.98",
    "changes": -0.07,
    "companyName": "Premier, Inc.",
    "currency": "USD",
    "cik": "0001577916",
    "isin": "US74051N1028",
    "cusip": "74051N102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Health Information Services",
    "website": "https://www.premierinc.com",
    "description": "Premier, Inc., together with its subsidiaries, operates as a healthcare improvement company in the United States. It operates in two segments, Supply Chain Services and Performance Services. The Supply Chain Services segment offers its members with an access to a range of products and services, including medical and surgical products, pharmaceuticals, laboratory supplies, capital equipment, information technology, facilities and construction, and food and nutritional products, as well as purchased services, such as clinical engineering and workforce solutions. This segment also provides the ASCENDrive programs for members to receive group purchasing programs, tiers, and prices; SURPASS Performance Group services; STOCKD, an e-commerce platform; PROVIDEGX program, which identifies supply sources for drugs that are on or may be at risk of being added to the national drug shortage list, or that are vulnerable to pricing volatility, as well as direct sourcing business; SaaS informatics products; supply chain co-management services; purchased services contracts; direct sourcing solutions; and supply chain resiliency programs. The Performance Services segment provides technology and services platform with offerings that help optimize performance in three main areas, including clinical intelligence, margin improvement, and value-based care under the PINC AI brand; third party administrator services and management of health benefit programs under the Contigo Health brand; and digital invoicing and payables services that offers financial support services to healthcare product suppliers and service providers under the Remitra brand. The company also provides services to other businesses, including food service, schools, and universities. Premier, Inc. was incorporated in 2013 and is headquartered in Charlotte, North Carolina.",
    "ceo": "Mr. Michael J. Alkire",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "2600",
    "phone": "704 357 0022",
    "address": "13034 Ballantyne Corporate Place",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28277",
    "dcfDiff": 0.598249,
    "dcf": 33.5182,
    "image": "https://financialmodelingprep.com/image-stock/PINC.png",
    "ipoDate": "2013-09-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]