[
  {
    "symbol": "PIPR",
    "price": 130.06,
    "beta": 1.369014,
    "volAvg": 108348,
    "mktCap": 1919126342,
    "lastDiv": 2.4,
    "range": "102.6-162.2",
    "changes": -0.07,
    "companyName": "Piper Sandler Companies",
    "currency": "USD",
    "cik": "0001230245",
    "isin": "US7240781002",
    "cusip": "724078100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.pipersandler.com",
    "description": "Piper Sandler Companies operates as an investment bank and institutional securities firm that serves corporations, private equity groups, public entities, non-profit entities, and institutional investors in the United States and internationally. The company offers investment banking and institutional sales, trading, and research services for various equity and fixed income products. It provides advisory services, such as mergers and acquisitions, equity private placements, and debt and restructuring advisory; raises capital through equity and debt financings; underwrites municipal issuances; and offers municipal financial advisory and loan placement services, as well as various over-the-counter derivative products. The company also offers public finance investment banking services that focus on state and local governments, and cultural and social service non-profit entities, as well as the education, healthcare, hospitality, senior living, and transportation sectors. In addition, it provides equity and fixed income advisory and trade execution services for institutional investors, and government and non-profit entities. Further, the company is involved in the alternative asset management funds merchant banking and healthcare to invest firm capital and to manage capital from outside investors, as well as trading activities. The company was formerly known as Piper Jaffray Companies and changed its name to Piper Sandler Companies in January 2020. Piper Sandler Companies was founded in 1895 and is headquartered in Minneapolis, Minnesota.",
    "ceo": "Mr. Chad R. Abraham",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1790",
    "phone": "612 303 6000",
    "address": "800 Nicollet Mall",
    "city": "Minneapolis",
    "state": "MN",
    "zip": "55402",
    "dcfDiff": 61.5481,
    "dcf": 199.778,
    "image": "https://financialmodelingprep.com/image-stock/PIPR.png",
    "ipoDate": "2004-01-02",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]