[
  {
    "symbol": "PKG",
    "price": 129.4,
    "beta": 0.895422,
    "volAvg": 650538,
    "mktCap": 11637226680,
    "lastDiv": 5,
    "range": "110.56-146.26",
    "changes": -2.26,
    "companyName": "Packaging Corporation of America",
    "currency": "USD",
    "cik": "0000075677",
    "isin": "US6951561090",
    "cusip": "695156109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaging & Containers",
    "website": "https://www.packagingcorp.com",
    "description": "Packaging Corporation of America manufactures and sells containerboard and corrugated packaging products in the United States. The company operates through Packaging and Paper segments. The Packaging segment offers various containerboard and corrugated packaging products, such as conventional shipping containers used to protect and transport manufactured goods; multi-color boxes and displays that help to merchandise the packaged product in retail locations; and honeycomb protective packaging products, as well as packaging for meat, fresh fruit and vegetables, processed food, beverages, and other industrial and consumer products. This segment sells its corrugated products through a direct sales and marketing organization, independent brokers, and distribution partners. The Paper segment manufactures and sells commodity and specialty papers, as well as communication papers, including cut-size office papers, and printing and converting papers. This segment sells white papers through its sales and marketing organization. Packaging Corporation of America was founded in 1867 and is headquartered in Lake Forest, Illinois.",
    "ceo": "Mr. Mark W. Kowlzan",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "15100",
    "phone": "847 482 3000",
    "address": "1 North Field Court",
    "city": "Lake Forest",
    "state": "IL",
    "zip": "60045",
    "dcfDiff": 0.554852,
    "dcf": 137.855,
    "image": "https://financialmodelingprep.com/image-stock/PKG.png",
    "ipoDate": "2000-01-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]