[
  {
    "symbol": "PKX",
    "price": 74.6,
    "beta": 1.02089,
    "volAvg": 290730,
    "mktCap": 22641472403,
    "lastDiv": 1.89,
    "range": "36.53-80.03",
    "changes": -3.1,
    "companyName": "POSCO Holdings Inc.",
    "currency": "USD",
    "cik": "0000889132",
    "isin": "US6934831099",
    "cusip": "693483109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Steel",
    "website": "https://www.posco.com",
    "description": "POSCO Holdings Inc., together with its subsidiaries, manufactures and sells steel rolled products and plates in South Korea and internationally. It operates through four segments: Steel, Construction, Trading, and Others. The company offers hot and cold rolled steel, steel plates, wire rods, galvanized sheets, electrical steel, stainless steel, and titanium. It also engages in the design, manufacture, and construction of steel mills and their facilities, and commercial and residential facilities; export and import of raw materials, as well as provision of supply and purchase transactions between domestic and foreign companies, and various steel products; power generation activities; and provision of network, system integration, and logistics services. In addition, the company is involved in the engineering and construction; research and consulting; architectural design and supervision; investment in venture, energy, and technology industries; electronic commerce; intellectual property services and consulting; transporting and warehousing; real estate development, rental, sale, and management; and education and real estate business. Further, it engages in the resource development; mine development; business facility maintenance; fuel cell; iron ore and coal sales; anode reproduction; and cargo handling business, as well as operates housing business agency. Additionally, the company is involved in the IT service and DVR; electric control engineering; forest resources development; refractory materials sales and furnace maintenance; quicklime manufacturing and sales; wastewater treatment operation and maintenance; rice processing; grain sales; and social enterprise businesses. POSCO Holdings Inc. was incorporated in 1968 and is headquartered in Pohang, South Korea.",
    "ceo": "Mr. Jeong-Woo  Choi",
    "sector": "Basic Materials",
    "country": "KR",
    "fullTimeEmployees": "168",
    "phone": null,
    "address": "6261, Donghaean-ro",
    "city": "Pohang",
    "state": null,
    "zip": null,
    "dcfDiff": 15557.3,
    "dcf": 15620,
    "image": "https://financialmodelingprep.com/image-stock/PKX.png",
    "ipoDate": "1994-10-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]