[
  {
    "symbol": "PLTR",
    "price": 15.28,
    "beta": 2.785794,
    "volAvg": 70942843,
    "mktCap": 32369762574,
    "lastDiv": 0,
    "range": "5.92-17.16",
    "changes": 0.67,
    "companyName": "Palantir Technologies Inc.",
    "currency": "USD",
    "cik": "0001321655",
    "isin": "US69608A1088",
    "cusip": "69608A108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.palantir.com",
    "description": "Palantir Technologies Inc. builds and deploys software platforms for the intelligence community in the United States to assist in counterterrorism investigations and operations. The company provides palantir gotham, a software platform which enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, as well as facilitates the handoff between analysts and operational users, helping operators plan and execute real-world responses to threats that have been identified within the platform. It also offers palantir foundry, a platform that transforms the ways organizations operate by creating a central operating system for their data; and allows individual users to integrate and analyze the data they need in one place. In addition, it provides apollo, a software that enables customers to deploy their own software virtually in any environment. Palantir Technologies Inc. was incorporated in 2003 and is based in Denver, Colorado.",
    "ceo": "Dr. Alexander C. Karp",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3850",
    "phone": "720 358 3679",
    "address": "1555 Blake Street",
    "city": "Denver",
    "state": "CO",
    "zip": "80202",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/PLTR.png",
    "ipoDate": "2020-09-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]