[
  {
    "symbol": "PLUG",
    "price": 9.44,
    "beta": 1.754577,
    "volAvg": 24187759,
    "mktCap": 5669069507,
    "lastDiv": 0,
    "range": "7.39-31.56",
    "changes": 0.18,
    "companyName": "Plug Power Inc.",
    "currency": "USD",
    "cik": "0001093691",
    "isin": "US72919P2020",
    "cusip": "72919P202",
    "exchange": "NASDAQ Capital Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Electrical Equipment & Parts",
    "website": "https://www.plugpower.com",
    "description": "Plug Power Inc. delivers end-to-end clean hydrogen and zero-emissions fuel cell solutions for supply chain and logistics applications, on-road electric vehicles, stationary power market, and others in North America and internationally. It engages in building an end-to-end green hydrogen ecosystem, including green hydrogen production, storage and delivery, and energy generation through mobile or stationary applications. The company provides proton exchange membrane (PEM), fuel cell and fuel processing technologies, and fuel cell/battery hybrid technologies, as well as related hydrogen and green hydrogen generation, storage, and dispensing infrastructure. The company offers GenDrive, a hydrogen-fueled PEM fuel cell system that provides power to material handling electric vehicles; GenFuel, a liquid hydrogen fueling delivery, generation, storage, and dispensing system; GenCare, an ongoing Internet of Things-based maintenance and on-site service program for GenDrive fuel cell systems, GenSure fuel cell systems, GenFuel hydrogen storage and dispensing products, and ProGen fuel cell engines; and GenSure, a stationary fuel cell solution that offers modular PEM fuel cell power to support the backup and grid-support power requirements of the telecommunications, transportation, and utility sectors. It also provides GenKey, an integrated turn-key solution for transitioning to fuel cell power; ProGen, a fuel cell stack and engine technology used in mobility and stationary fuel cell systems, and as engines in electric delivery vans; and GenFuel Electrolyzers that are hydrogen generators optimized for clean hydrogen production. The company sells its products through a direct product sales force, original equipment manufacturers, and dealer networks. It has strategic agreements with Airbus; Lhyfe; Edison Motors; Phillips 66; Apex Clean Energy; BAE Systems; and Universal Hydrogen Co. The company was founded in 1997 and is headquartered in Latham, New York.",
    "ceo": "Mr. Andrew J. Marsh",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "3353",
    "phone": "518 782 7700",
    "address": "968 Albany Shaker Road",
    "city": "Latham",
    "state": "NY",
    "zip": "12110",
    "dcfDiff": 3.77527,
    "dcf": 19.6353,
    "image": "https://financialmodelingprep.com/image-stock/PLUG.png",
    "ipoDate": "1999-10-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]