[
  {
    "symbol": "PNC",
    "price": 123.56,
    "beta": 1.105985,
    "volAvg": 3623233,
    "mktCap": 49384705943,
    "lastDiv": 6,
    "range": "110.31-176.34",
    "changes": -0.45,
    "companyName": "The PNC Financial Services Group, Inc.",
    "currency": "USD",
    "cik": "0000713676",
    "isin": "US6934751057",
    "cusip": "693475105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.pnc.com",
    "description": "The PNC Financial Services Group, Inc. operates as a diversified financial services company in the United States. The company's Retail Banking segment offers checking, savings, and money market accounts, as well as certificates of deposit; residential mortgages, home equity loans and lines of credit, auto loans, credit cards, education loans, and personal and small business loans and lines of credit; and brokerage, insurance, and investment and cash management services. This segment serves consumer and small business customers through a network of branches, ATMs, call centers, and online and mobile banking channels. Its Corporate & Institutional Banking segment provides secured and unsecured loans, letters of credit, and equipment leases; cash and investment management services, receivables and disbursement management services, funds transfer services, international payment services, and access to online/mobile information management and reporting; foreign exchange, derivatives, fixed income, securities underwriting, loan syndications, and mergers and acquisitions and equity capital markets advisory related services; and commercial loan servicing and technology solutions. It serves mid-sized and large corporations, and government and not-for-profit entities. The company's Asset Management Group segment offers investment and retirement planning, customized investment management, credit and cash management solutions, and trust management and administration services for high net worth and ultra high net worth individuals, and their families; and multi-generational family planning services for ultra high net worth individuals and their families. It also provides outsourced chief investment officer, custody, private real estate, cash and fixed income client solutions, and fiduciary retirement advisory services for institutional clients. The company has 2,591 branches and 9,502 ATMs. The company was founded in 1852 and is headquartered in Pittsburgh, Pennsylvania.",
    "ceo": "Mr. William S. Demchak",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "59457",
    "phone": "888 762 2265",
    "address": "The Tower at PNC Plaza",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15222-2401",
    "dcfDiff": 192.122,
    "dcf": 355.292,
    "image": "https://financialmodelingprep.com/image-stock/PNC.png",
    "ipoDate": "1975-11-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]