[
  {
    "symbol": "PNM",
    "price": 45.04,
    "beta": 0.418309,
    "volAvg": 631012,
    "mktCap": 3866003716,
    "lastDiv": 1.47,
    "range": "44.35-49.6",
    "changes": -0.12,
    "companyName": "PNM Resources, Inc.",
    "currency": "USD",
    "cik": "0001108426",
    "isin": "US69349H1077",
    "cusip": "69349H107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.pnmresources.com",
    "description": "PNM Resources, Inc., through its subsidiaries, provides electricity and electric services in the United States. It operates through Public Service Company of New Mexico (PNM) and Texas-New Mexico Power Company (TNMP) segments. The PNM segment engages in the generation, transmission, and distribution of electricity. The segment generates electricity using coal, natural gas and oil, nuclear fuel, solar, wind, and geothermal energy sources. As of December 31, 2021, this segment had owned or leased facilities with a total net generation capacity of 2,168 megawatts; and owned 3,426 miles of electric transmission lines, 5,751 miles of distribution overhead lines, 5,765 miles of underground distribution lines, and 250 substations. The segment also owns and leases communication, office and other equipment, office space, vehicles, and real estate. The TNMP segment provides regulated transmission and distribution services. As of December 31, 2021, the segment owned 983 miles of overhead electric transmission lines, 7,297 miles of overhead distribution lines, 1,408 miles of underground distribution lines, and 113 substations. The segment also owns and leases vehicles, service facilities, and office locations throughout its service territory. The company serves approximately 806,000 residential, commercial, and industrial customers and end-users of electricity in New Mexico and Texas. PNM Resources, Inc. was incorporated in 1882 and is headquartered in Albuquerque, New Mexico.",
    "ceo": "Ms. Patricia K. Vincent-Collawn",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "1537",
    "phone": "505 241 2700",
    "address": "414 Silver Avenue SW",
    "city": "Albuquerque",
    "state": "NM",
    "zip": "87102-3289",
    "dcfDiff": 0.897178,
    "dcf": 48.3928,
    "image": "https://financialmodelingprep.com/image-stock/PNM.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]