[
  {
    "symbol": "PNR",
    "price": 62.39,
    "beta": 1.12007,
    "volAvg": 1221929,
    "mktCap": 10291230500,
    "lastDiv": 0.88,
    "range": "38.55-63.17",
    "changes": -0.31,
    "companyName": "Pentair plc",
    "currency": "USD",
    "cik": "0000077360",
    "isin": "IE00BLS09M33",
    "cusip": "G7S00T104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.pentair.com",
    "description": "Pentair plc provides various water solutions worldwide. It operates through Consumer Solutions; and Industrial & Flow Technologies segments. The Consumer Solutions segment designs, manufactures, and sells residential and commercial pool equipment and accessories, including pumps, filters, heaters, lights, automatic controls, automatic cleaners, maintenance equipment, and pool accessories for residential and commercial pool maintenance, repair, renovation, service, and construction applications; and water treatment products and systems comprising pressure tanks, control valves, activated carbon products, conventional filtration products, and point-of-entry and point-of-use systems for the use in residential whole home water filtration, drinking water filtration, and water softening solutions, as well as in commercial total water management and filtration in foodservice operations. It offers its products under the Everpure, Ken's Beverage, Kreepy Krauly, Pentair Water Solutions, Pleatco, RainSoft, and Sta-Rite brands. The Industrial & Flow Technologies segment manufactures and sells fluid treatment products, such as advanced membrane filtration products, separation systems, and membrane bioreactors; water supply and disposal, solid handling, fluid transfer, and turbine pumps; and valves, spray nozzles, process filtration systems, and gas recovery solutions for food and beverage, fluid separation technologies, water and wastewater treatment, water wells, pressure boosting, fire suppression, flood control, agricultural irrigation, crop spray, fluid circulation and transfer, fluid delivery, ion exchange, desalination, residential and municipal wells, and wastewater solids handling applications. It offers its products under the Pentair, Aurora, Berkeley, Codeline, Fairbanks-Nijhuis, Haffmans, Hydromatic, Hypro, Jung Pumpen, Myers, Sta-Rite, Shurflo, Südmo, and X-Flow brands. Pentair plc was founded in 1966 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. John L. Stauch",
    "sector": "Industrials",
    "country": "GB",
    "fullTimeEmployees": "11250",
    "phone": "44 74 9421 6154",
    "address": "Regal House",
    "city": "London",
    "state": null,
    "zip": "TW13 QS",
    "dcfDiff": 5.98616,
    "dcf": 45.5438,
    "image": "https://financialmodelingprep.com/image-stock/PNR.png",
    "ipoDate": "1973-05-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]