[
  {
    "symbol": "POOL",
    "price": 370.12,
    "beta": 0.936971,
    "volAvg": 412659,
    "mktCap": 14448818584,
    "lastDiv": 4.4,
    "range": "278.1-423.97",
    "changes": 3.92,
    "companyName": "Pool Corporation",
    "currency": "USD",
    "cik": "0000945841",
    "isin": "US73278L1052",
    "cusip": "73278L105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Industrial Distribution",
    "website": "https://www.poolcorp.com",
    "description": "Pool Corporation distributes swimming pool supplies, equipment, and related leisure products in the United States and internationally. The company offers maintenance products, including chemicals, supplies, and pool accessories; repair and replacement parts for pool equipment, such as cleaners, filters, heaters, pumps, and lights; fiberglass pools, and hot tubs and packaged pool kits comprising walls, liners, braces, and coping for in-ground and above-ground pools; pool equipment and components for new pool construction and the remodeling of existing pools; and irrigation and related products consisting of irrigation system components, and professional lawn care equipment and supplies. It also provides building materials, such as concrete, plumbing and electrical components, functional and decorative pool surfaces, decking materials, tiles, hardscapes, and natural stones for pool installations and remodeling; and commercial products, including heaters, safety equipment, and commercial pumps and filters. In addition, the company offers other pool construction and recreational products comprising discretionary recreational and related outdoor living products, such as grills and components for outdoor kitchens. It serves swimming pool remodelers and builders; specialty retailers that sell swimming pool supplies; swimming pool repair and service businesses; irrigation construction and landscape maintenance contractors; and commercial customers that serve hotels, universities, and community recreational facilities. As of March 03, 2022, the company operated 410 sales centers in North America, Europe, and Australia. Pool Corporation was incorporated in 1993 and is headquartered in Covington, Louisiana.",
    "ceo": "Mr. Peter D. Arvan",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "6000",
    "phone": "985 892 5521",
    "address": "109 Northpark Boulevard",
    "city": "Covington",
    "state": "LA",
    "zip": "70433-5001",
    "dcfDiff": 58.5523,
    "dcf": 320.838,
    "image": "https://financialmodelingprep.com/image-stock/POOL.png",
    "ipoDate": "1995-10-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]