[
  {
    "symbol": "POST",
    "price": 85.27,
    "beta": 0.646478,
    "volAvg": 410754,
    "mktCap": 5435118327,
    "lastDiv": 0,
    "range": "80.39-98.84",
    "changes": -1.07,
    "companyName": "Post Holdings, Inc.",
    "currency": "USD",
    "cik": "0001530950",
    "isin": "US7374461041",
    "cusip": "737446104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaged Foods",
    "website": "https://www.postholdings.com",
    "description": "Post Holdings, Inc. operates as a consumer packaged goods holding company in the United States and internationally. It operates through five segments: Post Consumer Brands, Weetabix, Foodservice, Refrigerated Retail, and BellRing Brands. The Post Consumer Brands segment manufactures, markets, and sells branded and private label ready-to-eat (RTE) cereal and hot cereal products. It serves grocery stores, mass merchandise customers, supercenters, club stores, natural/specialty stores, and drug store customers, as well as sells its products in the military, ecommerce, and foodservice channels. The Weetabix segment primarily markets and distributes branded and private label RTE cereal, hot cereals and other cereal-based food products, breakfast drinks, and muesli. This segment sells its products to grocery stores, discounters, wholesalers, and convenience stores, as well as through ecommerce. The Foodservice segment produces and distributes egg and potato products in the foodservice and food ingredient channels. It serves foodservice distributors and national restaurant chains. The Refrigerated Retail segment produces and distributes side dishes, eggs and egg products, sausages, cheese, and other dairy and refrigerated products for grocery stores and mass merchandise customers. The BellRing Brands segment markets and distributes ready-to-drink (RTD) protein shakes, other RTD beverages, powders, nutrition bars, and supplements. It serves club stores, food, drug and mass customers, and online retailers, as well as specialty retailers, convenience stores, and distributors. Post Holdings, Inc. was founded in 1895 and is headquartered in Saint Louis, Missouri.",
    "ceo": "Mr. Robert V. Vitale",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "10420",
    "phone": "314 644 7600",
    "address": "2503 South Hanley Road",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63144",
    "dcfDiff": 13.913,
    "dcf": 104.983,
    "image": "https://financialmodelingprep.com/image-stock/POST.png",
    "ipoDate": "2012-01-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]