[
  {
    "symbol": "POWI",
    "price": 91.48,
    "beta": 1.17183,
    "volAvg": 423409,
    "mktCap": 5246496924,
    "lastDiv": 0.76,
    "range": "59.16-94.9",
    "changes": -0.44,
    "companyName": "Power Integrations, Inc.",
    "currency": "USD",
    "cik": "0000833640",
    "isin": "US7392761034",
    "cusip": "739276103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.power.com",
    "description": "Power Integrations, Inc. designs, develops, manufactures, and markets analog and mixed-signal integrated circuits (ICs), and other electronic components and circuitry used in high-voltage power conversion worldwide. The company provides a range of alternating current to direct current power conversion products that address power supply ranging from less than one watt of output to approximately 500 watts of output for mobile-device chargers, consumer appliances, utility meters, LCD monitors, main and standby power supplies for desktop computers and TVs, LED lighting, and various other consumer and industrial applications, as well as power conversion in high-power applications comprising industrial motors, solar and wind-power systems, electric vehicles, and high-voltage DC transmission systems. It also offers high-voltage diodes; high-voltage gate-driver products used to operate high-voltage switches, such as insulated-gate bipolar transistors and silicon-carbide MOSFETs under the SCALE and SCALE-2 product-family names; and SCALE-iDriver for use in powertrain and charging applications for electric vehicles. In addition, the company provides motor-driver ICs for use in refrigerator compressors, ceiling fans, and air purifiers, as well as pumps, fans, and blowers used in consumer appliances, such as dishwashers and laundry machines. It serves communications, computer, consumer, and industrial markets. The company sells its products to original equipment manufacturers and merchant power supply manufacturers through direct sales force, as well as a network of independent sales representatives and distributors. Power Integrations, Inc. was incorporated in 1988 and is headquartered in San Jose, California.",
    "ceo": "Mr. Balu  Balakrishnan",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "831",
    "phone": "408 414 9200",
    "address": "5245 Hellyer Avenue",
    "city": "San Jose",
    "state": "CA",
    "zip": "95138-1002",
    "dcfDiff": 10.3476,
    "dcf": 77.0224,
    "image": "https://financialmodelingprep.com/image-stock/POWI.png",
    "ipoDate": "1997-12-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]