[
  {
    "symbol": "PPBI",
    "price": 20.78,
    "beta": 1.18345,
    "volAvg": 670282,
    "mktCap": 1990724000,
    "lastDiv": 1.32,
    "range": "17.53-37.5",
    "changes": -0.15,
    "companyName": "Pacific Premier Bancorp, Inc.",
    "currency": "USD",
    "cik": "0001028918",
    "isin": "US69478X1054",
    "cusip": "69478X105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.ppbi.com",
    "description": "Pacific Premier Bancorp, Inc. operates as the bank holding company for Pacific Premier Bank that provides banking services to businesses, professionals, real estate investors, and non-profit organizations. The company accepts deposit products, such as checking, money market, and savings accounts; and certificates of deposit. Its loan portfolio includes commercial real estate owner and non-owner-occupied, multifamily, construction and land, franchise real estate secured, small business administration (SBA), and SBA paycheck protection program loans; revolving lines or credit, term loans, seasonal loans, and loans secured by liquid collateral; one-to-four family and home equity lines of credit loans; and savings account secured loans and auto loans. The company also offers cash management, electronic banking, treasury management, and online bill payment services. It operates 61 full-service depository branches located in Arizona, California, Nevada, Oregon, and Washington. Pacific Premier Bancorp, Inc. was founded in 1983 and is headquartered in Irvine, California.",
    "ceo": "Mr. Steven R. Gardner",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1430",
    "phone": "949 864 8000",
    "address": "17901 Von Karman Avenue",
    "city": "Irvine",
    "state": "CA",
    "zip": "92614",
    "dcfDiff": 8.36835,
    "dcf": 39.3883,
    "image": "https://financialmodelingprep.com/image-stock/PPBI.png",
    "ipoDate": "1997-06-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]