[
  {
    "symbol": "PPERY",
    "price": 13.9,
    "beta": 0.578424,
    "volAvg": 65166,
    "mktCap": 32433285888,
    "lastDiv": 0.71,
    "range": "9.27-15.36",
    "changes": 0.2,
    "companyName": "PT Bank Mandiri (Persero) Tbk",
    "currency": "USD",
    "cik": "0001461748",
    "isin": null,
    "cusip": "69367U105",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://bankmandiri.co.id",
    "description": "PT Bank Mandiri (Persero) Tbk provides various banking products and services to individuals and businesses in Indonesia, Singapore, Hong Kong, Timor Leste, Shanghai, Malaysia, the United Kingdom, and the Cayman Islands. It offers savings and current accounts, time deposits, demand deposits, and foreign currency savings and current accounts; motorcycle loans, mortgage loan, and housing loans, as well as loans for various purposes, such as education, home renovation, marriage, health, and other needs for individuals; and working capital loans, investment loans, people's business loans, syndicated loans, and micro business loans for businesses. The company also provides investment products comprising mutual funds, stocks, and bond trading; life, health, and general insurance products; credit, debit, and corporate cards; e-banking services; digital lending; cash management services; trade finance services, value chain, supply chain management, global and domestic trade, export and import, standby letter of credit, and bank guarantee, as well as spot and forex services; custodial services; treasury services, including cash transaction/liquidity, hedging, and investment products; trust services comprising trustee, paying agent, security agent, escrow agent, monitoring agent, and receiving bank services; and money transfer, remittance services, and venture capital financing. As of 31 December 2021, it operated 2,609 branches, including 137 branch offices, 2,465 sub-branch offices, and 7 overseas branch offices; and 13,087 ATM facilities. The company was founded in 1998 and is headquartered in Jakarta, Indonesia.",
    "ceo": "Mr. Darmawan  Junaidi",
    "sector": "Financial Services",
    "country": "ID",
    "fullTimeEmployees": "38229",
    "phone": "62 21 526 5045",
    "address": "Plaza Mandiri",
    "city": "Jakarta",
    "state": null,
    "zip": "12190",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/PPERY.png",
    "ipoDate": "2009-08-14",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]