[
  {
    "symbol": "PPG",
    "price": 143.3,
    "beta": 1.175,
    "volAvg": 1482496,
    "mktCap": 33726801400,
    "lastDiv": 2.48,
    "range": "107.4-145.51",
    "changes": -1.13,
    "companyName": "PPG Industries, Inc.",
    "currency": "USD",
    "cik": "0000079879",
    "isin": "US6935061076",
    "cusip": "693506107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.ppg.com",
    "description": "PPG Industries, Inc. manufactures and distributes paints, coatings, and specialty materials worldwide. The company's Performance Coatings segment offers coatings, solvents, adhesives, sealants, sundries, and software for automotive and commercial transport/fleet repair and refurbishing, light industrial coatings, and specialty coatings for signs; and coatings, sealants, transparencies, transparent armor, adhesives, engineered materials, and packaging and chemical management services for commercial, military, regional jet, and general aviation aircraft. It also provides coatings and finishes for the protection of metals and structures, such as metal fabricators, heavy duty maintenance contractors, and manufacturers of ships, bridges, and rail cars; paints, wood stains, adhesives, and purchased sundries for painting and maintenance contractors, and consumers for decoration and maintenance of residential and commercial building structures; and paints, thermoplastics, pavement marking products, and other technologies for pavement marking. The company's Industrial Coatings segment offers coatings, adhesives and sealants, and metal pretreatments, as well as services and coatings applications for appliances, agricultural and construction equipment, consumer electronics, automotive parts and accessories, building products, kitchenware, and transportation vehicles and other finished products; and on-site coatings services. It also provides coatings for metal cans, closures, plastic tubes, and promotional and specialty packaging; amorphous precipitated silica for tire, battery separator, and other end-uses; TESLIN substrates for labels, e-passports, drivers' licenses, breathable membranes, and loyalty and identification cards; and organic light emitting diode materials, displays and lighting lens materials, optical lenses, color-change products, and photochromic dyes. The company was incorporated in 1883 and is headquartered in Pittsburgh, Pennsylvania.",
    "ceo": "Mr. Timothy M. Knavish",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "52000",
    "phone": "412-434-3131",
    "address": "One PPG Place",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15272",
    "dcfDiff": 5.90151,
    "dcf": 133.252,
    "image": "https://financialmodelingprep.com/image-stock/PPG.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]