[
  {
    "symbol": "PRFT",
    "price": 81.15,
    "beta": 1.553521,
    "volAvg": 209196,
    "mktCap": 2827119930,
    "lastDiv": 0,
    "range": "59.79-110.28",
    "changes": 0.02,
    "companyName": "Perficient, Inc.",
    "currency": "USD",
    "cik": "0001085869",
    "isin": "US71375U1016",
    "cusip": "71375U101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Information Technology Services",
    "website": "https://www.perficient.com",
    "description": "Perficient, Inc. provides digital consultancy services and solutions in the United States. The company offers strategy and consulting solutions in the areas of digital and technology strategy, management consulting, and organizational change management; and data and intelligence solutions in the areas of analytics, artificial intelligence and machine learning, big data, business intelligence, and custom product portfolio. It also provides blockchain, cloud, commerce, corporate performance management, customer relationship management, content management systems, customer experience platforms, custom application development, DevOps, enterprise resource planning, integration and APIs, intelligent automation, Internet of Things, mobile, portals and collaboration, supply chain, product information management, and order management systems. In addition, the company offers analytics, content architecture, conversion rate optimization, creative design, email marketing, journey sciences, paid media and search, marketing automation research, SEO, and social media services; product development services, as well as a suite of proprietary products; and optimized global delivery solutions. It serves the healthcare, financial services, retail and consumer goods, manufacturing, automotive and transportation, telecommunications, energy and utilities, and life science markets. Perficient, Inc. was incorporated in 1997 and is headquartered in St. Louis, Missouri.",
    "ceo": "Mr. Jeffrey S. Davis",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "6893",
    "phone": "314 529 3600",
    "address": "555 Maryville University Drive",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63141",
    "dcfDiff": 5.81992,
    "dcf": 68.6501,
    "image": "https://financialmodelingprep.com/image-stock/PRFT.png",
    "ipoDate": "1999-07-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]