[
  {
    "symbol": "PRGO",
    "price": 33.23,
    "beta": 0.810915,
    "volAvg": 1044850,
    "mktCap": 4496882980,
    "lastDiv": 1.09,
    "range": "30.78-43.9",
    "changes": -0.08,
    "companyName": "Perrigo Company plc",
    "currency": "USD",
    "cik": "0001585364",
    "isin": "IE00BGH1M568",
    "cusip": "G97822103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.perrigo.com",
    "description": "Perrigo Company plc provides over-the-counter (OTC) health and wellness solutions that enhance individual well-being by empowering consumers to prevent or treat conditions that can be self-managed. The company operates through two segments, Consumer Self-Care Americas and Consumer Self-Care International. The Consumer Self-Care Americas segment focuses primarily on the development, manufacture, marketing, and sale of store brand, self-care products in categories, including upper respiratory, pain and sleep-aids, digestive health, nutrition, vitamins, minerals and supplements, healthy lifestyle, skincare and personal hygiene, and oral self-care in the United States, Mexico, Canada, and South America. The segment offers its products under the Prevacid 24HR, Good Sense, Zephrex D, ScarAway, Plackers, Rembrandt, Steripod, Firefly, REACH, Dr. Fresh, and Burt's Bees brand names. The Consumer Self-Care International segment develops, manufactures, markets, and distributes consumer self-care brands through a network of pharmacies, wholesalers, drug and grocery store retailers, and para-pharmacies in approximately 23 countries, primarily in Europe. The company also offers contract manufacturing services. Perrigo Company plc was founded in 1887 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Murray S. Kessler",
    "sector": "Healthcare",
    "country": "IE",
    "fullTimeEmployees": "8900",
    "phone": "353 1 709 4000",
    "address": "The Sharp Building",
    "city": "Dublin",
    "state": null,
    "zip": "2",
    "dcfDiff": 8.58581,
    "dcf": 45.7858,
    "image": "https://financialmodelingprep.com/image-stock/PRGO.png",
    "ipoDate": "1991-12-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]