[
  {
    "symbol": "PRI",
    "price": 194.65,
    "beta": 1.184507,
    "volAvg": 139064,
    "mktCap": 7051429830,
    "lastDiv": 2.6,
    "range": "115.03-196.66",
    "changes": 0.51,
    "companyName": "Primerica, Inc.",
    "currency": "USD",
    "cik": "0001475922",
    "isin": "US74164M1080",
    "cusip": "74164M108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Life",
    "website": "https://www.primerica.com",
    "description": "Primerica, Inc., together with its subsidiaries, provides financial products to middle-income households in the United States and Canada. The company operates in four segments: Term Life Insurance; Investment and Savings Products; Senior Health; and Corporate and Other Distributed Products. The Term Life Insurance segment underwrites individual term life insurance products. The Investment and Savings Products segment provides mutual funds and various retirement plans, managed investments, variable and fixed annuities, and fixed indexed annuities. The Senior Health segment offers segregated funds; and medicare advantage and supplement products. The Corporate and Other Distributed Products segment provides mortgage loans; prepaid legal services that assist subscribers with legal matters, such as drafting wills, living wills and powers of attorney, trial defense, and motor vehicle-related matters; ID theft defense services; auto and homeowners' insurance; home automation solutions; and insurance products, including supplemental health, accidental death, and disability for small businesses. It distributes and sells its products through a network of 129,515 licensed sales representatives. Primerica, Inc. was founded in 1927 and is headquartered in Duluth, Georgia.",
    "ceo": "Mr. Glenn Jackson Williams",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2646",
    "phone": "770 381 1000",
    "address": "1 Primerica Parkway",
    "city": "Duluth",
    "state": "GA",
    "zip": "30099",
    "dcfDiff": 2.08028,
    "dcf": 156.4,
    "image": "https://financialmodelingprep.com/image-stock/PRI.png",
    "ipoDate": "2010-04-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]