[
  {
    "symbol": "PRMW",
    "price": 12.61,
    "beta": 1.135642,
    "volAvg": 908090,
    "mktCap": 2006692451,
    "lastDiv": 0.32,
    "range": "12.15-16.47",
    "changes": -0.07,
    "companyName": "Primo Water Corporation",
    "currency": "USD",
    "cik": "0000884713",
    "isin": "CA74167P1080",
    "cusip": "74167P108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Beverages—Non-Alcoholic",
    "website": "https://primowatercorp.com",
    "description": "Primo Water Corporation provides water direct to consumers and water filtration services in North America and Europe. It offers bottled water, purified bottled water, premium spring, sparkling and flavored water, mineral water, filtration equipment, and coffee; as well as water dispensers, and self-service refill drinking water. The company offers its products under the Primo, Alhambra, Crystal Rock, Mountain Valley, Deep Rock, Hinckley Springs, Crystal Springs, Kentwood Springs, Mount Olympus, Pureflo, Nursery, Sierra Springs, Sparkletts, Clear Mountain Natural Spring Water, Earth2O, Renü, Water Event Pure Water Solutions, Canadian Springs, Labrador Source, Decantae, Eden, Eden Springs, Chateaud'eau, and Mey Eden brands. It provides its services to residential customers, small and medium-sized businesses, and regional and national corporations and retailers. The company was formerly known as Cott Corporation and changed its name to Primo Water Corporation in March 2020. Primo Water Corporation was incorporated in 1955 and is headquartered in Tampa, Florida.",
    "ceo": "Mr. Thomas J. Harrington",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "9240",
    "phone": "813 313 1732",
    "address": "4221 West Boy Scout Boulevard",
    "city": "Tampa",
    "state": "FL",
    "zip": "33607",
    "dcfDiff": 0.398617,
    "dcf": 15.9286,
    "image": "https://financialmodelingprep.com/image-stock/PRMW.png",
    "ipoDate": "1992-06-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]