[
  {
    "symbol": "PRTA",
    "price": 70,
    "beta": 0.360211,
    "volAvg": 465427,
    "mktCap": 3692626000,
    "lastDiv": 0,
    "range": "25.02-79.65",
    "changes": 1.43,
    "companyName": "Prothena Corporation plc",
    "currency": "USD",
    "cik": "0001559053",
    "isin": "IE00B91XRN20",
    "cusip": "G72800108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.prothena.com",
    "description": "Prothena Corporation plc, a late-stage clinical company, focuses on discovery and development of novel therapies for life-threatening diseases in the United States. The company is involved in developing Birtamimab, an investigational humanized antibody that is in Phase III clinical trial for the treatment of AL amyloidosis; Prasinezumab, a humanized monoclonal antibody, which is in Phase IIb clinical trial for the treatment of Parkinson's disease; PRX004 that completed Phase I clinical trial for the treatment of Transthyretin amyloidosis; and PRX005, which is in Phase I clinical trial for the treatment of Alzheimer's disease. Its discovery and preclinical programs include PRX012 for the treatment of Alzheimer's disease; and dual Aß-Tau vaccine for the treatment and prevention of Alzheimer's disease. Prothena Corporation plc has a license, development, and commercialization agreement with F. Hoffmann-La Roche Ltd. and Hoffmann-La Roche Inc. to develop and commercialize antibodies that target alpha-synuclein; and a collaboration agreement with Bristol-Myers Squibb to develop antibodies. The company was founded in 2012 and is based in Dublin, Ireland.",
    "ceo": "Dr. Gene G. Kinney Ph.D.",
    "sector": "Healthcare",
    "country": "IE",
    "fullTimeEmployees": "127",
    "phone": "353 1 236 2500",
    "address": "77 Sir John Rogerson’s Quay",
    "city": "Dublin",
    "state": null,
    "zip": "2",
    "dcfDiff": 14.909,
    "dcf": 72.029,
    "image": "https://financialmodelingprep.com/image-stock/PRTA.png",
    "ipoDate": "2012-12-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]