[
  {
    "symbol": "PRU",
    "price": 86.29,
    "beta": 1.386267,
    "volAvg": 2280730,
    "mktCap": 31495850000,
    "lastDiv": 5,
    "range": "75.37-110.96",
    "changes": -0.37,
    "companyName": "Prudential Financial, Inc.",
    "currency": "USD",
    "cik": "0001137774",
    "isin": "US7443201022",
    "cusip": "744320102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Life",
    "website": "https://www.prudential.com",
    "description": "Prudential Financial, Inc., together with its subsidiaries, provides insurance, investment management, and other financial products and services in the United States and internationally. It operates through eight segments: PGIM, Retirement, Group Insurance, Individual Annuities, Individual Life, Assurance IQ, International Businesses, and Closed Block. The company offers investment management services and solutions related to public fixed income, public equity, real estate debt and equity, private credit and other alternatives, and multi-asset class strategies to institutional and retail clients, as well as its general account. It also provides a range of retirement investment, and income products and services to retirement plan sponsors in the public, private, and not-for-profit sectors; and group life, long-term and short-term group disability, and group corporate-, bank-, and trust-owned life insurance in the United States, primarily to institutional clients for use in connection with employee and membership benefits plans, as well as sells accidental death and dismemberment, and other supplemental health solutions; and provides plan administration services in connection with its insurance coverages. In addition, the company develops and distributes individual variable and fixed annuity products, principally to the mass affluent and affluent markets; and individual variable, term, and universal life insurance products to the mass middle, mass affluent, and affluent markets in the United States. Further, it provides third-party life, health, Medicare, property and casualty, and term life products to retail shoppers through its digital and independent agent channels. The company offers its products and services to individual and institutional customers through its proprietary and third-party distribution networks. Prudential Financial, Inc. was founded in 1875 and is headquartered in Newark, New Jersey.",
    "ceo": "Mr. Charles Frederick Lowrey Jr.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "39583",
    "phone": "973 802 6000",
    "address": "751 Broad Street",
    "city": "Newark",
    "state": "NJ",
    "zip": "07102",
    "dcfDiff": 36.5177,
    "dcf": 140.018,
    "image": "https://financialmodelingprep.com/image-stock/PRU.png",
    "ipoDate": "2001-12-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]