[
  {
    "symbol": "PRVA",
    "price": 27.49,
    "beta": 0.767057,
    "volAvg": 1931732,
    "mktCap": 3179548380,
    "lastDiv": 0,
    "range": "20.64-44.64",
    "changes": 1.53,
    "companyName": "Privia Health Group, Inc.",
    "currency": "USD",
    "cik": "0001759655",
    "isin": "US74276R1023",
    "cusip": "74276R102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Health Information Services",
    "website": "https://www.priviahealth.com",
    "description": "Privia Health Group, Inc. operates as a national physician-enablement company in the United States. The company collaborates with medical groups, health plans, and health systems to optimize physician practices, enhance patient experiences, and reward doctors for delivering care in-person and virtual settings. It offers technology and population health tools to enhance independent providers' workflows; management services organization that enable providers to focus on their patients by reducing administrative work; single-TIN medical group that facilitates payer negotiation, clinical integration and alignment of financial incentives; accountable care organization, which engage patients, reduce inappropriate utilization, and enhance coordination and patient quality metrics to drive value-based care; and network for purchasers and payers that enable providers to connect with new patient populations and create custom contracts. The company was founded in 2007 and is headquartered in Arlington, Virginia. Privia Health Group, Inc. was a former subsidiary of Brighton Health Group Holdings, LLC.",
    "ceo": "Mr. Matthew Shawn Morris",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "964",
    "phone": "571 366 8850",
    "address": "950 North Glebe Road",
    "city": "Arlington",
    "state": "VA",
    "zip": "22203",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/PRVA.png",
    "ipoDate": "2021-04-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]