[
  {
    "symbol": "PSN",
    "price": 47.74,
    "beta": 0.827597,
    "volAvg": 444912,
    "mktCap": 5005873180,
    "lastDiv": 0,
    "range": "38.67-50.15",
    "changes": -0.11,
    "companyName": "Parsons Corporation",
    "currency": "USD",
    "cik": "0000275880",
    "isin": "US70202L1026",
    "cusip": "70202L102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.parsons.com",
    "description": "Parsons Corporation provides integrated solutions and services in the defense, intelligence, and critical infrastructure markets in North America, the Middle East, and internationally. It operates through two segments, Federal Solutions and Critical Infrastructure. The company offers cyber security and intelligence services, as well as offensive and defensive cybersecurity platforms, tools, and operations to the U.S. Department of Defense and the United States intelligence community; space and geospatial solutions, such as geospatial intelligence, threat analytics, space situational awareness, small satellite launch and integration, satellite ground systems, fight dynamics, and command, and control solutions to the National Geospatial-Intelligence Agency, National Reconnaissance Office, and multiple units within the U.S. Department of Defense. It also provides missile defense and C5ISR solutions, such as integrated air and missile defense, data fusion and analytics, platform system integration, directed energy, joint all-domain operations, and command and control systems to Defense Intelligence Agency and the U.S. Department of Defense; technology services for energy production systems, aviation, healthcare and bio-surveillance systems, and environmental systems and associated infrastructure, as well as nuclear waste processing and treatment, weapons of mass destruction elimination, program and project management, infectious disease control analytics, and data protection solutions. In addition, the company offers intelligent transportation system management, aviation, rail and transit systems, smart cities software, and critical infrastructure cyber protection to the transportation authorities, rail, and transit entities; engineering services for infrastructure; and program management, and environmental solutions to private-sector industrial clients and public utilities. Parsons Corporation was founded in 1944 and is headquartered in Centreville, Virginia.",
    "ceo": "Ms. Carey A. Smith",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "17000",
    "phone": "703 988 8500",
    "address": "5875 Trinity Parkway",
    "city": "Centreville",
    "state": "VA",
    "zip": "21120",
    "dcfDiff": 9.66529,
    "dcf": 52.4753,
    "image": "https://financialmodelingprep.com/image-stock/PSN.png",
    "ipoDate": "2019-05-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]