[
  {
    "symbol": "PSO",
    "price": 10.47,
    "beta": 0.30498,
    "volAvg": 412712,
    "mktCap": 7498142934,
    "lastDiv": 0.26,
    "range": "8.84-12.03",
    "changes": -0.07,
    "companyName": "Pearson plc",
    "currency": "USD",
    "cik": "0000938323",
    "isin": "US7050151056",
    "cusip": "705015105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Publishing",
    "website": "https://plc.pearson.com",
    "description": "Pearson plc provides educational courseware, assessments, and services in the United Kingdom, the United States, Canada, the Asia Pacific, other European countries, and internationally. It operates through five segments: Assessment & Qualifications, Virtual Learning, English Language Learning, Higher Education, and Workforce Skills. The Assessment & Qualifications segment offers Pearson VUE, US student assessment, clinical assessment, UK GCSE, and A levels and international academic qualifications. The Virtual Learning segment provides virtual schools and online program management services. The English Language Learning segment offers Pearson test of English, institutional courseware, and English online solutions. The Higher Education segment provides the US, Canadian, and international higher education courseware businesses. The Workforce Skills offers BTEC, GED, TalentLens, Faethm, Pearson college, and apprenticeships. Pearson plc was founded in 1844 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. Adam  Bird CBE",
    "sector": "Communication Services",
    "country": "GB",
    "fullTimeEmployees": "20169",
    "phone": "44 20 7010 2000",
    "address": "80 Strand",
    "city": "London",
    "state": null,
    "zip": "WC2R 0RL",
    "dcfDiff": 1.50436,
    "dcf": 12.8644,
    "image": "https://financialmodelingprep.com/image-stock/PSO.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]