[
  {
    "symbol": "PSTG",
    "price": 35.86,
    "beta": 1.207042,
    "volAvg": 4890214,
    "mktCap": 11028133093,
    "lastDiv": 0,
    "range": "22.14-38.36",
    "changes": -0.05,
    "companyName": "Pure Storage, Inc.",
    "currency": "USD",
    "cik": "0001474432",
    "isin": "US74624M1027",
    "cusip": "74624M102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Computer Hardware",
    "website": "https://www.purestorage.com",
    "description": "Pure Storage, Inc. provides data storage technologies, products, and services in the United States and internationally. The company's Purity software is shared across its products and provides enterprise-class data services, such as data reduction, data protection, and encryption, as well as storage protocols, including block, file, and object. Its products portfolio includes FlashArray for block-oriented storage, addressing databases, applications, virtual machines, and other traditional workloads; FlashArray//XL; and FlashArray//C, an all-QLC flash array. The company also provides FlashBlade, a solution for unstructured data workloads of various types; FlashStack that combines compute, network, and storage to provide an infrastructure platform; FlashRecover, an all-flash modern data-protection solution; and AIRI, a full-stack AI-ready infrastructure. In addition, it offers evergreen storage subscription, Pure as-a-Service, and Cloud Block Store, as well as Portworx a cloud-native Kubernetes data management solution It also offers technical and professional, training and education, and certification services. The company sells its products and subscription services through direct sales force and channel partners. The company was formerly known as OS76, Inc. and changed its name to Pure Storage, Inc. in January 2010. Pure Storage, Inc. was incorporated in 2009 and is headquartered in Mountain View, California.",
    "ceo": "Mr. Charles H. Giancarlo",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "5200",
    "phone": "800 379 7873",
    "address": "650 Castro Street",
    "city": "Mountain View",
    "state": "CA",
    "zip": "94041",
    "dcfDiff": 3.78074,
    "dcf": 32.0807,
    "image": "https://financialmodelingprep.com/image-stock/PSTG.png",
    "ipoDate": "2015-10-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]