[
  {
    "symbol": "PSX",
    "price": 93.4,
    "beta": 1.376408,
    "volAvg": 3373753,
    "mktCap": 42857712294,
    "lastDiv": 4.2,
    "range": "74.02-113.53",
    "changes": 0.83,
    "companyName": "Phillips 66",
    "currency": "USD",
    "cik": "0001534701",
    "isin": "US7185461040",
    "cusip": "718546104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Refining & Marketing",
    "website": "https://www.phillips66.com",
    "description": "Phillips 66 operates as an energy manufacturing and logistics company. It operates through four segments: Midstream, Chemicals, Refining, and Marketing and Specialties (M&S). The Midstream segment transports crude oil and other feedstocks; delivers refined petroleum products to market; provides terminaling and storage services for crude oil and refined petroleum products; transports, stores, fractionates, exports, and markets natural gas liquids; provides other fee-based processing services; and gathers, processes, transports, and markets natural gas. The Chemicals segment produces and markets ethylene and other olefin products; aromatics and styrenics products, such as benzene, cyclohexane, styrene, and polystyrene; and various specialty chemical products, including organosulfur chemicals, solvents, catalysts, and chemicals used in drilling and mining. The Refining segment refines crude oil and other feedstocks into petroleum products, such as gasolines, distillates, aviation, and renewable fuels at 12 refineries in the United States and Europe. The M&S segment purchases for resale and markets refined petroleum products, including gasolines, distillates, and aviation fuels primarily in the United States and Europe. This segment also manufactures and markets specialty products, such as base oils and lubricants. The company was founded in 1875 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Mark E. Lashier",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "13000",
    "phone": "281 293 6600",
    "address": "2331 CityWest Boulevard",
    "city": "Houston",
    "state": "TX",
    "zip": "77042",
    "dcfDiff": 7.44636,
    "dcf": 116.176,
    "image": "https://financialmodelingprep.com/image-stock/PSX.png",
    "ipoDate": "2012-04-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]