[
  {
    "symbol": "PTC",
    "price": 140.64,
    "beta": 1.186971,
    "volAvg": 755943,
    "mktCap": 16645165920,
    "lastDiv": 0,
    "range": "97.97-144.56",
    "changes": 0.87,
    "companyName": "PTC Inc.",
    "currency": "USD",
    "cik": "0000857005",
    "isin": "US69370C1009",
    "cusip": "69370C100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.ptc.com",
    "description": "PTC Inc. operates as software and services company in the Americas, Europe, and the Asia Pacific. The company operates in two segments, Software Products and Professional Services. It offers ThingWorx platform, which offers a set of capabilities that enable enterprises to digitally transform every aspect of their business with innovative solutions that are simple to create, easy to implement, scalable to meet future needs, and designed to enable customers to accelerate time to value; and Vuforia, which enables the visualization of digital information in a physical context and the creation of AR. The company also provides Onshape, a software-as-a-service product development platform unites computer-aided design with data management, collaboration tools, and real-time analytics; Arena, a PLM solution enables product teams to collaborate virtually anytime and anywhere; Creo, a 3D CAD technology enables the digital design, testing, and modification of product models; and Windchill, a product lifecycle management software. In addition, it offers Integrity, an application lifecycle management solution; Servigistics, service parts management solution; and consulting, implementation, training, cloud, and license and support services. The company was formerly known as Parametric Technology Corporation and changed its name to PTC Inc. in January 2013. PTC Inc. was incorporated in 1985 and is headquartered in Boston, Massachusetts.",
    "ceo": "Mr. James E. Heppelmann",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "7084",
    "phone": "781 370 5000",
    "address": "121 Seaport Boulevard",
    "city": "Boston",
    "state": "MA",
    "zip": "02210",
    "dcfDiff": 9.12136,
    "dcf": 125.969,
    "image": "https://financialmodelingprep.com/image-stock/PTC.png",
    "ipoDate": "1989-12-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]