[
  {
    "symbol": "PTCT",
    "price": 41.5,
    "beta": 0.421126,
    "volAvg": 876554,
    "mktCap": 3078914216,
    "lastDiv": 0,
    "range": "33.25-59.84",
    "changes": 0.37,
    "companyName": "PTC Therapeutics, Inc.",
    "currency": "USD",
    "cik": "0001070081",
    "isin": "US69366J2006",
    "cusip": "69366J200",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.ptcbio.com",
    "description": "PTC Therapeutics, Inc., a biopharmaceutical company, focuses on the discovery, development, and commercialization of medicines to patients with rare disorders. Its portfolio pipeline includes commercial products and product candidates in various stages of development, including clinical, pre-clinical and research and discovery stages, focuses on the development of treatments for multiple therapeutic areas, such as rare diseases. The company offers Translarna and Emflaza for the treatment of Duchenne muscular dystrophy in the European Economic Area and the United States, as well as to treat nonsense mutation Duchenne muscular dystrophy in Brazil and Russia; commercializes Tegsedi and Waylivra for the treatment of rare diseases in Latin America and the Caribbean; and markets Evrysdi for the treatment of spinal muscular atrophy in adults and children two months and older in Brazil. The company's splicing platform includes PTC518, which is being developed for the treatment of Huntington's disease. PTC Therapeutics, Inc. has collaborations with F. Hoffman-La Roche Ltd and Hoffman-La Roche Inc., as well as the Spinal Muscular Atrophy Foundation to advance drug discovery and development research in regenerative medicine; and Akcea Therapeutics, Inc. to commercialize Tegsedi and Waylivra for the treatment of rare diseases in Latin America and the Caribbean. PTC Therapeutics, Inc. was incorporated in 1998 and is headquartered in South Plainfield, New Jersey.",
    "ceo": "Dr. Matthew B. Klein F.A.C.S., FACS, M.D., M.S., MS",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "1402",
    "phone": "908 222 7000",
    "address": "100 Corporate Court",
    "city": "South Plainfield",
    "state": "NJ",
    "zip": "07080",
    "dcfDiff": 3.5967,
    "dcf": 42.6533,
    "image": "https://financialmodelingprep.com/image-stock/PTCT.png",
    "ipoDate": "2013-06-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]