[
  {
    "symbol": "PTEN",
    "price": 11.84,
    "beta": 2.297183,
    "volAvg": 3785898,
    "mktCap": 2462648960,
    "lastDiv": 0.32,
    "range": "9.7-19.81",
    "changes": -0.005,
    "companyName": "Patterson-UTI Energy, Inc.",
    "currency": "USD",
    "cik": "0000889900",
    "isin": "US7034811015",
    "cusip": "703481101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Oil & Gas Drilling",
    "website": "https://www.patenergy.com",
    "description": "Patterson-UTI Energy, Inc., through its subsidiaries, provides onshore contract drilling services to oil and natural gas operators in the United States and internationally. It operates through three segments: Contract Drilling Services, Pressure Pumping Services, and Directional Drilling Services. The Contract Drilling Services segment markets its contract drilling services primarily in west Texas, Appalachia, Rockies, Oklahoma, South Texas, East Texas, and Colombia. As of December 31, 2021, this segment had a drilling fleet of 192 marketable land-based drilling rigs. The Pressure Pumping Services segment offers pressure pumping services that consist of well stimulation for the completion of new wells and remedial work on existing wells, as well as hydraulic fracturing, cementing, and acid pumping services in Texas and the Appalachian region. The Directional Drilling Services segment provides a suite of directional drilling services, including directional drilling and measurement-while-drilling services; supply and rental of downhole performance motors; and software and services that enhances the accuracy of directional and horizontal wellbores, wellbore quality, and on-bottom rate of penetration. It also services equipment to drilling contractors, as well as provides electrical controls and automation to the energy, marine, and mining industries in North America and other markets; and owns and invests in oil and natural gas assets as a non-operating working interest owner located principally in Texas and New Mexico. Patterson-UTI Energy, Inc. was founded in 1978 and is headquartered in Houston, Texas.",
    "ceo": "Mr. William Andrew Hendricks Jr.",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "6500",
    "phone": "281 765 7100",
    "address": "10713 West Sam Houston Parkway North",
    "city": "Houston",
    "state": "TX",
    "zip": "77064",
    "dcfDiff": 1.71508,
    "dcf": 18.4751,
    "image": "https://financialmodelingprep.com/image-stock/PTEN.png",
    "ipoDate": "1993-11-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]