[
  {
    "symbol": "PUBGY",
    "price": 20.24,
    "beta": 0.93908,
    "volAvg": 100227,
    "mktCap": 20123924086,
    "lastDiv": 0.78,
    "range": "10.47-21.18",
    "changes": -0.11,
    "companyName": "Publicis Groupe S.A.",
    "currency": "USD",
    "cik": "0001050952",
    "isin": "US74463M1062",
    "cusip": "74463M106",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Advertising Agencies",
    "website": "https://www.publicisgroupe.com",
    "description": "Publicis Groupe S.A. provides marketing, communications, and digital business transformation services in North America, Europe, the Asia Pacific, Latin America, Africa, and the Middle East. The company offers advisory services for brand strategy, and repositioning and their identity under the Publicis Worldwide, Saatchi & Saatchi, Leo Burnett, Marcel, Fallon, and BBH brands; online advertising services under the Razorfish and Moxie brand names; crisis communications, media relations, public affairs, financial communications, and strategy and event management services; media consulting, planning, and buying services; performance marketing services; and e-commerce services to optimize distribution channels. It also designs and delivers brand content for various channels, such as television, print, radio, cinema, and billboards, as well as digital, including display, social networks, Internet video, etc. under the Prodigious, Harbor, and The Pub brand names. In addition, the company operates Epsilon PeopleCloud, a unified data and technology platform; and Publicis Sapient, a technological, digital, and consulting platform for automotive, consumer products, energy and raw materials, retail, financial services, healthcare, media-telecoms, and travel and hospitality sectors. Further, it provides healthcare communication services under the Digitas Health, Publicis Health Media, and Saatchi & Saatchi Wellness brands for the healthcare and well-being sectors. The company serves clients in the non-food consumer products, finance, automotive, TMT, healthcare, food and beverage, leisure and travel, energy and industry, retail, and public and other sectors. Publicis Groupe S.A. was founded in 1926 and is headquartered in Paris, France.",
    "ceo": "Mr. Arthur  Sadoun",
    "sector": "Communication Services",
    "country": "FR",
    "fullTimeEmployees": "96356",
    "phone": "33 1 44 43 70 00",
    "address": "133, Avenue des Champs-ElysEes",
    "city": "Paris",
    "state": null,
    "zip": "75008",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/PUBGY.png",
    "ipoDate": "2000-09-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]