[
  {
    "symbol": "PVH",
    "price": 82.7,
    "beta": 2.109859,
    "volAvg": 1003103,
    "mktCap": 5186687630,
    "lastDiv": 0.15,
    "range": "43.49-94.51",
    "changes": -0.58,
    "companyName": "PVH Corp.",
    "currency": "USD",
    "cik": "0000078239",
    "isin": "US6936561009",
    "cusip": "693656100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Apparel Manufacturing",
    "website": "https://www.pvh.com",
    "description": "PVH Corp. operates as an apparel company worldwide. The company operates through six segments: Tommy Hilfiger North America, Tommy Hilfiger International, Calvin Klein North America, Calvin Klein International, Heritage Brands Wholesale, and Heritage Brands Retail. It designs, markets, and retails men's, women's, and children's apparel and accessories, including branded dress shirts, neckwear, sportswear, jeans wear, performance apparel, intimate apparel, underwear, swimwear, swim-related products, handbags, accessories, footwear, outerwear, home furnishings, luggage products, sleepwear, loungewear, hats, scarves, gloves, socks, watches and jewelry, eyeglasses and non-ophthalmic sunglasses, fragrance, home bed and bath furnishings, small leather goods, and other products. The company offers its products under its own brands, such as Tommy Hilfiger, Calvin Klein, Van Heusen, IZOD, ARROW, Warner's, Olga, Geoffrey Beene, and True&Co., as well as various other owned, licensed, and private label brands. It also licenses its own brands over various products. The company distributes its products at wholesale in department, chain, and specialty stores, as well as through warehouse clubs, mass market, and off-price and independent retailers; and through company-operated full-price, outlet stores, and concession locations, as well as through digital commerce sites. It markets its products to approximately 40 countries. PVH Corp. was founded in 1881 and is based in New York, New York.",
    "ceo": "Mr. Stefan  Larsson",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "19000",
    "phone": "212 381 3500",
    "address": "285 Madison Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10017",
    "dcfDiff": 11.7392,
    "dcf": 76.2008,
    "image": "https://financialmodelingprep.com/image-stock/PVH.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]