[
  {
    "symbol": "PWR",
    "price": 193.72,
    "beta": 1.072887,
    "volAvg": 821350,
    "mktCap": 28123494720,
    "lastDiv": 0.32,
    "range": "117.53-195.14",
    "changes": -0.94,
    "companyName": "Quanta Services, Inc.",
    "currency": "USD",
    "cik": "0001050915",
    "isin": "US74762E1029",
    "cusip": "74762E102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Engineering & Construction",
    "website": "https://www.quantaservices.com",
    "description": "Quanta Services, Inc. provides specialty contracting services worldwide. The Electric Power Infrastructure Solutions segment engages in the design, procurement, construction, upgrade, repair, and maintenance of electric power transmission and distribution infrastructure and substation facilities; energized installation, maintenance, and upgrade of electric power infrastructure projects; installation of smart grid technologies on electric power networks; and design, installation, maintenance, and repair of commercial and industrial wirings. This segment also offers aviation services; emergency restoration services; and other engineering and technical services; design and construction solutions to wireline and wireless communications, cable multi-system operators, and other customers; and training for electric workers, as well as training for the gas distribution and communications industries. The Renewable Energy Infrastructure Solutions segment is the involved in engineering, procurement, construction, upgrade, repair, and maintenance services to renewable generation facilities, such as wind, solar, and hydropower generation facilities, as well as battery storage facilities; and provision of engineering and construction services for substations and switchyards, transmission, and other electrical infrastructures. The Underground Utility and Infrastructure Solutions segment offers design, engineering, construction, upgrade repair, and maintenance services to customers involved in the transportation, distribution, storage and processing of natural gas, oil, and other products; fabrication of pipeline support systems and related structures and facilities; and engineering and construction of pipeline and storage systems, and compressor and pump stations. The company was formerly known as Fabal Construction, Inc. and changed its name to Quanta Services, Inc. in November 1997. Quanta Services, Inc. was incorporated in 1997 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Earl C. Austin Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "47300",
    "phone": "713 629 7600",
    "address": "2800 Post Oak Boulevard",
    "city": "Houston",
    "state": "TX",
    "zip": "77056",
    "dcfDiff": 0.527603,
    "dcf": 150.528,
    "image": "https://financialmodelingprep.com/image-stock/PWR.png",
    "ipoDate": "1998-02-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]