[
  {
    "symbol": "PYCR",
    "price": 22.87,
    "beta": 0,
    "volAvg": 494433,
    "mktCap": 4037355633,
    "lastDiv": 0,
    "range": "20.5-34.95",
    "changes": -0.28,
    "companyName": "Paycor HCM, Inc.",
    "currency": "USD",
    "cik": "0001839439",
    "isin": "US70435P1021",
    "cusip": "70435P102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.paycor.com",
    "description": "Paycor HCM, Inc. provides software-as-a-service (SaaS) human capital management (HCM) solutions for small and medium-sized businesses (SMBs) primarily in the United States. It offers cloud-native platform to address the comprehensive people management needs of SMB leaders. The company's SaaS based people management products include Core HCM and Payroll, a calculation engine that enables real-time changes in payroll processing; Workforce Management, a solution with flexible time entry, overtime calculations, and scheduling capabilities with real-time payroll synchronization; Benefits Administration, a decision support solution to help leaders to streamline and optimize company's benefits administration; Talent Management, an integrated compensation and performance management solution; and Employee Engagement, a solution with interactive learning tools and AI-powered surveys. It serves manufacturing, healthcare, restaurant, retail, professional services, nonprofit, and education industries through its direct sales teams. The company was founded in 1990 and is headquartered in Cincinnati, Ohio.",
    "ceo": "Mr. Raul  Villar Jr.",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2300",
    "phone": "800 381 0053",
    "address": "4811 Montgomery Road",
    "city": "Cincinnati",
    "state": "OH",
    "zip": "45212",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/PYCR.png",
    "ipoDate": "2021-07-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]