[
  {
    "symbol": "QCOM",
    "price": 117.54,
    "beta": 1.257042,
    "volAvg": 8222506,
    "mktCap": 130939560000,
    "lastDiv": 3.2,
    "range": "101.47-156.66",
    "changes": -2.25,
    "companyName": "QUALCOMM Incorporated",
    "currency": "USD",
    "cik": "0000804328",
    "isin": "US7475251036",
    "cusip": "747525103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.qualcomm.com",
    "description": "QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. The company operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software based on 3G/4G/5G and other technologies for use in wireless voice and data communications, networking, application processing, multimedia, and global positioning system products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA,LTE and/or OFDMA-based 5G standards and their derivatives. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, and IoT, and investment for supporting the design and introduction of new products and services for voice and data communications, new industries, and applications. It also provides development, and other services and related products to the United States government agencies and their contractors. QUALCOMM Incorporated was incorpotared in 1985 and is headquartered in San Diego, California.",
    "ceo": "Mr. Cristiano Renno Amon",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "51000",
    "phone": "858 587 1121",
    "address": "5775 Morehouse Drive",
    "city": "San Diego",
    "state": "CA",
    "zip": "92121-1714",
    "dcfDiff": 7.00679,
    "dcf": 126.393,
    "image": "https://financialmodelingprep.com/image-stock/QCOM.png",
    "ipoDate": "1991-12-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]