[
  {
    "symbol": "QDEL",
    "price": 81.3,
    "beta": 0.287676,
    "volAvg": 359540,
    "mktCap": 5417303550,
    "lastDiv": 0,
    "range": "66.88-108.35",
    "changes": 0.21,
    "companyName": "QuidelOrtho Corporation",
    "currency": "USD",
    "cik": "0001906324",
    "isin": "US74838J1016",
    "cusip": "219798105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.quidelortho.com",
    "description": "QuidelOrtho Corporation focuses on the development and manufacture of diagnostic testing technologies across the continuum of healthcare testing needs. The company operates through Labs, Transfusion Medicine, Point-of-Care, and Molecular Diagnostics business units. The Labs business unit provides clinical chemistry laboratory instruments and tests that measure target chemicals in bodily fluids for the evaluation of health and the clinical management of patients; immunoassay laboratory instruments and tests, which measure proteins as they act as antigens in the spread of disease, antibodies in the immune response spurred by disease, or markers of proper organ function and health; testing products to detect and monitor disease progression across a spectrum of therapeutic areas; and specialized diagnostic solutions. The Transfusion Medicine business unit offers immunohematology instruments and tests used for blood typing to ensure patient-donor compatibility in blood transfusions; and donor screening instruments and tests used for blood and plasma screening for infectious diseases. The Point-of-Care business unit provides tests to provide rapid results across a continuum of point-of-care settings. The Molecular Diagnostics business unit offers polymerase chain reaction thermocyclers; and analyzers and amplification systems. The company sells its products directly to end users through a direct sales force; and through a network of distributors for professional use in physician offices, hospitals, clinical laboratories, reference laboratories, urgent care clinics, universities, retail clinics, pharmacies, wellness screening centers, blood banks, and donor centers, as well as for individual, non-professional, and over-the-counter use. It operates in North America, Europe, the Middle East, Africa, China, and internationally. The company was founded in 1979 and is headquartered in San Diego, California.",
    "ceo": "Mr. Douglas C. Bryant",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "7000",
    "phone": "858 552 1100",
    "address": "9975 Summers Ridge Road",
    "city": "San Diego",
    "state": "CA",
    "zip": "92121",
    "dcfDiff": 21.0447,
    "dcf": 107.355,
    "image": "https://financialmodelingprep.com/image-stock/QDEL.png",
    "ipoDate": "1991-02-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]