[
  {
    "symbol": "QGEN",
    "price": 44.55,
    "beta": 0.373591,
    "volAvg": 956354,
    "mktCap": 10158959606,
    "lastDiv": 1.089079,
    "range": "40.38-51.18",
    "changes": -0.15,
    "companyName": "Qiagen N.V.",
    "currency": "USD",
    "cik": "0001015820",
    "isin": "NL0012169213",
    "cusip": "N72482123",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Diagnostics & Research",
    "website": "https://www.qiagen.com",
    "description": "QIAGEN N.V. offers sample to insight solutions that transform biological materials into molecular insights worldwide. The company provides primary sample technology consumables, such as nucleic stabilization and purification kits for primary sample materials, manual and automated processing for genotyping, gene expression, and viral and bacterial analysis, as well as silica membranes and magnetic bead technologies; secondary sample technology consumables, including kits and components for purification of nucleic acids from secondary sample materials; and instruments for nucleic acid purification and accessories. It also provides interferon-gamma release assay for TB testing, and assays for post-transplant testing and viral load monitoring; assays for prenatal testing and detection of sexually transmitted diseases and HPV, as well as assays for analysis of genomic variants, such as mutations, insertions, deletions, and fusions; and sample to insight instruments, including one-step molecular analysis of hard-to-diagnose syndromes, and integrated PCR testing. In addition, it offers PCR consumables, such as quantitative PCR, reverse transcription, and combinations kits for analysis of gene expression, genotyping, and gene regulation instruments and technologies; human ID and forensics assay consumables, including STR assays for human ID, and assays for food contamination; PCR instruments consist of digital PCR solutions; and developed and configured OEM consumables. Further, the company provides predefined and custom NGS gene panels, library prep kits and components, and whole genome amplification; QIAGEN consumables and instruments, as well as bioinformatics solutions; and custom laboratory and genomic services. It serves molecular diagnostics, academia, pharmaceutical, and applied testing customers. It has a strategic alliance agreement with Sysmex Corporation and OncXerna Therapeutics, as well as an agreement with Mirati. The company was founded in 1986 and is headquartered in Venlo, the Netherlands.",
    "ceo": "Mr. Thierry  Bernard",
    "sector": "Healthcare",
    "country": "NL",
    "fullTimeEmployees": "6200",
    "phone": "31 77 355 6600",
    "address": "Hulsterweg 82",
    "city": "Venlo",
    "state": null,
    "zip": "5912 PL",
    "dcfDiff": 2.74477,
    "dcf": 52.0448,
    "image": "https://financialmodelingprep.com/image-stock/QGEN.png",
    "ipoDate": "1996-06-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]