[
  {
    "symbol": "QLYS",
    "price": 125.7,
    "beta": 0.62676,
    "volAvg": 326562,
    "mktCap": 4637802060,
    "lastDiv": 0,
    "range": "101.1-162.36",
    "changes": -1.1,
    "companyName": "Qualys, Inc.",
    "currency": "USD",
    "cik": "0001107843",
    "isin": "US74758T3032",
    "cusip": "74758T303",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.qualys.com",
    "description": "Qualys, Inc. provides cloud-based information technology (IT), security, and compliance solutions in the United States and internationally. The company offers Qualys Cloud Apps, which includes Vulnerability Management; Vulnerability Management, Detection and Response; Threat Protection; Continuous Monitoring; Patch Management; Multi-Vector Endpoint Detection and Response; Certificate Assessment; SaaS Detection and Response; Secure Enterprise Mobility; Policy Compliance; Security Configuration Assessment; PCI Compliance; File Integrity Monitoring; Security Assessment Questionnaire; Out of-Band Configuration Assessment; Web Application Scanning; Web Application Firewall; Global Asset Inventory; Cybersecurity Asset Management; Certificate Inventory; Cloud Inventory; Cloud Security Assessment; and Container Security. Its integrated suite of IT, security, and compliance solutions delivered on its Qualys Cloud Platform enables customers to identify and manage IT assets, collect and analyze IT security data, discover and prioritize vulnerabilities, recommend and implement remediation actions, and verify the implementation of such actions. The company also provides asset tagging and management, reporting and dashboards, questionnaires and collaboration, remediation and workflow, big data correlation and analytics engine, and alerts and notifications, which enable integrated workflows, management and real-time analysis, and reporting across IT, security, and compliance solutions. The company offers its solutions through its sales teams, as well as through its network of channel partners, such as security consulting organizations, managed service providers, resellers, and consulting firms. It serves enterprises, government entities, and small and medium-sized businesses in various industries, including education, financial services, government, healthcare, insurance, manufacturing, media, retail, technology, and utilities. The company was incorporated in 1999 and is headquartered in Foster City, California.",
    "ceo": "Mr. Sumedh S. Thakar",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2143",
    "phone": "650 801 6100",
    "address": "919 East Hillsdale Boulevard",
    "city": "Foster City",
    "state": "CA",
    "zip": "94404",
    "dcfDiff": 12.4285,
    "dcf": 126.589,
    "image": "https://financialmodelingprep.com/image-stock/QLYS.png",
    "ipoDate": "2012-09-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]