[
  {
    "symbol": "QRVO",
    "price": 100.66,
    "beta": 1.433098,
    "volAvg": 1240754,
    "mktCap": 9938785892,
    "lastDiv": 0,
    "range": "75.38-114.587",
    "changes": -1.37,
    "companyName": "Qorvo, Inc.",
    "currency": "USD",
    "cik": "0001604778",
    "isin": "US74736K1016",
    "cusip": "74736K101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.qorvo.com",
    "description": "Qorvo, Inc. develops and commercializes technologies and products for wireless, wired, and power markets worldwide. The company operates through two segments, Mobile Products, and Infrastructure and Defense Products. It offers mobile devices, such as smartphones, wearables, laptops, tablets and other devices; radio frequency power management integrated circuits, ultra-wideband (UWB) system-on-a-chip (SoC) and system-in-package (SiP) solutions, MEMS-based sensors, antenna tuners, and antennaplexers, as well as discrete multiplexers, duplexers, filters, and switches; and cellular base stations include switch-low noise amplifier (LNA) modules, variable gain amplifiers, integrated power amplifier (PA) Doherty modules, discrete LNAs, and high power GaN amplifiers. The company's also provides SiC products, such as Schottky diodes and transistors for automotive, industrial, IT infrastructure and renewable energy markets; SoC hardware, firmware, and application software for smart home applications; power management solutions include programmable power management integrated circuits (ICs) and power application controllers; RF products and compound semiconductor foundry services to defense primes and other global defense and aerospace customers; RF connectivity and UWB SoC solutions for automotive connectivity; and Wi-Fi products, such as PAs, switches, LNAs and bulk acoustic wave filters, as well as integrated solutions including front end modules (FEMs) and integrated FEMs. It sells its products directly to original equipment manufacturers and original design manufacturers, as well as through a network of sales representative firms and distributors. The company was founded in 1957 and is headquartered in Greensboro, North Carolina.",
    "ceo": "Mr. Robert A. Bruggeworth",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "8500",
    "phone": "336 664 1233",
    "address": "7628 Thorndike Road",
    "city": "Greensboro",
    "state": "NC",
    "zip": "27409-9421",
    "dcfDiff": 4.24813,
    "dcf": 107.362,
    "image": "https://financialmodelingprep.com/image-stock/QRVO.png",
    "ipoDate": "2015-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]