[
  {
    "symbol": "R",
    "price": 83.33,
    "beta": 1.559154,
    "volAvg": 291846,
    "mktCap": 3874195026,
    "lastDiv": 2.48,
    "range": "65.69-102.36",
    "changes": -0.21,
    "companyName": "Ryder System, Inc.",
    "currency": "USD",
    "cik": "0000085961",
    "isin": "US7835491082",
    "cusip": "783549108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Rental & Leasing Services",
    "website": "https://www.ryder.com",
    "description": "Ryder System, Inc. operates as a logistics and transportation company worldwide. The company operates through three segments: Fleet Management Solutions (FMS), Supply Chain Solutions (SCS), and Dedicated Transportation Solutions (DTS). The FMS segment offers full service leasing and leasing with flexible maintenance options, as well as maintenance services, supplies, and related equipment for operation of the vehicles; commercial vehicle rental services; and contract or transactional maintenance services of trucks, tractors, and trailers, as well as fleet support services. This segment also provides access to diesel fuel; offers fuel planning and tax reporting, cards, and monitoring services, and centralized billing; and sells used vehicles through its 63 retail sales centers and www.ryder.com/used-trucks website. The DTS segment offers equipment, maintenance, drivers, administrative, and additional services, as well as routing and scheduling, fleet sizing, safety, regulatory compliance, risk management, and technology and communication systems support services. The SCS segment comprises distribution management services, such as designing and managing customer's distribution network and facilities; coordinating warehousing and transportation for inbound and outbound material flows; handling import and export for international shipments; coordinating just-in-time replenishment of component parts to manufacturing and final assembly; and offering shipments to customer distribution centers or end customer delivery points, as well as other value added services, such as light assembly of components. This segment also offers transportation management services, such as shipment optimization, load scheduling, and delivery confirmation services; knowledge-based professional services; and e-commerce and last mile services. Ryder System, Inc. was founded in 1933 and is headquartered in Miami, Florida.",
    "ceo": "Mr. Robert E. Sanchez",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "48300",
    "phone": "305 500 3726",
    "address": "11690 NW 105th Street",
    "city": "Miami",
    "state": "FL",
    "zip": "33178",
    "dcfDiff": 0.164218,
    "dcf": 94.6042,
    "image": "https://financialmodelingprep.com/image-stock/R.png",
    "ipoDate": "1980-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]