[
  {
    "symbol": "RAIFY",
    "price": 3.83,
    "beta": 1.366283,
    "volAvg": 3572,
    "mktCap": 5031279684,
    "lastDiv": 0.356,
    "range": "2.464-4.625",
    "changes": 0.32,
    "companyName": "Raiffeisen Bank International AG",
    "currency": "USD",
    "cik": null,
    "isin": "US7507321096",
    "cusip": "750732109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.rbinternational.com",
    "description": "Raiffeisen Bank International AG, together with its subsidiaries, provides corporate, retail, and investment banking services. The company offers cross border accounts; and cash management services, such as account, reporting, payment, clearing, settlement, and cash pooling services; electronic banking; and SEPA and cross-border payments to billing solutions. It also provides investor services, including custody and fund administration services, as well as execution services comprising electronic sales trading, direct market access, and fund brokerage services; trade, working capital, export, sustainable, and real estate finance services, as well as commodity and structured trade, project, and supply chain finance products; and cards. In addition, the company offers bank guarantees, sureties, and letters of credit, as well as documentary collection products; hedging, factoring, and leasing services; and fixed income, money market and securities, asset management, and structured products for corporate and institutional customers. Further, it arranges syndicated loans and structure asset based finance transactions; and assists clients in mergers, acquisitions, sales, and privatizations. As of December 31, 2020, the company operated through a network of 1,857 business outlets in Central, Southeastern, and Eastern Europe. Raiffeisen Bank International AG was founded in 1886 and is headquartered in Vienna, Austria.",
    "ceo": "Dr. Johann  Strobl",
    "sector": "Financial Services",
    "country": "AT",
    "fullTimeEmployees": "44705",
    "phone": "43 1 71 707 0",
    "address": "Am Stadtpark 9",
    "city": "Vienna",
    "state": null,
    "zip": "1030",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/RAIFY.png",
    "ipoDate": "2021-01-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]