[
  {
    "symbol": "RARE",
    "price": 48.01,
    "beta": 0.902464,
    "volAvg": 684291,
    "mktCap": 3399803953,
    "lastDiv": 0,
    "range": "33.36-68.68",
    "changes": -0.54,
    "companyName": "Ultragenyx Pharmaceutical Inc.",
    "currency": "USD",
    "cik": "0001515673",
    "isin": "US90400D1081",
    "cusip": "90400D108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.ultragenyx.com",
    "description": "Ultragenyx Pharmaceutical Inc., a biopharmaceutical company, focuses on the identification, acquisition, development, and commercialization of novel products for the treatment of rare and ultra-rare genetic diseases in North America, Europe, and internationally. Its biologic products include Crysvita (burosumab), an antibody targeting fibroblast growth factor 23 for the treatment of X-linked hypophosphatemia, as well as tumor-induced osteomalacia; Mepsevii, an enzyme replacement therapy for the treatment of children and adults with Mucopolysaccharidosis VII; Dojolvi for treating long-chain fatty acid oxidation disorders; and Evkeeza (evinacumab) for the treatment of homozygous familial hypercholesterolemia. The company's products candidatures include DTX401, an adeno-associated virus 8 (AAV8) gene therapy clinical candidate for the treatment of patients with glycogen storage disease type Ia; DTX301, an AAV8 gene therapy for the treatment of patients with ornithine transcarbamylase; UX143, a human monoclonal antibody for the treatment of osteogenesis imperfecta; GTX-102, an antisense oligonucleotide for the treatment of Angelman syndrome; UX701, for the treatment of Wilson disease; and UX053 for the treatment of glycogen storage disease type III. Ultragenyx Pharmaceutical Inc. has collaboration and license agreement with Kyowa Kirin Co., Ltd.; Saint Louis University; Baylor Research Institute; REGENXBIO Inc.; Bayer Healthcare LLC; GeneTx; Mereo; University of Pennsylvania; Arcturus Therapeutics Holdings Inc., Solid Biosciences Inc.; and Daiichi Sankyo Co., Ltd. Ultragenyx Pharmaceutical Inc. was incorporated in 2010 and is headquartered in Novato, California.",
    "ceo": "Dr. Emil D. Kakkis M.D., Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "1311",
    "phone": "415 483 8800",
    "address": "60 Leveroni Court",
    "city": "Novato",
    "state": "CA",
    "zip": "94949",
    "dcfDiff": 4.29484,
    "dcf": 39.4252,
    "image": "https://financialmodelingprep.com/image-stock/RARE.png",
    "ipoDate": "2014-01-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]