[
  {
    "symbol": "RBA",
    "price": 58.54,
    "beta": 0.89014,
    "volAvg": 1850298,
    "mktCap": 10641986600,
    "lastDiv": 1.08,
    "range": "48.72-72.73",
    "changes": 0.28,
    "companyName": "Ritchie Bros. Auctioneers Incorporated",
    "currency": "USD",
    "cik": "0001046102",
    "isin": "CA7677441056",
    "cusip": "767744105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Business Services",
    "website": "https://www.ritchiebros.com",
    "description": "Ritchie Bros. Auctioneers Incorporated, an asset management and disposition company, sells industrial equipment and other durable assets through its unreserved auctions, online marketplaces, listing services, and private brokerage services. It sells a range of used and unused commercial assets, including earthmoving equipment, truck tractors and trailers, government surplus, oil and gas equipment, and other industrial assets, as well as construction and heavy machinery. The company also offers live auction events with online bidding. It sells used equipment to its customers through live unreserved auctions at 40 auction sites worldwide. The company serves construction, transportation, agriculture, energy, oil and gas, mining, and forestry sectors. It operates in the United States, Canada, Australia, the United Arab Emirates, the Netherlands, Europe, the Middle East, Asia, and internationally. Ritchie Bros. Auctioneers Incorporated was founded in 1958 and is headquartered in Burnaby, Canada.",
    "ceo": "Ms. Ann M. Fandozzi",
    "sector": "Industrials",
    "country": "CA",
    "fullTimeEmployees": "7600",
    "phone": "17783315500",
    "address": "9500 Glenlyon Parkway",
    "city": "Burnaby",
    "state": "BC",
    "zip": "V5J 0C6",
    "dcfDiff": 0.127225,
    "dcf": 59.0272,
    "image": "https://financialmodelingprep.com/image-stock/RBA.png",
    "ipoDate": "1998-03-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]