[
  {
    "symbol": "RBGLY",
    "price": 15.12,
    "beta": 0.161685,
    "volAvg": 332540,
    "mktCap": 54241487032,
    "lastDiv": 0.44,
    "range": "12.71-16.78",
    "changes": -0.39,
    "companyName": "Reckitt Benckiser Group plc",
    "currency": "USD",
    "cik": "0001420798",
    "isin": "US7562552049",
    "cusip": "756255204",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Household & Personal Products",
    "website": "https://www.reckitt.com",
    "description": "Reckitt Benckiser Group plc manufactures and sells health, hygiene, and nutrition products in the United Kingdom, the United States, China, India, and internationally. The company offers acne treatment creams, facial washes, and cleansing pads; disinfection, hygiene, and first aid products; condoms, sex toys, and lubricants; heartburn and indigestion solutions; and cough and chest congestion, multi-symptom, and sinus remedies for adults and children under the Clearasil, Dettol, Durex, Gaviscon, and Mucinex brands. It also provides analgesics; sore throat medications; and hair removal products under the Nurofen, Strepsils, and Veet brands. In addition, the company offers fragrances and devices; water softeners; home cleaning products; dish washes; toilet cleaners; disinfectants; sprays, baits, and plug-ins for pest control; stain removals; fabric washing; and other hygiene products under the Air Wick, Calgon, Cillit Bang, Finish, Harpic, Lysol, Mortein, Vanish, and Woolite brands, as well as analgesics, adult nutrition products, iron-fortified hypoallergenic baby formula, products for joint issues, and infant and toddler nutrition products, as well as vitamins, minerals, and supplements under the Biofreeze, Airborne, Mead Johnson, Move Free, Enfamil, and Nutramigen brands. Further, it provides probiotics, sore throat pain relief products, Omega products, brain health support products, cleaning and carpet cleaning products, septic tank system treatment products, cough syrups, plant-based laundry products, probiotics, and lubricants under the Digestive Advantage, Cepacol, MegaRed, Neuriva, Easy-Off, RID-X, Delsym, Botanical Origin, Bodi-Ome, and K-Y brands. The company was founded in 1819 and is headquartered in Slough, the United Kingdom.",
    "ceo": "Mr. Nicandro  Durante",
    "sector": "Consumer Defensive",
    "country": "GB",
    "fullTimeEmployees": "40000",
    "phone": "44 17 5321 7800",
    "address": "Turner House",
    "city": "Slough",
    "state": null,
    "zip": "SL1 3UH",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/RBGLY.png",
    "ipoDate": "2008-10-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]