[
  {
    "symbol": "RCI",
    "price": 45.45,
    "beta": 0.431457,
    "volAvg": 332866,
    "mktCap": 24096588282,
    "lastDiv": 1.49,
    "range": "36.23-50.16",
    "changes": 0.28,
    "companyName": "Rogers Communications Inc.",
    "currency": "USD",
    "cik": "0000733099",
    "isin": "CA7751092007",
    "cusip": "775109200",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.rogers.com",
    "description": "Rogers Communications Inc. operates as a communications and media company in Canada. It operates through three segments: Wireless, Cable, and Media. The company offers mobile Internet access, wireless voice and enhanced voice, device and accessory financing, wireless home phone, device protection, e-mail, global voice and data roaming, bridging landline, machine-to-machine and Internet of Things solutions, and advanced wireless solutions for businesses, as well as device delivery services; and postpaid and prepaid services under the Rogers, Fido, and chatr brands to approximately 11.3 million subscribers. It also provides Internet and WiFi services; smart home monitoring services, such as monitoring, security, automation, energy efficiency, and smart control through a smartphone app. In addition, the company offers local and network TV; on-demand television; cloud-based digital video recorders; voice-activated remote controls, and integrated apps; personal video recorders; linear and time-shifted programming; digital specialty channels; 4K television programming; and televised content on smartphones, tablets, and personal computers, as well as operates Ignite TV and Ignite TV app. Further, it provides residential and small business local telephony services; calling features, such as voicemail, call waiting, and long distance; voice, data networking, Internet protocol, and Ethernet services; private networking, Internet, IP voice, and cloud solutions; optical wave and multi-protocol label switching services; IT and network technologies; and cable access network services. The company also owns Toronto Blue Jays and the Rogers Centre event venue; and operates Sportsnet ONE, Sportsnet 360, Sportsnet World, Citytv, OMNI, FX (Canada), FXX (Canada), and OLN television networks, as well as 55 AM and FM radio stations. The company was founded in 1960 and is headquartered in Toronto, Canada.",
    "ceo": "Mr. Anthony  Staffieri FCA, FCPA",
    "sector": "Communication Services",
    "country": "CA",
    "fullTimeEmployees": "22000",
    "phone": "14160353532",
    "address": "333 Bloor Street East",
    "city": "Toronto",
    "state": "ON",
    "zip": "M4W 1G9",
    "dcfDiff": 2.56416,
    "dcf": 45.9958,
    "image": "https://financialmodelingprep.com/image-stock/RCI.png",
    "ipoDate": "1996-01-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]