[
  {
    "symbol": "RCM",
    "price": 18.28,
    "beta": 0.836267,
    "volAvg": 2722841,
    "mktCap": 7644750986,
    "lastDiv": 0,
    "range": "6.71-27.07",
    "changes": 0.59,
    "companyName": "R1 RCM Inc.",
    "currency": "USD",
    "cik": "0001910851",
    "isin": "US77634L1052",
    "cusip": "77634L105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Health Information Services",
    "website": "https://www.r1rcm.com",
    "description": "R1 RCM Inc. provides technology-driven solutions that transform the patient experience and financial performance of hospitals, health systems, and medical groups. It offers end-to-end revenue cycle management (RCM) services, which address the spectrum of revenue cycle challenges faced by healthcare providers. The company also provides modular services, including physician advisory services, which assists healthcare organizations in complying with payer requirements regarding whether to classify a hospital visit as an in-patient or an out-patient observation case for billing purposes; practice management services that offers administrative and operational support for patient care and outsource non-core functions; revenue integrity solutions, including charge capture, charge description master maintenance, and pricing services; coding management services, such as business intelligence and analysis, human capital management, accountability framework, and quality management programs; patient experience; and business office services. In addition, the company offers software-as-a-service based scheduling and patient access solutions. The company was founded in 2003 and is headquartered in Murray, Utah.",
    "ceo": "Mr. Lee  Rivas",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "27200",
    "phone": "312 324 7820",
    "address": "434 W. Ascension Way",
    "city": "Murray",
    "state": "UT",
    "zip": "84123",
    "dcfDiff": 6.25124,
    "dcf": 7.87876,
    "image": "https://financialmodelingprep.com/image-stock/RCM.png",
    "ipoDate": "2017-03-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]