[
  {
    "symbol": "RCRRF",
    "price": 32.42,
    "beta": 1.227586,
    "volAvg": 3508,
    "mktCap": 51273525763,
    "lastDiv": 0.17,
    "range": "24.25-40.26",
    "changes": 0.58,
    "companyName": "Recruit Holdings Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Staffing & Employment Services",
    "website": "https://recruit-holdings.com",
    "description": "Recruit Holdings Co., Ltd. provides HR technology and business solutions in Japan, the United States, and internationally. The company operates through three segments: HR Technology, Media & Solutions, and Staffing. The HR Technology segment provides various technological solutions that help job seekers and employers in navigating hiring and recruitment. The Media & Solutions segment offers marketing solutions that provide matching platforms for businesses in various industries, including housing and real estate, beauty, bridal, travel, dining, and others; and SaaS solutions, which are business and management support tools for small and medium-sized companies. It also provides HR solutions that support business clients' recruiting and hiring activities and individual users' job search activities through its job advertising services and placement services. The Staffing segment provides temporary staffing services in Japan, Europe, and Australia. Recruit Holdings Co., Ltd. was founded in 1960 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Hisayuki  Idekoba",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "51757",
    "phone": "81 3 6835 1111",
    "address": "1-9-2 Marunouchi",
    "city": "Tokyo",
    "state": null,
    "zip": "100-6640",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/RCRRF.png",
    "ipoDate": "2016-08-25",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]