[
  {
    "symbol": "RDN",
    "price": 24.99,
    "beta": 1.139788,
    "volAvg": 1514777,
    "mktCap": 3907261270,
    "lastDiv": 0.9,
    "range": "17.84-26.74",
    "changes": -0.09,
    "companyName": "Radian Group Inc.",
    "currency": "USD",
    "cik": "0000890926",
    "isin": "US7502361014",
    "cusip": "750236101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Specialty",
    "website": "https://www.radian.com",
    "description": "Radian Group Inc., together with its subsidiaries, engages in the mortgage and real estate services business in the United States. Its Mortgage segment offers credit-related insurance coverage primarily through private mortgage insurance on residential first-lien mortgage loans, as well as other credit risk management, contract underwriting, and fulfillment solutions. This segment primarily serves mortgage originators, such as mortgage banks, commercial banks, savings institutions, credit unions, and community banks. The company's Homegenius segment offers title services, including a suite of insurance and non-insurance title, tax and title data, centralized recording, document retrieval and default curative title services, and deed and property reports, as well as closing and settlement services comprising electronic execution and traditional signing services; real estate valuation products and services; and asset management services, as well as a suite of real estate technology products and services to facilitate real estate transactions, such as software as a service solutions. This segment serves consumers, mortgage lenders, mortgage and real estate investors, government-sponsored enterprises, and real estate brokers and agents. The company was founded in 1977 and is headquartered in Wayne, Pennsylvania.",
    "ceo": "Mr. Richard Gerald Thornberry",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1400",
    "phone": "215 231 1000",
    "address": "550 East Swedesford Road",
    "city": "Wayne",
    "state": "PA",
    "zip": "19087",
    "dcfDiff": 1.62622,
    "dcf": 20.1138,
    "image": "https://financialmodelingprep.com/image-stock/RDN.png",
    "ipoDate": "1992-10-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]