[
  {
    "symbol": "RDY",
    "price": 62.4,
    "beta": 0.230136,
    "volAvg": 245187,
    "mktCap": 10369881600,
    "lastDiv": 0.49,
    "range": "49.8-62.41",
    "changes": 1.06,
    "companyName": "Dr. Reddy's Laboratories Limited",
    "currency": "USD",
    "cik": "0001135951",
    "isin": "US2561352038",
    "cusip": "256135203",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.drreddys.com",
    "description": "Dr. Reddy's Laboratories Limited, together with its subsidiaries, operates as an integrated pharmaceutical company worldwide. It operates through Global Generics, Pharmaceutical Services and Active Ingredients (PSAI), Proprietary Products, and Others segments. The company's Global Generics segment manufactures and markets prescription and over-the-counter finished pharmaceutical products that are marketed under a brand name or as a generic finished dosages with therapeutic equivalence to branded formulations. This segment also engages in the biologics business. The PSAI segment manufactures and markets active pharmaceutical ingredients and intermediates, which are principal ingredients for finished pharmaceutical products. This segment also provides contract research services; and manufactures and sells active pharmaceutical ingredients and steroids in accordance with the specific customer requirements. Its Proprietary Products segment focuses on the research and development of differentiated formulations. The Others segment engages in developing therapies in the fields of oncology and inflammation. The therapeutic categories primarily include gastro-intestinal, cardiovascular, anti-diabetic, dermatology, oncology, respiratory, stomatology, urology, and nephrology. The company has a collaboration, license, and option agreement with Curis, Inc. to discover, develop, and commercialize small molecule antagonists for immuno-oncology and precision oncology targets. Dr. Reddy's Laboratories Limited was incorporated in 1984 and is headquartered in Hyderabad, India.",
    "ceo": "Mr. Erez  Israeli M.B.A.",
    "sector": "Healthcare",
    "country": "IN",
    "fullTimeEmployees": "25863",
    "phone": "91 40 4900 2900",
    "address": "8-2-337, Road No. 3",
    "city": "Hyderabad",
    "state": null,
    "zip": "500034",
    "dcfDiff": 89.8814,
    "dcf": 143.221,
    "image": "https://financialmodelingprep.com/image-stock/RDY.png",
    "ipoDate": "2001-04-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]