[
  {
    "symbol": "RE",
    "price": 332.87,
    "beta": 0.610211,
    "volAvg": 382683,
    "mktCap": 14451617624,
    "lastDiv": 6.6,
    "range": "244.58-395.0",
    "changes": -5.03,
    "companyName": "Everest Re Group, Ltd.",
    "currency": "USD",
    "cik": "0001095073",
    "isin": "BMG3223R1088",
    "cusip": "G3223R108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Reinsurance",
    "website": "https://www.everestre.com",
    "description": "Everest Re Group, Ltd., through its subsidiaries, provides reinsurance and insurance products in the United States, Bermuda, and internationally. The company operates through Reinsurance Operations and Insurance Operations segments. The Reinsurance Operations segment writes property and casualty reinsurance; and specialty lines of business through reinsurance brokers, as well as directly with ceding companies in the United States, Bermuda, Ireland, Canada, Singapore, Switzerland, and the United Kingdom. The Insurance Operations segment writes property and casualty insurance directly, as well as through brokers, surplus lines brokers, and general agents in Bermuda, Canada, Europe, South America, Canada, Chile, the United Kingdom, Ireland, and the Netherlands. The company also provides treaty and facultative reinsurance products; admitted and non-admitted insurance products; and property and casualty reinsurance and insurance coverages, including marine, aviation, surety, errors and omissions liability, directors' and officers' liability, medical malpractice, mortgage reinsurance, other specialty lines, accident and health, and workers' compensation products. In addition, it offers commercial property and casualty insurance products through wholesale and retail brokers, surplus lines brokers, and program administrators. Everest Re Group, Ltd. was founded in 1973 and is headquartered in Hamilton, Bermuda.",
    "ceo": "Mr. Juan Carlos Andrade",
    "sector": "Financial Services",
    "country": "BM",
    "fullTimeEmployees": "2428",
    "phone": "14412950006",
    "address": "Seon Place",
    "city": "Hamilton",
    "state": null,
    "zip": "HM 19",
    "dcfDiff": 9.71941,
    "dcf": 360.709,
    "image": "https://financialmodelingprep.com/image-stock/RE.png",
    "ipoDate": "1995-10-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]