[
  {
    "symbol": "REGN",
    "price": 700.03,
    "beta": 0.231338,
    "volAvg": 553508,
    "mktCap": 75527636760,
    "lastDiv": 0,
    "range": "563.82-837.55",
    "changes": -16.06,
    "companyName": "Regeneron Pharmaceuticals, Inc.",
    "currency": "USD",
    "cik": "0000872589",
    "isin": "US75886F1075",
    "cusip": "75886F107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.regeneron.com",
    "description": "Regeneron Pharmaceuticals, Inc. discovers, invents, develops, manufactures, and commercializes medicines for treating various diseases worldwide. The company's products include EYLEA injection to treat wet age-related macular degeneration and diabetic macular edema; myopic choroidal neovascularization; and diabetic retinopathy, as well as macular edema following retinal vein occlusion, including macular edema following central retinal vein occlusion and macular edema following branch retinal vein occlusion. It also provides Dupixent injection to treat atopic dermatitis and asthma in adults and pediatrics; Libtayo injection to treat metastatic or locally advanced cutaneous squamous cell carcinoma;Praluent injection for heterozygous familial hypercholesterolemia or clinical atherosclerotic cardiovascular disease in adults; REGEN-COV for covid-19; and Kevzara solution for treating rheumatoid arthritis in adults. In addition, the company offers Inmazeb injection for infection caused by Zaire ebolavirus; ARCALYST injection for cryopyrin-associated periodic syndromes, including familial cold auto-inflammatory syndrome and muckle-wells syndrome; and ZALTRAP injection for intravenous infusion to treat metastatic colorectal cancer; and develops product candidates for treating patients with eye, allergic and inflammatory, cardiovascular and metabolic, infectious, and rare diseases; and cancer, pain, and hematologic conditions. It has collaboration and license agreements with Sanofi; Bayer; Teva Pharmaceutical Industries Ltd.; Mitsubishi Tanabe Pharma Corporation; Alnylam Pharmaceuticals, Inc.; Roche Pharmaceuticals; and Kiniksa Pharmaceuticals, Ltd., as well as has an agreement with the U.S. Department of Health and Human Services, as well as with Zai Lab Limited; Intellia Therapeutics, Inc.; Biomedical Advanced Research Development Authority; and AstraZeneca PLC. The company was incorporated in 1988 and is headquartered in Tarrytown, New York.",
    "ceo": "Dr. Leonard S. Schleifer M.D., Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "12099",
    "phone": "914 847 7000",
    "address": "777 Old Saw Mill River Road",
    "city": "Tarrytown",
    "state": "NY",
    "zip": "10591-6707",
    "dcfDiff": 21.2204,
    "dcf": 764.05,
    "image": "https://financialmodelingprep.com/image-stock/REGN.png",
    "ipoDate": "1991-04-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]