[
  {
    "symbol": "RELX",
    "price": 32.97,
    "beta": 0.49885,
    "volAvg": 764579,
    "mktCap": 62488702510,
    "lastDiv": 0.66,
    "range": "23.39-34.07",
    "changes": -0.16,
    "companyName": "RELX PLC",
    "currency": "USD",
    "cik": "0000929869",
    "isin": "US7595301083",
    "cusip": "759530108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Publishing",
    "website": "https://www.relx.com",
    "description": "RELX PLC provides information-based analytics and decision tools for professional and business customers in North America, Europe, and internationally. It operates through four segments: Risk; Scientific, Technical & Medical; Legal; and Exhibitions. The Risk segment offers information-based analytics and decision tools that combine public and industry specific content with technology and algorithms to assist clients in evaluating and predicting risk. The Scientific, Technical & Medical segment provides information and analytics that help institutions and professionals to progress in science and advance healthcare. The Legal segment provides legal, regulatory, and business information and analytics that help customers in decision-making, as well as increases the productivity. The Exhibitions segment is involved in the events business that combines face-to-face with data and digital tools to help customers learn about markets, source products, and complete transactions. The company was formerly known as Reed Elsevier PLC and changed its name to RELX PLC in July 2015. The company was incorporated in 1903 and is headquartered in London, the United Kingdom.",
    "ceo": "Mr. Erik  Engstrom M.Sc Econ, M.Sc Eng., MBA",
    "sector": "Communication Services",
    "country": "GB",
    "fullTimeEmployees": "35700",
    "phone": "44 20 7166 5500",
    "address": "1-3 Strand",
    "city": "London",
    "state": null,
    "zip": "WC2N 5JR",
    "dcfDiff": 1.78134,
    "dcf": 27.6287,
    "image": "https://financialmodelingprep.com/image-stock/RELX.png",
    "ipoDate": "1994-10-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]