[
  {
    "symbol": "REPYY",
    "price": 14.36,
    "beta": 1.024521,
    "volAvg": 115951,
    "mktCap": 18636982400,
    "lastDiv": 0.75,
    "range": "10.79-16.94",
    "changes": 0.08,
    "companyName": "Repsol, S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US76026T2050",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.repsol.com",
    "description": "Repsol, S.A. operates as an integrated energy company worldwide. Its Exploration and Production segment engages in the exploration, development, and production of crude oil and natural gas reserves. The company's Industrial segment is involved in refining activities and petrochemicals business; the trading and transportation of crude oil and oil products; and the sale, transportation, and regasification of natural gas and liquefied natural gas (LNG). Its Commercial and Renewables segment engages in the low carbon power generation and renewable sources; sale of gas and power; mobility and sale of oil products; and liquified petroleum gas activities. The company also offers asphalt products; installs, operates, and manages service stations; provides maritime services; constructs and operates oil refineries; refines and markets hydrocarbons; offers human resource services; distributes and supplies electricity; and develops new energy source, solar, and wind projects, as well as produces and markets chemical products, lubricants, and biofuels. Further, it is involved in fuel and special products marketing, research, trading and transport, insurance and reinsurance, technology development, and financing activities; develops nanoparticles and nanofibers for material, energy, and biomedicine applications; provides blockchain technology for retail, energy, and automotive sectors; produces synthetic oil cloths; invests in liquefaction plant project; and offers water treatment technology management services. The company was formerly known as Repsol YPF, S.A. and changed its name to Repsol, S.A. in May 2012. Repsol, S.A. was founded in 1927 and is headquartered in Madrid, Spain.",
    "ceo": "Mr. Josu Jon  Imaz San Miguel Ph.D.",
    "sector": "Energy",
    "country": "ES",
    "fullTimeEmployees": "23770",
    "phone": "34 91 753 81 00",
    "address": "Repsol Campus",
    "city": "Madrid",
    "state": null,
    "zip": "28045",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/REPYY.png",
    "ipoDate": "1989-05-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]