[
  {
    "symbol": "RETA",
    "price": 98.83,
    "beta": 1.515845,
    "volAvg": 765693,
    "mktCap": 3711204961,
    "lastDiv": 0,
    "range": "18.47-106.69",
    "changes": 6.44,
    "companyName": "Reata Pharmaceuticals, Inc.",
    "currency": "USD",
    "cik": "0001358762",
    "isin": "US75615P1030",
    "cusip": "75615P103",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.reatapharma.com",
    "description": "Reata Pharmaceuticals, Inc., a clinical-stage biopharmaceutical company, identifies, develops, and commercializes novel therapeutics for patients with serious or life-threatening diseases. The company is developing Phase 3 clinical trial programs, including bardoxolone methyl (bardoxolone) for the treatment of patients with chronic kidney disease (CKD) caused by Alport syndrome, as well as for a form of pulmonary arterial hypertension associated with connective tissue disease; omaveloxolone that is Phase II clinical trial to treat Friedreich's ataxia; and conduct Phase 2 study for various form of CKD, such as IgA nephropathy, type 1 and type 2 diabetic CKD, hypertensive CKD, focal segmental glomerulosclerosis, and others. It is also developing RTA 901 for neurological diseases; and RTA 1701 for the potential treatment of a range of autoimmune, inflammatory, and fibrotic diseases. In addition, the company offers bardoxolone for the treatment of autosomal dominant polycystic kidney disease. Further, it has a strategic collaboration agreement with Kyowa Kirin Co., Ltd. to develop and commercialize bardoxolone for renal, cardiovascular, diabetes, and various other related metabolic indications in Japan, China, Hong Kong, Macao, South Korea, Taiwan, Thailand, Singapore, the Philippines, Malaysia, Indonesia, Brunei, Vietnam, Laos, Myanmar, and Cambodia; and AbbVie Inc. to jointly research, develop, and commercialize all second- and later-generation Nrf2 activators for all indications other than renal, cardiovascular, and metabolic indications. The company was formerly known as Reata Discovery, Inc. and changed its name to Reata Pharmaceuticals, Inc. in May 2005. Reata Pharmaceuticals, Inc. was incorporated in 2002 and is headquartered in Plano, Texas.",
    "ceo": "Mr. J. Warren Huff",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "321",
    "phone": "972 865 2219",
    "address": "5320 Legacy Drive",
    "city": "Plano",
    "state": "TX",
    "zip": "75024",
    "dcfDiff": 9.24099,
    "dcf": 52.631,
    "image": "https://financialmodelingprep.com/image-stock/RETA.png",
    "ipoDate": "2016-05-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]