[
  {
    "symbol": "REYN",
    "price": 27.79,
    "beta": 0.468361,
    "volAvg": 297612,
    "mktCap": 5836149888,
    "lastDiv": 0.92,
    "range": "25.9-32.5",
    "changes": -0.39,
    "companyName": "Reynolds Consumer Products Inc.",
    "currency": "USD",
    "cik": "0001786431",
    "isin": "US76171L1061",
    "cusip": "76171L106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Packaging & Containers",
    "website": "https://www.reynoldsconsumerproducts.com",
    "description": "Reynolds Consumer Products Inc. produces and sells products in cooking, waste and storage, and tableware product categories in the United States and internationally. It operates through four segments: Reynolds Cooking & Baking, Hefty Waste & Storage, Hefty Tableware, and Presto Products. The Reynolds Cooking & Baking segment produces foil, disposable aluminum pans, parchment paper, freezer paper, wax paper, butcher paper, plastic wrap, baking cups, oven bags, and slow cooker liners under the Reynolds Wrap, Reynolds KITCHENS, and E-Z Foil brands in the United States, as well as under the ALCAN brand in Canada and under the Diamond brand internationally. The Hefty Waste & Storage segment offers trash bags under the Hefty Ultra Strong and Hefty Strong brands; and food storage bags under the Hefty and Baggies brands. This segment also provides a suite of products, including blue and clear recycling bags, compostable bags, bags made from recycled materials, and the Hefty EnergyBag Program. The Hefty Tableware segment offers disposable and compostable plates, bowls, platters, cups, and cutlery under the Hefty brand. The Presto Products segment primarily sells store brand products in food storage bags, trash bags, reusable storage containers, and plastic wrap categories. Reynolds Consumer Products Inc. offers both branded and store brand products to grocery stores, mass merchants, warehouse clubs, discount chains, dollar stores, drug stores, home improvement stores, military outlets, and eCommerce retailers. The company was founded in 1947 and is headquartered in Lake Forest, Illinois. Reynolds Consumer Products Inc. operates as a subsidiary of Packaging Finance Limited.",
    "ceo": "Mr. Lance  Mitchell",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "6000",
    "phone": "800 879 5067",
    "address": "1900 West Field Court",
    "city": "Lake Forest",
    "state": "IL",
    "zip": "60045",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/REYN.png",
    "ipoDate": "2020-01-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]