[
  {
    "symbol": "REZI",
    "price": 17.37,
    "beta": 1.949072,
    "volAvg": 596033,
    "mktCap": 2555370180,
    "lastDiv": 0,
    "range": "14.95-23.94",
    "changes": -0.14,
    "companyName": "Resideo Technologies, Inc.",
    "currency": "USD",
    "cik": "0001740332",
    "isin": "US76118Y1047",
    "cusip": "76118Y104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Security & Protection Services",
    "website": "https://www.resideo.com",
    "description": "Resideo Technologies, Inc. develops, manufactures, and sells comfort, residential thermal, and security solutions to the commercial and residential end markets in the United States, Europe, and internationally. The company operates in two segments, Products & Solutions, and ADI Global Distribution. It offers temperature and humidity control, thermal water, and air solutions; and security panels, sensors, peripherals, wires and cables, communication devices, video cameras, awareness solutions, cloud infrastructure, installation and maintenance tools, and related software products under the Honeywell Home brand. In addition, the company distributes security products comprising video, intrusion, and access control products; and smart home, fire, power, audio, ProAV, networking, communication, wire and cable, enterprise connectivity, and structured wiring products to contractors that service non-residential and residential end-users. It sells its products through a network of distributors, original equipment manufacturers, and service providers, as well as retail and online channels. Resideo Technologies, Inc. was incorporated in 2018 and is headquartered in Scottsdale, Arizona.",
    "ceo": "Mr. Jay L. Geldmacher",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "15200",
    "phone": "480 573 5340",
    "address": "16100 North 71st Street",
    "city": "Austin",
    "state": "TX",
    "zip": "85254",
    "dcfDiff": 3.80668,
    "dcf": 22.3667,
    "image": "https://financialmodelingprep.com/image-stock/REZI.png",
    "ipoDate": "2018-10-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]