[
  {
    "symbol": "RGEN",
    "price": 139.09,
    "beta": 1.064788,
    "volAvg": 569545,
    "mktCap": 7744531200,
    "lastDiv": 0,
    "range": "135.37-262.26",
    "changes": -2.91,
    "companyName": "Repligen Corporation",
    "currency": "USD",
    "cik": "0000730272",
    "isin": "US7599161095",
    "cusip": "759916109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.repligen.com",
    "description": "Repligen Corporation develops and commercializes bioprocessing technologies and systems for use in biological drug manufacturing process in North America, Europe, the Asia Pacific, and internationally. It offers Protein A ligands that are the binding components of Protein A affinity chromatography resins; and cell culture growth factor products. The company's chromatography products include OPUS pre-packed chromatography columns, which are used in the purification of biologics; and OPUS smaller-scale columns that are used in the high throughput process development screening, viral clearance validation studies, and scale down validation of chromatography processes. It also offers ELISA test kits; and chromatography resins under the CaptivA brand. In addition, the company provides filtration products, such as XCell Alternating Tangential Flow systems that are filtration devices used in upstream perfusion and cell culture processing; TangenX flat sheet cassettes, which are used in downstream biologic drug concentration and formulation processes; KrosFlo tangential flow filtration and tangential flow depth filtration systems; Spectra/Por laboratory and process dialysis products, and SpectraFlo dynamic dialysis systems; and ProConnex single-use hollow fiber. Further, it provides process analytics products, such as slope spectroscopy systems under the SoloVPE, FlowVPE, and FlowVPX brands. The company sells its products to life sciences, biopharmaceutical, and diagnostics companies; laboratory researchers; and contract manufacturing organizations. Repligen Corporation has collaboration agreements with Navigo Proteins GmbH to develop multiple affinity ligands. Repligen Corporation was incorporated in 1981 and is headquartered in Waltham, Massachusetts.",
    "ceo": "Mr. Anthony J. Hunt",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "2025",
    "phone": "781 250 0111",
    "address": "Building 1",
    "city": "Waltham",
    "state": "MA",
    "zip": "02453",
    "dcfDiff": 10.5956,
    "dcf": 184.554,
    "image": "https://financialmodelingprep.com/image-stock/RGEN.png",
    "ipoDate": "1986-04-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]