[
  {
    "symbol": "RHP",
    "price": 90.87,
    "beta": 1.596478,
    "volAvg": 528085,
    "mktCap": 5424157518,
    "lastDiv": 4,
    "range": "71.63-98.6",
    "changes": -0.76,
    "companyName": "Ryman Hospitality Properties, Inc.",
    "currency": "USD",
    "cik": "0001040829",
    "isin": "US78377T1079",
    "cusip": "78377T107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "REIT—Hotel & Motel",
    "website": "https://www.rymanhp.com",
    "description": "Ryman Hospitality Properties, Inc. (NYSE: RHP) is a leading lodging and hospitality real estate investment trust that specializes in upscale convention center resorts and country music entertainment experiences. The Company's core holdings* include a network of five of the top 10 largest non-gaming convention center hotels in the United States based on total indoor meeting space. These convention center resorts operate under the Gaylord Hotels brand and are managed by Marriott International. The Company also owns two adjacent ancillary hotels and a small number of attractions managed by Marriott International for a combined total of 10,110 rooms and more than 2.7 million square feet of total indoor and outdoor meeting space in top convention and leisure destinations across the country. The Company's Entertainment segment includes a growing collection of iconic and emerging country music brands, including the Grand Ole Opry; Ryman Auditorium, WSM 650 AM; Ole Red and Circle, a country lifestyle media network the Company owns in a joint-venture with Gray Television. The Company operates its Entertainment segment as part of a taxable REIT subsidiary. * The Company is the sole owner of Gaylord Opryland Resort & Convention Center; Gaylord Palms Resort & Convention Center; Gaylord Texan Resort & Convention Center; and Gaylord National Resort & Convention Center. It is the majority owner and managing member of the joint venture that owns the Gaylord Rockies Resort & Convention Center.",
    "ceo": "Mr. Mark  Fioravanti",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "689",
    "phone": "615-316-6000",
    "address": "One Gaylord Drive",
    "city": "Nashville",
    "state": "TN",
    "zip": "37214",
    "dcfDiff": 2.16494,
    "dcf": 93.0349,
    "image": "https://financialmodelingprep.com/image-stock/RHP.png",
    "ipoDate": "1991-10-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]