[
  {
    "symbol": "RICOY",
    "price": 8.3695,
    "beta": 0.687739,
    "volAvg": 946,
    "mktCap": 4863549928,
    "lastDiv": 0.22,
    "range": "6.87-9.2",
    "changes": -0.0555,
    "companyName": "Ricoh Company, Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US7656583074",
    "cusip": "765658307",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Business Equipment & Supplies",
    "website": "https://www.ricoh.co.jp",
    "description": "Ricoh Company, Ltd. provides various office and commercial printing solutions and related solutions worldwide. It offers multifunctional printers, printers, industrial inkjets, garment and production printers, 3D printers, projectors, video and web conference systems, and interactive whiteboards, as well as inkjet heads and modules. The company also provides digital, spherical, single lens reflex, action, and infrared thermography cameras; and automotive stereo cameras, automotive precision machined parts, and small and low energy mobile ICs. In addition, it produces and markets thermal paper and media for food labels, clothing tags, tickets, and handy terminal papers; manufactures and sells watches; and provides magnetoencephalography systems used in brain activity measurement, indoor location information services, bed sensor systems, automated external defibrillators, integrative medical care cooperation systems, and genetic testing substances. Further, the company provides managed print, application/ business process, communication, intelligent workplace, and information technology services; and solar power facility operations and maintenance services, as well as electricity sales services. Ricoh Company, Ltd. serves manufacturing, retail, healthcare, real estate, travel and tourism, and engineering and construction sectors. The company was formerly known as Riken Optical Co., Ltd. and changed its name to Ricoh Company, Ltd. in 1963. Ricoh Company, Ltd. was founded in 1936 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Akira  Oyama",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "81000",
    "phone": "81 3 3777 8111",
    "address": "1-3-6 Nakamagome",
    "city": "Tokyo",
    "state": null,
    "zip": "143-8555",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/RICOY.png",
    "ipoDate": "2003-10-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]