[
  {
    "symbol": "RJF",
    "price": 101.98,
    "beta": 1.029225,
    "volAvg": 1345979,
    "mktCap": 21610684596,
    "lastDiv": 1.68,
    "range": "82.0-126.0",
    "changes": 1.42,
    "companyName": "Raymond James Financial, Inc.",
    "currency": "USD",
    "cik": "0000720005",
    "isin": "US7547301090",
    "cusip": "754730109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.raymondjames.com",
    "description": "Raymond James Financial, Inc., a diversified financial services company, provides private client group, capital markets, asset management, banking, and other services to individuals, corporations, and municipalities in the United States, Canada, and Europe. The Private Client Group segment offers investment services, portfolio management services, insurance and annuity products, and mutual funds; support to third-party product partners, including sales and marketing support, as well as distribution and accounting, and administrative services; margin loans; and securities borrowing and lending services. The Capital Markets segment provides investment banking services, including equity underwriting, debt underwriting, and merger and acquisition advisory services; and fixed income and equity brokerage services. The Asset Management segment offers asset management, portfolio management, and related administrative services to retail and institutional clients; and administrative support services, such as record-keeping. The Raymond James Bank segment provides insured deposit accounts; commercial and industrial, commercial real estate (CRE) and CRE construction, tax-exempt, residential, securities-based, and other loans; and loan syndication services. The Other segment engages in the private equity investments, including various direct and third-party private equity investments; and legacy private equity funds. The company was founded in 1962 and is headquartered in St. Petersburg, Florida.",
    "ceo": "Mr. Paul Christopher Reilly",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "17000",
    "phone": "727 567 1000",
    "address": "880 Carillon Parkway",
    "city": "Saint Petersburg",
    "state": "FL",
    "zip": "33716",
    "dcfDiff": 45.3756,
    "dcf": 157.146,
    "image": "https://financialmodelingprep.com/image-stock/RJF.png",
    "ipoDate": "1983-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]