[
  {
    "symbol": "RKT",
    "price": 9.4,
    "beta": 2.043839,
    "volAvg": 1825138,
    "mktCap": 18680618994,
    "lastDiv": 2.12,
    "range": "5.97-11.375",
    "changes": 0.31,
    "companyName": "Rocket Companies, Inc.",
    "currency": "USD",
    "cik": "0001805284",
    "isin": "US77311W1018",
    "cusip": "77311W101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Mortgage Finance",
    "website": "https://www.rocketcompanies.com",
    "description": "Rocket Companies, Inc. engages in the tech-driven real estate, mortgage, and e-Commerce businesses in the United States and Canada. It operates through two segments, Direct to Consumer and Partner Network. The company's solutions include Rocket Mortgage, a mortgage lender; Amrock that provides title insurance, property valuation, and settlement services; Rocket Homes, a home search platform and real estate agent referral network, which offers technology-enabled services to support the home buying and selling experience; Rocket Auto, an automotive retail marketplace that provides centralized and virtual car sales support to online car purchasing platforms; and Rocket Loans, an online-based personal loans business. It also offer Core Digital Media, a digital social and display advertiser in the mortgage, insurance, and education sectors; Rocket Solar, which connect homeowners with digital financing solutions through a team of trained solar advisors; Truebill, a personal finance app that helps clients manage every aspect of their financial lives; Lendesk, a technology services company that provides a point of sale system for mortgage professionals and a loan origination system for private lenders; and Edison Financial, a digital mortgage broker. In addition, the company originates, closes, sells, and services agency-conforming loans. Rocket Companies, Inc. was founded in 1985 and is headquartered in Detroit, Michigan. Rocket Companies, Inc. operates as a subsidiary of Rock Holdings, Inc.",
    "ceo": "Mr. William C. Emerson",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "18500",
    "phone": "313 373 7990",
    "address": "1050 Woodward Avenue",
    "city": "Detroit",
    "state": "MI",
    "zip": "48226",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/RKT.png",
    "ipoDate": "2020-08-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]