[
  {
    "symbol": "RKUNY",
    "price": 3.35,
    "beta": 0.909195,
    "volAvg": 61154,
    "mktCap": 7152953446,
    "lastDiv": 0.03,
    "range": "3.22-5.61",
    "changes": 0.06,
    "companyName": "Rakuten Group, Inc.",
    "currency": "USD",
    "cik": "0001294591",
    "isin": "US75102W1080",
    "cusip": "75102W108",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Internet Retail",
    "website": "https://global.rakuten.com/corp",
    "description": "Rakuten Group, Inc. offers internet services in Japan and internationally. It operates through three segments: Internet Services, FinTech, and Mobile segments. The Internet Services segment operates Rakuten Ichiba, an internet shopping mall; Rakuten Books, an online bookstore; Rakuten Travel, an internet travel site; Rakuten Gora, an online golf course reservation service; Rakuten Fashion, an online fashion store; Rakuma, a flea market app; Rakuten Rewards, which offers online cash-back services; and Rakuten 24, an internet shopping site that sells medical supplies and daily necessities. It also offers mobile messaging and VoIP, performance marketing, and e-book services. The FinTech segment issues credit cards; offers internet banking, general and life insurance, and payment services; and operates online securities trading platform. The Mobile segment provides mobile communication, optical broadband line, and power supply services. The company was formerly known as Rakuten, Inc. and changed its name to Rakuten Group, Inc. in April 2021. Rakuten Group, Inc. was incorporated in 1997 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Hiroshi  Mikitani",
    "sector": "Consumer Cyclical",
    "country": "JP",
    "fullTimeEmployees": "32079",
    "phone": "81 50 5581 6910",
    "address": "Rakuten Crimson House",
    "city": "Tokyo",
    "state": null,
    "zip": "158-0094",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/RKUNY.png",
    "ipoDate": "2014-01-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]