[
  {
    "symbol": "RMD",
    "price": 214.68,
    "beta": 0.480633,
    "volAvg": 598983,
    "mktCap": 31543148797,
    "lastDiv": 1.76,
    "range": "202.04-247.65",
    "changes": 0.58,
    "companyName": "ResMed Inc.",
    "currency": "USD",
    "cik": "0000943819",
    "isin": "US7611521078",
    "cusip": "761152107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.resmed.com",
    "description": "ResMed Inc. develops, manufactures, distributes, and markets medical devices and cloud-based software applications for the healthcare markets. The company operates in two segments, Sleep and Respiratory Care, and Software as a Service. It offers various products and solutions for a range of respiratory disorders, including technologies to be applied in medical and consumer products, ventilation devices, diagnostic products, mask systems for use in the hospital and home, headgear and other accessories, dental devices, and cloud-based software informatics solutions to manage patient outcomes, as well as provides customer and business processes. The company also provides AirView, a cloud-based system that enables remote monitoring and changing of patients' device settings; myAir, a personalized therapy management application for patients with sleep apnea that provides support, education, and troubleshooting tools for increased patient engagement and improved compliance; U-Sleep, a compliance monitoring solution that enables home medical equipment (HME)to streamline their sleep programs; connectivity module and propeller solutions; and Propeller portal. It offers out-of-hospital software solution, such as Brightree business management software and service solutions to providers of HME, pharmacy, home infusion, orthotics, and prosthetics services; MatrixCare care management and related ancillary solutions to senior living, skilled nursing, life plan communities, home health, home care, and hospice organizations, as well as related accountable care organizations; and HEALTHCAREfirst that offers electronic health record, software, billing and coding services, and analytics for home health and hospice agencies. The company markets its products primarily to sleep clinics, home healthcare dealers, and hospitals through a network of distributors and direct sales force in approximately 140 countries. ResMed Inc. was founded in 1989 and is headquartered in San Diego, California.",
    "ceo": "Mr. Michael J. Farrell BE, MBA, SM",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "8160",
    "phone": "858 836 5000",
    "address": "9001 Spectrum Center Boulevard",
    "city": "San Diego",
    "state": "CA",
    "zip": "92123",
    "dcfDiff": 2.63623,
    "dcf": 227.226,
    "image": "https://financialmodelingprep.com/image-stock/RMD.png",
    "ipoDate": "1995-06-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]