[
  {
    "symbol": "RNG",
    "price": 33.48,
    "beta": 0.918661,
    "volAvg": 1913322,
    "mktCap": 3215071008,
    "lastDiv": 0,
    "range": "25.32-61.42",
    "changes": 0.4,
    "companyName": "RingCentral, Inc.",
    "currency": "USD",
    "cik": "0001384905",
    "isin": "US76680R2067",
    "cusip": "76680R206",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.ringcentral.com",
    "description": "RingCentral, Inc. provides software-as-a-service solutions that enable businesses to communicate, collaborate, and connect in North America. The company offers business cloud communications and contact center solutions based on its Message Video Phone? platform. Its products include RingCentral Office that provides communication and collaboration across various modes, including high-definition voice, video, SMS, messaging and collaboration, conferencing, online meetings, and fax; RingCentral Contact Center, a collaborative contact center solution that delivers omni-channel; and RingCentral Engage Digital, a digital customer engagement platform that allows enterprises to interact with their customers. The company's products also comprise RingCentral Engage Voice, a cloud-based outbound/blended customer engagement platform for midsize and enterprise companies; RingCentral Video, a video meeting service which includes our RCV video and team messaging capabilities and offers video and audio conferencing, file sharing, contact, task, and calendar management. In addition, it offers RingCentral Professional, a cloud based virtual telephone service that provides inbound call answering and management services for professionals; and RingCentral Fax that provides online fax capabilities. The company serves a range of industries, including financial services, education, healthcare, legal services, real estate, retail, technology, insurance, construction, hospitality, and state and local government, as well as others. It sells its products through a network of direct sales representatives, as well as sales agents, resellers, and channel partners. RingCentral, Inc. has strategic partnerships with Alcatel-Lucent Enterprise; and Vodafone Business. The company was incorporated in 1999 and is headquartered in Belmont, California.",
    "ceo": "Mr. Vladimir G. Shmunis",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3902",
    "phone": "650 472 4100",
    "address": "20 Davis Drive",
    "city": "Belmont",
    "state": "CA",
    "zip": "94002",
    "dcfDiff": 1.24009,
    "dcf": 38.6999,
    "image": "https://financialmodelingprep.com/image-stock/RNG.png",
    "ipoDate": "2013-09-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]