[
  {
    "symbol": "RNLSY",
    "price": 7.912,
    "beta": 1.7,
    "volAvg": 18117,
    "mktCap": 11365350767,
    "lastDiv": 0.05,
    "range": "4.45-9.36",
    "changes": -0.008,
    "companyName": "Renault SA",
    "currency": "USD",
    "cik": null,
    "isin": "US7596734035",
    "cusip": "759673403",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Auto Manufacturers",
    "website": "https://www.group.renault.com",
    "description": "Renault SA designs, manufactures, sells, and distributes vehicles in France and internationally. The company operates through Automotive, AVTOVAZ, Sales Financing, and Mobility Services segments. It offers passenger and light commercial, and electric vehicles primarily under the Renault, Dacia, Renault Samsung Motors, Alpine, LADA, Jinbei & Huaasong, and Eveasy, as well as under the Nissan, Datsun, and Infiniti brands. The company also sells powertrains and used vehicles, and spare parts; and provides various services, including vehicle sales financing, rental, maintenance, and service contracts. In addition, it offers finance for the purchase on inventories of new and used vehicles, and replacement parts; designs, produces, and sells converted vehicles; Renault EASY CONNECT for Fleet, a connected service for business users; and produces driving aids, such as steering-wheel mounted accelerators and brakes, multifunction remote control units to operate indicators, lights and horns, pedal transfers, etc.; and manual or electric swivel seats. Renault SA was founded in 1898 and is based in Boulogne-Billancourt, France.",
    "ceo": "Mr. Luca  de Meo",
    "sector": "Consumer Cyclical",
    "country": "FR",
    "fullTimeEmployees": "105812",
    "phone": "33 1 76 84 04 04",
    "address": "13/15 quai Alphonse Le Gallo",
    "city": "Boulogne-Billancourt",
    "state": null,
    "zip": "92100",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/RNLSY.png",
    "ipoDate": "2015-01-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]