[
  {
    "symbol": "RNR",
    "price": 180.39,
    "beta": 0.444718,
    "volAvg": 477366,
    "mktCap": 9231746874,
    "lastDiv": 1.52,
    "range": "124.18-223.8",
    "changes": -2.91,
    "companyName": "RenaissanceRe Holdings Ltd.",
    "currency": "USD",
    "cik": "0000913144",
    "isin": "BMG7496G1033",
    "cusip": "G7496G103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Reinsurance",
    "website": "https://www.renre.com",
    "description": "RenaissanceRe Holdings Ltd. provides reinsurance and insurance products in the United States and internationally. The company operates through Property, and Casualty and Specialty segments. The Property segment writes property catastrophe excess of loss reinsurance and excess of loss retrocessional reinsurance to insure insurance and reinsurance companies against natural and man-made catastrophes, including hurricanes, earthquakes, typhoons, and tsunamis, as well as claims arising from other natural and man-made catastrophes comprising winter storms, freezes, floods, fires, windstorms, tornadoes, explosions, and acts of terrorism; and other property class of products, such as proportional reinsurance, property per risk, property reinsurance, binding facilities, and regional U.S. multi-line reinsurance. The Casualty and Specialty segment writes various classes of products, such as directors and officers, medical malpractice, and professional indemnity; automobile and employer's liability, casualty clash, umbrella or excess casualty, workers' compensation, and general liability; financial and mortgage guaranty, political risk, surety, and trade credit; and accident and health, agriculture, aviation, cyber, energy, marine, satellite, and terrorism. The company distributes its products and services primarily through intermediaries. RenaissanceRe Holdings Ltd. was founded in 1993 and is headquartered in Pembroke, Bermuda.",
    "ceo": "Mr. Kevin Joseph O'Donnell",
    "sector": "Financial Services",
    "country": "BM",
    "fullTimeEmployees": "718",
    "phone": "441 295 4513",
    "address": "Renaissance House",
    "city": "Pembroke",
    "state": null,
    "zip": "HM 19",
    "dcfDiff": 29.9742,
    "dcf": 224.984,
    "image": "https://financialmodelingprep.com/image-stock/RNR.png",
    "ipoDate": "1995-07-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]