[
  {
    "symbol": "RNSHF",
    "price": 45.4435,
    "beta": 0.741762,
    "volAvg": 44,
    "mktCap": 3605932773,
    "lastDiv": 0.9,
    "range": "39.2486-57.73",
    "changes": 0,
    "companyName": "Renishaw plc",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.renishaw.com",
    "description": "Renishaw plc, an engineering and scientific technology company, designs, manufactures, distributes, sells, and services metrology and healthcare products worldwide. The company offers co-ordinate measuring machine (CMM) products, machine tool probe and software, performance measurement systems, gauging systems, fixtures, and styli for touch probe systems; interferometric laser, magnetic, and optical encoders; additive manufacturing systems; plastics and metal vacuum casting machines; and mapping sensors. It also provides healthcare products, such as dental scanners, neurosurgical robots and accessories, neurosurgical planning software, drug delivery systems, Raman microscopes, craniomaxillofacial customized implants, analysers, and hybrid Raman systems. In addition, the company offers asset financing and travel agency services. It serves the aerospace, agriculture, automotive, construction, consumer electronics, healthcare, power generation, resource exploration, energy, heavy, medical, and precision manufacturing industries, as well as scientific, research, and analysis industries. Renishaw plc was incorporated in 1973 and is headquartered in Wotton-under-Edge, the United Kingdom.",
    "ceo": "Sir David R. McMurtry CBE, CEng, FIMechE, FREng, FRS, RDI",
    "sector": "Technology",
    "country": "GB",
    "fullTimeEmployees": "5150",
    "phone": "44 1453 524 524",
    "address": "New Mills",
    "city": "Wotton-under-Edge",
    "state": null,
    "zip": "GL12 8JR",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/RNSHF.png",
    "ipoDate": "2013-02-19",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]