[
  {
    "symbol": "ROG",
    "price": 158.95,
    "beta": 0.964436,
    "volAvg": 147416,
    "mktCap": 2957836970,
    "lastDiv": 0.0675,
    "range": "98.45-271.12",
    "changes": 1.4,
    "companyName": "Rogers Corporation",
    "currency": "USD",
    "cik": "0000084748",
    "isin": "US7751331015",
    "cusip": "775133101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electronic Components",
    "website": "https://www.rogerscorp.com",
    "description": "Rogers Corporation designs, develops, manufactures, and sells engineered materials and components worldwide. It operates through Advanced Electronics Solutions (AES), Elastomeric Material Solutions (EMS), and Other segments. The AES segment offers circuit materials, ceramic substrate materials, busbars, and cooling solutions for applications in electric and hybrid electric vehicles (EV/HEV), wireless infrastructure, automotive, telematics and thermal solutions, aerospace and defense, mass transit, clean energy, connected devices, and wired infrastructure markets. This segment sells its products under the curamik, ROLINX, RO4000, RO3000, RT/duroid, CLTE Series, TMM, AD Series, DiClad, CuClad Series, Kappa, COOLSPAN, TC Series, 92ML, IsoClad, MAGTREX, XTremeSpeed RO1200, IM Series, 2929 Bondply, 3001 Bondply Film, and SpeedWave names. The EMS segment provides engineered material solutions, including polyurethane and silicone materials used in cushioning, gasketing, sealing, and vibration management applications; customized silicones used in flex heater and semiconductor thermal applications; and polytetrafluoroethylene and ultra-high molecular weight polyethylene materials used in wire and cable protection, electrical insulation, conduction and shielding, hose and belt protection, vibration management, cushioning, gasketing and sealing, and venting applications. This segment sells its products under the PORON, BISCO, DeWAL, ARLON, eSORBA, Griswold, XRD, Silicone Engineering, and R/bak names. The Other segment provides elastomer components; and elastomer floats for level sensing in fuel tanks, motors, and storage tanks for applications in the general industrial and automotive markets under the ENDUR and NITROPHYL names. Rogers Corporation was founded in 1832 and is headquartered in Chandler, Arizona.",
    "ceo": "Mr. Randall Colin Gouveia",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3800",
    "phone": "480 917 6000",
    "address": "2225 West Chandler Boulevard",
    "city": "Chandler",
    "state": "AZ",
    "zip": "85224-6155",
    "dcfDiff": 23.4123,
    "dcf": 113.158,
    "image": "https://financialmodelingprep.com/image-stock/ROG.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]