[
  {
    "symbol": "ROK",
    "price": 321.21,
    "beta": 1.423943,
    "volAvg": 753120,
    "mktCap": 36898998750,
    "lastDiv": 4.72,
    "range": "192.9-326.86",
    "changes": -1.45,
    "companyName": "Rockwell Automation, Inc.",
    "currency": "USD",
    "cik": "0001024478",
    "isin": "US7739031091",
    "cusip": "773903109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.rockwellautomation.com",
    "description": "Rockwell Automation, Inc. provides industrial automation and digital transformation solutions in the United States and internationally. The company operates in three segments, Intelligent Devices, Software & Control, and Lifecycle Services. Its solutions include hardware and software products, and services. The Intelligent Devices segment offers drives, motion, safety, sensing, industrial components, and configured-to-order products. The Software & Control segment provides control and visualization software and hardware, information software, digital twin and simulation software, and network and security infrastructure solutions. The Lifecycle Services segment provides consulting, professional services and solutions, and connected and maintenance services. The company sells its solutions primarily through independent distributors in relation with its direct sales force. It serves discrete end markets, including automotive, semiconductor, warehousing and logistics, and other discrete markets, as well as general industries comprising printing and publishing, marine, glass, fiber and textiles, airports, and aerospace; hybrid end markets, such as food and beverage, life sciences, household and personal care, and tire, as well as eco industrial, including water/wastewater, waste management, mass transit, and renewable energy; and process end markets comprising oil and gas, mining, metals, chemicals, pulp and paper, and others. Rockwell Automation, Inc. was founded in 1903 and is headquartered in Milwaukee, Wisconsin.",
    "ceo": "Mr. Blake D. Moret",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "26000",
    "phone": "414 382 2000",
    "address": "1201 South Second Street",
    "city": "Milwaukee",
    "state": "WI",
    "zip": "53204",
    "dcfDiff": 17.215,
    "dcf": 269.245,
    "image": "https://financialmodelingprep.com/image-stock/ROK.png",
    "ipoDate": "1981-12-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]