[
  {
    "symbol": "ROKU",
    "price": 65.22,
    "beta": 1.709154,
    "volAvg": 7401701,
    "mktCap": 9181996983,
    "lastDiv": 0,
    "range": "38.26-97.93",
    "changes": 1.71,
    "companyName": "Roku, Inc.",
    "currency": "USD",
    "cik": "0001428439",
    "isin": "US77543R1023",
    "cusip": "77543R102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Entertainment",
    "website": "https://www.roku.com",
    "description": "Roku, Inc., together with its subsidiaries, operates a TV streaming platform. The company operates in two segments, Platform and Player. Its platform allows users to discover and access various movies and TV episodes, as well as live TV, news sports, shows, and others. As of December 31, 2021, the company had 60.1 million active accounts. It also provides digital and video advertising, content distribution, subscription, and billing services, as well as other commerce transactions, and brand sponsorship and promotions; and manufactures, sells, and licenses smart TVs under the Roku TV name. In addition, the company offers streaming players, and audio products and accessories under the Roku brand name; and sells branded channel buttons on remote controls of streaming devices. It provides its products and services through retailers and distributors, as well as directly to customers through its website in the United States, Canada, the United Kingdom, France, Mexico, Brazil, Chile, Peru, North and South Americas, and Europe. Roku, Inc. was incorporated in 2002 and is headquartered in San Jose, California.",
    "ceo": "Mr. Anthony J. Wood",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "3600",
    "phone": "408 556 9040",
    "address": "1155 Coleman Avenue",
    "city": "San Jose",
    "state": "CA",
    "zip": "95110",
    "dcfDiff": 12.7684,
    "dcf": 68.8084,
    "image": "https://financialmodelingprep.com/image-stock/ROKU.png",
    "ipoDate": "2017-09-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]