[
  {
    "symbol": "ROP",
    "price": 471.14,
    "beta": 1.030281,
    "volAvg": 521375,
    "mktCap": 50219754880,
    "lastDiv": 2.73,
    "range": "356.22-472.723",
    "changes": 0.27,
    "companyName": "Roper Technologies, Inc.",
    "currency": "USD",
    "cik": "0000882835",
    "isin": "US7766961061",
    "cusip": "776696106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.ropertech.com",
    "description": "Roper Technologies, Inc. designs and develops software, and engineered products and solutions. The company offers management, campus solutions, diagnostic and laboratory information management, enterprise management, information solutions, transportation management, financial and compliance management, and cloud-based financial analytics and performance management software; cloud-based software to the property and casualty insurance industry; and software, services, and technologies for foodservice operations. It also provides cloud-based data, collaboration, and estimating automation software; electronic marketplace; visual effects and 3D content software; wireless sensor network and solutions; cloud-based software for the life insurance and financial services industries; supply chain software; health care service and software; RFID card readers; data analytics and information; and pharmacy software solutions. In addition, the company offers precision rubber and polymer testing instruments, and data analysis software; ultrasound accessories; testing and analyzing plastic solutions; dispensers and metering pumps; control valves; precision weighing equipment; automated surgical scrub and linen dispensing equipment; water meters; optical and electromagnetic measurement systems; automated leak detection equipment; medical devices; products and services for water and gas utilities; and equipment and consumables. It also provides temperature control and emergency shutoff valves; turbomachinery control hardware, software, and services; specialized pumps; flow meter calibrators and controllers; vibration monitoring systems and controls; analytical instrument; drilling power section; and pressure and level sensors. The company was formerly known as Roper Industries, Inc. and changed its name to Roper Technologies, Inc. in April 2015. The company was incorporated in 1981 and is based in Sarasota, Florida.",
    "ceo": "Mr. Laurence Neil Hunn",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "15800",
    "phone": "941 556 2601",
    "address": "6901 Professional Parkway",
    "city": "Sarasota",
    "state": "FL",
    "zip": "34240",
    "dcfDiff": 3.71544,
    "dcf": 437.825,
    "image": "https://financialmodelingprep.com/image-stock/ROP.png",
    "ipoDate": "1992-02-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]