[
  {
    "symbol": "RPD",
    "price": 44.41,
    "beta": 1.111971,
    "volAvg": 1220670,
    "mktCap": 2680236761,
    "lastDiv": 0,
    "range": "26.485-74.88",
    "changes": -0.46,
    "companyName": "Rapid7, Inc.",
    "currency": "USD",
    "cik": "0001560327",
    "isin": "US7534221046",
    "cusip": "753422104",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.rapid7.com",
    "description": "Rapid7, Inc. provides cyber security solutions. The company offers a cloud-native insight platform that enables customers to create and manage analytics-driven cyber security risk management programs. Its platform includes InsightIDR, an incident detection and response solution; InsightCloudSec, a solution that integrates posture management, workload protection, infrastructure entitlements management, infrastructure-as-code security, and Kubernetes protection; InsightVM, a vulnerability risk management solution that is designed to provide a way to collect vulnerability data, prioritize risk, and automate remediation; InsightAppSec, which provides application security testing that analyzes web applications for security vulnerabilities; and InsightConnect, a security orchestration and automation response solution that is used by security professionals. The company's other products include DivvyCloud, a cloud security posture management solution; Nexpose, an on-premises version of company's vulnerability risk management solution; AppSpider, an on-premises version of company's application security testing solution; and Metasploit, a penetration testing software solution, as well as professional services. It offers its products through term or perpetual software licenses, cloud-based subscriptions, and managed services. The company serves customers in a range of industries, including technology, energy, financial services, healthcare and life sciences, manufacturing, media and entertainment, retail, education, real estate, transportation, government, and professional services industries through sales teams, and indirect channel partner relationships, as well as directly in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company was incorporated in 2000 and is headquartered in Boston, Massachusetts.",
    "ceo": "Mr. Corey E. Thomas",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2623",
    "phone": "617 247 1717",
    "address": "120 Causeway Street",
    "city": "Boston",
    "state": "MA",
    "zip": "02114",
    "dcfDiff": 8.62981,
    "dcf": 30.7502,
    "image": "https://financialmodelingprep.com/image-stock/RPD.png",
    "ipoDate": "2015-07-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]