[
  {
    "symbol": "RPM",
    "price": 84.24,
    "beta": 0.935563,
    "volAvg": 638522,
    "mktCap": 10859546880,
    "lastDiv": 1.68,
    "range": "77.36-106.5",
    "changes": -0.32,
    "companyName": "RPM International Inc.",
    "currency": "USD",
    "cik": "0000110621",
    "isin": "US7496851038",
    "cusip": "749685103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.rpminc.com",
    "description": "RPM International Inc. manufactures, markets, and sells specialty chemicals for the industrial, specialty, and consumer markets worldwide. It offers waterproofing, coating, and institutional roofing systems; sealants, air barriers, tapes, and foams; residential home weatherization systems; roofing and building maintenance services; sealing and bonding, subfloor preparation, flooring, and glazing solutions; resin flooring systems, polyurethane, MMA waterproof, epoxy floor paint and coatings, concrete repair, and protection products; solutions for fire stopping and intumescent steel coating, and manufacturing industry; rolled asphalt roofing materials and chemical admixtures; concrete and masonry admixtures, concrete fibers, curing and sealing compounds, structural grouts and mortars, epoxy adhesives, injection resins, polyurethane foams, floor hardeners and toppings, joint fillers, industrial and architectural coatings, decorative color/stains/stamps, and restoration materials; insulated building cladding materials; and concrete form wall systems. It also provides polymer flooring systems; fiberglass reinforced plastic gratings and shapes; corrosion-control coating, containment and railcar lining, fire and sound proofing, and heat and cryogenic insulation products; specialty construction products; amine curing agents, reactive diluents, and epoxy resins; fluorescent colorants and pigments; shellac-based-specialty and marine coatings; fire and water damage restoration, carpet cleaning, and disinfecting products; fuel additives; wood treatments, and touch-up products; and nail enamels, polishes, and coating components. In addition, it offers paint contractors and the DIYers solutions, concrete restoration and flooring, metallic and faux finish coatings, cleaners, and hobby paints and cements; and caulk, sealant, adhesive, insulating foam, spackling, glazing, patch, and repair products. The company was incorporated in 1947 and is headquartered in Medina, Ohio.",
    "ceo": "Mr. Frank C. Sullivan",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "16751",
    "phone": "330 273 5090",
    "address": "2628 Pearl Road",
    "city": "Medina",
    "state": "OH",
    "zip": "44258",
    "dcfDiff": 14.9735,
    "dcf": 102.964,
    "image": "https://financialmodelingprep.com/image-stock/RPM.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]