[
  {
    "symbol": "RRX",
    "price": 152.07,
    "beta": 1.04014,
    "volAvg": 404441,
    "mktCap": 10079001909,
    "lastDiv": 1.4,
    "range": "108.82-162.89",
    "changes": -1.03,
    "companyName": "Regal Rexnord Corporation",
    "currency": "USD",
    "cik": "0000082811",
    "isin": "US7587501039",
    "cusip": "758750103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.regalrexnord.com",
    "description": "Regal Rexnord Corporation, together with its subsidiaries, designs, manufactures, and sells industrial powertrain solutions, power transmission components, electric motors and electronic controls, air moving products, and specialty electrical components and systems worldwide. It operates through four segments: Commercial Systems, Industrial Systems, Climate Solutions, and Motion Control Solutions. The Commercial Systems segment provides AC and DC motors, electronic variable speed controls, fans, blowers, and precision stator and rotor kits. The Industrial Systems segment offers AC motors for industrial applications; electric alternators for prime and standby power applications to data centers, distributed energy, microgrid, rental marine, agriculture, healthcare, mobile, and defense markets; and switchgear for healthcare, government, and waste water applications, as well as residential, commercial, and industrial applications. The Climate Solutions segment provides fractional motors, electronic variable speed controls, and blowers for use in a residential and light commercial air moving applications; and fractional horsepower motors and blowers for white goods, water heating equipment, small pumps, compressors, and fans. The Motion Control Solutions segment offers bearings; conveyors; disc, gear, grid, elastomeric, and torsionally soft couplings; mechanical power transmission drives and components; worm gearing, shaft configuration, helical, bevel, helical bevel, worm, hypoid, and spur gearing products; and aerospace components. This segment serves beverage, bulk handling, metal, special machinery, energy, and aerospace and general industrial markets. The company sells its products directly to original equipment manufacturers and end-users through a network of direct and independent sales representatives, and distributors. The company was formerly known as Regal Beloit Corporation. The company was founded in 1955 and is headquartered in Beloit, Wisconsin.",
    "ceo": "Mr. Louis Vernon Pinkham",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "26000",
    "phone": "608 364 8800",
    "address": "200 State Street",
    "city": "Beloit",
    "state": "WI",
    "zip": "53511",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/RRX.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]