[
  {
    "symbol": "RSG",
    "price": 148.81,
    "beta": 0.664084,
    "volAvg": 1118980,
    "mktCap": 47065922039,
    "lastDiv": 1.98,
    "range": "120.58-150.52",
    "changes": -1.38,
    "companyName": "Republic Services, Inc.",
    "currency": "USD",
    "cik": "0001060391",
    "isin": "US7607591002",
    "cusip": "760759100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Waste Management",
    "website": "https://www.republicservices.com",
    "description": "Republic Services, Inc., together with its subsidiaries, offers environmental services in the United States. The company offers collection and processing of recyclable materials, collection, transfer and disposal of non-hazardous solid waste, and other environmental solutions. Its collection services include curbside collection of material for transport to transfer stations, landfills, or recycling processing centers; supply of recycling and waste containers; and renting of compactors. In addition, the company engages in the processing and sale of old corrugated containers, old newsprint, aluminum, glass, and other materials; and provision of landfill and transfer services. Further, it offers disposal of non-hazardous solid and liquid material and in-plant services, such as transportation and logistics. It serves small-container, large-container, and residential customers. As of December 31, 2021, the company operated through 356 collection operations, 239 transfer stations, 198 active landfills, 71 recycling processing centers, 6 saltwater disposal wells, and 7 deep injection wells, as well as 3 treatment, recovery, and disposal facilities in 41 states. It also operated 77 landfill gas-to-energy and renewable energy projects and had 124 closed landfills. The company was incorporated in 1996 and is based in Phoenix, Arizona.",
    "ceo": "Mr. Jon  Vander Ark",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "40000",
    "phone": "480 627 2700",
    "address": "18500 North Allied Way",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85054",
    "dcfDiff": 10.8908,
    "dcf": 134.741,
    "image": "https://financialmodelingprep.com/image-stock/RSG.png",
    "ipoDate": "1998-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]