[
  {
    "symbol": "RTO",
    "price": 39.7,
    "beta": 0.430268,
    "volAvg": 329135,
    "mktCap": 20009117600,
    "lastDiv": 0.46,
    "range": "24.85-41.27",
    "changes": -0.01,
    "companyName": "Rentokil Initial plc",
    "currency": "USD",
    "cik": "0000930157",
    "isin": null,
    "cusip": null,
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Business Services",
    "website": "https://www.rentokil-initial.com",
    "description": "Rentokil Initial plc, together with its subsidiaries, provides route-based services in North America, the United Kingdom, rest of Europe, Asia, the Pacific, and internationally. It offers a range of pest control services for rodents, and flying and crawling insects, as well as other forms of wildlife management for commercial and residential customers. The company also provides hygiene services, including the provision and maintenance of products, such as soap and hand sanitizer dispensers, hand dryers, air care and purification, cubicle and surface sanitizers, feminine hygiene units, toilet paper dispensers, and floor protection mats. In addition, it engages in the supply and laundering of workwear, uniforms, cleanroom uniforms, and protective equipment. Further, the company installs and services interior and exterior plant displays, flowers, replica foliage, Christmas decorations, and ambient scenting for commercial businesses; offers property care services consisting of damp proofing, property conservation, and woodworm and wood rot treatment; and provides a range of specialist cleaning services, such as graffiti removal deep cleaning of kitchens and washrooms, trauma cleaning, and flood or fire damage cleaning, as well as specialist industrial cleaning and disinfection services, including the professional and discreet disinfection of areas that have been exposed to bio-hazardous situations, such as crime and trauma scenes, prison cells, void properties, emergency vehicles, and healthcare establishments. Additionally, it offers a range of healthcare waste management services comprising the collection, disposal, and recycling of hazardous and offensive waste produced by businesses and organizations associated with the provision of healthcare; and color-coded sharps disposal bins to deal with various types of waste. Rentokil Initial plc was founded in 1903 and is headquartered in Crawley, the United Kingdom.",
    "ceo": "Mr. Andrew M. Ransom",
    "sector": "Industrials",
    "country": "GB",
    "fullTimeEmployees": "58600",
    "phone": "44 12 9385 8000",
    "address": "Compass House",
    "city": "Crawley",
    "state": null,
    "zip": "RH10 9PY",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/RTO.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]