[
  {
    "symbol": "RTX",
    "price": 95.87,
    "beta": 0.728169,
    "volAvg": 4276400,
    "mktCap": 140079488732,
    "lastDiv": 2.36,
    "range": "80.27-104.91",
    "changes": -0.66,
    "companyName": "Raytheon Technologies Corporation",
    "currency": "USD",
    "cik": "0000101829",
    "isin": "US75513E1010",
    "cusip": "75513E101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.rtx.com",
    "description": "Raytheon Technologies Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers worldwide. It operates through four segments: Collins Aerospace Systems, Pratt & Whitney, Raytheon Intelligence & Space, and Raytheon Missiles & Defense. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for aircraft manufacturers and airlines, as well as regional, business, and general aviation; and for defense and commercial space operations. This segment also designs, produces, and supports cabin interior, communications and aviation systems, oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; airborne intelligence, surveillance and reconnaissance systems, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and information management services. The Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon Intelligence & Space segment develops and provides integrated space, communication, and sensor systems for missions, training, and cyber and software solutions to intelligence, defense, federal, and commercial customers. The Raytheon Missiles & Defense segment designs, develops, produces, and sustains integrated air and missile defense systems; defensive and combat solutions; land- and sea-based radars; command, control, communications, and intelligence solutions; and naval and undersea sensor solutions for the U.S. and foreign government customers. The company is headquartered in Waltham, Massachusetts.",
    "ceo": "Mr. Gregory J. Hayes",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "182000",
    "phone": "781 522 3000",
    "address": "870 Winter Street",
    "city": "Waltham",
    "state": "MA",
    "zip": "02451",
    "dcfDiff": 1.82064,
    "dcf": 101.421,
    "image": "https://financialmodelingprep.com/image-stock/RTX.png",
    "ipoDate": "1962-04-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]