[
  {
    "symbol": "RUSHA",
    "price": 60.86,
    "beta": 0.913028,
    "volAvg": 174459,
    "mktCap": 3391727861,
    "lastDiv": 0.84,
    "range": "42.72-62.2",
    "changes": 0.13,
    "companyName": "Rush Enterprises, Inc.",
    "currency": "USD",
    "cik": "0001012019",
    "isin": "US7818462092",
    "cusip": "781846209",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Auto & Truck Dealerships",
    "website": "https://www.rushenterprises.com",
    "description": "Rush Enterprises, Inc., through its subsidiaries, operates as an integrated retailer of commercial vehicles and related services in the United States. The company operates a network of commercial vehicle dealerships under the Rush Truck Centers name. Its Rush Truck Centers primarily sell commercial vehicles manufactured by Peterbilt, International, Hino, Ford, Isuzu, IC Bus, or Blue Bird. The company also provides new and used commercial vehicles, and aftermarket parts, as well as service and repair, financing, and leasing and rental services; and offers property and casualty insurance, including collision and liability insurance on commercial vehicles, cargo insurance, and credit life insurance to its commercial vehicle customers. In addition, it provides equipment installation and repair, parts installation, and paint and body repair services; new vehicle pre-delivery inspection, truck modification, and natural gas fuel system installation services; body, chassis upfitting, and component installation services, as well as sells tires for use on commercial vehicles, new and used trailers, and vehicle telematics products; and manufactures compressed natural gas fuel systems and related component parts for commercial vehicles. The company serves regional and national fleets, corporations, local and state governments, and owner operators. It operates a network of centers located in the states of Alabama, Arizona, California, Colorado, Florida, Georgia, Idaho, Illinois, Indiana, Kansas, Kentucky, Missouri, Nevada, Nebraska, New Mexico, North Carolina, Ohio, Oklahoma, Pennsylvania, Tennessee, Texas, Utah, and Virginia. Rush Enterprises, Inc. was incorporated in 1965 and is headquartered in New Braunfels, Texas.",
    "ceo": "Mr. W. Marvin Rush III",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "7418",
    "phone": "830 302 5200",
    "address": "555 IH 35 South",
    "city": "New Braunfels",
    "state": "TX",
    "zip": "78130",
    "dcfDiff": 1.09281,
    "dcf": 53.6428,
    "image": "https://financialmodelingprep.com/image-stock/RUSHA.png",
    "ipoDate": "2003-10-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]