[
  {
    "symbol": "RVNC",
    "price": 25.4,
    "beta": 0.843661,
    "volAvg": 1322683,
    "mktCap": 2134626160,
    "lastDiv": 0,
    "range": "13.51-37.98",
    "changes": -0.08,
    "companyName": "Revance Therapeutics, Inc.",
    "currency": "USD",
    "cik": "0001479290",
    "isin": "US7613301099",
    "cusip": "761330109",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.revance.com",
    "description": "Revance Therapeutics, Inc., a biotechnology company, engages in the development, manufacture, and commercialization of neuromodulators for various aesthetic and therapeutic indications in the United States and internationally. The company's lead drug candidate is DaxibotulinumtoxinA for injection, which has completed phase III clinical trials for the treatment of glabellar (frown) lines and cervical dystonia; is in phase II clinical trials to treat upper facial lines, moderate or severe dynamic forehead lines, and moderate or severe lateral canthal lines; and has completed Phase II clinical trials for the treatment of adult upper limb spasticity and plantar fasciitis. It is also developing DaxibotulinumtoxinA in preclinical trial for the treatment of migraine, as well as a topical program for various indications; and OnabotulinumtoxinA, a biosimilar to BOTOX. The company has a collaboration and license agreement with Viatris Inc. to develop, manufacture, and commercialize onabotulinumtoxinA. The company was formerly known as Essentia Biosystems, Inc. and changed its name to Revance Therapeutics, Inc. in April 2005. Revance Therapeutics, Inc. was incorporated in 1999 and is headquartered in Nashville, Tennessee.",
    "ceo": "Mr. Mark J. Foley",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "534",
    "phone": "615 724 7755",
    "address": "1222 Demonbreun Street",
    "city": "Nashville",
    "state": "TN",
    "zip": "37203",
    "dcfDiff": 9.39133,
    "dcf": 23.7387,
    "image": "https://financialmodelingprep.com/image-stock/RVNC.png",
    "ipoDate": "2014-02-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]