[
  {
    "symbol": "RVTY",
    "price": 117.24,
    "beta": 1.10669,
    "volAvg": 809006,
    "mktCap": 14706702840,
    "lastDiv": 0.28,
    "range": "110.75-170.0",
    "changes": 2.32,
    "companyName": "Revvity, Inc.",
    "currency": "USD",
    "cik": "0000031791",
    "isin": null,
    "cusip": null,
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Diagnostics & Research",
    "website": "https://www.perkinelmer.com",
    "description": "Revvity, Inc. provides products, services, and solutions to the diagnostics, life sciences, and applied services markets worldwide. It operates through two segments, Discovery & Analytical Solutions and Diagnostics. The Discovery & Analytical Solutions segment provides instruments, reagents, informatics, software, subscriptions, detection, and imaging technologies that enable scientists to enhance research breakthroughs in the life sciences research market, as well as contract research and laboratory services. It also provides analytical technologies, solutions, and services for its customers to understand the characterize the health of various aspects, including air, water, and soil. In addition, this segment offers solutions to farmers and food producers; and analytical instrumentation for the industrial market, which includes the chemical, semiconductor and electronics, energy, lubricant, petrochemical, and polymer industries. The Diagnostics segment provides instruments, reagents, assay platforms, and software products for the early detection of genetic disorders, such as pregnancy and early childhood, as well as infectious disease testing in the diagnostics market. Its products are used for testing and screening genetic abnormalities, disorders, and diseases, including down syndrome, hypothyroidism, muscular dystrophy, infertility, and various metabolic conditions. This segment also develops technologies that enable and support genomic workflows using protein coupled receptor and next-generation DNA sequencing for applications in oncology, immunodiagnostics, and drug discovery. It serves pharmaceutical and biotechnology companies, laboratories, academic and research institutions, public health authorities, private healthcare organizations, doctors, and government agencies. The company was formerly known as PerkinElmer, Inc. and changed its name to Revvity, Inc. in April 2023. Revvity, Inc. was founded in 1937 and is headquartered in Waltham, Massachusetts.",
    "ceo": "Dr. Prahlad R. Singh Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "11000",
    "phone": "781 663 6900",
    "address": "940 Winter Street",
    "city": "Waltham",
    "state": "MA",
    "zip": "02451",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/RVTY.png",
    "ipoDate": "1973-02-21",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]