[
  {
    "symbol": "RY",
    "price": 94.29,
    "beta": 0.77441,
    "volAvg": 777787,
    "mktCap": 131037646226,
    "lastDiv": 4,
    "range": "83.63-104.72",
    "changes": -0.76,
    "companyName": "Royal Bank of Canada",
    "currency": "USD",
    "cik": "0001000275",
    "isin": "CA7800871021",
    "cusip": "780087102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.rbc.com",
    "description": "Royal Bank of Canada operates as a diversified financial service company worldwide. The company's Personal & Commercial Banking segment offers checking and savings accounts, home equity financing, personal lending, private banking, indirect lending, including auto financing, mutual funds and self-directed brokerage accounts, guaranteed investment certificates, credit cards, and payment products and solutions; and lending, leasing, deposit, investment, foreign exchange, cash management, auto dealer financing, trade products, and services to small and medium-sized commercial businesses. This segment offers financial products and services through branches, automated teller machines, and mobile sales network. Its Wealth Management segment provides a suite of advice-based solutions and strategies to high net worth and ultra-high net worth individuals, and institutional clients. The company's Insurance segment offers life, health, home, auto, travel, wealth, annuities, and reinsurance advice and solutions; and business insurance services to individual, business, and group clients through its advice centers, RBC insurance stores, and mobile advisors; digital, mobile, and social platforms; independent brokers; and travel partners. Its Investor & Treasury Services segment provides asset servicing, custody, payments, and treasury services to financial and other investors; and fund and investment administration, shareholder, private capital, performance measurement and compliance monitoring, distribution, transaction banking, cash and liquidity management, foreign exchange, and global securities finance services. The company's Capital Markets segment offers corporate and investment banking, as well as equity and debt origination, distribution, advisory services, sale, and trading services for corporations, institutional investors, asset managers, private equity firms, and governments. The company was founded in 1864 and is headquartered in Toronto, Canada.",
    "ceo": "Mr. David I. McKay",
    "sector": "Financial Services",
    "country": "CA",
    "fullTimeEmployees": "94398",
    "phone": "14169741012",
    "address": "200 Bay Street",
    "city": "Toronto",
    "state": "ON",
    "zip": "M5J 2J5",
    "dcfDiff": 134.418,
    "dcf": 235.548,
    "image": "https://financialmodelingprep.com/image-stock/RY.png",
    "ipoDate": "1995-10-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]