[
  {
    "symbol": "RYAAY",
    "price": 109.48,
    "beta": 1.499419,
    "volAvg": 412051,
    "mktCap": 24935273404,
    "lastDiv": 8.298974000000001,
    "range": "55.9-110.17",
    "changes": 1.34,
    "companyName": "Ryanair Holdings plc",
    "currency": "USD",
    "cik": "0001038683",
    "isin": "US7835132033",
    "cusip": "783513203",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Airlines",
    "website": "https://www.ryanair.com",
    "description": "Ryanair Holdings plc, together with its subsidiaries, provides scheduled-passenger airline services in Ireland, the United Kingdom, Italy, Spain, Germany, and other European countries. It is also involved in the provision of various ancillary services, such as non-flight scheduled and Internet-related services; in-flight sale of beverages, food, duty-free, and merchandise; and marketing of car hire and accommodation services, and travel insurance through its website and mobile app. In addition, the company offers aircraft and passenger handling, ticketing, and maintenance and repair services; and markets car parking, fast-track, airport transfers, attractions, and activities on its website and mobile app, as well as sells gift vouchers. As of June 30, 2022, it had a principal fleet of approximately 483 Boeing 737 aircrafts and 29 Airbus A320 aircrafts; and offered approximately 3,000 short-haul flights per day serving approximately 225 airports. Ryanair Holdings plc was founded in 1985 and is headquartered in Swords, Ireland.",
    "ceo": "Mr. Michael  O'Leary",
    "sector": "Industrials",
    "country": "IE",
    "fullTimeEmployees": "21000",
    "phone": "353 1 945 1212",
    "address": "Dublin Office",
    "city": "Swords",
    "state": null,
    "zip": "K67 NY94",
    "dcfDiff": 8.97642,
    "dcf": 86.7136,
    "image": "https://financialmodelingprep.com/image-stock/RYAAY.png",
    "ipoDate": "1997-05-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]