[
  {
    "symbol": "SAFRY",
    "price": 38.5,
    "beta": 1.347892,
    "volAvg": 105416,
    "mktCap": 65681000000,
    "lastDiv": 0.36,
    "range": "21.63-39.42",
    "changes": 0.11,
    "companyName": "Safran SA",
    "currency": "USD",
    "cik": null,
    "isin": "US7865841024",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Aerospace & Defense",
    "website": "https://www.safran-group.com",
    "description": "Safran SA, together with its subsidiaries, engages in the aerospace and defense businesses worldwide. The company operates through three segments: Aerospace Propulsion; Aircraft Equipment, Defense and Aerosystems; and Aircraft Interiors. The Aerospace Propulsion segment designs, develops, produces, and markets propulsion and mechanical power transmission systems for commercial aircraft, military transport, training and combat aircraft, civil and military helicopters, and drones. This segment also offers maintenance, repair, and overhaul services, as well as sells spare parts. The Aircraft Equipment, Defense and Aerosystems segment provides landing gears and brakes; and engine systems and equipment, such as thrust reversers and nacelles. This segment also offers avionics, such as flight controls and onboard information systems; security systems, including evacuation slides, emergency arresting systems, and oxygen masks; onboard computers and fuel systems; electrical power management systems and associated engineering services; and optronic equipment and sights, navigation equipment and sensors, infantry, and drones, as well as sells spare parts. Its products and services are used in civil and military aircraft, and helicopters. The Aircraft Interiors segment designs, develops, manufactures, and markets aircraft seats for passengers and crew; cabin equipment, overhead bins, class dividers, passenger service units, cabin interior solutions, chilling systems, galleys, electrical inserts, and trolleys and cargo equipment; and water distribution equipment, lavatories, air systems, and in-flight entertainment and connectivity systems. Safran SA was incorporated in 1924 and is headquartered in Paris, France.",
    "ceo": "Mr. Olivier  Andries",
    "sector": "Industrials",
    "country": "FR",
    "fullTimeEmployees": "83217",
    "phone": "33 1 40 60 80 80",
    "address": "2, boulevard du GEnEral-Martial-Valin",
    "city": "Paris",
    "state": null,
    "zip": "75724",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SAFRY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]