[
  {
    "symbol": "SAGE",
    "price": 46.84,
    "beta": 1.155281,
    "volAvg": 597311,
    "mktCap": 2799252080,
    "lastDiv": 0,
    "range": "31.42-59.99",
    "changes": -0.21,
    "companyName": "Sage Therapeutics, Inc.",
    "currency": "USD",
    "cik": "0001597553",
    "isin": "US78667J1088",
    "cusip": "78667J108",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.sagerx.com",
    "description": "Sage Therapeutics, Inc., a biopharmaceutical company, develops and commercializes medicines to treat central nervous system disorders. Its lead product candidate is ZULRESSO, an intravenous formulation of brexanolone for the treatment of postpartum depression (PPD) in adults. The company's product pipeline also includes zuranolone, a neuroactive steroid, which is in Phase III clinical trials for treating PPD, major depressive disorders, treatment resistant disorders, generalized anxiety disorders, and bipolar depression; and SAGE-324, a compound that is in Phase II clinical trial to treat essential tremors, as well as has completed Phase I clinical trial for epilepsy and Parkinson's diseases. In addition, its product pipeline comprises SAGE-718, an oxysterol-based positive allosteric modulator of the NMDA receptor, which has completed Phase I clinical trial for the treatment of depression, Huntington's disease, Alzheimer's disease, attention deficit hyperactivity disorder, schizophrenia, and neuropathic pain. Sage Therapeutics, Inc. has a strategic collaboration with Shionogi & Co., Ltd. for the development and commercialization of zuranolone in Japan, Taiwan, and South Korea; and a collaboration and license agreement with Biogen MA Inc. to jointly develop and commercialize SAGE-217 and SAGE-324 products. The company was formerly known as Sterogen Biopharma, Inc. and changed its name to Sage Therapeutics, Inc. in September 2011. Sage Therapeutics, Inc. was incorporated in 2010 and is headquartered in Cambridge, Massachusetts.",
    "ceo": "Mr. Barry E. Greene",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "689",
    "phone": "617 299 8380",
    "address": "215 First Street",
    "city": "Cambridge",
    "state": "MA",
    "zip": "02142",
    "dcfDiff": 3.30497,
    "dcf": 40.065,
    "image": "https://financialmodelingprep.com/image-stock/SAGE.png",
    "ipoDate": "2014-07-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]