[
  {
    "symbol": "SAIC",
    "price": 110.61,
    "beta": 0.69507,
    "volAvg": 346472,
    "mktCap": 5937876630,
    "lastDiv": 1.48,
    "range": "87.93-117.94",
    "changes": 0.64,
    "companyName": "Science Applications International Corporation",
    "currency": "USD",
    "cik": "0001571123",
    "isin": "US8086251076",
    "cusip": "808625107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.saic.com",
    "description": "Science Applications International Corporation provides technical, engineering, and enterprise information technology (IT) services primarily in the United States. The company's offerings include engineering; technology integration; IT modernization; maintenance of ground and maritime systems; logistics; training and simulation; operation and program support services; and end-to-end services, such as design, development, integration, deployment, management and operations, sustainment, and security of its customers' IT infrastructure, as well as cloud migration, managed services, infrastructure modernization, and enterprise IT-as-a-service solutions. It serves the U.S. military comprising Army, Air Force, Navy, Marines, and Coast Guard; Department of Defense agencies; National Aeronautics and Space Administration; the U.S. Department of State; Department of Justice; Department of Homeland Security; and various intelligence community agencies, as well as U.S. federal civilian agencies. The company was formerly known as SAIC Gemini, Inc. and changed its name to Science Applications International Corporation in September 2013. Science Applications International Corporation was founded in 1969 and is headquartered in Reston, Virginia.",
    "ceo": "Ms. Nazzic S. Keene",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "24000",
    "phone": "703 676 4300",
    "address": "12010 Sunset Hills Road",
    "city": "Reston",
    "state": "VA",
    "zip": "20190",
    "dcfDiff": 8.29444,
    "dcf": 110.274,
    "image": "https://financialmodelingprep.com/image-stock/SAIC.png",
    "ipoDate": "2013-09-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]