[
  {
    "symbol": "SANM",
    "price": 58.68,
    "beta": 1.162676,
    "volAvg": 433845,
    "mktCap": 3413351052,
    "lastDiv": 0,
    "range": "39.21-69.28",
    "changes": 0.59,
    "companyName": "Sanmina Corporation",
    "currency": "USD",
    "cik": "0000897723",
    "isin": "US8010561020",
    "cusip": "801056102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Electronic Components",
    "website": "https://www.sanmina.com",
    "description": "Sanmina Corporation provides integrated manufacturing solutions, components, products and repair, logistics, and after-market services worldwide. It operates in two businesses, Integrated Manufacturing Solutions; and Components, Products and Services. The company offers product design and engineering, including concept development, detailed design, prototyping, validation, preproduction, manufacturing design release, and product industrialization; assembly and test services; direct order fulfillment and logistics services; after-market product service and support; and supply chain management services, as well as engages in the manufacturing of components, subassemblies, and complete systems. In addition, the company provides interconnect systems, such as printed circuit board fabrication, backplane, cable assemblies, and plastic injection moldings; mechanical systems comprising enclosures and precision machining; memory, storage platforms, radio frequency, optical, and microelectronic solutions; defense and aerospace products; and cloud-based manufacturing execution software. It offers its products and services primarily to original equipment manufacturers in the industrial, medical, defense and aerospace, automotive, communications networks, and cloud solutions industries. Sanmina Corporation was founded in 1980 and is headquartered in San Jose, California.",
    "ceo": "Mr. Jure  Sola",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "34000",
    "phone": "408 964 3500",
    "address": "2700 North First Street",
    "city": "San Jose",
    "state": "CA",
    "zip": "95134",
    "dcfDiff": 19.1582,
    "dcf": 75.4382,
    "image": "https://financialmodelingprep.com/image-stock/SANM.png",
    "ipoDate": "1993-04-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]