[
  {
    "symbol": "SAP",
    "price": 134.27,
    "beta": 1.008045,
    "volAvg": 944137,
    "mktCap": 156709202400,
    "lastDiv": 2.19,
    "range": "78.22-139.25",
    "changes": 1.26,
    "companyName": "SAP SE",
    "currency": "USD",
    "cik": "0001000184",
    "isin": "US8030542042",
    "cusip": "803054204",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.sap.com",
    "description": "SAP SE, together with its subsidiaries, operates as an enterprise application software company worldwide. The company operates through three segments: Applications, Technology & Support; Qualtrics; and Services. It offers SAP S/4HANA, an ERP suite with intelligent technologies, such as artificial intelligence, machine learning, and advanced analytics; SAP SuccessFactors Human Experience Management provides cloud-based solutions, such as a human resources management system for core HR and payroll, talent management, employee experience management, and people analytics; and intelligent spend management solutions, including products branded under the SAP Ariba, SAP Concur, and SAP Fieldglass names. The company also provides SAP customer experience solutions; SAP Business Technology platform that enables customers and partners to extend and customize SAP applications in a cloud-native way; and SAP Business Network that enable companies to extend their ecosystem, react to supply chain disruptions, discover new trading partners, and find new opportunities. In addition, it offers business process intelligence solutions aim to help customers analyze their operations, understand their process bottlenecks, and improve their business process landscape; Experience solutions; SAP's industry cloud provides modular solutions addressing industry-specific functions; and SAP's ecosystem build, sell, service, and run SAP solutions and technology, as well as sustainable business solutions, services, and partnerships solutions. SAP SE was founded in 1972 and is headquartered in Walldorf, Germany.",
    "ceo": "Mr. Christian  Klein",
    "sector": "Technology",
    "country": "DE",
    "fullTimeEmployees": "105132",
    "phone": "49 6227 7 47474",
    "address": "Dietmar-Hopp-Allee 16",
    "city": "Walldorf",
    "state": null,
    "zip": "69190",
    "dcfDiff": 2.83337,
    "dcf": 116.043,
    "image": "https://financialmodelingprep.com/image-stock/SAP.png",
    "ipoDate": "1995-09-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]