[
  {
    "symbol": "SAPMF",
    "price": 1.34,
    "beta": 2.075095,
    "volAvg": 398,
    "mktCap": 2795682089,
    "lastDiv": 0.11,
    "range": "0.62-5.09",
    "changes": 0.0615,
    "companyName": "Saipem SpA",
    "currency": "USD",
    "cik": "0001062750",
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Oil & Gas Equipment & Services",
    "website": "https://www.saipem.com",
    "description": "Saipem SpA provides energy and infrastructure solutions worldwide. The company operates through five divisions: Offshore Engineering & Construction (E&C), Onshore Engineering & Construction, Offshore Drilling, Onshore Drilling, and XSIGHT. It offers engineering, construction, installation of platforms, pipelines, subsea fields, maintenance, modification, operation, and decommissioning activities, as well as develops marine wind farms and energy integration projects. The company also designs onshore project in the LNG and regasification, refining, petrochemical, fertilizers, pipelines, gas, oil processing stations, floaters, renewables, biotechnologies, CO2 capture, transportation, storage, and hydrogen production and transportation. In addition, the company provides procurement, project management, construction, and engineering integrated services for the energy industry markets and public infrastructures, as well as offshore and onshore drilling services on all types of rigs and in all geographical areas. As of December 31, 2021, its offshore drilling fleet consisted of twelve vessels, including six ultra-deep-water units, five high specification jack-ups, and one standard jack-ups. The company also operates 9 fabrication yards and a sea fleet of 41 vessels; and onshore drilling fleet comprised 84 units. Saipem S.p.A. is headquartered in Milan, Italy.",
    "ceo": "Mr. Alessandro  Puliti",
    "sector": "Energy",
    "country": "IT",
    "fullTimeEmployees": "29437",
    "phone": "39 02 44231",
    "address": "Via Martiri di Cefalonia 67",
    "city": "Milan",
    "state": "MI",
    "zip": "20097",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SAPMF.png",
    "ipoDate": "2011-04-21",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]