[
  {
    "symbol": "SBGSY",
    "price": 35.49,
    "beta": 0.990804,
    "volAvg": 206033,
    "mktCap": 99214776461,
    "lastDiv": 0.69,
    "range": "21.37-36.14",
    "changes": 0.05,
    "companyName": "Schneider Electric S.E.",
    "currency": "USD",
    "cik": null,
    "isin": "US80687P1066",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.se.com/ww/en",
    "description": "Schneider Electric S.E. provides energy and automation digital solutions worldwide. It operates through two segments, Energy Management and Industrial Automation. The company offers busway and cable support products, circuit breakers and switches, contactors and protection relays, electrical protection and control products, energy management software solutions, transfer switches, surge protection and power conditioning products, power monitoring and control products, power quality and power factor correction products, pushbuttons, switches, pilot lights and joysticks, software products, and switchboards and enclosures. It also provides access control, building management, fire detection, sensors and room units, valve and valve actuator, and variable and frequency speed drive. In addition, the company offers feeder automation, grid automation and SCADA software products, medium voltage switchgears and transformers, outdoor equipment, substation automation products, and switchgear components. Further, it provides critical power and cooling services, data center software, IT power distribution products, prefabricated data center modules, racks and accessories, and security and environmental monitoring products; home automation and security, installation materials and systems, light switches and electrical sockets, and uninterruptible power supply products; and human machine interface, industrial automation software, industrial communication, measurement and instrumentation, motion control and robotics, signaling units, programmable logic and automation controllers, power supply and protection, process control and safety, RFID systems, signaling devices, and other industrial automation and control products, as well as solar and energy storage. The company was founded in 1836 and is headquartered in Rueil-Malmaison, France.",
    "ceo": "Ms. Annette K. Clayton",
    "sector": "Industrials",
    "country": "FR",
    "fullTimeEmployees": "135000",
    "phone": "33 1 41 29 70 00",
    "address": "35 rue Joseph Monier",
    "city": "Rueil-Malmaison",
    "state": null,
    "zip": "92506",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SBGSY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]