[
  {
    "symbol": "SBHGF",
    "price": 19.47,
    "beta": 0.997701,
    "volAvg": 154,
    "mktCap": 5300649246,
    "lastDiv": 1.08,
    "range": "17.1-21.79",
    "changes": 0.02,
    "companyName": "SBI Holdings, Inc.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Asset Management",
    "website": "https://www.sbigroup.co.jp",
    "description": "SBI Holdings, Inc. engages in the online financial service businesses and investment activities in Japan and internationally. It operates through Financial Services Business; Asset Management Business; Investment Business, Crypto-Asset Business and Non-financial Business segments. The company offers financial products and services, including brokerage and investment banking; Internet banking; auto, cancer, fire, and earthquake, as well as life insurance; short term insurance; FX margin trading; online securities; exchange and transaction services related to digital assets; management of defined-contribution pension, etc.; leasing and lending services; operation of proprietary trading system; control and operation of the e-commerce settlement business; and remittance and back office support services. It also provides private equity, venture capital fund management, M&A advisory, commercial banking, investment advisory and management, and rating information services; real estate secured loans; and rent guarantees for rental housing. In addition, the company researches, manufactures, and sells pharmaceutical products, health foods, and cosmetics; develops, produces, sells, and maintains medical information integration systems; and researches and develops antibody drugs and nucleic acid medicines for cancer and immunology. Further, it operates a fund-raising platform; acts as a crypto-asset broker; develops, manufactures, and sells crypto-asset mining systems; operates and develops cybersecurity systems; provides blockchain platform; invests in real estate properties; exports used cars; and offers healthcare services, as well as revitalization services. Additionally, the company engages in the mining of digital assets; and e-sports and renewable energy business. The company was formerly known as Softbank Investment Corporation and changed its name to SBI Holdings, Inc. in July 2005. SBI Holdings, Inc. was incorporated in 1999 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Yoshitaka  Kitao",
    "sector": "Financial Services",
    "country": "JP",
    "fullTimeEmployees": "17496",
    "phone": "81 3 6229 0100",
    "address": "Izumi Garden Tower",
    "city": "Tokyo",
    "state": null,
    "zip": "106-6019",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SBHGF.png",
    "ipoDate": "2012-08-28",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]