[
  {
    "symbol": "SBMFF",
    "price": 0.46295,
    "beta": 0.623754,
    "volAvg": 1445,
    "mktCap": 8705867755,
    "lastDiv": 0.02,
    "range": "0.44-0.63",
    "changes": -0.0071,
    "companyName": "Sino Biopharmaceutical Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Biotechnology",
    "website": "https://www.sinobiopharm.com",
    "description": "Sino Biopharmaceutical Limited, an investment holding company, operates as a research and development pharmaceutical conglomerate in the People's Republic of China. It operates through three segments: Modernised Chinese Medicines and Chemical Medicines, Investment, and Others. The company's products include oncology medicines comprising Qingkeshu tablets, Anxian capsules, Yinishu tablets, Genike capsules, Anyue capsules, and Leweixin injections; cardio-cerebral vascular medicines, including Kaina and Anrixin tablets; hepatitis medicines, such as Tianqingganmei injections and Tianqingganping enteric capsules; orthopedic medicines consisting of Gaisanchun capsules, Yigu injections, and Taiyan tablets; respiratory system medicines; parenteral nutritious medicines comprising Xinhaineng and Fenghaina injections; and other medicines, including Tuotuo tablets, Debaian cataplasms, and Qingliming injections. It also offers Aprepitant capsules, Lenvatinib Mesilate capsules, Vortioxetine Hydrobromide tablets, Edaravone injection, Amlodipine Besylate and Atorvastatin Calcium tablets, Sofosbuvir tablets, Sitagliptin Phosphate tablets, Colistimethate Sodium for injection, and Tofacitinib Citrate tablets. In addition, the company holds properties; retails and distributes pharmaceutical products; offers optometry for optical glasses and sells ophthalmic products; operates hospitals; provides medical management and health information consultancy, as well as bio-tech transfer and consultation services; manufactures and sells health food; and offers orthopedic outpatient and surgical procedures. Further, it manufactures, sells, and distributes health food; develops medical and health technology; trades in optical glasses; and researches, develops, and sells medical devices and active pharmaceutical ingredients. The company was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
    "ceo": "Mr. Eric S. Y.  Tse",
    "sector": "Healthcare",
    "country": "HK",
    "fullTimeEmployees": "26272",
    "phone": "852 2802 9886",
    "address": "Office Tower",
    "city": "Wan Chai",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SBMFF.png",
    "ipoDate": "2010-02-22",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]