[
  {
    "symbol": "SBSW",
    "price": 6.12,
    "beta": 1.230136,
    "volAvg": 3512732,
    "mktCap": 4330768942,
    "lastDiv": 0.53,
    "range": "6.0119-12.44",
    "changes": -0.1,
    "companyName": "Sibanye Stillwater Limited",
    "currency": "USD",
    "cik": "0001786909",
    "isin": "US82575P1075",
    "cusip": "82575P107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Gold",
    "website": "https://www.sibanyestillwater.com",
    "description": "Sibanye Stillwater Limited, together with its subsidiaries, operates as a precious metals mining company in South Africa, the United States, Zimbabwe, Canada, and Argentina. The company produces gold; platinum group metals (PGMs), including palladium, platinum, and rhodium; and by-products, such as iridium, ruthenium, nickel, copper, and chrome. It owns the East Boulder and Stillwater mines located in Montana, the United States; and Columbus metallurgical complex, which smelts the material mined to produce PGM-rich filter cake, as well as conducts PGM recycling activities. The company is also involved in the Kroondal, Rustenburg, Marikana, and Platinum Mile operations situated in South Africa; Mimosa located on the southern portion in Zimbabwe; the Driefontein, Kloof, and Cooke surface operations located on the West Rand of the Witwatersrand Basin; and the Beatrix situated in the southern Free State. In addition, it owns an interest in surface tailings retreatment facilities; the Marathon PGM project in Ontario, Canada; the Altar and Rio Grande copper gold projects in the Andes in north-west Argentina; the Hoedspruit; and the Burnstone and southern Free State gold projects in South Africa. Sibanye Stillwater Limited was founded in 2013 and is headquartered in Weltevreden Park, South Africa.",
    "ceo": "Mr. Neal John Froneman B.Sc(MechEng), B.Sc., BCompt UNISA, PR Eng.",
    "sector": "Basic Materials",
    "country": "ZA",
    "fullTimeEmployees": "66043",
    "phone": "27 11 278 9600",
    "address": "Bridgeview House, Building 11",
    "city": "Weltevredenpark",
    "state": null,
    "zip": "1709",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SBSW.png",
    "ipoDate": "2013-02-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]