[
  {
    "symbol": "SCCO",
    "price": 70.68,
    "beta": 1.248591,
    "volAvg": 1155522,
    "mktCap": 54642850491,
    "lastDiv": 4,
    "range": "42.42-82.05",
    "changes": -2.72,
    "companyName": "Southern Copper Corporation",
    "currency": "USD",
    "cik": "0001001838",
    "isin": "US84265V1052",
    "cusip": "84265V105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Copper",
    "website": "https://www.southernperu.com",
    "description": "Southern Copper Corporation engages in mining, exploring, smelting, and refining copper and other minerals in Peru, Mexico, Argentina, Ecuador, and Chile. The company is involved in the mining, milling, and flotation of copper ore to produce copper and molybdenum concentrates; smelting of copper concentrates to produce blister and anode copper; refining of anode copper to produce copper cathodes; production of molybdenum concentrate and sulfuric acid; production of refined silver, gold, and other materials; and mining and processing of zinc and lead. It operates the Toquepala and Cuajone open-pit mines, and a smelter and refinery in Peru; and La Caridad, an open-pit copper mine, as well as a copper ore concentrator, a SX-EW plant, a smelter, refinery, and a rod plant in Mexico. The company also operates Buenavista, an open-pit copper mine, as well as two copper concentrators and two operating SX-EW plants in Mexico. In addition, it operates five underground mines that produce zinc, lead, copper, silver, and gold; a coal mine that produces coal and coke; and a zinc refinery. The company has interests in 82,134 hectares of exploration concessions in Peru; 493,533 hectares of exploration concessions in Mexico; 246,346 hectares of exploration concessions in Argentina; 29,888 hectares of exploration concessions in Chile; and 7,299 hectares of exploration concessions in Ecuador. Southern Copper Corporation was incorporated in 1952 and is based in Phoenix, Arizona. Southern Copper Corporation operates as a subsidiary of Americas Mining Corporation.",
    "ceo": "Mr. Oscar  Gonzalez Rocha",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "15018",
    "phone": "602 264 1375",
    "address": "1440 East Missouri Avenue",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85014",
    "dcfDiff": 13.4469,
    "dcf": 61.1331,
    "image": "https://financialmodelingprep.com/image-stock/SCCO.png",
    "ipoDate": "1996-01-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]