[
  {
    "symbol": "SCHYY",
    "price": 35.12,
    "beta": 1.052107,
    "volAvg": 18379,
    "mktCap": 28423282437,
    "lastDiv": 20.473000000000003,
    "range": "16.18-39.35",
    "changes": 0.27,
    "companyName": "Sands China Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US80007R1059",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Resorts & Casinos",
    "website": "https://www.sandschina.com",
    "description": "Sands China Ltd., an investment holding company, develops, owns, and operates integrated resorts and casinos in Macao. It owns and operates The Venetian Macao, The Londoner Macao, The Parisian Macao resort, The Plaza Macao, and The Sands Macao casino; the Cotai Expo, a convention and exhibition hall; and the Cotai Arena, an entertainment venue, as well as Cotai Water Jet ferry for leisure and business travelers. As of December 31, 2021, the company had 12,373 hotel rooms and suites, 151 restaurants and food outlets, 2.1 million square feet of retail malls, 1.7 million square feet of MICE space, 4 permanent theatres, a 15,000-seat arena, and casinos. It also offers ferry transportation and leasing services, and pontoon leasing; travel and tourism agency services; security services; human resources administration services; and mall management services, as well as outsourcing services, including information technology, accounting, hotel management, and marketing. The company was incorporated in 2009 and is headquartered in Taipa, Macau. Sands China Ltd. is a subsidiary of Las Vegas Sands Corp.",
    "ceo": "Mr. Robert Glen Goldstein",
    "sector": "Consumer Cyclical",
    "country": "MO",
    "fullTimeEmployees": "24000",
    "phone": null,
    "address": "The Venetian Macao Resort Hotel",
    "city": "Taipa",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SCHYY.png",
    "ipoDate": "2010-10-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]