[
  {
    "symbol": "SCI",
    "price": 64.07,
    "beta": 0.791901,
    "volAvg": 949640,
    "mktCap": 9813730040,
    "lastDiv": 1.08,
    "range": "56.85-75.11",
    "changes": -0.03,
    "companyName": "Service Corporation International",
    "currency": "USD",
    "cik": "0000089089",
    "isin": "US8175651046",
    "cusip": "817565104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Personal Services",
    "website": "https://www.sci-corp.com",
    "description": "Service Corporation International provides deathcare products and services in the United States and Canada. The company operates through Funeral and Cemetery segments. Its funeral service and cemetery operations comprise funeral service locations, cemeteries, funeral service/cemetery combination locations, crematoria, and other businesses. The company also provides professional services related to funerals and cremations, including the use of funeral facilities and motor vehicles; arranging and directing services; and removal, preparation, embalming, cremation, memorialization, and travel protection, as well as catering services. In addition, it offers funeral merchandise, including burial caskets and related accessories, urns and other cremation receptacles, outer burial containers, flowers, online and video tributes, stationery products, casket and cremation memorialization products, and other ancillary merchandise. Further, the company's cemeteries provide cemetery property interment rights, such as developed lots, lawn crypts, mausoleum spaces, niches, and other cremation memorialization and interment options; and sells cemetery merchandise and services, including memorial markers and bases, outer burial containers, flowers and floral placements, graveside services, merchandise installations, and interments, as well as offers preneed cemetery merchandise and services. Service Corporation International offers its products and services under the Dignity Memorial, Dignity Planning, National Cremation Society, Advantage Funeral and Cremation Services, Funeraria del Angel, Making Everlasting Memories, Neptune Society, and Trident Society brands. As of December 31, 2021, it owned and operated 1,471 funeral service locations; and 488 cemeteries, including 299 funeral service/cemetery combination locations covering 44 states, eight Canadian provinces, the District of Columbia, and Puerto Rico. The company was incorporated in 1962 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Thomas Luke Ryan",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "17589",
    "phone": "713 522 5141",
    "address": "1929 Allen Parkway",
    "city": "Houston",
    "state": "TX",
    "zip": "77019",
    "dcfDiff": 0.86921,
    "dcf": 71.9508,
    "image": "https://financialmodelingprep.com/image-stock/SCI.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]