[
  {
    "symbol": "SCMWY",
    "price": 62.19,
    "beta": 0.175862,
    "volAvg": 6193,
    "mktCap": 32215602108,
    "lastDiv": 2.4,
    "range": "43.69-70.04",
    "changes": -0.13,
    "companyName": "Swisscom AG",
    "currency": "USD",
    "cik": null,
    "isin": "US8710131082",
    "cusip": "871013108",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.swisscom.ch",
    "description": "Swisscom AG provides telecommunication services primarily in Switzerland, Italy, and internationally. It operates through three segments: Swisscom Switzerland, Fastweb, and Other Operating. The company offers mobile and fixed-network services, such as telephony, broadband, TV, and mobile offerings, as well as sells terminal equipment; and telecom and communications solutions for large corporations and small and medium-sized enterprises. It also provides cloud, outsourcing, workplace, mobile phone, networking, business process optimization, SAP, and security and authentication solutions, as well as a range of services to the banking industry; Internet of Things solutions; digitization services to the healthcare sector; IT systems for health insurance companies; fixed-line and mobile networks by other telecommunication service providers; and roaming to foreign operators whose customers use its mobile networks, as well as broadband services and regulated products. In addition, the company plans, operates, and maintains network infrastructure and IT systems; provides support functions to finance, human resource, and strategy, as well as management of real estate and vehicle fleet; and offers broadband and mobile services, such as telephony, mobile offerings, and broadband services, as well as ICT solutions for residential, business, and wholesale customers. Further, it provides IT and network services; online and telephone directories; and cross-platform retail media and security communication services, as well as builds and maintains wired and wireless networks. The company was founded in 1852 and is based in Bern, Switzerland.",
    "ceo": "Mr. Christoph  Aeschlimann",
    "sector": "Communication Services",
    "country": "CH",
    "fullTimeEmployees": "19252",
    "phone": "41 58 221 99 11",
    "address": "Alte Tiefenaustrasse 6",
    "city": "Bern",
    "state": null,
    "zip": "3048",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SCMWY.png",
    "ipoDate": "1998-10-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]