[
  {
    "symbol": "SCRYY",
    "price": 2.82,
    "beta": 1.240613,
    "volAvg": 12685,
    "mktCap": 5239954831,
    "lastDiv": 0.15,
    "range": "1.32-2.91",
    "changes": -0.09,
    "companyName": "SCOR SE",
    "currency": "USD",
    "cik": null,
    "isin": "US80917Q1067",
    "cusip": "80917Q106",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Insurance—Reinsurance",
    "website": "https://www.scor.com",
    "description": "SCOR SE, together with its subsidiaries, provides life and non-life reinsurance products in Europe, the Middle East, Africa, the Americas, Latin America, and Asia Pacific. It operates through two segments, SCOR Global P&C and SCOR Global Life. The SCOR Global P&C segment offers reinsurance products in the areas of property, motors, casualty treaties, credit and surety, decennial insurance, aviation, marine and energy, engineering, agricultural risks, and property catastrophes; specialties insurance products, including business solutions, political and credit risks, cyber, and environmental impairment liability; and business ventures and partnerships. The SCOR Global Life segment provides life reinsurance products, including protection for mortality, morbidity, behavioral risks, disability, long-term care, critical illness, medical, and personal accident. This segment also provides financial solutions that combine traditional life reinsurance with financial components and provide liquidity, balance sheet, solvency, and income improvements to clients; longevity solutions that include products covering the risk of negative deviation from expected results due to the insured or annuitant living longer than assumed in the pricing of insurance covers provided by insurers or pension funds; and distribution solutions. In addition, it is involved in the asset management business. The company was founded in 1970 and is headquartered in Paris, France.",
    "ceo": "Dr. Francois  de Varenne Ph.D.",
    "sector": "Financial Services",
    "country": "FR",
    "fullTimeEmployees": "3522",
    "phone": "33 1 58 44 70 00",
    "address": "5, Avenue KlEber",
    "city": "Paris",
    "state": null,
    "zip": "75795",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SCRYY.png",
    "ipoDate": "2007-12-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]