[
  {
    "symbol": "SDXAY",
    "price": 22.605,
    "beta": 0.888505,
    "volAvg": 12169,
    "mktCap": 16506058156,
    "lastDiv": 0.51,
    "range": "13.63-22.69",
    "changes": -0.085,
    "companyName": "Sodexo S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US8337921048",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Business Services",
    "website": "https://www.sodexo.com",
    "description": "Sodexo S.A. develops, manages, and delivers on-site, benefits and rewards, and personal and home services worldwide. It provides various on-site services, including business and administration, which covers corporate, energy and resources, government and agencies, sports and leisure, and other customers; healthcare and seniors; and education services comprising schools and universities. The company also provides food services; benefits and rewards services, such as employee benefits, incentive and recognition programs, employee mobility, expense management, and public benefits; and personal and home services, including childcare, concierge, and in-home care services. In addition, it offers facility management services, including cleaning, front of house, security, ground maintenance, mailroom, document management, waste management, laundry, transportation, general repairs, technical maintenance, energy management, asset management, and project management services. The company was formerly known as Sodexho Alliance and changed its name to Sodexo S.A. in 2008. Sodexo S.A. was founded in 1966 and is headquartered in Issy-les-Moulineaux, France.",
    "ceo": "Ms. Sophie  Bellon",
    "sector": "Industrials",
    "country": "FR",
    "fullTimeEmployees": "422000",
    "phone": "33 1 30 85 75 00",
    "address": "255 Quai de la Bataille de Stalingrad",
    "city": "Issy-les-Moulineaux",
    "state": null,
    "zip": "92866",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SDXAY.png",
    "ipoDate": "2002-10-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]