[
  {
    "symbol": "SE",
    "price": 57.1,
    "beta": 1.678169,
    "volAvg": 4605895,
    "mktCap": 32476137530,
    "lastDiv": 6.135,
    "range": "40.665-93.7",
    "changes": -0.24,
    "companyName": "Sea Limited",
    "currency": "USD",
    "cik": "0001703399",
    "isin": "US81141R1005",
    "cusip": "81141R100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Internet Retail",
    "website": "https://www.sea.com",
    "description": "Sea Limited, together with its subsidiaries, engages in the digital entertainment, e-commerce, and digital financial service businesses in Southeast Asia, Latin America, rest of Asia, and internationally. It offers Garena digital entertainment platform for users to access mobile and PC online games, as well as eSports operations; and access to other entertainment content, including livestreaming of gameplay and social features, such as user chat and online forums. The company also operates Shopee e-commerce platform, a mobile-centric marketplace that provides integrated payment and logistics infrastructure and seller services. In addition, it offers SeaMoney digital financial services to individuals and businesses, including offline and online mobile wallet, and payment processing services, as well as other offerings across credit, insurtech, and digital bank services under the ShopeePay, SPayLater, SeaBank, and other digital financial services brands; and payment processing services for Shopee. The company was formerly known as Garena Interactive Holding Limited and changed its name to Sea Limited in April 2017. Sea Limited was incorporated in 2009 and is headquartered in Singapore.",
    "ceo": "Mr. Xiaodong  Li",
    "sector": "Consumer Cyclical",
    "country": "SG",
    "fullTimeEmployees": "63800",
    "phone": "65 6270 8100",
    "address": "1 Fusionopolis Place",
    "city": "Singapore",
    "state": null,
    "zip": "138522",
    "dcfDiff": 4.91658,
    "dcf": 73.4666,
    "image": "https://financialmodelingprep.com/image-stock/SE.png",
    "ipoDate": "2017-10-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]