[
  {
    "symbol": "SEAS",
    "price": 54.36,
    "beta": 1.969718,
    "volAvg": 851751,
    "mktCap": 3472891884,
    "lastDiv": 2.7900000000000005,
    "range": "40.01-68.19",
    "changes": -0.94,
    "companyName": "SeaWorld Entertainment, Inc.",
    "currency": "USD",
    "cik": "0001564902",
    "isin": "US81282V1008",
    "cusip": "81282V100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Leisure",
    "website": "https://www.seaworldentertainment.com",
    "description": "SeaWorld Entertainment, Inc., together with its subsidiaries, operates as a theme park and entertainment company in the United States. The company operates SeaWorld theme parks in Orlando, Florida; San Antonio, Texas; and San Diego, California, as well as Busch Gardens theme parks in Tampa, Florida, and Williamsburg, Virginia. It also operates water park attractions in Orlando, Florida; San Antonio, Texas; San Diego, California; Chula Vista, California; Tampa, Florida; and Williamsburg, Virginia. In addition, the company operates a reservations-only theme park in Orlando, Florida and a park in Langhorne, Pennsylvania. It operates a portfolio of twelve theme parks under the SeaWorld, Busch Gardens, Aquatica, Discovery Cove, Water Country USA, Adventure Island, and Sesame Place brands. The company was formerly known as SW Holdco, Inc. and changed its name to SeaWorld Entertainment, Inc. in December 2012. SeaWorld Entertainment, Inc. was founded in 1959 and is headquartered in Orlando, Florida.",
    "ceo": "Mr. Marc G. Swanson",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "3200",
    "phone": "407 226 5011",
    "address": "6240 Sea Harbor Drive",
    "city": "Orlando",
    "state": "FL",
    "zip": "32821",
    "dcfDiff": 32.4195,
    "dcf": 30.2805,
    "image": "https://financialmodelingprep.com/image-stock/SEAS.png",
    "ipoDate": "2013-04-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]