[
  {
    "symbol": "SEB",
    "price": 3554,
    "beta": 0.468661,
    "volAvg": 929,
    "mktCap": 4125412120,
    "lastDiv": 9,
    "range": "3295.0-4242.95",
    "changes": -96,
    "companyName": "Seaboard Corporation",
    "currency": "USD",
    "cik": "0000088121",
    "isin": "US8115431079",
    "cusip": "811543107",
    "exchange": "American Stock Exchange",
    "exchangeShortName": "AMEX",
    "industry": "Conglomerates",
    "website": "https://www.seaboardcorp.com",
    "description": "Seaboard Corporation operates as an agribusiness and transportation company worldwide. It operates through six segments: Pork, Commodity Trading and Milling (CT&M), Marine, Sugar and Alcohol, Power, and Turkey. The Pork segment produces and sells fresh and frozen pork products to further processors, foodservice operators, grocery stores, and distributors; hogs; and biodiesel. The CT&M segment sources, transports, and markets wheat, corn, soybeans, soybean meal, and other commodities; and produces wheat flour, maize meal, manufactured feed, and oilseed crush commodities. The Marine segment provides cargo shipping services in the United States, as well as in 26 countries in the Caribbean, and Central and South America; dry, refrigerated, and specialized containers, as well as other related equipment; and operates a terminal and an off-port warehouse for cargo consolidation and temporary storage. As of December 31, 2021, this segment operated through a fleet of 20 chartered and 4 owned vessels. The Sugar and Alcohol segment produces and sells sugar and alcohol; and generates and sells energy through its 51-megawatt cogeneration power plant that is fueled by sugarcane by-products, natural gas, and other biomass. The Power segment operates as an independent power producer that generates electricity for the power grid in the Dominican Republic. The Turkey segment produces and processes organic turkey products to retail stores, foodservice outlets, and industrial entities, as well as exports products to Mexico and internationally. The company also processes and sells jalapeño peppers. Seaboard Corporation was founded in 1918 and is headquartered in Merriam, Kansas.",
    "ceo": "Mr. Robert L. Steer",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "13000",
    "phone": "913 676 8928",
    "address": "9000 West 67th Street",
    "city": "Merriam",
    "state": "KS",
    "zip": "66202",
    "dcfDiff": 44.0502,
    "dcf": 4019.16,
    "image": "https://financialmodelingprep.com/image-stock/SEB.png",
    "ipoDate": "1973-02-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]