[
  {
    "symbol": "SEDG",
    "price": 257.96,
    "beta": 1.420774,
    "volAvg": 1078440,
    "mktCap": 14534678812,
    "lastDiv": 0,
    "range": "190.15-375.9",
    "changes": 2.73,
    "companyName": "SolarEdge Technologies, Inc.",
    "currency": "USD",
    "cik": "0001419612",
    "isin": "US83417M1045",
    "cusip": "83417M104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Solar",
    "website": "https://www.solaredge.com",
    "description": "SolarEdge Technologies, Inc., together with its subsidiaries, designs, develops, and sells direct current (DC) optimized inverter systems for solar photovoltaic (PV) installations worldwide. It operates through five segments: Solar, Energy Storage, e-Mobility, Critical Power, and Automation Machines. The company offers inverters, power optimizers, communication devices, and smart energy management solutions used in residential, commercial, and small utility-scale solar installations; and a cloud-based monitoring platform that collects and processes information from the power optimizers and inverters, as well as monitors and manages the solar PV system. It also provides residential, commercial, and large scale PV, energy storage and backup, electric vehicle charging, and home energy management solutions, as well as grid services; and e-Mobility, automation machines, lithium-ion cells and battery packs, and uninterrupted power supply solutions, as well as virtual power plants, which helps to manage the load on the grid and grid stability. In addition, the company offers pre-sales support, ongoing trainings, and technical support and after installation services. The company sells its products to the providers of solar PV systems; and solar installers and distributors, electrical equipment wholesalers, and PV module manufacturers, as well as engineering, procurement, and construction firms. SolarEdge Technologies, Inc. was founded in 2006 and is headquartered in Herzliya, Israel.",
    "ceo": "Mr. Zvi  Lando",
    "sector": "Technology",
    "country": "IL",
    "fullTimeEmployees": "4926",
    "phone": "972 9 957 6620",
    "address": "1 HaMada Street",
    "city": "Herzliya",
    "state": null,
    "zip": "4673335",
    "dcfDiff": 5.01044,
    "dcf": 311.45,
    "image": "https://financialmodelingprep.com/image-stock/SEDG.png",
    "ipoDate": "2015-03-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]