[
  {
    "symbol": "SEE",
    "price": 38.65,
    "beta": 1.254225,
    "volAvg": 1271888,
    "mktCap": 5580518900,
    "lastDiv": 0.8,
    "range": "37.34-62.14",
    "changes": -0.66,
    "companyName": "Sealed Air Corporation",
    "currency": "USD",
    "cik": "0001012100",
    "isin": "US81211K1007",
    "cusip": "81211K100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaging & Containers",
    "website": "https://www.sealedair.com",
    "description": "Sealed Air Corporation provides food safety and security, and product protection solutions and equipment in North America, South America, Europe, the Middle East, Africa, and the Asia Pacific. It operates through two segments, Food and Protective. The Food segment offers integrated packaging materials and automation equipment solutions to provide food safety and shelf life extension, reduce food waste, automate processes, and optimize total cost for food processors in the fresh red meat, smoked and processed meats, poultry, seafood, plant-based, and dairy markets under the CRYOVAC, CRYOVAC Grip & Tear, CRYOVAC Darfresh, Simple Steps, and Optidure brands. This segment sells its solutions directly to customers through its sales, marketing, and customer service personnel. The Protective segment provides foam, inflatable, suspension and retention, temperature assurance packaging solutions to protect goods to e-commerce, consumer goods, pharmaceutical and medical devices, and industrial manufacturing markets under the SEALED AIR, BUBBLE WRAP, AUTOBAG, SEALED AIR, AUTOBAG, Instapak, Korrvu, Kevothermal, and TempGuard brands. This segment sells its solutions through supply distributors, as well as directly to fabricators, original equipment manufacturers, contract manufacturers, logistics partners, and e-commerce/fulfillment operations. Sealed Air Corporation was incorporated in 1960 and is headquartered in Charlotte, North Carolina.",
    "ceo": "Mr. Edward L. Doheny II",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "16300",
    "phone": "980 221 3235",
    "address": "2415 Cascade Pointe Boulevard",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28208",
    "dcfDiff": 1.19615,
    "dcf": 54.7562,
    "image": "https://financialmodelingprep.com/image-stock/SEE.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]