[
  {
    "symbol": "SEIC",
    "price": 58.69,
    "beta": 1.018661,
    "volAvg": 528677,
    "mktCap": 7823729140,
    "lastDiv": 0.86,
    "range": "46.3-64.69",
    "changes": -0.02,
    "companyName": "SEI Investments Company",
    "currency": "USD",
    "cik": "0000350894",
    "isin": "US7841171033",
    "cusip": "784117103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Asset Management",
    "website": "https://www.seic.com",
    "description": "SEI Investments Company is a publicly owned asset management holding company. Through its subsidiaries, the firm provides wealth management, retirement and investment solutions, asset management, asset administration, investment processing outsourcing solutions, financial services, and investment advisory services to its clients. It provides its services to private banks, independent financial advisers, institutional investors, investment managers, investment advisors, wealth management organizations, corporations, retirement scheme sponsors, not-for-profit organizations, hedge fund managers, registered investment advisers, independent broker-dealers, financial planners, life insurance agents, defined-benefit schemes, defined-contribution schemes, endowments, foundations, and board-designated fund, through its subsidiaries. Through its subsidiaries, the firm manages separate client-focused portfolios. It also launches and manages equity, fixed income, and balanced mutual funds, through its subsidiaries. Through its subsidiaries, the firm invests in public equity and fixed income markets. It employs fundamental and quantitative analysis with a focus on top-down and bottom-up analysis to make its investments, through its subsidiaries. SEI Investments Company was founded in 1968 and is based in Oaks, Pennsylvania.",
    "ceo": "Mr. Ryan P. Hicke",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4805",
    "phone": "610 676 1000",
    "address": "1 Freedom Valley Drive",
    "city": "Oaks",
    "state": "PA",
    "zip": "19456",
    "dcfDiff": 4.65746,
    "dcf": 66.7375,
    "image": "https://financialmodelingprep.com/image-stock/SEIC.png",
    "ipoDate": "1981-03-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]