[
  {
    "symbol": "SEKEY",
    "price": 7.785,
    "beta": 1.124904,
    "volAvg": 17922,
    "mktCap": 5163914811,
    "lastDiv": 0.23,
    "range": "6.61-8.21",
    "changes": 0.105,
    "companyName": "Seiko Epson Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US81603X1081",
    "cusip": "81603X108",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Computer Hardware",
    "website": "https://global.epson.com",
    "description": "Seiko Epson Corporation, together with its subsidiaries, develops, manufactures, sells, and provides services for products in the printing solutions, visual communications, manufacturing-related and wearables, and other businesses. It operates through three segments: Printing Solutions, Visual Communications, and Manufacturing-related and Wearables segments. The Printing Solutions segment offers home and office inkjet printers, serial impact dot matrix printers, page printers, color image scanners, dry process office papermaking systems, commercial and industrial inkjet printers, inkjet printheads, printers for use in POS systems, label printers, printer consumables, and others. The Visual Communications segment provides 3LCD projectors for business, education, the home, and event; smart glasses; and others. The Manufacturing-related and Wearables segment offers wristwatches, watch movements, and others; factory automation products, industrial robots, compact injection molders, and other production systems; and crystal units, crystal oscillators, quartz sensors, and others for consumer, automotive, and industrial equipment applications. This segment also provides CMOS LSIs and other chips primarily for consumer electronics and automotive applications; and metal powders for use as raw materials in the production of electronic components, etc., as well as value-added surface finishing in a range of industrial fields. The company also sells PCs, etc. It has operations in Japan, the Philippines, the United States, Indonesia, China, and internationally. The company was incorporated in 1942 and is headquartered in Suwa, Japan.",
    "ceo": "Mr. Yasunori  Ogawa",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "77642",
    "phone": "81 2 6652 3131",
    "address": "3-5, Owa 3-chome",
    "city": "Suwa",
    "state": null,
    "zip": "392-8502",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SEKEY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]