[
  {
    "symbol": "SEM",
    "price": 31.69,
    "beta": 1.39683,
    "volAvg": 575304,
    "mktCap": 4028654630,
    "lastDiv": 0.5,
    "range": "18.86-32.31",
    "changes": 0.48,
    "companyName": "Select Medical Holdings Corporation",
    "currency": "USD",
    "cik": "0001320414",
    "isin": "US81619Q1058",
    "cusip": "81619Q105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Care Facilities",
    "website": "https://www.selectmedical.com",
    "description": "Select Medical Holdings Corporation, through its subsidiaries, operates critical illness recovery hospitals, rehabilitation hospitals, outpatient rehabilitation clinics, and occupational health centers in the United States. The company's Critical Illness Recovery Hospital segment consists of hospitals that provide services for heart failure, infectious disease, respiratory failure and pulmonary disease, surgery requiring prolonged recovery, renal disease, neurological events, and trauma. Its Rehabilitation Hospital segment offers therapy and rehabilitation treatments, including rehabilitative services for brain and spinal cord injuries, strokes, amputations, neurological disorders, orthopedic conditions, pediatric congenital or acquired disabilities, and cancer. The company's Outpatient Rehabilitation segment operates rehabilitation clinics that provide physical, occupational, and speech rehabilitation programs and services; and specialized programs, such as functional programs for work related injuries, hand therapy, post-concussion rehabilitation, pediatric and cancer rehabilitation, and athletic training services. Its Concentra segment operates and provides occupational health centers and contract services at employer worksites that deliver occupational medicine, consumer health, physical therapy, and wellness services. As of December 31, 2021, the company operated 104 critical illness recovery hospitals in 28 states; 30 rehabilitation hospitals in 12 states; 1,881 outpatient rehabilitation clinics in 38 states and the District of Columbia; and 518 occupational health centers in 41 states, and 134 onsite clinics at employer worksites states. Select Medical Holdings Corporation was founded in 1996 and is headquartered in Mechanicsburg, Pennsylvania.",
    "ceo": "Mr. David S. Chernow",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "37800",
    "phone": "717 972 1100",
    "address": "4714 Gettysburg Road",
    "city": "Mechanicsburg",
    "state": "PA",
    "zip": "17055",
    "dcfDiff": 4.44098,
    "dcf": 24.139,
    "image": "https://financialmodelingprep.com/image-stock/SEM.png",
    "ipoDate": "2009-09-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]