[
  {
    "symbol": "SEOAY",
    "price": 11.57,
    "beta": 0.923371,
    "volAvg": 48601,
    "mktCap": 9124333770,
    "lastDiv": 0.65,
    "range": "11.32-16.89",
    "changes": 0.03,
    "companyName": "Stora Enso Oyj",
    "currency": "USD",
    "cik": null,
    "isin": "US86210M1062",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Paper & Paper Products",
    "website": "https://www.storaenso.com",
    "description": "Stora Enso Oyj provides renewable solutions for the packaging, biomaterials, wooden constructions, and paper industries worldwide. It operates through Packaging Materials, Packaging Solutions, Biomaterials, Wood Products, Forest, Paper, and Other segments. The company's Packaging Materials segment offers virgin and recycled fiber renewable and recyclable packaging materials for food and drink, pharmaceutical, and transport packaging. Its Packaging Solutions segment develops and sells fiber-based packaging products and services, including corrugated, carton board and other converting products, design services, automation solutions, and formed fiber and wood foams for various market sectors, such as store retail, e-commerce, and industrials. The company's Biomaterials segment provides various pulp grades for paper, board, tissue, textile, and hygiene product producers; and tall oil and turpentine from biomass. Its Wood Products segment offers wood-based solutions, including digital tools for designing of building projects; sawn woods; and pellets for sustainable heating, as well as applications for windows, doors, and packaging industries. The company's Forest segment engages in sustainable forest management, as well as supplies wood. Its Paper segment provides paper products for print and office use. The company's Other segment holds an interest in Pohjolan Voima Oy, a company that produces electricity and heat. It serves packaging manufacturers, brand owners, paper and board producers, publishers, retailers, printing houses, converters, joinery, and construction companies. The company was incorporated in 1996 and is headquartered in Helsinki, Finland.",
    "ceo": "Ms. Annica  Bresky M.B.A., M.Sc.",
    "sector": "Basic Materials",
    "country": "FI",
    "fullTimeEmployees": "21000",
    "phone": "358 2046 111",
    "address": "Salmisaarenaukio 2",
    "city": "Helsinki",
    "state": null,
    "zip": "00101",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SEOAY.png",
    "ipoDate": "2000-09-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]