[
  {
    "symbol": "SEPJY",
    "price": 22.48,
    "beta": 0.747126,
    "volAvg": 29,
    "mktCap": 4694723200,
    "lastDiv": 0.46,
    "range": "14.98-24.32",
    "changes": -1.02,
    "companyName": "Spectris plc",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.spectris.com",
    "description": "Spectris plc manufactures and sells measuring instruments and controls worldwide. It operates through Malvern Panalytical, HBK, Omega and Industrial Solutions segments. The Malvern Panalytical segment provides measurement and materials characterization and efficiency in R&D and manufacturing sectors. The HBK segment offers differentiated sensing, testing, modelling and simulation solutions for product development. The Omega segment provides process improvement, specialist sensors, and omni-channel distribution services. The Industrial Solutions segment operates high-value precision in-line sensing and monitors businesses. It also provides particle measuring systems, a solution to measure and monitor contamination levels in clean and controlled environments. In addition, the company offers red lion controls, an industrial automation tool that provides solutions to connect, monitor, and control disparate assets, as well as provides servomex, a specialist in gas and moisture analysis solutions. Further, it provides data and insights, test equipment and software for industrial applications. Additionally, the company offers sensor, instrument, software, and services technology, as well as provides training, technical support, spare parts, calibration, and maintenance services. It serves pharmaceutical, automotive, electronics, semiconductors, technology-LED, and primary and advanced materials industries. Spectris plc was incorporated in 1986 and is based in London, the United Kingdom.",
    "ceo": "Mr. Andrew  Heath",
    "sector": "Technology",
    "country": "GB",
    "fullTimeEmployees": "7608",
    "phone": "44 20 4566 9400",
    "address": "Melbourne House",
    "city": "London",
    "state": null,
    "zip": "WC2B 4LL",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SEPJY.png",
    "ipoDate": "2012-03-14",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]