[
  {
    "symbol": "SF",
    "price": 58.21,
    "beta": 1.25669,
    "volAvg": 637066,
    "mktCap": 6177885510,
    "lastDiv": 1.44,
    "range": "49.31-68.77",
    "changes": 0.06,
    "companyName": "Stifel Financial Corp.",
    "currency": "USD",
    "cik": "0000720672",
    "isin": "US8606301021",
    "cusip": "860630102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.stifel.com",
    "description": "Stifel Financial Corp., a financial services and bank holding company, provides retail and institutional wealth management, and investment banking services to individual investors, corporations, municipalities, and institutions in the United States, the United Kingdom, the rest of Europe, and Canada. It operates in three segments: Global Wealth Management, Institutional Group, and Other. The company provides private client services, including securities transaction and financial planning services; institutional equity and fixed income sales, trading and research, and municipal finance services; investment banking services, such as mergers and acquisitions, public offerings, and private placements; and retail and commercial banking services comprising personal and commercial lending programs, as well as deposit accounts. It also participates in and manages underwritings for corporate and public finance; and offers financial advisory and securities brokerage services. The company was founded in 1890 and is headquartered in St. Louis, Missouri.",
    "ceo": "Mr. Ronald James Kruszewski",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "8898",
    "phone": "314 342 2000",
    "address": "One Financial Plaza",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63102-2188",
    "dcfDiff": 13.986,
    "dcf": 80.356,
    "image": "https://financialmodelingprep.com/image-stock/SF.png",
    "ipoDate": "1983-07-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]