[
  {
    "symbol": "SFBS",
    "price": 41.05,
    "beta": 0.859154,
    "volAvg": 288764,
    "mktCap": 2233037900,
    "lastDiv": 1.12,
    "range": "39.66-93.83",
    "changes": -1.82,
    "companyName": "ServisFirst Bancshares, Inc.",
    "currency": "USD",
    "cik": "0001430723",
    "isin": "US81768T1088",
    "cusip": "81768T108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.servisfirstbank.com",
    "description": "ServisFirst Bancshares, Inc. operates as the bank holding company for ServisFirst Bank that provides various banking services to individual and corporate customers. It accepts demand, time, savings, and other deposits; checking, money market, and IRA accounts; and certificates of deposit. The company's loan products include commercial lending products, such as seasonal, bridge, and term loans for working capital, expansion of the business, acquisition of property, and plant and equipment, as well as commercial lines of credit; commercial real estate loans, construction and development loans, and residential real estate loans; and consumer loans, such as home equity loans, vehicle financing, loans secured by deposits, and secured and unsecured personal loans. It also offers other banking products and services comprising telephone and mobile banking, direct deposit, Internet banking, traveler's checks, safe deposit boxes, attorney trust accounts, automatic account transfers, automated teller machines, and debit card systems, as well as Visa credit cards; treasury and cash management services; wire transfer, night depository, banking-by-mail, and remote capture services; and correspondent banking services to other financial institutions. In addition, the company holds and manages participations in residential mortgages and commercial real estate loans originated by ServisFirst Bank in Alabama, Florida, Georgia, and Tennessee. It operates 23 full-service banking offices located in Alabama, Florida, Georgia, South Carolina, and Tennessee, as well as 2 loan production offices in Florida. The company was founded in 2005 and is headquartered in Birmingham, Alabama.",
    "ceo": "Mr. Thomas Ashford Broughton III",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "573",
    "phone": "205 949 0302",
    "address": "2500 Woodcrest Place",
    "city": "Birmingham",
    "state": "AL",
    "zip": "35209",
    "dcfDiff": 84.9998,
    "dcf": 151.93,
    "image": "https://financialmodelingprep.com/image-stock/SFBS.png",
    "ipoDate": "2014-05-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]