[
  {
    "symbol": "SFTBY",
    "price": 23.01,
    "beta": 0.956704,
    "volAvg": 337187,
    "mktCap": 67329330532,
    "lastDiv": 0.16,
    "range": "16.86-24.85",
    "changes": 0.2,
    "companyName": "SoftBank Group Corp.",
    "currency": "USD",
    "cik": "0001065521",
    "isin": "US83404D1090",
    "cusip": "83404D109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://group.softbank",
    "description": "SoftBank Group Corp. provides telecommunication services in Japan and internationally. It operates through five segments: Investment Business of Holding Companies, SoftBank Vision Funds, SoftBank, Arm, and Latin America Funds. The company offers mobile communications, broadband, and fixed-line communications services; and sells mobile devices. It is also involved in the internet advertising marketing, online advertising distribution, and e-book distribution services; planning and operation of fashion e-commerce website; mail-order sale of stationery and services; and design and development of mobile robots. In addition, the company designs microprocessor intellectual property and related technology; sells software tools; and generates, supplies, and sells electricity from renewable energy sources, as well as offers related services. Further, it provides alternative investment management, smartphone payment, PC software downloads, and banking services, as well as solutions and services for online businesses; distributes video, voice, and data content; manufactures, distributes, and sells IT-related products, as well as IT-related services; and manages funds. Additionally, the company operates a professional baseball team; and ITmedia, an IT information site, as well as manages and maintains baseball stadium and other sports facilities. It also plans and operates ZOZOTOWN, ZOZO, and ZOZOBASE websites. The company was formerly known as SoftBank Corp. and changed its name to SoftBank Group Corp. in July 2015. SoftBank Group Corp. was incorporated in 1981 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Masayoshi  Son",
    "sector": "Communication Services",
    "country": "JP",
    "fullTimeEmployees": "63339",
    "phone": "81 3 6889 2000",
    "address": "1-7-1, Kaigan",
    "city": "Tokyo",
    "state": null,
    "zip": "105-7537",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SFTBY.png",
    "ipoDate": "2011-02-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]