[
  {
    "symbol": "SGAPY",
    "price": 18.68,
    "beta": 0.524521,
    "volAvg": 45072,
    "mktCap": 30869634299,
    "lastDiv": 0.73,
    "range": "16.19-20.82",
    "changes": -0.13,
    "companyName": "Singapore Telecommunications Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US82929R3049",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.singtel.com",
    "description": "Singapore Telecommunications Limited, together with its subsidiaries, provides telecommunication services to consumers and small businesses in Singapore, Australia, the United States, Europe, and internationally. The company engages in the carriage business, including mobile, pay television, fixed broadband, voice, and content and digital services, as well as equipment sales; digital media and advertising services; integrated information and communications technology solutions, such as cloud computing, multi-access edge computing, software-defined network, and digital solutions; fund management services to enterprise customers. It also offers mobile phones, accessories, watches, watch straps, cables, adapters, multimedia hubs, cameras, gimbals, cases, chargers, drones, earphones, headphones, microphones, keyboards, laptops, screen protectors, speakers, tablets, trackers, and wearables, as well as mouse, connectivity, gaming, smart home, power solution, and storage solution products; postpaid and prepaid plans; and postpaid add-on, roaming, 5G, and AR/VR entertainment services. In addition, the company provides broadband plans and add-on, WiFi mesh, Wi-Fi 6, Microsoft 365 subscription, TV packages and guides, TV Go, video on demand, instalment plans, wellness, news stand, music, and telephony services; car, home content, domestic helper, and travel insurance; DVR set top boxes; lifestyle products; and Singtel Surf School that offers cyber fun, safety, and education services, as well as tech workshops. Further, it offers cloud, data center, and software-as-a service; Internet of Things; cyber security, IT, professional consulting, and managed services; voice unified communications, cloud conferencing, international calling, and SIP trunking services; managed network and managed unified communications services; satellite services; and Singtel Liquid-X, a suite of cloud centric services. The company was incorporated in 1992 and is headquartered in Singapore.",
    "ceo": "Mr. Kuan Moon  Yuen",
    "sector": "Communication Services",
    "country": "SG",
    "fullTimeEmployees": "24368",
    "phone": "65 6838 3388",
    "address": "31 Exeter Road",
    "city": "Singapore",
    "state": null,
    "zip": "239732",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SGAPY.png",
    "ipoDate": "2006-09-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]