[
  {
    "symbol": "SGEN",
    "price": 193.87,
    "beta": 0.522887,
    "volAvg": 1451169,
    "mktCap": 36351400480,
    "lastDiv": 0,
    "range": "116.08-207.17",
    "changes": -2.61,
    "companyName": "Seagen Inc.",
    "currency": "USD",
    "cik": "0001060736",
    "isin": "US8125781026",
    "cusip": "81181C104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.seagen.com",
    "description": "Seagen Inc., a biotechnology company, develops and commercializes therapies for the treatment of cancer in the United States and internationally. The company offers ADCETRIS, an antibody-drug conjugate (ADC) for the treatment of patients with Hodgkin lymphoma or CD30-positive T-cell lymphomas; PADCEV, an ADC targeting Nectin-4 for the treatment of advanced or metastatic urothelial cancer; and TUKYSA, an oral small molecule tyrosine kinase inhibitor for the treatment of adult patients with advanced unresectable or metastatic HER2-positive breast cancer. It also develops TIVDAK for metastatic cervical cancer and other solid tumors; Ladiratuzumab Vedotin, an ADC targeting LIV-1 for metastatic breast cancer and solid tumors; Disitamab Vedotin, a novel HER2-targeted ADC; and SEA-CD40, SEA-TGT, SEA-BCMA, and SEA-CD70 for various cancer diseases. Seagen Inc. has collaboration agreements with Takeda Pharmaceutical Company Limited; Agensys, Inc.; Genmab A/S; Merck; and RemeGen, Co. Ltd. The company was formerly known as Seattle Genetics, Inc. and changed its name to Seagen Inc. in October 2020. Seagen Inc. was incorporated in 1997 and is headquartered in Bothell, Washington.",
    "ceo": "Mr. David R. Epstein B.Sc., M.B.A.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "3256",
    "phone": "425 527 4000",
    "address": "21823 30th Drive SE",
    "city": "Bothell",
    "state": "WA",
    "zip": "98021",
    "dcfDiff": 14.238,
    "dcf": 126.432,
    "image": "https://financialmodelingprep.com/image-stock/SGEN.png",
    "ipoDate": "2001-03-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]