[
  {
    "symbol": "SGIOY",
    "price": 10.73,
    "beta": 0.538314,
    "volAvg": 81950,
    "mktCap": 12631570257,
    "lastDiv": 0.24,
    "range": "10.68-14.13",
    "changes": 0.05,
    "companyName": "Shionogi & Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US8246671098",
    "cusip": "824667109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.shionogi.com",
    "description": "Shionogi & Co., Ltd. engages in the research, development, manufacture, and distribution of pharmaceuticals, diagnostic reagents, and medical devices in Japan. It offers Fetroja, a multidrug-resistant for gram-negative bacterial infection treatment; Xofluza, an influenza virus drug; and Tivicay for HIV treatment. It also develops Symproic for opioid-induced constipation treatment; S-120083 for Inflammatory pain; S-010887 for Neuropathic pain; S-117957 for Insomnia; sivopixant for Neuropathic pain, Sleep Apnea Syndrome, and Refractory/unexplainedchronic cough; S-637880 for Neuropathic Low Back Pain; Zuranolone for Depression; SDT-001 for attention-deficit/hyperactivity disorder patients; BPN14770 for Fragile X syndrome and Alzheimer's disease; and S-237648 and S-309309 for Obesity. In addition, the company develops ADR-001 for Decompensated liver cirrhosis; S-723595 for NASH; S-588410 for Esophageal and Bladder cancer; S-488210 for Head and neck squamouscell carcinoma; S-588210 for Solid tumor; S-222611 for Malignant tumor; S-770108 for Idiopathic pulmonary fibrosis; SR-0379 for Cutaneous ulcer; S-005151 for Stroke and Epidermolysis bullosa; S-531011 for Solid tumor; S-0373 for Spinocerebellar ataxia; and S-600918 and S-217622 for COVID-19, as well as S-555739 for Control of the aggravation of COVID-19. Further, it offers antibody test kits for COVID-19. Shionogi & Co., Ltd. has collaboration agreements with Nagasaki University, the National Institute of Infectious Diseases, and The Kitasato University to develop antimalarial drugs. The company was formerly known as Shionogi Shoten Co., Ltd. and changed its name to Shionogi & Co., Ltd. in 1943. Shionogi & Co., Ltd. was founded in 1878 and is headquartered in Osaka, Japan.",
    "ceo": "Dr. Isao  Teshirogi Ph.D.",
    "sector": "Healthcare",
    "country": "JP",
    "fullTimeEmployees": "5693",
    "phone": "81 6 6202 2161",
    "address": "1-8, Doshomachi 3-chome",
    "city": "Osaka",
    "state": null,
    "zip": "541-0045",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SGIOY.png",
    "ipoDate": "2015-12-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]