[
  {
    "symbol": "SGRY",
    "price": 44.56,
    "beta": 2.752464,
    "volAvg": 669825,
    "mktCap": 5635948800,
    "lastDiv": 0,
    "range": "20.46-44.65",
    "changes": 1.28,
    "companyName": "Surgery Partners, Inc.",
    "currency": "USD",
    "cik": "0001638833",
    "isin": "US86881A1007",
    "cusip": "86881A100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Care Facilities",
    "website": "https://www.surgerypartners.com",
    "description": "Surgery Partners, Inc., through its subsidiaries, owns and operates a network of surgical facilities and ancillary services in the United States. The company operates through two segments, Surgical Facility Services and Ancillary Services. Its surgical facilities comprise ambulatory surgery centers and surgical hospitals that offer non-emergency surgical procedures in various specialties, including gastroenterology, general surgery, ophthalmology, orthopedics, and pain management. The company's surgical hospitals also provide ancillary services, such as diagnostic imaging, pharmacy, laboratory, obstetrics, oncology, physical therapy, and wound care; and ancillary services, which consist of multi-specialty physician practices, urgent care facilities, and anesthesia services. As of December 31, 2021, it owned or operated a portfolio of 126 surgical facilities, including 108 ambulatory surgical centers and 18 surgical hospitals in 31 states. Surgery Partners, Inc. was founded in 2004 and is headquartered in Brentwood, Tennessee.",
    "ceo": "Mr. J. Eric Evans",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "9100",
    "phone": "615 234 5900",
    "address": "310 Seven Springs Way",
    "city": "Brentwood",
    "state": "TN",
    "zip": "37027",
    "dcfDiff": 0.540088,
    "dcf": 33.1801,
    "image": "https://financialmodelingprep.com/image-stock/SGRY.png",
    "ipoDate": "2015-09-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]