[
  {
    "symbol": "SGSOY",
    "price": 9.36,
    "beta": 0.635249,
    "volAvg": 167657,
    "mktCap": 17243553300,
    "lastDiv": 0.35,
    "range": "8.159264-10.256102",
    "changes": -0.0095,
    "companyName": "SGS SA",
    "currency": "USD",
    "cik": null,
    "isin": "US8188001049",
    "cusip": "818800104",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Consulting Services",
    "website": "https://www.sgs.com",
    "description": "SGS SA provides inspection, verification, testing, certification, and quality assurance services in Europe, Africa, the Middle East, the Americas, and the Asia Pacific. It operates in five segments: Connectivity & Products, Health & Nutrition, Industries & Environment, Natural Resources and Knowledge. The company provides laboratory testing, product inspection and consulting, process assessment, technical and transactional assistance; digital solutions, which include cybersecurity, the internet of things, digital platform, and mobile application services. In addition, it offers a range of testing, inspection and certification solutions for the crop science, food, health science, and cosmetics and hygiene industries; field services, technical assessment and advisory services; and services related to industrial, public health and safety, environmental testing, and public mandates. Further, it provides certification, training, supply chain assurance, technical consulting, and ESG assurance services; and laboratory outsourcing, commodities logistics, geochemistry, metallurgy, sustainability, and market intelligence solutions. The company serves the agriculture and food, chemical, construction, consumer and retail, energy, industrial manufacturing, life sciences, mining, oil and gas, public, and transportation sectors. SGS SA was founded in 1878 and is headquartered in Geneva, Switzerland.",
    "ceo": "Mr. Kwok Wang Ng",
    "sector": "Industrials",
    "country": "CH",
    "fullTimeEmployees": "93711",
    "phone": "41 22 739 91 11",
    "address": "1 Place Des Alpes",
    "city": "Geneva",
    "state": null,
    "zip": "1211",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SGSOY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]