[
  {
    "symbol": "SHALY",
    "price": 14.4514,
    "beta": 0.788505,
    "volAvg": 9,
    "mktCap": 2724479218,
    "lastDiv": 6.069000000000001,
    "range": "10.93-20.48",
    "changes": 0,
    "companyName": "Shangri-La Asia Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Lodging",
    "website": "https://www.shangri-la.com",
    "description": "Shangri-La Asia Limited, an investment holding company, develops, owns/leases, operates, and manages hotels and associated properties worldwide. It operates through four segments: Hotel Properties, Hotel Management and Related Services, Investment Properties, and Property Development for Sale. The company develops, owns, and operates office and commercial properties, and serviced apartments/residences; and operates restaurants and amusement parks. It is also involved in the hotel ownership, and property rental and sale business; and property investment, as well as wines trading activities. The company operates hotels under the Shangri-La Hotels and Resorts, Kerry Hotels, JEN by Shangri-La, Traders Hotel, Rasa, Summer Palace, and Shang Palace, as well as CHI, The Spa at Shangri-La brand names. As of December 31, 2021, it had equity interests in 80 operating hotels and 3 hotels under operating lease with 35,154 rooms. Shangri-La Asia Limited was founded in 1971 and is headquartered in Quarry Bay, Hong Kong.",
    "ceo": "Mr. Chuen Kee  Paw",
    "sector": "Consumer Cyclical",
    "country": "HK",
    "fullTimeEmployees": "23900",
    "phone": "852 2525 9146",
    "address": "Kerry Centre",
    "city": "Quarry Bay",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SHALY.png",
    "ipoDate": "2006-12-01",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]