[
  {
    "symbol": "SHCAY",
    "price": 1.32,
    "beta": 1.36475,
    "volAvg": 34164,
    "mktCap": 3533336321,
    "lastDiv": 0.07,
    "range": "1.28-2.08",
    "changes": 0.0075,
    "companyName": "Sharp Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US8198823093",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Consumer Electronics",
    "website": "https://global.sharp",
    "description": "Sharp Corporation manufactures and sells telecommunication equipment, electric and electronic application equipment, and electronic components in Japan, China, and internationally. It operates through five segments: Smart Life, 8K Ecosystem, ICT, Display Device, and Electronic Device. The Smart Life segment offers refrigerators, superheated steam ovens, microwave ovens, small cooking appliances, air conditioners, washing machines, vacuum cleaners, air purifiers, fans, dehumidifiers, humidifiers, electric heating equipment, plasma cluster ion generators, beauty equipment, electronic dictionaries, calculators, telephones, network control units, solar cells, storage batteries etc. The 8K Ecosystem segment provides TVs, Blu-ray disc recorders, audio equipment, multi-function printers, information displays, business projectors, POS system equipment, FA equipment, options/consumables, software, masks etc. The ICT segment offers mobile phones, personal computers, tablet devices, routers etc. The Display Device segments provides display modules, in-vehicle cameras etc. The Electronic Device segment offers camera modules, sensor modules, proximity sensors, dust sensors, wafer foundry, CMOS / CCD sensors, semiconductor lasers etc. The company was formerly known as Hayakawa Electric Industry Co., Ltd. and changed its name to Sharp Corporation in January 1970. Sharp Corporation was founded in 1912 and is headquartered in Sakai, Japan.",
    "ceo": "Po-Hsuan  Wu",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "47941",
    "phone": "81 72 282 1221",
    "address": "1 Takumi-cho",
    "city": "Sakai",
    "state": null,
    "zip": "590-8522",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SHCAY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]