[
  {
    "symbol": "SHECY",
    "price": 16.51,
    "beta": 1.17931,
    "volAvg": 250284,
    "mktCap": 133299759857,
    "lastDiv": 0.34,
    "range": "9.739896-17.67507",
    "changes": 0.31,
    "companyName": "Shin-Etsu Chemical Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US8245511055",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Chemicals",
    "website": "https://www.shinetsu.co.jp",
    "description": "Shin-Etsu Chemical Co., Ltd. engages in the polyvinyl chloride (PVC)/chlor-alkali, semiconductor silicon, silicones, electronics and functional materials, specialty chemicals, processing, and trading and specialized businesses worldwide. The company operates through Infrastructure Materials; Electronics Materials; Functional Materials; and Processing and Specialized Services segments. It offers PVC- framed windows; electric, hybrid, and fuel cell vehicles; wind power generators, air conditioners, aircrafts, industrial motors, semiconductor silicon used in semiconductors for robots; and cellulose derivative products. The company also offers pipes for water supply and sewerage systems; caustic soda; polyvinyl alcohol; photoresists photomasks blanks; encapsulant materials; rare earth magnets; silicon wafers, LED packaging materials, and synthetic quartz; pellicles; SOLBIN, a copolymer resin; anode material of batteries; and input devices, wafer cases, and wrapping films. The company was formerly known as Shin-Etsu Nitrogen Fertilizer Co., Ltd. and changed its name to Shin-Etsu Chemical Co., Ltd. in 1940. The company was incorporated in 1926 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Yasuhiko  Saitoh",
    "sector": "Basic Materials",
    "country": "JP",
    "fullTimeEmployees": "25625",
    "phone": "81 3 3246 5091",
    "address": "Marunouchi Eiraku Building",
    "city": "Tokyo",
    "state": null,
    "zip": "100-0005",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SHECY.png",
    "ipoDate": "2008-11-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]