[
  {
    "symbol": "SHMUY",
    "price": 21.28,
    "beta": 0.601915,
    "volAvg": 0,
    "mktCap": 4217526015,
    "lastDiv": 0.65,
    "range": "19.62-22.69",
    "changes": 0,
    "companyName": "Shimizu Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US82454Y1047",
    "cusip": "82454Y104",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Engineering & Construction",
    "website": "https://www.shimz.co.jp",
    "description": "Shimizu Corporation engages in the building contracting, civil engineering, machinery, and other construction works in Japan. It is also involved in the research, planning, study, evaluation, diagnosis, soil analysis, surveying, design, supervision, management, and consultancy related to regional, urban, ocean, space, resources, and energy developments, as well as construction works and environment improvement; and purchase, sale, letting, brokerage, management, appraisal, and consultancy of real estate. The company constructs, lets, sells, and caretaking of residential houses and other buildings; plans, constructs, possesses, maintains, and operates public office buildings, roads, harbors, airports, and parks, as well as educational and cultural, medical and welfare, and water supply and sewerage facilities; generates and supplies electricity and heat; undertakes purification works; collects, disposes, and reutilizes waste; and designs, installs, leases, sells, and maintains information communication and building management system. It also engages in the cultivation of agricultural produce and seafood, and forestry work; maintenance and upkeep, security, and cleaning of buildings, equipment, and machinery; and design, manufacture, sale, lease, and brokerage of construction machinery and materials, concrete and wooden products, furniture, and interior fitting. The company offers industrial property, copyrights, and computer software; pharmaceutical, medical care material, and medical machinery and equipment; and advertisement, publication, printing, images and other information media, business event, inland transportation, warehouse, distribution center, insurance and travel agency, manpower supply, loan, guarantee, and factoring services. It also engages in the management and consultancy of sporting, hotel, restaurant, nursing, and resort facilities. The company was founded in 1804 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Kazuyuki  Inoue",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "17036",
    "phone": "81 3 3561 1111",
    "address": "No.16-1 Kyobashi 2-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "104-8370",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SHMUY.png",
    "ipoDate": "2015-04-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]