[
  {
    "symbol": "SHOO",
    "price": 32.71,
    "beta": 1.148591,
    "volAvg": 937208,
    "mktCap": 2486254390,
    "lastDiv": 0.84,
    "range": "26.36-37.85",
    "changes": 0.6,
    "companyName": "Steven Madden, Ltd.",
    "currency": "USD",
    "cik": "0000913241",
    "isin": "US5562691080",
    "cusip": "556269108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Footwear & Accessories",
    "website": "https://www.stevemadden.com",
    "description": "Steven Madden, Ltd. designs, sources, markets, and sells fashion-forward branded and private label footwear, accessories, and apparel for women, men, and children in the United States and internationally. Its Wholesale Footwear segment provides footwear under the Steve Madden, Steven by Steve Madden, Madden Girl, BB Dakota, Dolce Vita, DV Dolce Vita, Betsey Johnson, GREATS, Blondo, Anne Klein, Mad Love, Superga, Madden NYC, and COOL Planet brands, as well as private label footwear. The company's Wholesale Accessories/Apparel segment offers handbags, apparel, small leather goods, belts, soft accessories, fashion scarves, wraps, gifting, and other accessories under the Steve Madden, BB Dakota, Anne Klein, Betsey Johnson, Cejon, Madden NYC, and Dolce Vita brands, as well as private label handbag and accessories to department stores, mass merchants, off-price retailers, online retailers, specialty stores, and independent stores. Its Direct-to-Consumer segment operates Steve Madden and Superga full-price retail stores, Steve Madden outlet stores, and Steve Madden shop-in-shops, as well as digital e-commerce websites, including SteveMadden.com, DolceVita.com, betseyjohnson.com, Blondo.com, GREATS.com, and Superga-USA.com. The company's Licensing segment licenses its Steve Madden, Madden Girl, and Betsey Johnson trademarks. Its First Cost segment operates as a buying agent for footwear products under private labels for national chains, specialty retailers, and value-priced retailers. As of December 31, 2021, it owned and operated 214 brick-and-mortar retail stores that included 147 Steve Madden full-price stores, 66 Steve Madden outlet stores, and 1 Superga store, as well as 6 e-commerce websites. Steven Madden, Ltd. was incorporated in 1990 and is headquartered in Long Island City, New York.",
    "ceo": "Mr. Edward R. Rosenfeld",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "2800",
    "phone": "718 446 1800",
    "address": "52-16 Barnett Avenue",
    "city": "Long Island City",
    "state": "NY",
    "zip": "11104",
    "dcfDiff": 0.939632,
    "dcf": 36.3296,
    "image": "https://financialmodelingprep.com/image-stock/SHOO.png",
    "ipoDate": "1993-12-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]