[
  {
    "symbol": "SHWDY",
    "price": 15.5,
    "beta": 0.871647,
    "volAvg": 76,
    "mktCap": 2807313376,
    "lastDiv": 0.49,
    "range": "14.4-19.76",
    "changes": 0,
    "companyName": "Showa Denko K.K.",
    "currency": "USD",
    "cik": "0001446694",
    "isin": "US8253842095",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Chemicals",
    "website": "https://www.sdk.co.jp",
    "description": "Showa Denko K.K. operates as a chemical company in Japan and internationally. It operates through seven segments: Petrochemicals, Chemicals, Electronics, Inorganics, Aluminum, Showa Denko Materials, and Others. The Petrochemicals segment offers olefins, including ethylene and propylene; organic chemicals, such as vinyl and ethyl acetate, and allyl alcohol; and polypropylene. The Chemicals segment offers functional chemicals, which include polymer emulsion and unsaturated polyester resins; industrial gases, including liquefied carbon dioxide, dry ice, oxygen, nitrogen, and hydrogen; basic chemicals, such as liquefied ammonia, acrylonitrile, and chloroprene rubber; electronic chemicals; and coating materials. The Inorganics segment offers graphite electrodes and ceramics, such as alumina and abrasives. The Aluminum segment offers rolled products, which include high-purity foils for capacitors; specialty components, such as cylinders for laser beam printers, extrusions, forged products, and heat exchangers; and beverage cans. The Electronics segment provides hard disks (HDs), SiC epitaxial wafers for power devices, compound semiconductors (LED chips), and lithium-ion battery (LIB) materials. The Showa Denko Materials segment offers electronics materials, including epoxy molding compounds, die bonding materials, CMP slurries, and anisotropic conductive films; printed wiring boards materials, which include copper-clad laminates and photosensitive dry films; mobility components comprising plastic molded products, friction materials, powder metal products, and carbon anode materials for LIB; energy storage devices and systems, including automotive and industrial batteries; diagnostics and regenerative medicine products, as well as engages in the contracted manufacturing activities. The Others segment is involved in the provision of building materials and general trading business. Showa Denko K.K. was founded in 1939 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Hidehito  Takahashi",
    "sector": "Basic Materials",
    "country": "JP",
    "fullTimeEmployees": "25803",
    "phone": "81 3 5470 3235",
    "address": "13-9, Shiba Daimon 1-Chome",
    "city": "Tokyo",
    "state": null,
    "zip": "105-8518",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SHWDY.png",
    "ipoDate": "2011-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]