[
  {
    "symbol": "SHWGF",
    "price": 1.725,
    "beta": 0.507279,
    "volAvg": 19174,
    "mktCap": 7801019443,
    "lastDiv": 0.02,
    "range": "1.06-1.73",
    "changes": 0,
    "companyName": "Shandong Weigao Group Medical Polymer Company Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.weigaogroup.com",
    "description": "Shandong Weigao Group Medical Polymer Company Limited engages in the research and development, production, and sale of single-use medical devices in the People's Republic of China. It operates through Medical Device Products, Orthopaedic Products, Interventional Products, Pharma Packaging Products, Blood Management Products, and Others segments. The company offers vascular and non-vascular access infusion devices, infusion sets, syringes, puncture needles, and specialized single-use clinical collection kits; wound sutures, wound healing dressings, and wound cleaning and nonvascular catheter supporting extracorporeal devices; and blood collection, storage, separation, and sterilization equipment. It also provides prefilled syringes and pre-filled flush syringes; blood collection and blood glucose testing devices; and general anesthesia consumables, local anesthesia consumables, anesthesia auxiliary consumables, ICU equipment, and open and minimally invasive surgical equipment. In addition, the company engages in the production and sale of orthopedic devices; tumor and blood vessel interventional instruments; implantation materials and artificial organs; medical PVC granules, plastic packing bags, and carton boxes; industrial automatic equipment and parts; molds; hemodialysis equipment; and type I, type II, and type III medical devices. Further, it is involved in the finance leasing and factoring business; wholesale of type I medical devices, surgical devices, and other disposal medical products; provision of asset management, enterprise consulting, enterprise management advisory services, as well as logistics and storage services, as well as export its products. The company offers its products under the Jierui, Wego Ortho, Yahua, Bangde, and Hai Xing brands. It serves hospitals, blood stations, and other medical units; and distributors. The company was incorporated in 2000 and is based in Weihai, the People's Republic of China.",
    "ceo": "Mr. Rinan  Cong",
    "sector": "Healthcare",
    "country": "CN",
    "fullTimeEmployees": "12122",
    "phone": "86 63 1562 1999",
    "address": "Torch Hi-Tech Science Park",
    "city": "Weihai",
    "state": null,
    "zip": "264210",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SHWGF.png",
    "ipoDate": "2010-06-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]