[
  {
    "symbol": "SID",
    "price": 2.67,
    "beta": 1.538356,
    "volAvg": 3486117,
    "mktCap": 3540660257,
    "lastDiv": 0.22,
    "range": "2.2-3.7",
    "changes": -0.1,
    "companyName": "Companhia Siderúrgica Nacional",
    "currency": "USD",
    "cik": "0001049659",
    "isin": "US20440W1053",
    "cusip": "20440W105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Steel",
    "website": "https://www.csn.com.br",
    "description": "Companhia Siderúrgica Nacional operates as an integrated steel producer in Brazil and Latin America. It operates in five segments: Steel, Mining, Logistics, Energy, and Cement. The company offers flat steel products, such as high, medium, low carbon, micro-alloyed, ultra-low-carbon, and interstitial free slabs; hot-rolled products, including heavy and light-gauge hot-rolled coils and sheets; cold-rolled products comprising cold-rolled coils and sheets; galvanized products; tin mill products that consist of flat-rolled low-carbon steel coils or sheets; and profiles, channels, UPE sections, and steel sleepers for the distribution, packaging, automotive, home appliance, and construction industries. It primarily explores for iron ore reserves at Casa de Pedra and Engenho mines located in the city of Congonhas; and limestone and dolomite at the Bocaina mine located in the city of Arcos in the state of Minas Gerais, Brazil, as well as produces tin. In addition, the company operates railway and port facilities; produces and sells cement to construction material stores, home centers, concrete producers, construction companies, mortar industries, and cement artifact producers; and generates electric power from its thermoelectric co-generation and hydroelectric power plants. It also exports its products. The company was incorporated in 1941 and is headquartered in São Paulo, Brazil. Companhia Siderúrgica Nacional operates as a subsidiary of Vicunha Aços S.A.",
    "ceo": "Mr. Benjamin  Steinbruch",
    "sector": "Basic Materials",
    "country": "BR",
    "fullTimeEmployees": "24924",
    "phone": "55 11 3049 7100",
    "address": "Av. Brigadeiro Faria Lima, 3400",
    "city": "São Paulo",
    "state": "SP",
    "zip": "04538-132",
    "dcfDiff": 11.1817,
    "dcf": 14.7517,
    "image": "https://financialmodelingprep.com/image-stock/SID.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]