[
  {
    "symbol": "SIEGY",
    "price": 83.67,
    "beta": 1.162452,
    "volAvg": 136353,
    "mktCap": 132691425587,
    "lastDiv": 2.29,
    "range": "46.37-91.34",
    "changes": -2.93,
    "companyName": "Siemens Aktiengesellschaft",
    "currency": "USD",
    "cik": null,
    "isin": "US8261975010",
    "cusip": "826197501",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.siemens.com",
    "description": "Siemens Aktiengesellschaft, a technology company, focuses in the areas of automation and digitalization in Europe, Commonwealth of Independent States, Africa, the Middle East, the Americas, Asia, and Australia. It operates through Digital Industries, Smart Infrastructure, Mobility, Siemens Healthineers, and Siemens Financial Services segments. The Digital Industries segment offers automation systems and software for factories, numerical control systems, motors, drives and inverters, and integrated automation systems for machine tools and production machines; process control systems, machine-to-machine communication products, sensors and radio frequency identification systems; software for production and product lifecycle management, and simulation and testing of mechatronic systems; and cloud-based industrial Internet of Things operating systems. The Smart Infrastructure segment offers products, systems, solutions, services, and software to support sustainable transition in energy generation from fossil and renewable sources; sustainable buildings and communities; and buildings, electrification, and electrical products. The Mobility segment provides passenger and freight transportation, such as vehicles, trams and light rail, and commuter trains, as well as trains and passenger coaches; locomotives for freight or passenger transport and solutions for automated transportation; products and solutions for rail automation; electrification products; and intermodal solutions. The Siemens Healthineers segment develops, manufactures, and sells various diagnostic and therapeutic products and services; and provides clinical consulting services. The Siemens Financial Services segment offers debt and equity investments; leasing, lending, and working capital financing solutions; and equipment, project, and structured financing solutions. Siemens Aktiengesellschaft was founded in 1847 and is headquartered in Munich, Germany.",
    "ceo": "Dr. Roland  Busch Dipl.Phys.",
    "sector": "Industrials",
    "country": "DE",
    "fullTimeEmployees": "316000",
    "phone": "49 89 636 00",
    "address": "Werner-von-Siemens-Strasse 1",
    "city": "Munich",
    "state": null,
    "zip": "80333",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SIEGY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]