[
  {
    "symbol": "SIG",
    "price": 63.81,
    "beta": 2.144718,
    "volAvg": 957380,
    "mktCap": 2897535528,
    "lastDiv": 0.92,
    "range": "50.84-83.42",
    "changes": -0.81,
    "companyName": "Signet Jewelers Limited",
    "currency": "USD",
    "cik": "0000832988",
    "isin": "BMG812761002",
    "cusip": "G81276100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Luxury Goods",
    "website": "https://www.signetjewelers.com",
    "description": "Signet Jewelers Limited operates as a diamond jewelry retailer. It operates through three segments: North America, International, and Other. The North America segment operates jewelry stores in jewelry stores in malls, mall-based kiosks, and off-mall locations in the United States and Canada primarily under the Kay Jewelers, Kay Jewelers Outlet, Jared The Galleria Of Jewelry, Jared Vault, Zales Jewelers, Zales Outlet, Diamonds Direct, James Allen, Banter by Piercing Pagoda, and Peoples Jewellers names, as well as operates online through JamesAllen.com and Rocksbox. The International segment operates stores in shopping malls and off-mall locations primarily under the H.Samuel and Ernest Jones brands in the United Kingdom, Republic of Ireland, and Channel Islands. The Other segment is involved in the purchase and conversion of rough diamonds to polished stones, as well as the provision of diamond polishing services. As of January 29, 2022, it operated 2,854 stores and kiosks. Signet Jewelers Limited is based in Hamilton, Bermuda.",
    "ceo": "Ms. Virginia C. Drosos",
    "sector": "Consumer Cyclical",
    "country": "BM",
    "fullTimeEmployees": "29660",
    "phone": "442073179700",
    "address": "Clarendon House",
    "city": "Hamilton",
    "state": null,
    "zip": "HM11",
    "dcfDiff": 9.03793,
    "dcf": 85.0379,
    "image": "https://financialmodelingprep.com/image-stock/SIG.png",
    "ipoDate": "1988-07-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]