[
  {
    "symbol": "SIGI",
    "price": 96.15,
    "beta": 0.629577,
    "volAvg": 287090,
    "mktCap": 5816382720,
    "lastDiv": 1.2,
    "range": "66.81-104.37",
    "changes": -0.89,
    "companyName": "Selective Insurance Group, Inc.",
    "currency": "USD",
    "cik": "0000230557",
    "isin": "US8163001071",
    "cusip": "816300107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.selective.com",
    "description": "Selective Insurance Group, Inc., together with its subsidiaries, provides insurance products and services in the United States. It operates through four segments: Standard Commercial Lines, Standard Personal Lines, E&S Lines, and Investments. The company offers property insurance products, which covers the financial consequences of accidental loss of an insured's real property, personal property, and/or earnings due to the property's loss; and casualty insurance products that covers the financial consequences of employee injuries in the course of employment, and bodily injury and/or property damage to a third party, as well as flood insurance products. It also invests in fixed income investments and commercial mortgage loans, as well as equity securities and alternative investment portfolio. The company offers its insurance products and services to businesses, non-profit organizations, local government agencies, and individuals through independent retail agents and wholesale general agents. Selective Insurance Group, Inc. was founded in 1926 and is headquartered in Branchville, New Jersey.",
    "ceo": "Mr. John Joseph Marchioni CPCU",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2520",
    "phone": "973 948 3000",
    "address": "40 Wantage Avenue",
    "city": "Branchville",
    "state": "NJ",
    "zip": "07890",
    "dcfDiff": 0.312453,
    "dcf": 92.4775,
    "image": "https://financialmodelingprep.com/image-stock/SIGI.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]