[
  {
    "symbol": "SIMO",
    "price": 75.07,
    "beta": 0.897887,
    "volAvg": 485395,
    "mktCap": 2507886011,
    "lastDiv": 2,
    "range": "51.53-88.65",
    "changes": -5.55,
    "companyName": "Silicon Motion Technology Corporation",
    "currency": "USD",
    "cik": "0001329394",
    "isin": "US82706C1080",
    "cusip": "82706C108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.siliconmotion.com",
    "description": "Silicon Motion Technology Corporation, together with its subsidiaries, designs, develops, and markets NAND flash controllers for solid-state storage devices. It offers controllers for computing-grade solid state drives (SSDs), which are used in PCs and other client devices; enterprise-grade SSDs used in data centers; eMMC and UFS mobile embedded storage for use in smartphones and IoT devices; flash memory cards and flash drives for use in expandable storage; and specialized SSDs that are used in industrial, commercial, and automotive applications. It markets its controllers under the SMI brand; enterprise-grade SSDs under the Shannon Systems brand; and single-chip industrial-grade SSDs under the Ferri SSD, Ferri-eMMC, and Ferri-UFS brands. The company markets and sells its products through direct sales personnel and independent electronics distributors to NAND flash makers, module makers, hyperscalers, and OEMs. It operates in Taiwan, the United States, South Korea, China, Malaysia, Singapore, and internationally. Silicon Motion Technology Corporation was founded in 1995 and is based in Hong Kong, Hong Kong.",
    "ceo": "Mr. Chia-Chang  Kou",
    "sector": "Technology",
    "country": "HK",
    "fullTimeEmployees": "1643",
    "phone": "852 2307 4768",
    "address": "Wing Cheong Commercial Building",
    "city": "Hong Kong",
    "state": null,
    "zip": null,
    "dcfDiff": 4.21448,
    "dcf": 71.2245,
    "image": "https://financialmodelingprep.com/image-stock/SIMO.png",
    "ipoDate": "2005-06-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]