[
  {
    "symbol": "SIRI",
    "price": 4.27,
    "beta": 0.953169,
    "volAvg": 16498603,
    "mktCap": 16518068547,
    "lastDiv": 0.1,
    "range": "3.32-6.85",
    "changes": 0.18,
    "companyName": "Sirius XM Holdings Inc.",
    "currency": "USD",
    "cik": "0000908937",
    "isin": "US82968B1035",
    "cusip": "82968B103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Entertainment",
    "website": "https://www.siriusxm.com",
    "description": "Sirius XM Holdings Inc. provides satellite radio services on a subscription fee basis in the United States. It broadcasts music, sports, entertainment, comedy, talk, news, traffic, and weather channels, including various music genres, such as rock, pop and hip-hop, country, dance, jazz, Latin, and classical; live play-by-play sports from various leagues and colleges; various talk and entertainment channels for a range of audiences; national, international, and financial news; and limited run channels. The company also provides streaming service that includes a range of music and non-music channels, and podcasts, as well as channels that are not available on its satellite radio service; and offers applications to allow consumers to access its streaming service on smartphones, tablets, computers, home devices, and other consumer electronic equipment, as well as connected vehicle services. In addition, it distributes satellite radios through automakers and retailers, as well as its website. Further, the company provides location-based services through two-way wireless connectivity, including safety, security, convenience, remote vehicles diagnostic, maintenance and data, and stolen or parked vehicle locator services. Additionally, it offers satellite television services, which offer music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; and real-time traffic and weather services. The company was incorporated in 2013 and is headquartered in New York, New York. Sirius XM Holdings Inc. is a subsidiary of Liberty Media Corporation.",
    "ceo": "Ms. Jennifer C. Witz",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "5869",
    "phone": "212 584 5100",
    "address": "1221 Avenue of the Americas",
    "city": "New York",
    "state": "NY",
    "zip": "10020",
    "dcfDiff": 0.556102,
    "dcf": 6.4761,
    "image": "https://financialmodelingprep.com/image-stock/SIRI.png",
    "ipoDate": "1994-09-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]