[
  {
    "symbol": "SITE",
    "price": 167.55,
    "beta": 1.44507,
    "volAvg": 287780,
    "mktCap": 7537136220,
    "lastDiv": 0,
    "range": "97.36-169.26",
    "changes": 0.6,
    "companyName": "SiteOne Landscape Supply, Inc.",
    "currency": "USD",
    "cik": "0001650729",
    "isin": "US82982L1035",
    "cusip": "82982L103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Industrial Distribution",
    "website": "https://www.siteone.com",
    "description": "SiteOne Landscape Supply, Inc. engages in the wholesale distribution of landscape supplies in the United States and Canada. The company provides a selection of approximately 135,000 stock keeping units, including irrigation supplies, which comprise controllers, valves, sprinkler heads, and irrigation pipes; fertilizer, grass seed, and ice melt products; control products, such as herbicides, fungicides, rodenticides, and other pesticides; landscape accessories that include mulches, soil amendments, drainage pipes, tools, and sods; nursery goods, which consist of deciduous and evergreen shrubs, ornamental, shade, evergreen trees, field grown and container-grown nursery stock, roses, perennials, annuals, bulbs, and plant species; hardscapes, such as pavers, natural stones, blocks, and other durable materials; and outdoor lighting products that include lighting fixtures, LED lamps, wires, transformers, and accessories. It also offers consultative services consisting of assistance with irrigation network design, commercial project planning, generation of sales leads, business operations, product support services, and a series of technical and business management seminars; and distributes branded products of third parties. The company offers its products under the LESCO, SiteOne Green Tech, and Pro-Trade brand names. It markets its products primarily to residential and commercial landscape professionals who specialize in the design, installation, and maintenance of lawns, gardens, golf courses, and other outdoor spaces through branch network and direct distribution. As of January 2, 2022, the company had approximately 590 branches in 45 U.S. States and six Canadian provinces. SiteOne Landscape Supply, Inc. was incorporated in 2013 and is headquartered in Roswell, Georgia.",
    "ceo": "Mr. Doug  Black",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "6570",
    "phone": "470 277 7000",
    "address": "300 Colonial Center Parkway",
    "city": "Roswell",
    "state": "GA",
    "zip": "30076",
    "dcfDiff": 24.2621,
    "dcf": 122.998,
    "image": "https://financialmodelingprep.com/image-stock/SITE.png",
    "ipoDate": "2016-05-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]