[
  {
    "symbol": "SJM",
    "price": 145.15,
    "beta": 0.222183,
    "volAvg": 885103,
    "mktCap": 14812122050,
    "lastDiv": 4.08,
    "range": "125.83-163.07",
    "changes": -5.63,
    "companyName": "The J. M. Smucker Company",
    "currency": "USD",
    "cik": "0000091419",
    "isin": "US8326964058",
    "cusip": "832696405",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaged Foods",
    "website": "https://www.jmsmucker.com",
    "description": "The J. M. Smucker Company manufactures and markets branded food and beverage products worldwide. It operates in three segments: U.S. Retail Pet Foods, U.S. Retail Coffee, and U.S. Retail Consumer Foods. The company offers mainstream roast, ground, single serve, and premium coffee; peanut butter and specialty spreads; fruit spreads, shortening and oils, and frozen sandwiches and snacks; pet food and pet snacks; and foodservice hot beverage, foodservice portion control, and flour products, as well as dog and cat food, frozen handheld products, juices and beverages, and baking mixes and ingredients. It provides its products under the Meow Mix, 9Lives, Kibbles n Bits, Milk-Bone, Pup-Peroni, Rachael Ray Nutrish and Nature's Recipe, Folgers, Café Bustelo, Dunkin', Folgers, Café Bustelo, 1850, Jif, Smucker's, Smucker's Uncrustables, Robin Hood, and Five Roses. The company sells its products through direct sales and brokers to food retailers, club stores, discount and dollar stores, online retailers, pet specialty stores, natural foods stores and distributors, drug stores, military commissaries, and mass merchandisers. Smucker Company was founded in 1897 and is headquartered in Orrville, Ohio.",
    "ceo": "Mr. Mark T. Smucker",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "5800",
    "phone": "330 682 3000",
    "address": "One Strawberry Lane",
    "city": "Orrville",
    "state": "OH",
    "zip": "44667-0280",
    "dcfDiff": 1.0642,
    "dcf": 151.084,
    "image": "https://financialmodelingprep.com/image-stock/SJM.png",
    "ipoDate": "1994-10-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]