[
  {
    "symbol": "SJW",
    "price": 69.4,
    "beta": 0.57183,
    "volAvg": 196558,
    "mktCap": 2181054620,
    "lastDiv": 1.52,
    "range": "57.51-83.88",
    "changes": -0.9,
    "companyName": "SJW Group",
    "currency": "USD",
    "cik": "0000766829",
    "isin": "US7843051043",
    "cusip": "784305104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Water",
    "website": "https://www.sjwgroup.com",
    "description": "SJW Group, through its subsidiaries, provides water utility services in the United States. It engages in the production, purchase, storage, purification, distribution, wholesale, and retail sale of water and wastewater services. The company also provides non-tariffed services, including water system operations, maintenance agreements, and antenna site leases; contracted services and sewer operations to water utilities; and a Linebacker protection plan for public drinking water customers in Connecticut and Maine. Its water supply consists of groundwater from wells, surface water from watershed run-off and diversion, reclaimed water, and imported water purchased from the Santa Clara Valley Water District. The company offers water service to approximately 231,000 connections that serve approximately one million people residing in portions of the cities of San Jose and Cupertino, as well as in the cities of Campbell, Monte Sereno, Saratoga, and the Town of Los Gatos; and adjacent unincorporated territories in the County of Santa Clara in the State of California. In addition, it provides water service to approximately 140,000 connections, which serve approximately 456,000 people in 81 municipalities with a service area comprising approximately 269 square miles throughout Connecticut and Maine, as well as approximately 24,000 connections that serve approximately 70,000 people in a service area comprising approximately 266 square miles in the region between San Antonio and Austin, Texas; and approximately 3,000 wastewater connections in Southbury, Connecticut. Further, the company owns undeveloped land in California and Tennessee; and owns and operates commercial buildings and warehouse properties in Tennessee. The company was formerly known as SJW Corp. and changed its name to SJW Group in November 2016. SJW Group was incorporated in 1985 and is headquartered in San Jose, California.",
    "ceo": "Mr. Eric W. Thornburg",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "757",
    "phone": "408 279 7800",
    "address": "110 West Taylor Street",
    "city": "San Jose",
    "state": "CA",
    "zip": "95110",
    "dcfDiff": 2.62582,
    "dcf": 74.4642,
    "image": "https://financialmodelingprep.com/image-stock/SJW.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]