[
  {
    "symbol": "SKFRY",
    "price": 17.453,
    "beta": 1.138314,
    "volAvg": 29211,
    "mktCap": 7947241143,
    "lastDiv": 0.67,
    "range": "12.57-20.76",
    "changes": 0.003,
    "companyName": "AB SKF (publ)",
    "currency": "USD",
    "cik": null,
    "isin": "US7843754042",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Tools & Accessories",
    "website": "https://www.skf.com",
    "description": "AB SKF (publ) engages in the design, development, and manufacture of bearings, seals, lubrication systems, and services worldwide. It operates in two segments, Industrial and Automotive. The company offers rolling bearings, mounted bearings and housings, super-precision bearings, slewing bearings, plain bearings, magnetic bearings and systems, industrial and automotive seals, lubrication management solutions, maintenance products, condition monitoring systems, power transmission solutions, test and measuring equipment, vehicle aftermarket, and waste electric and electronic equipment products. It also provides various services, including application engineering, asset management, condition-based maintenance, mechanical maintenance, remanufacturing and customization, and training solutions. The company offers its solutions for various industries, including aerospace, agriculture, cars and light trucks, construction, food and beverage, general machinery, machine tools, marine, material handling, metals, mining, mineral processing and cement, ocean energy, oil and gas, pulp and paper, railways, trucks, trailers, buses, two and three wheelers, and wind energy. AB SKF (publ) was founded in 1907 and is headquartered in Gothenburg, Sweden.",
    "ceo": "Mr. Rickard  Gustafson",
    "sector": "Industrials",
    "country": "SE",
    "fullTimeEmployees": "41433",
    "phone": "46 3 13 37 10 00",
    "address": "Sven Wingquists Gata 2",
    "city": "Gothenburg",
    "state": null,
    "zip": "415 50",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SKFRY.png",
    "ipoDate": "2006-02-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]