[
  {
    "symbol": "SKHSY",
    "price": 19.95,
    "beta": 0.640229,
    "volAvg": 32550,
    "mktCap": 13216436419,
    "lastDiv": 0.79,
    "range": "15.87-21.58",
    "changes": 0.07,
    "companyName": "Sekisui House, Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US8160783077",
    "cusip": "816078307",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Residential Construction",
    "website": "https://www.sekisuihouse.co.jp",
    "description": "Sekisui House, Ltd. designs, constructs, and contracts built-to-order detached houses in Japan and internationally. The company operates through Custom Detached Houses, Rental Housing, Architectural/Civil Engineering, Remodeling, Real Estate Management Fees, Houses For Sale, Condominiums, Urban Redevelopment, and Overseas segments. It also engages in the design, construction, and contracting of built-to-order properties rental housing, medical and nursing care facilities, commercial facilities, and hotels; design, construction, and contracting of construction of civil engineering works; and construction of reinforced concrete rental housing and commercial buildings. In addition, the company is involved in the remodeling and renovation of houses, etc.; sub-lease, management, operation, and brokerage of real estate; sale of houses and residential land; design, construction, and sale of condominiums; and development of office and commercial buildings, as well as management and operation of owned properties. Sekisui House, Ltd. was incorporated in 1929 and is headquartered in Osaka, Japan.",
    "ceo": "Mr. Yoshihiro  Nakai",
    "sector": "Consumer Cyclical",
    "country": "JP",
    "fullTimeEmployees": "29052",
    "phone": null,
    "address": "Umeda Sky Building Tower East",
    "city": "Osaka",
    "state": null,
    "zip": "531-0076",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SKHSY.png",
    "ipoDate": "2003-01-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]