[
  {
    "symbol": "SKX",
    "price": 50.45,
    "beta": 1.320422,
    "volAvg": 1877719,
    "mktCap": 7806330502,
    "lastDiv": 0,
    "range": "31.28-54.77",
    "changes": 0.13,
    "companyName": "Skechers U.S.A., Inc.",
    "currency": "USD",
    "cik": "0001065837",
    "isin": "US8305661055",
    "cusip": "830566105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Footwear & Accessories",
    "website": "https://www.skechers.com",
    "description": "Skechers U.S.A., Inc. designs, develops, markets, and distributes footwear for men, women, and children; and performance footwear for men and women worldwide. The company operates through three segments: Domestic Wholesale, International Wholesale, and Direct-to-Consumer. It offers casual, casual athletic, sport athletic, trail, sandals, boots, and retro fashion footwear for men and women under the Skechers USA, Skechers Sport, Skechers Active, Modern Comfort, Skechers Street, Mark Nason, and BOBS brands; sneakers, casuals, boots, and sandals for boys and girls under the Skechers Mega-Craft, S-Lights, SKECH-AIR, Foamies, Twinkle Toes, Z-Strap, Skechers Stretch Fit, and Skechers Street brands; and technical footwear under the Skechers GOrun, Skechers GOwalk, Skechers GOtrain, Skechers GOtrail, and Skechers GO Golf brands. The company also provides men's and women's slip-resistant and safety-toe casuals, boots, hikers, and athletic shoes; and lifestyle apparel for men, women, and kids. As of December 31, 2021, it operated 4,306 company and third party owned Skechers stores. The company sells its products through department and specialty stores, athletic and independent retailers, boutiques, and online retailers; and through its e-commerce sites, concept stores, and factory and warehouse outlet stores. It also licenses its Skechers brand. Skechers U.S.A., Inc. was incorporated in 1992 and is headquartered in Manhattan Beach, California.",
    "ceo": "Mr. Robert Y. Greenberg",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "7800",
    "phone": "310 318 3100",
    "address": "228 Manhattan Beach Boulevard",
    "city": "Manhattan Beach",
    "state": "CA",
    "zip": "90266",
    "dcfDiff": 3.32211,
    "dcf": 44.1579,
    "image": "https://financialmodelingprep.com/image-stock/SKX.png",
    "ipoDate": "1999-06-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]