[
  {
    "symbol": "SLB",
    "price": 48.59,
    "beta": 1.786619,
    "volAvg": 9451932,
    "mktCap": 69256787032,
    "lastDiv": 1,
    "range": "30.65-59.45",
    "changes": 0.45,
    "companyName": "Schlumberger Limited",
    "currency": "USD",
    "cik": "0000087347",
    "isin": "AN8068571086",
    "cusip": "806857108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Equipment & Services",
    "website": "https://www.slb.com",
    "description": "Schlumberger Limited provides technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. It offers software, information management, and IT infrastructure services; consulting services for reservoir characterization, field development planning, and production enhancement; petro technical data services and training solutions; reservoir interpretation and data processing services; asset performance solutions; open and cased-hole services; exploration and production pressure and flow-rate measurement services; pressure pumping, well stimulation, and coiled tubing equipment for downhole mechanical well intervention, reservoir monitoring, and downhole data acquisition; and integrated production systems. The company also provides mud logging and engineering support services; drilling equipment and services for shipyards, drilling contractors, energy companies, and rental tool companies; land drilling rigs and related services; drilling tools; well cementing products and services; and well planning and drilling, engineering, supervision, logistics, procurement, contracting, and drilling rig management services, as well as supplies engineered drilling fluid systems; and designs, manufactures, and markets roller cone and fixed cutter drill bits. In addition, it offers well completion services and equipment; artificial lift production equipment and optimization services; valves; process systems; and integrated subsea production systems comprising wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services, as well as designs and manufactures onshore and offshore platform wellhead systems and processing solutions. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.",
    "ceo": "Mr. Olivier  Le Peuch",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "99000",
    "phone": "713 513 2000",
    "address": "5599 San Felipe",
    "city": "Houston",
    "state": "TX",
    "zip": "77056",
    "dcfDiff": 3.46615,
    "dcf": 53.5038,
    "image": "https://financialmodelingprep.com/image-stock/SLB.png",
    "ipoDate": "1981-12-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]