[
  {
    "symbol": "SLOIF",
    "price": 161.45,
    "beta": 1.450191,
    "volAvg": 17,
    "mktCap": 5745230540,
    "lastDiv": 0,
    "range": "109.75-169.5",
    "changes": 13.95,
    "companyName": "Soitec S.A.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Semiconductor Equipment & Materials",
    "website": "https://www.soitec.com",
    "description": "Soitec S.A. designs and manufactures semiconductor materials worldwide. Its products are used to manufacture chips that are used in smart phones, tablets, computers, IT servers, and data centers, as well as electronic components in cars, connected devices, and industrial and medical equipment. It offers Fully Depleted Silicon-On-Insulator (FD-SOI) for automotive radar and processors, and PD-SOI and FinFET-SOI products for high-performance computing markets. The company also offers RF-SOI substrates for front-end module devices, as well as 4G LTE and new 5G sub-6 GHz/ mmWave smartphones. In addition, it offers power-SOI products that address the requirements for integrating high and low voltage functions in power IC devices for automotive and industry markets. Further, the company offers Smart photonics-SOI products for optical networking; Smart Imager-SOI products for next generation 3D image sensing; Auto Smartsic for green mobility; Connect RF-GaN for 5G infrastructure architecture and smartphone power amplifier markets; Connect-POI engineered substrates for high performance surface acoustic wave filter; and Gallium Nitride (GAN) Epitaxial wafers for energy efficient power management system. Soitec S.A. was incorporated in 1992 and is headquartered in Bernin, France.",
    "ceo": "Mr. Pierre  Barnabe",
    "sector": "Technology",
    "country": "FR",
    "fullTimeEmployees": "1986",
    "phone": "33 4 76 92 75 00",
    "address": "Parc Technologique des Fontaines",
    "city": "Bernin",
    "state": null,
    "zip": "38190",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SLOIF.png",
    "ipoDate": "2012-04-18",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]