[
  {
    "symbol": "SMAR",
    "price": 38.92,
    "beta": 1.037676,
    "volAvg": 1568391,
    "mktCap": 5200023360,
    "lastDiv": 0,
    "range": "25.09-52.813",
    "changes": -0.11,
    "companyName": "Smartsheet Inc.",
    "currency": "USD",
    "cik": "0001366561",
    "isin": "US83200N1037",
    "cusip": "83200N103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.smartsheet.com",
    "description": "Smartsheet Inc. provides cloud-based enterprise platform to plan, capture, manage, automate, and report on work for teams and organizations. The company offers Dashboards for real-time visibility into the status of work to align individuals, managers, and executives; Portals to locate and access from any device the resources available for a project without IT assistance; Cardview to organize, share, and act on workflows; and Grid to keep teams on task by tracking multiple moving parts. It also provides Reports that allow users to see and action their work in one centralized location; Projects, which offers interface with capabilities that foster collaboration among teams and organizations; Calendar that align teams and organizations by connecting deadlines to workflows; Forms to collect information in a structured and consistent format; Automated actions to automate repetitive processes; and Integrations to connect, sync, and extend existing enterprise applications across workflows to create work execution. The company offers WorkApps to build easy to navigate apps; Connectors for embedded integrations with industry-leading systems of record; Control Center to achieve consistent work execution; Dynamic View enables mixed internal and external teams to collaborate confidentially with vendors; Data Shuttle to upload or offload data between Smartsheet and other existing systems and databases; Bridge to build intelligent workflows and automate business processes across platforms; Resource Management; Brandfolder; and Premium Apps and Connectors, as well as Calendar, Pivot, and DataMesh apps, and Smartsheet Advance. It serves aerospace, automotive, biotechnology, consumer, e-commerce, education, finance, government, healthcare, IT services, marketing, media, travel, and other sectors. The company was formerly known as Smartsheet.com, Inc. and changed its name to Smartsheet Inc. in February 2017. The company was incorporated in 2005 and is based in Bellevue, Washington.",
    "ceo": "Mr. Mark P. Mader",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3176",
    "phone": "844 324 2360",
    "address": "10500 NE 8th Street",
    "city": "Bellevue",
    "state": "WA",
    "zip": "98004-4357",
    "dcfDiff": 11.3583,
    "dcf": 32.0017,
    "image": "https://financialmodelingprep.com/image-stock/SMAR.png",
    "ipoDate": "2018-04-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]