[
  {
    "symbol": "SMCI",
    "price": 235.94,
    "beta": 1.185915,
    "volAvg": 2408670,
    "mktCap": 12384136690,
    "lastDiv": 0,
    "range": "37.01-270.18",
    "changes": 9.77,
    "companyName": "Super Micro Computer, Inc.",
    "currency": "USD",
    "cik": "0001375365",
    "isin": "US86800U1043",
    "cusip": "86800U104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Computer Hardware",
    "website": "https://www.supermicro.com",
    "description": "Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high-performance server and storage solutions based on modular and open architecture. Its solutions range from complete server, storage, modular blade servers, blades, workstations, full racks, networking devices, server management software, and server sub-systems, as well as support and services. The company also provides application-optimized server solutions, including rackmount and blade servers, storage systems, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company primarily operates in the United States, Europe, Asia, and internationally. Super Micro Computer, Inc. was incorporated in 1993 and is headquartered in San Jose, California.",
    "ceo": "Mr. Charles  Liang",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "4607",
    "phone": "408 503 8000",
    "address": "980 Rock Avenue",
    "city": "San Jose",
    "state": "CA",
    "zip": "95131",
    "dcfDiff": 13.9509,
    "dcf": 88.2509,
    "image": "https://financialmodelingprep.com/image-stock/SMCI.png",
    "ipoDate": "2007-03-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]