[
  {
    "symbol": "SMFKY",
    "price": 32.73,
    "beta": 0.948275,
    "volAvg": 11748,
    "mktCap": 8514676508,
    "lastDiv": 1.49,
    "range": "26.74-43.515",
    "changes": -0.7,
    "companyName": "Smurfit Kappa Group Plc",
    "currency": "USD",
    "cik": null,
    "isin": "US83272W1062",
    "cusip": "83272W106",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Packaging & Containers",
    "website": "https://www.smurfitkappa.com",
    "description": "Smurfit Kappa Group plc, together with its subsidiaries, manufactures, distributes, and sells paper-based packaging products. It operates through two segments, Europe and the Americas. The company offers consumer, retail, industrial, e-commerce, heavy-duty corrugated, and hexacomb packaging products; composite cardboard tubes, bags, and sacks; and bag-in-box, a single-use packaging system that comprises films, accessories, bags, taps, and boxes. It also provides point of sale displays; automated packing lines; various types of containerboards, such as Kraftliners, testliners, and containerboard flutings; and corrugated sheet boards, solid board sheets, folding carton sheet boards, sack Kraft papers, MG Kraft papers, preprint products, agro-papers, technical papers, BanaBag, and Catcher Board MB12.In addition, the company offers recycling solutions to cardboard and paper products. It primarily serves food, beverage, and household consumables sectors. Smurfit Kappa Group plc was founded in 1934 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Anthony Paul  J. Smurfit",
    "sector": "Consumer Cyclical",
    "country": "IE",
    "fullTimeEmployees": "48000",
    "phone": "353 1 202 7000",
    "address": "Beech Hill",
    "city": "Dublin",
    "state": null,
    "zip": "4",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SMFKY.png",
    "ipoDate": "2014-08-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]