[
  {
    "symbol": "SMG",
    "price": 60.49,
    "beta": 1.618661,
    "volAvg": 767848,
    "mktCap": 3391801329,
    "lastDiv": 2.64,
    "range": "39.06-90.01",
    "changes": -0.62,
    "companyName": "The Scotts Miracle-Gro Company",
    "currency": "USD",
    "cik": "0000825542",
    "isin": "US8101861065",
    "cusip": "810186106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Agricultural Inputs",
    "website": "https://scottsmiraclegro.com",
    "description": "The Scotts Miracle-Gro Company engages in the manufacture, marketing, and sale of products for lawn, garden care, and indoor and hydroponic gardening in the United States and internationally. The company operates through three segments: U.S. Consumer, Hawthorne, and Other. It provides lawn care products comprising lawn fertilizers, grass seed products, spreaders, other durable products, and outdoor cleaners, as well as lawn-related weed, pest, and disease control products; gardening and landscape products include water-soluble and continuous-release plant foods, potting mixes and garden soils, mulch and decorative groundcover products, plant-related pest and disease control products, organic garden products, and lives goods and seeding solutions. The company also offers hydroponic products that help users to grow plants, flowers, and vegetables using little or no soil; lighting systems and components for use in hydroponic and indoor gardening applications; insect, rodent, and weed control products for home areas; and non-selective weed killer products. It sells its products under the Scotts, Turf Builder, EZ Seed, PatchMaster, Thick'R Lawn, GrubEx, EdgeGuard, Handy Green II, Miracle-Gro, LiquaFeed, Osmocote, Shake N Feed, Hyponex, Earthgro, SuperSoil, Fafard, Nature Scapes, Ortho, Miracle-Gro Performance Organics, Miracle-Gro Organic Choice, Whitney Farms, EcoScraps, Mother Earth, Botanicare, Hydroponics, Vermicrop, Gavita, Agrolux, Can-Filters, Sun System, Gro Pro, Hurricane, AeroGarden, Titan, Tomcat, Ortho Weed B Gon, Roundup, Groundclear, and Alchemist brands. The company serves home centers, mass merchandisers, warehouse clubs, large hardware chains, independent hardware stores, nurseries, garden centers, e-commerce platforms, and food and drug stores, as well as indoor gardening and hydroponic distributors, retailers, and growers. The Scotts Miracle-Gro Company was founded in 1868 and is headquartered in Marysville, Ohio.",
    "ceo": "Mr. James S. Hagedorn",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "6100",
    "phone": "937 644 0011",
    "address": "14111 Scottslawn Road",
    "city": "Marysville",
    "state": "OH",
    "zip": "43041",
    "dcfDiff": 8.58571,
    "dcf": 57.9443,
    "image": "https://financialmodelingprep.com/image-stock/SMG.png",
    "ipoDate": "1992-01-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]