[
  {
    "symbol": "SMPNY",
    "price": 22.565,
    "beta": 0.422605,
    "volAvg": 16011,
    "mktCap": 15032057813,
    "lastDiv": 0.86,
    "range": "19.28-23.44",
    "changes": 0.069,
    "companyName": "Sompo Holdings, Inc.",
    "currency": "USD",
    "cik": "0001669414",
    "isin": "US83540J1016",
    "cusip": "83540J101",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.sompo-hd.com",
    "description": "Sompo Holdings, Inc. provides property and casualty (P&C) insurance services in Japan and internationally. The company operates through Domestic P&C Insurance Business, Overseas Insurance Business, Domestic Life Insurance Business, and Nursing Care and Healthcare Business segments. It offers various P&C insurance products, including automobile, fire, personal accident, and marine, as well as security, risk management, assistance, and warranty services; and life insurance products. The company also provides nursing care and healthcare services; and customer security, health, and wellbeing support services. In addition, it offers asset management services; home remodeling services; health support services comprising health guidance and health counseling, and employee assistance programs; and wellness communication services. The company was formerly known as Sompo Japan Nipponkoa Holdings, Inc. and changed its name to Sompo Holdings, Inc. in October 2016. The company was incorporated in 2010 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Kengo  Sakurada",
    "sector": "Financial Services",
    "country": "JP",
    "fullTimeEmployees": "47776",
    "phone": "81 3 3349 3000",
    "address": "26-1, Nishi-Shinjuku 1-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "160-8338",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SMPNY.png",
    "ipoDate": "2016-05-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]