[
  {
    "symbol": "SNDR",
    "price": 28.32,
    "beta": 0.989788,
    "volAvg": 547919,
    "mktCap": 5052826307,
    "lastDiv": 0.36,
    "range": "20.26-30.93",
    "changes": 0.26,
    "companyName": "Schneider National, Inc.",
    "currency": "USD",
    "cik": "0001692063",
    "isin": "US80689H1023",
    "cusip": "80689H102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Trucking",
    "website": "https://schneider.com",
    "description": "Schneider National, Inc., together with its subsidiaries, provides surface transportation and logistics solutions in the United States, Canada, and Mexico. The company operates through three segments: Truckload, Intermodal, and Logistics. The Truckload segment offers standard long-haul and regional shipping services primarily through dry van, bulk, temperature-controlled, and flat-bed equipment, as well as cross dock and customized solutions for time-sensitive loads. The Intermodal segment provides door-to-door container on flat car services, including rail and dray transportation through company-owned containers, chassis, and trucks. The Logistics segment offers freight brokerage, supply chain, and import/export services; value-added services to manage and move its customers' freight; and transloading and warehousing services. It also leases equipment, such as trucks to owner-operators; and provides insurance for the company drivers and owner-operators. Schneider National, Inc. was founded in 1935 and is headquartered in Green Bay, Wisconsin.",
    "ceo": "Mr. Mark B. Rourke",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "17050",
    "phone": "920 592 2000",
    "address": "3101 South Packerland Drive",
    "city": "Green Bay",
    "state": "WI",
    "zip": "54313",
    "dcfDiff": 0.296055,
    "dcf": 26.5461,
    "image": "https://financialmodelingprep.com/image-stock/SNDR.png",
    "ipoDate": "2017-04-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]