[
  {
    "symbol": "SNLAY",
    "price": 6.2,
    "beta": 0.529501,
    "volAvg": 774,
    "mktCap": 10133156198,
    "lastDiv": 0.37,
    "range": "5.24-7.95",
    "changes": 0.28,
    "companyName": "Sino Land Company Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Real Estate—Development",
    "website": "https://www.sino.com",
    "description": "Sino Land Company Limited, an investment holding company, invests in, develops, manages, and trades in properties. It operates through six segments: Property Sales, Property Rental, Property Management and Other Services, Hotel Operations, Investments in Securities, and Financing. The company's property portfolio includes office, industrial, and residential buildings, as well as shopping malls, car parks, and hotels. It also provides cleaning, building construction and management, financing, administration, security, mortgage loan financing, secretarial, management, project management, securities investment, living, consultancy, and deposit placing services, as well as operates hotels. As of June 30, 2022, the company had a land bank of approximately 20.4 million square feet of attributable floor area in Mainland China, Hong Kong, Singapore, and Australia. The company was incorporated in 1971 and is based in Tsim Sha Tsui, Hong Kong. Sino Land Company Limited is a subsidiary of Tsim Sha Tsui Properties Limited.",
    "ceo": "Mr. Chee Siong  Ng",
    "sector": "Real Estate",
    "country": "HK",
    "fullTimeEmployees": "7000",
    "phone": "852 2721 8388",
    "address": "Tsim Sha Tsui Centre",
    "city": "Tsim Sha Tsui",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SNLAY.png",
    "ipoDate": "2006-02-27",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]