[
  {
    "symbol": "SNN",
    "price": 31.9,
    "beta": 0.389272,
    "volAvg": 914554,
    "mktCap": 13930410490,
    "lastDiv": 0.75,
    "range": "21.78-33.09",
    "changes": 0.15,
    "companyName": "Smith & Nephew plc",
    "currency": "USD",
    "cik": "0000845982",
    "isin": "US83175M2052",
    "cusip": "83175M205",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.smith-nephew.com",
    "description": "Smith & Nephew plc, together with its subsidiaries, develops, manufactures, markets, and sells medical devices worldwide. The company offers knee implant products for knee replacement procedures; hip implants for the reconstruction of hip joints; and trauma and extremities products that include internal and external devices used in the stabilization of severe fractures and deformity correction procedures. It also provides sports medicine joint repair products for surgeons, including instruments, technologies, and implants necessary to perform minimally invasive surgery of the joints, such as the repair of soft tissue injuries and degenerative conditions of the knee, hip, and shoulder, as well as meniscal repair systems. In addition, the company offers arthroscopic enabling technologies comprising fluid management equipment for surgical access, high-definition cameras, digital image capture, scopes, light sources, and monitors to assist with visualization inside the joints, radio frequency, electromechanical and mechanical tissue resection devices, and hand instruments for removing damaged tissue; and ear, nose, and throat solutions. Further, it provides advanced wound care products for the treatment and prevention of acute and chronic wounds, which comprise leg, diabetic and pressure ulcers, burns, and post-operative wounds; advanced wound bioactives, including biologics and other bioactive technologies for debridement and dermal repair/regeneration, as well as regenerative medicine products including skin, bone graft, and articular cartilage substitutes; and advanced wound devices, such as traditional and single-use negative pressure wound therapy, and hydrosurgery systems. It primarily serves the healthcare providers. Smith & Nephew plc was founded in 1856 and is headquartered in Watford, the United Kingdom.",
    "ceo": "Dr. Deepak S. Nath Ph.D.",
    "sector": "Healthcare",
    "country": "GB",
    "fullTimeEmployees": "19012",
    "phone": "44 1923 477 100",
    "address": "Building 5",
    "city": "Watford",
    "state": null,
    "zip": "WD18 8YE",
    "dcfDiff": 0.459428,
    "dcf": 28.6094,
    "image": "https://financialmodelingprep.com/image-stock/SNN.png",
    "ipoDate": "1999-11-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]