[
  {
    "symbol": "SNX",
    "price": 90.85,
    "beta": 1.541549,
    "volAvg": 399316,
    "mktCap": 8572333450,
    "lastDiv": 1.4,
    "range": "78.86-111.57",
    "changes": -1.97,
    "companyName": "TD SYNNEX Corporation",
    "currency": "USD",
    "cik": "0001177394",
    "isin": "US87162W1009",
    "cusip": "87162W100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electronics & Computer Distribution",
    "website": "https://www.tdsynnex.com",
    "description": "TD SYNNEX Corporation provides business process services in the United States and internationally. The company distributes PC systems, mobile phones and accessories, printers, peripherals, supplies, endpoint technology software, consumer electronics, information technology (IT) systems including data center server and storage solutions, system components, software, networking, communications and security equipment, consumer electronics, and complementary products. It also provides systems design and integration solutions, build-to-order, and configure-to-order assembly capabilities; logistics services that comprise outsourced fulfillment, virtual distribution, and direct ship to end-users; cloud services; online services; and financing services comprising net terms, third party leasing, floor plan financing, and letters of credit backed financing and arrangements. In addition, the company offers marketing services, such as direct mail, external media advertising, reseller product training, targeted telemarketing campaigns, trade shows, trade groups, database analysis, print on demand services, and web-based marketing. It serves resellers, system integrators, and retailers. The company was formerly known as SYNNEX Corporation and changed its name to TD SYNNEX Corporation in September 2021. TD SYNNEX Corporation was incorporated in 1980 and is headquartered in Fremont, California.",
    "ceo": "Mr. Richard T. Hume",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "23500",
    "phone": "510 656 3333",
    "address": "44201 Nobel Drive",
    "city": "Fremont",
    "state": "CA",
    "zip": "94538",
    "dcfDiff": 15.0133,
    "dcf": 116.463,
    "image": "https://financialmodelingprep.com/image-stock/SNX.png",
    "ipoDate": "2003-11-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]