[
  {
    "symbol": "SNY",
    "price": 53.74,
    "beta": 0.416091,
    "volAvg": 1554603,
    "mktCap": 134369342961,
    "lastDiv": 1.9,
    "range": "36.91-57.82",
    "changes": 0.07,
    "companyName": "Sanofi",
    "currency": "USD",
    "cik": "0001121404",
    "isin": "US80105N1054",
    "cusip": "80105N105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.sanofi.com",
    "description": "Sanofi, together with its subsidiaries, engages in the research, development, manufacture, and marketing of therapeutic solutions in the United States, Europe, and internationally. It operates through three segments: Pharmaceuticals, Vaccines, and Consumer Healthcare. The company provides specialty care products, including human monoclonal antibodies; products for multiple sclerosis, neurology, other inflammatory diseases, immunology, rare diseases, oncology, and rare blood disorders; medicines for diabetes; and cardiovascular and established prescription products. It also supplies poliomyelitis, pertussis, and hib pediatric vaccines; and influenza, adult booster, meningitis, and travel and endemic vaccines. In addition, the company offers allergy, cough and cold, pain, liver care, physical and mental wellness, probiotics, digestive, and nutritional products; and other products, such as daily body lotions, anti-itch products, moisturizing and soothing lotions, and body and foot creams, as well as powders for eczema. Further, it has various pharmaceutical products and vaccines in development stage. Sanofi has collaboration agreement with GlaxoSmithKline to develop a recombinant Covid-19 vaccine; and a research collaboration with Stanford University School of Medicine to advance the understanding of immunology and inflammation through open scientific exchange. It also has a collaboration and license option agreement with Prellis Biologics, Inc. The company was formerly known as Sanofi-Aventis and changed its name to Sanofi in May 2011. Sanofi was founded in 1973 and is headquartered in Paris, France.",
    "ceo": "Mr. Paul  Hudson",
    "sector": "Healthcare",
    "country": "FR",
    "fullTimeEmployees": "91573",
    "phone": "33 1 53 77 40 00",
    "address": "54, Rue La BoEtie",
    "city": "Paris",
    "state": null,
    "zip": "75008",
    "dcfDiff": 0.281137,
    "dcf": 48.7711,
    "image": "https://financialmodelingprep.com/image-stock/SNY.png",
    "ipoDate": "2002-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]