[
  {
    "symbol": "SO",
    "price": 69.87,
    "beta": 0.511619,
    "volAvg": 4067120,
    "mktCap": 76186248000,
    "lastDiv": 2.8,
    "range": "60.71-80.57",
    "changes": -1.25,
    "companyName": "The Southern Company",
    "currency": "USD",
    "cik": "0000092122",
    "isin": "US8425871071",
    "cusip": "842587107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.southerncompany.com",
    "description": "The Southern Company, through its subsidiaries, engages in the generation, transmission, and distribution of electricity. It operates through Gas Distribution Operations, Gas Pipeline Investments, Wholesale Gas Services, and Gas Marketing Services segments. The company also develops, constructs, acquires, owns, and manages power generation assets, including renewable energy projects and sells electricity in the wholesale market; and distributes natural gas in Illinois, Georgia, Virginia, and Tennessee, as well as provides gas marketing services, wholesale gas services, and gas pipeline investments operations. In addition, it owns and/or operates 30 hydroelectric generating stations, 24 fossil fuel generating stations, three nuclear generating stations, 13 combined cycle/cogeneration stations, 45 solar facilities, 15 wind facilities, one fuel cell facility, and four battery storage facility; and constructs, operates, and maintains 76,289 miles of natural gas pipelines and 14 storage facilities with total capacity of 157 Bcf to provide natural gas to residential, commercial, and industrial customers. The company serves approximately 8.7 million electric and gas utility customers. Further, the company offers digital wireless communications and fiber optics services. The Southern Company was incorporated in 1945 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. Christopher C. Womack",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "27423",
    "phone": "404 506 5000",
    "address": "30 Ivan Allen Jr. Boulevard, N.W.",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30308",
    "dcfDiff": 0.586479,
    "dcf": 67.4135,
    "image": "https://financialmodelingprep.com/image-stock/SO.png",
    "ipoDate": "1981-12-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]