[
  {
    "symbol": "SOHVY",
    "price": 5.65,
    "beta": 1.028352,
    "volAvg": 19,
    "mktCap": 3059508731,
    "lastDiv": 0.17,
    "range": "4.46-5.65",
    "changes": 0,
    "companyName": "Sumitomo Heavy Industries, Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US8656201089",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.shi.co.jp",
    "description": "Sumitomo Heavy Industries, Ltd. manufactures and sells general machinery, advanced precision machinery, construction machinery, ships, and environmental plant facilities in Japan and internationally. The company operates through four segments: Mechatronics, Industrial Machinery, Logistics & Construction, and Energy & Lifelines. Its Mechatronics segment offers gear reducers, motors, and boxes; motion control drives, inverters, precision positioning equipment, laser processing systems, control systems and components, motion components, and drive and collaborative robot solutions. The company's Industrial Machinery segment provides plastics machinery, film forming machines, cryogenic equipment, precision forgings, semiconductor production equipment, medical machines and equipment, forging press machines, machining tools, air conditioning equipment, defense equipment, injection molding machines, transfer molding presses, cryocoolers, cryopumps, ion accelerators and implanters, cyclotrons, tracer production systems, proton therapy systems, vacuum coating equipment, steel tube air forming systems, lifting magnets, spinning machines, clean room systems, dust collectors, cast iron and steel rolls, surface grinding machines, coolant systems, and extrusion coating products. Its Logistics & Construction segment offers hydraulic excavators, mobile cranes, road machinery, material handling systems, logistics systems, automated parking systems, road machinery, crawler cranes, foundation machines, and forklifts. The company's Energy & Lifelines segment provides private power generation facilities, boilers, air pollution control equipment, water and sewage treatment systems, industrial waste treatment facilities, turbines, pumps, process equipment, pressure vessels, mixing vessels, food processing machinery, ships, circulating and bubbling fluidized bed boilers, liquid air energy storage, rotary kiln-type recycling facilities, electrostatic precipitators, ash handling systems, evaporation and crystallization facilities, fluidized bed gasifiers, waste heat boilers, waste-to-energy plants, CFB scrubbers, baghouses, flue gas denitrification systems, plant operation support systems, industrial waste water treatment facilities, water and sewage treatment systems, steam turbines, process pumps, distillation technology and extractors, reactor vessels, mixing vessels, coke oven machines, food and beverage manufacturing facilities, and oil tankers. The company was founded in 1888 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Shinji  Shimomura",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "25211",
    "phone": "81 3 6737 2000",
    "address": "ThinkPark Tower",
    "city": "Tokyo",
    "state": null,
    "zip": "141-6025",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SOHVY.png",
    "ipoDate": "2011-07-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]