[
  {
    "symbol": "SOMLY",
    "price": 16.99,
    "beta": 0.341379,
    "volAvg": 53279,
    "mktCap": 14476346626,
    "lastDiv": 0.33,
    "range": "13.34-17.56",
    "changes": 0.03,
    "companyName": "SECOM CO., LTD.",
    "currency": "USD",
    "cik": null,
    "isin": "US8131132065",
    "cusip": "813113206",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Security & Protection Services",
    "website": "https://www.secom.co.jp",
    "description": "SECOM CO., LTD. provides security services in Japan and internationally. The company's Security Services segment provides online security systems, static guard services, and armored car services. Its Fire Protection Services segment provides automatic fire alarm systems, fire extinguishing systems, other fire protection systems, and related maintenance services to office buildings, plants, tunnels, cultural properties, ships, and residences. The company's Medical Services segment offers home nursing, pharmaceutical dispensing, and other personal care services; support for affiliated medical institutions; operates the general hospital, pharmacies, and residences for seniors; provides electronic medical report systems; health and preventative care services; and sells medical equipment and pharmaceuticals. Its Insurance Services Segment provides fire insurance, automobile insurance, and cancer treatment insurance services. The company's Geospatial Information Services segment provides geospatial information services to public-sector entities, including national and local governments; private sector customers; and overseas government agencies. Its BPO and ICT Services segment offers data center services, disaster preparedness services, BCP and telework support services, information security services, cloud-based services, and business process outsourcing services. The Real Estate and Other Services segment provides real estate leasing, construction, installation, and home services. It also offers building management, real estate management, electrical engineering, general office, credit, clerical, and software development services; sells security and water-treatment equipment; operates PFI correctional facilities, and restaurants and shops at medical facilities; and provides lifestyle support and car maintenance services, as well as manufactures, sells, and maintains freight elevators. The company was incorporated in 1962 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Ichiro  Ozeki",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "59745",
    "phone": "81 3 5775 8100",
    "address": "5-1, Jingumae 1-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "150-0001",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SOMLY.png",
    "ipoDate": "2006-01-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]