[
  {
    "symbol": "SOMMY",
    "price": 15.07,
    "beta": 0.818773,
    "volAvg": 27638,
    "mktCap": 4929020371,
    "lastDiv": 0.66,
    "range": "14.52-21.9",
    "changes": -0.23,
    "companyName": "Sumitomo Chemical Company, Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Chemicals",
    "website": "https://www.sumitomo-chem.co.jp",
    "description": "Sumitomo Chemical Company, Limited engages in Chemicals & Plastics, energy and functional materials, IT-related chemicals, health and crop sciences, pharmaceuticals, and other businesses worldwide. Its Essential Chemicals & Plastics segment offers synthetic resins, such as polyethylene, polypropylene, and polymethyl methacrylate resins; raw materials for synthetic fibers; and various industrial chemicals. The company's Energy & Functional Materials segment provides alumina and aluminum products used for energy products; resorcinol for tires, wood adhesives, flame retardants, and ultraviolet ray absorbants; polymer additives and rubber chemicals; synthetic rubber for tires, shoes, construction materials, and other applications; and engineering plastics and lithium-ion secondary battery materials for use in electronic components and next-generation vehicles. Its IT-Related Chemicals segment provides polarizing films, touch screen sensor panels, and color resists and polymer OLED for LC and OLED displays; photoresists and high-purity chemicals for the semiconductor manufacturing process; and compound semiconductor materials for antenna switches and other components of communication terminal equipment. The company's Health & Crop Sciences segment offers crop protection chemicals, fertilizers, feed additives, and household insecticides; active pharmaceutical ingredients and intermediates; and products to control infectious diseases. Its Pharmaceuticals segment provides prescription and diagnostic pharmaceuticals. The company's Others segment supplies electric power and steam; designs, constructs, and supervises chemical plants; provides transportation and warehousing services; and conducts physical property and environmental analysis. Sumitomo Chemical Company, Limited was founded in 1913 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Keiichi  Iwata",
    "sector": "Basic Materials",
    "country": "JP",
    "fullTimeEmployees": "33572",
    "phone": "81 3 5201 0200",
    "address": "Tokyo Nihombashi Tower",
    "city": "Tokyo",
    "state": null,
    "zip": "103-6020",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SOMMY.png",
    "ipoDate": "2010-04-06",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]