[
  {
    "symbol": "SON",
    "price": 58.03,
    "beta": 0.70669,
    "volAvg": 488917,
    "mktCap": 5684369039,
    "lastDiv": 2.04,
    "range": "53.78-65.97",
    "changes": -0.42,
    "companyName": "Sonoco Products Company",
    "currency": "USD",
    "cik": "0000091767",
    "isin": "US8354951027",
    "cusip": "835495102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaging & Containers",
    "website": "https://www.sonoco.com",
    "description": "Sonoco Products Company, together with its subsidiaries, manufactures and sells industrial and consumer packaging products in North and South America, Europe, Australia, and Asia. The company operates through two segments: Consumer Packaging and Industrial Paper Packaging. The Consumer Packaging segment round and shaped rigid paper containers; metal and peelable membrane ends and closures; thermoformed plastic trays and containers; printed flexible packaging; and global brand artwork management. The Industrial Paper Packaging segment provides fiber-based tubes, cones, and cores; fiber-based construction tubes; fiber-based protective packaging and components; wooden, metal, and composite wire and cable, as well as reels and spools; and recycled paperboard, corrugating medium, recovered paper, and material recycling services. Sonoco Products Company offers thermoformed rigid plastic trays and devices; custom-engineered molded foam protective packaging and components; temperature-assured packaging; injection molded and extruded containers, spools, and parts; retail security packaging, including printed backer cards, thermoformed blisters, and heat-sealing equipment; and paper amenities. The company sells its products in various markets, which include paper, textile, film, food, chemical, packaging, construction, and wire and cable. Sonoco Products Company was founded in 1899 and is headquartered in Hartsville, South Carolina.",
    "ceo": "Mr. Robert Howard Coker",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "22000",
    "phone": "843 383 7000",
    "address": "1 North Second Street",
    "city": "Hartsville",
    "state": "SC",
    "zip": "29550",
    "dcfDiff": 1.89936,
    "dcf": 62.1594,
    "image": "https://financialmodelingprep.com/image-stock/SON.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]