[
  {
    "symbol": "SONVY",
    "price": 52.95,
    "beta": 1.000383,
    "volAvg": 9380,
    "mktCap": 15777353074,
    "lastDiv": 1.02,
    "range": "41.59-73.3",
    "changes": 0.49,
    "companyName": "Sonova Holding AG",
    "currency": "USD",
    "cik": null,
    "isin": "US83569C1027",
    "cusip": "83569C102",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Medical Devices",
    "website": "https://www.sonova.com",
    "description": "Sonova Holding AG designs, develops, manufactures, and distributes hearing care solutions for adults and children. It operates through two segments, Hearing Instruments and Cochlear Implants segments. The company offers wireless communication products; rechargeable hearing aids; wireless headsets, speech enhanced hearables, audiophile headphones, microphones, and wireless transmission systems; and audiological care services. It also provides hearing instruments under the Phonak, Unitron, and Hansaton brand names; cochlear implants under the Advanced Bionics brand; consumer hearing products under the Sennheiser brand; and audiological care services under the AudioNova, Audium, Audition Santé, Boots Hearingcare, Connect Hearing, Geers, Hansaton, Lapperre, Schoonenberg, and Triton brands. The company sells its products through independent distributors; and provides hearing care services through a network of approximately 3,600 stores and clinics. It operates in the United States, Europe, the Middle East, Africa, and the Asia Pacific. The company was formerly known as Phonak Holding AG and changed its name to Sonova Holding AG in August 2007. Sonova Holding AG was founded in 1947 and is headquartered in Stäfa, Switzerland.",
    "ceo": "Mr. Arnd  Kaldowski",
    "sector": "Healthcare",
    "country": "CH",
    "fullTimeEmployees": "17608",
    "phone": "41 58 928 33 33",
    "address": "Laubisrutistrasse 28",
    "city": "Stäfa",
    "state": null,
    "zip": "8712",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SONVY.png",
    "ipoDate": "2011-04-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]