[
  {
    "symbol": "SONY",
    "price": 91.29,
    "beta": 0.930268,
    "volAvg": 806183,
    "mktCap": 112648202557,
    "lastDiv": 0.57,
    "range": "61.72-100.94",
    "changes": 1.22,
    "companyName": "Sony Group Corporation",
    "currency": "USD",
    "cik": "0000313838",
    "isin": "US8356993076",
    "cusip": "835699307",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Consumer Electronics",
    "website": "https://www.sony.com",
    "description": "Sony Group Corporation designs, develops, produces, and sells electronic equipment, instruments, and devices for the consumer, professional, and industrial markets in Japan, the United States, Europe, China, the Asia-Pacific, and internationally. The company distributes software titles and add-on content through digital networks; network services related to game, video, and music content; and home and portable game consoles, packaged software, and peripheral devices. It also develops, produces, markets, and distributes recorded music; publishes music; and produces and distributes animation titles, game applications, and various services for music and visual products. In addition, the company produces, acquires, and distributes live-action and animated motion pictures for theatrical release, as well as scripted and animated series, unscripted reality or light entertainment, daytime serials, game shows, television movies, and miniseries and other television programs; operates a visual effects and animation unit; manages a studio facility; and operates television and digital networks, and post-production facilities. Further, it researches, develops, designs, produces, markets, distributes, sells, and services televisions, and video and sound products; interchangeable lens, compact digital, and consumer and professional video cameras; projectors and medical equipment; mobile phones, tablets, accessories, and applications; and metal oxide semiconductor image sensors, charge-coupled devices, integration systems, and other semiconductors. Additionally, it offers Internet broadband network services; recording media, and storage media products; and life and non-life insurance, banking, and other services, as well as creates and distributes content for PCs and mobile phones. The company was formerly known as Sony Corporation and changed its name to Sony Group Corporation in April 2021. Sony Group Corporation was incorporated in 1946 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Kenichiro  Yoshida",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "113000",
    "phone": "81 3 6748 2111",
    "address": "1-7-1 Konan",
    "city": "Tokyo",
    "state": null,
    "zip": "108-0075",
    "dcfDiff": 1846.94,
    "dcf": 1893.57,
    "image": "https://financialmodelingprep.com/image-stock/SONY.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]