[
  {
    "symbol": "SPB",
    "price": 77.81,
    "beta": 1.397535,
    "volAvg": 822411,
    "mktCap": 3190560145,
    "lastDiv": 1.68,
    "range": "38.93-84.12",
    "changes": 0.42,
    "companyName": "Spectrum Brands Holdings, Inc.",
    "currency": "USD",
    "cik": "0000109177",
    "isin": "US84790A1051",
    "cusip": "84790A105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Household & Personal Products",
    "website": "https://www.spectrumbrands.com",
    "description": "Spectrum Brands Holdings, Inc. operates as a branded consumer products company worldwide. It operates through three segments: Home and Personal Care; Global Pet Care; and Home and Garden. The Home and Personal Care segment provides home appliances under the Black & Decker, Russell Hobbs, George Foreman, Toastmaster, Juiceman, Farberware, and Breadman brands; and personal care products under the Remington and LumaBella brands. The Global Pet Care segment provides rawhide chewing, dog and cat clean-up and food, training, health and grooming, small animal food and care, and rawhide-free products under the 8IN1 (8-in-1), Dingo, Nature's Miracle, Wild Harvest, Littermaid, Jungle, Excel, FURminator, IAMS, Eukanuba, Healthy-Hide, DreamBone, SmartBones, ProSense, Perfect Coat, eCOTRITION, Birdola, Good Boy, Meowee!, Wildbird, and Wafcol brands. This segment also offers aquarium kits, stand-alone tanks, and aquatics equipment and consumables under the Tetra, Marineland, Whisper, Instant Ocean, GloFish, OmegaOne, and OmegaSea brands. The Home and Garden segment provides outdoor insect and weed control solutions, and animal repellents under the Spectracide, Garden Safe, Liquid Fence, and EcoLogic brands; household pest control solutions under the Hot Shot, Black Flag, Real-Kill, Ultra Kill, The Ant Trap, and Rid-A-Bug brand names; household surface cleaning, maintenance, and restoration products, including bottled liquids, mops, wipes, and markers under the Rejuvenate brand name; and personal-use pesticides and insect repellent products under the Cutter and Repel brands. The company sells its products through retailers, e-commerce and online retailers, wholesalers, and distributors. Spectrum Brands Holdings, Inc. was incorporated in 2009 and is headquartered in Middleton, Wisconsin.",
    "ceo": "Mr. David M. Maura C.F.A.",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "3300",
    "phone": "608 275 3340",
    "address": "3001 Deming Way",
    "city": "Middleton",
    "state": "WI",
    "zip": "53562",
    "dcfDiff": 12.2305,
    "dcf": 52.7195,
    "image": "https://financialmodelingprep.com/image-stock/SPB.png",
    "ipoDate": "1979-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]