[
  {
    "symbol": "SPGI",
    "price": 391.52,
    "beta": 1.114436,
    "volAvg": 1138256,
    "mktCap": 125599616000,
    "lastDiv": 3.6,
    "range": "279.32-402.92",
    "changes": 0.51,
    "companyName": "S&P Global Inc.",
    "currency": "USD",
    "cik": "0000064040",
    "isin": "US78409V1044",
    "cusip": "78409V104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Financial Data & Stock Exchanges",
    "website": "https://www.spglobal.com",
    "description": "S&P Global Inc., together with its subsidiaries, provides credit ratings, benchmarks, analytics, and workflow solutions in the global capital, commodity, and automotive markets. It operates in six divisions: S&P Global Ratings, S&P Dow Jones Indices, S&P Global Commodity Insights, S&P Global Market Intelligence, S&P Global Mobility, and S&P Global Engineering Solutions. The S&P Global Ratings division operates as an independent provider of credit ratings, research, and analytics, offering investors and other market participants information, ratings, and benchmarks. The S&P Dow Jones Indices division is an index provider that maintains various valuation and index benchmarks for investment advisors, wealth managers, and institutional investors. The S&P Global Commodity Insights division offers data and insights for global energy and commodity markets and enable its customers to make decisions. The S&P Global Market Intelligence division delivers data and technology solutions for customers to provide insights for making decisions. It offers data and services that bring end-to-end workflow solutions, including capital formation, data and distribution, ESG and sustainability, leveraged loans, private markets, sector coverage, supply chain, and issuer solutions, as well as credit, risk, and regulatory solutions. The S&P Global Mobility division provides insights derived from unmatched automotive data, enabling its customers to anticipate change and make decisions. The S&P Global Engineering Solutions division offers engineering expertise and solutions in industries, such as aerospace and defense, energy, architecture, construction, and transportation. Its solutions empower business and technical leaders to transform workflows and make decisions. S&P Global Inc. was founded in 1860 and is headquartered in New York, New York.",
    "ceo": "Mr. Douglas L. Peterson M.B.A.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "39911",
    "phone": "212 438 1000",
    "address": "55 Water Street",
    "city": "New York",
    "state": "NY",
    "zip": "10041",
    "dcfDiff": 0.866012,
    "dcf": 374.256,
    "image": "https://financialmodelingprep.com/image-stock/SPGI.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]