[
  {
    "symbol": "SPKKY",
    "price": 15.5,
    "beta": 0.164367,
    "volAvg": 26591,
    "mktCap": 5786320624,
    "lastDiv": 0.91,
    "range": "13.71-17.33",
    "changes": -0.29,
    "companyName": "Spark New Zealand Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US84652A1025",
    "cusip": "84652A102",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.sparknz.co.nz",
    "description": "Spark New Zealand Limited, together with its subsidiaries, provides telecommunications and digital services in New Zealand. It offers telecommunications, information technology, media, and other digital products and services, including mobile services; voice services; broadband services; internet sports streaming services; cloud, security, and service. The company also provides IT infrastructure, business cloud, business and outsourced telecommunications, software, big data analytics, data center, and international wholesale telecommunications services. In addition, it offers local, national, and international telephone and data services; finance products; group insurance products; and mobile phone repair services. Further, the company retails telecommunications products and services; and distributes equipment. It serves consumers, households, small businesses, government, and large enterprises. The company was formerly known as Telecom Corporation of New Zealand Limited and changed its name to Spark New Zealand Limited in August 2014. Spark New Zealand Limited was incorporated in 1987 and is headquartered in Auckland, New Zealand.",
    "ceo": "Ms. Jolie  Hodson",
    "sector": "Communication Services",
    "country": "NZ",
    "fullTimeEmployees": "4921",
    "phone": "64 4 471 1638",
    "address": "Spark City",
    "city": "Auckland",
    "state": null,
    "zip": "1010",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SPKKY.png",
    "ipoDate": "1991-07-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]