[
  {
    "symbol": "SPLK",
    "price": 104.35,
    "beta": 1.279577,
    "volAvg": 1433585,
    "mktCap": 17280360000,
    "lastDiv": 0,
    "range": "65.0-116.84",
    "changes": 1.97,
    "companyName": "Splunk Inc.",
    "currency": "USD",
    "cik": "0001353283",
    "isin": "US8486371045",
    "cusip": "848637104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.splunk.com",
    "description": "Splunk Inc., together with its subsidiaries, provides software and cloud solutions that deliver and operationalize insights from the data generated by digital systems in the United States and internationally. The company offers Splunk Platform, a real-time data platform comprising collection, streaming, indexing, search, reporting, analysis, machine learning, alerting, monitoring, and data management capabilities. It also provides Splunk Solutions, such as Splunk Security solutions that enable cybersecurity teams streamline the security operations workflow, accelerate threat detection and response, enhance threat visibility, and scale resources to increase analyst productivity through machine learning and automation; Splunk IT Solutions that provide IT Operations teams visibility and control across cloud and on-premises environments; and Splunk Observability Solutions for building and maintaining infrastructure and applications. In addition, the company offers Ecosystem Solutions, which includes pre-built data inputs, workflows, searches, reports, alerts, custom dashboards, flexible UI components, custom data visualizations, and integration actions and methods, as well as Splunk On-Call, Splunk Infrastructure Monitoring, and Splunk SOAR solutions, which provides APIs, SDKs, and other interfaces that enable its ecosystem, including third-party developers, partners, and customers to build content that configures and extends Splunk solutions to accommodate specific use cases. Further, the company provides adoption and implementation services, education services, and maintenance and customer support services. It sells its offerings directly through field and inside sales, and indirectly through various routes to market with various partners. Splunk Inc. was incorporated in 2003 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Gary L. Steele",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "8000",
    "phone": "415 848 8400",
    "address": "270 Brannan Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94107",
    "dcfDiff": 7.7651,
    "dcf": 87.5149,
    "image": "https://financialmodelingprep.com/image-stock/SPLK.png",
    "ipoDate": "2012-04-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]