[
  {
    "symbol": "SPR",
    "price": 28.98,
    "beta": 1.636267,
    "volAvg": 3086656,
    "mktCap": 3049130700,
    "lastDiv": 0.04,
    "range": "21.14-38.55",
    "changes": -0.28,
    "companyName": "Spirit AeroSystems Holdings, Inc.",
    "currency": "USD",
    "cik": "0001364885",
    "isin": "US8485741099",
    "cusip": "848574109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.spiritaero.com",
    "description": "Spirit AeroSystems Holdings, Inc. designs, engineers, manufactures, and markets commercial aerostructures worldwide. It operates through three segments: Commercial, Defense & Space, and Aftermarket. The Commercial segment offers forward, mid, and rear fuselage sections and systems, struts/pylons, nacelles, and related engine structural components; and wings and wing components, including flight control surfaces, as well as other structural parts. This segment primarily serves the aircraft original equipment manufacturers (OEMs) or engine OEMs of large commercial aircraft and/or business/regional jet programs. The Defense & Space segment provides fuselage, strut, nacelle, and wing aerostructures primarily for U.S. Government defense programs, including Boeing P-8, C40, and KC-46 Tanker. This segment also engages in the fabrication, bonding, assembly, testing, tooling, processing, engineering analysis, and training on fixed wing aircraft aerostructures, missiles, and hypersonics works, such as solid rocket motor throats, nozzles, re-entry vehicle thermal protections systems, forward cockpit and cabin, and fuselage work on rotorcraft aerostructures. The Aftermarket segment offers spare parts and MRO services, repairs for flight control surfaces and nacelles, radome repairs, rotable assets, engineering services, advanced composite repairs, and other repair and overhaul services. Spirit AeroSystems Holdings, Inc. has a strategic partnership with Sierra Space to enhance access to commercial space economy of the future. The company was formerly known as Mid-Western Aircraft Systems Holdings, Inc. Spirit AeroSystems Holdings, Inc. was founded in 1927 and is headquartered in Wichita, Kansas.",
    "ceo": "Mr. Thomas C. Gentile III",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "18235",
    "phone": "316 526 9000",
    "address": "3801 South Oliver Street",
    "city": "Wichita",
    "state": "KS",
    "zip": "67210",
    "dcfDiff": 5.36099,
    "dcf": 39.231,
    "image": "https://financialmodelingprep.com/image-stock/SPR.png",
    "ipoDate": "2006-11-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]