[
  {
    "symbol": "SPSC",
    "price": 188.5,
    "beta": 0.772535,
    "volAvg": 169191,
    "mktCap": 6886432800,
    "lastDiv": 0,
    "range": "100.06-189.2",
    "changes": 4.65,
    "companyName": "SPS Commerce, Inc.",
    "currency": "USD",
    "cik": "0001092699",
    "isin": "US78463M1071",
    "cusip": "78463M107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.spscommerce.com",
    "description": "SPS Commerce, Inc. provides cloud-based supply chain management solutions worldwide. It offers solutions through the SPS Commerce, a cloud-based platform that enhances the way retailers, suppliers, grocers, distributors, and logistics firms manage and fulfill omnichannel orders, optimize sell-through performance, and automate new trading relationships. The company also provides Fulfillment solution that provides fulfillment automation and replaces or augments an organization's existing staff and trading partner electronic communication infrastructure by enabling easy compliance with retailers' rulebooks, automatic, and digital exchange of information among numerous trading partners through various protocols, and greater visibility into the journey of an order; and Analytics solution, which consists of data analytics applications that enables customers to enhance their visibility across supply chains through greater analytics capabilities. In addition, it offers various complimentary products, such as assortment product, which enables accurate order management and rapid fulfillment; and community product that accelerates vendor onboarding and ensures trading partner adoption of new supply chain requirements. The company was formerly known as St. Paul Software, Inc. and changed its name to SPS Commerce, Inc. in May 2001. SPS Commerce, Inc. was incorporated in 1987 and is headquartered in Minneapolis, Minnesota.",
    "ceo": "Mr. Archie C. Black",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2215",
    "phone": "612 435 9400",
    "address": "333 South Seventh Street",
    "city": "Minneapolis",
    "state": "MN",
    "zip": "55402",
    "dcfDiff": 2.42275,
    "dcf": 134.397,
    "image": "https://financialmodelingprep.com/image-stock/SPSC.png",
    "ipoDate": "2010-04-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]