[
  {
    "symbol": "SPT",
    "price": 47.04,
    "beta": 0.888249,
    "volAvg": 969280,
    "mktCap": 2605907761,
    "lastDiv": 0,
    "range": "37.0-74.07",
    "changes": 0.65,
    "companyName": "Sprout Social, Inc.",
    "currency": "USD",
    "cik": "0001517375",
    "isin": "US85209W1099",
    "cusip": "85209W109",
    "exchange": "NASDAQ Capital Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.sproutsocial.com",
    "description": "Sprout Social, Inc. designs, develops, and operates a web-based social media management platform in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It provides cloud software that brings together social messaging, data, and workflows in a unified system of record, intelligence, and action. The company offers provides various integrated tools in a range of functions comprising social engagement/response, publishing, reporting and analytics, social listening and business intelligence, reputation management, employee advocacy, and automation and workflows. Its tools serve a range of use-cases within its customers' organizations, including social and community management, public relations, marketing, customer service and care, commerce, sales and customer acquisition, recruiting and hiring, product development, and business strategy. The company also offers professional services, which primarily consist of consulting and training services. It serves approximately more than 31,000 customers across small-and-medium-sized businesses, mid-market companies, enterprises, marketing agencies, government, non-profit, and educational institutions. The company was incorporated in 2010 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Justyn Russell Howard",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1141",
    "phone": "866 878 3231",
    "address": "131 South Dearborn Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60603",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SPT.png",
    "ipoDate": "2019-12-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]