[
  {
    "symbol": "SPXC",
    "price": 83.47,
    "beta": 1.224647,
    "volAvg": 262237,
    "mktCap": 3798035246,
    "lastDiv": 5.823445999999996,
    "range": "49.67-85.61",
    "changes": 0.29,
    "companyName": "SPX Technologies, Inc.",
    "currency": "USD",
    "cik": "0000088205",
    "isin": "US78473E1038",
    "cusip": "78473E103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.spx.com",
    "description": "SPX Technologies, Inc. supplies infrastructure equipment serving the heating, ventilation, and cooling (HVAC); and detection and measurement markets in the United States, China, the United Kingdom, and internationally. The company operates in two segments, HVAC and Detection and Measurement. The HVAC segment engineers, designs, manufactures, installs, and services package and process cooling products and engineered air movement solutions for the HVAC industrial and power generation markets, as well as boilers and comfort heating and ventilation products for the residential and commercial markets. It offers its products under the Marley, Recold, SGS, Cincinnati Fan, Berko, Qmark, Fahrenheat, Leading Edge, Patterson-Kelley, Weil-McLain, and Williamson-Thermoflo brands. The Detection and Measurement segment offers underground pipe and cable locators, inspection and rehabilitation equipment, and robotic systems under the Radiodetection, Pearpoint, Schonstedt, Dielectric, Riser Bond, Warren G-V, Cues, ULC Robotics, and Sensors & Software brands; and bus fare collection systems, communication technologies, and obstruction lighting products under the Genfare, TCI, Flash Technology, Sabik Marine, Sealite, Avlite, and ECS brands. The company markets its products through independent manufacturing representatives, third-party distributors, and retailers, as well as direct to customers. The company was formerly known as SPX Corporation and changed its name to SPX Technologies, Inc. in August 2022. SPX Technologies, Inc. was founded in 1912 and is headquartered in Charlotte, North Carolina.",
    "ceo": "Mr. Eugene Joseph Lowe III",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "3300",
    "phone": "980 474 3700",
    "address": "6325 Ardrey Kell Road",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28277",
    "dcfDiff": 6.32155,
    "dcf": 79.0915,
    "image": "https://financialmodelingprep.com/image-stock/SPXC.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]