[
  {
    "symbol": "SQ",
    "price": 64.77,
    "beta": 2.327112,
    "volAvg": 11252279,
    "mktCap": 39179112106,
    "lastDiv": 0,
    "range": "51.34-93.19",
    "changes": 0.84,
    "companyName": "Block, Inc.",
    "currency": "USD",
    "cik": "0001512673",
    "isin": "US8522341036",
    "cusip": "852234103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.block.xyz",
    "description": "Block, Inc., together with its subsidiaries, creates tools that enables sellers to accept card payments and provides reporting and analytics, and next-day settlement. It provides hardware products, including Magstripe reader, which enables swiped transactions of magnetic stripe cards; Contactless and chip reader that accepts Europay, MasterCard, and Visa (EMV) chip cards and Near Field Communication payments; Square Stand, which enables an iPad to be used as a payment terminal or full point of sale solution; Square Register that combines its hardware, point-of-sale software, and payments technology; Square Terminal, a payments device and receipt printer to replace traditional keypad terminals, which accepts tap, dip, and swipe payments. The company also offers various software products, including Square Point of Sale; Square Appointments; Square for Retail; Square for Restaurants; Square Online and Square Online Checkout; Square Invoices; Square Virtual Terminal; Square Team Management; Square Contracts; Square Loyalty, Marketing, and Gift Cards; and Square Dashboard. In addition, it offers a developer platform, which includes application programming interfaces and software development kits. Further, the company provides Cash App, which enables to send, spend, and store money; and Weebly that offers customers website hosting and domain name registration solutions. It serves in the United States, Canada, Japan, Australia, Ireland, France, Spain, and the United Kingdom. The company was formerly known as Square, Inc. and changed its name to Block, Inc. in December 2021. Block, Inc. was incorporated in 2009 and is based in San Francisco, California.",
    "ceo": "Mr. Jack  Dorsey",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "12428",
    "phone": "415 375 3176",
    "address": "1455 Market Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94103",
    "dcfDiff": 13.1242,
    "dcf": 70.7058,
    "image": "https://financialmodelingprep.com/image-stock/SQ.png",
    "ipoDate": "2015-11-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]