[
  {
    "symbol": "SQNXF",
    "price": 47.94,
    "beta": 0.490421,
    "volAvg": 101,
    "mktCap": 5733863700,
    "lastDiv": 0.72,
    "range": "42.54-50.3",
    "changes": -1.22,
    "companyName": "Square Enix Holdings Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Electronic Gaming & Multimedia",
    "website": "https://www.hd.square-enix.com",
    "description": "Square Enix Holdings Co., Ltd. operates in the content and service businesses in Japan, North America, Europe, and rest of Asia. It operates through four segments: Digital Entertainment, Amusement, Publication, and Merchandising. The company's Digital Entertainment segment plans, develops, distributes, and operates digital entertainment content primarily in the form of games. This segment offers digital entertainment content for various customer usage environments, including personal computers and smart devices, as well as consumer game consoles, such as handheld game machines. Its Amusement segment is involved in the operation of amusement facilities. This segment also engages in the planning, development, distribution, and rental of arcade game machines and related products for amusement facilities. The company's Publication segment publishes and licenses comic magazines, comic books, and game-related books. Its Merchandising segment plans, produces, distributes, and licenses derivative products. The company publishes, distributes, and licenses entertainment content under the SQUARE ENIX and TAITO brands. Square Enix Holdings Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Yosuke  Matsuda",
    "sector": "Communication Services",
    "country": "JP",
    "fullTimeEmployees": "4675",
    "phone": "81 3 5292 8000",
    "address": "Shinjuku Eastside Square",
    "city": "Tokyo",
    "state": null,
    "zip": "160-8430",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SQNXF.png",
    "ipoDate": "2010-02-23",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]