[
  {
    "symbol": "SRAD",
    "price": 12.96,
    "beta": 0,
    "volAvg": 286332,
    "mktCap": 3851919360,
    "lastDiv": 0,
    "range": "7.1-14.56",
    "changes": 0.71,
    "companyName": "Sportradar Group AG",
    "currency": "USD",
    "cik": "0001836470",
    "isin": "CH1134239669",
    "cusip": "H8088L103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.sportradar.com",
    "description": "Sportradar Group AG, together with its subsidiaries, provides sports data services for the sports betting and media industries in the United Kingdom, the United States, Malta, Switzerland, and internationally. Its sports data services to the bookmaking under the Betradar brand name, and to the international media industry under the Sportradar Media Services brand name. The company offers mission-critical software, data, and content to sports leagues, betting operators, and media companies. In addition, the company provides sports entertainment, gaming solution, and sports solutions, as well as live streaming solution for online, mobile, and retail sports betting. Further, its software solutions address the entire sports betting value chain from traffic generation and advertising technology to the collection, processing, and extrapolation of data and odds, as well as to visualization solutions, risk management, and platform services. Sportradar Group AG was incorporated in 2001 and is headquartered in St. Gallen, Switzerland.",
    "ceo": "Mr. Carsten  Koerl",
    "sector": "Technology",
    "country": "CH",
    "fullTimeEmployees": "3977",
    "phone": "41 71 517 72 00",
    "address": "Feldlistrasse 2",
    "city": "Sankt Gallen",
    "state": null,
    "zip": "9000",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SRAD.png",
    "ipoDate": "2021-09-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]