[
  {
    "symbol": "SRCL",
    "price": 44.88,
    "beta": 1.23169,
    "volAvg": 414450,
    "mktCap": 4148949552,
    "lastDiv": 0,
    "range": "39.63-56.12",
    "changes": -0.19,
    "companyName": "Stericycle, Inc.",
    "currency": "USD",
    "cik": "0000861878",
    "isin": "US8589121081",
    "cusip": "858912108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Waste Management",
    "website": "https://www.stericycle.com",
    "description": "Stericycle, Inc., together with its subsidiaries, provides regulated and compliance solutions in the United States, Europe, and internationally. The company offers regulated waste and compliance services, including sharps disposable and management solutions; pharmaceutical waste services; hazardous waste disposal; maritime waste services, such as seaport and airport waste; and compliance programs under the Steri-Safe, Clinical Services, First Practice Management, SeguriMed, and EnviroAssure brand names. It also provides secure information destruction services, including document and hard drive destruction services under the Shred-it brand; and communication solutions, such as appointment reminders, secure messaging, event registration, and other communications specifically for hospitals and integrated delivery networks. The company serves healthcare businesses, including hospitals, physician and dental practices, outpatient clinics, long-term care facilities, etc.; retailers and manufacturers; financial and professional service providers; governmental entities; and other businesses. Stericycle, Inc. was incorporated in 1989 and is headquartered in Bannockburn, Illinois.",
    "ceo": "Ms. Cindy J. Miller",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "14550",
    "phone": "847 367 5910",
    "address": "2355 Waukegan Road",
    "city": "Bannockburn",
    "state": "IL",
    "zip": "60015",
    "dcfDiff": 1.93235,
    "dcf": 50.5976,
    "image": "https://financialmodelingprep.com/image-stock/SRCL.png",
    "ipoDate": "1996-08-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]