[
  {
    "symbol": "SRE",
    "price": 145.13,
    "beta": 0.744366,
    "volAvg": 1212388,
    "mktCap": 45665588729,
    "lastDiv": 4.76,
    "range": "136.54-176.47",
    "changes": -1.14,
    "companyName": "Sempra",
    "currency": "USD",
    "cik": "0001032208",
    "isin": "US8168511090",
    "cusip": "816851109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Diversified",
    "website": "https://www.sempra.com",
    "description": "Sempra operates as an energy-services holding company in the United States and internationally. The company's San Diego Gas & Electric Company segment provides electric services; and supplies natural gas. It offers electric services to approximately 3.6 million population and natural gas services to approximately 3.3 million population that covers 4,100 square miles. Its Southern California Gas Company segment owns and operates a natural gas distribution, transmission, and storage system that supplies natural gas to a population of approximately 22 million covering an area of 24,000 square miles. The company's Sempra Texas Utilities segment engages in the regulated transmission and distribution of electricity serving 3.8 million homes and businesses, and operation of 140,000 miles of transmission and distribution lines. Its transmission system includes 18,249 circuit miles of transmission lines, a total of 1,174 transmission and distribution substations, and interconnection to 130 third-party generation facilities totaling 45,403 megawatts. The company was formerly known as Sempra Energy and changed its name to Sempra in July 2021. Sempra was founded in 1998 and is headquartered in San Diego, California.",
    "ceo": "Mr. Jeffrey Walker Martin",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "15785",
    "phone": "619 696 2000",
    "address": "488 8th Avenue",
    "city": "San Diego",
    "state": "CA",
    "zip": "92101",
    "dcfDiff": 1.27426,
    "dcf": 160.556,
    "image": "https://financialmodelingprep.com/image-stock/SRE.png",
    "ipoDate": "1998-06-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]