[
  {
    "symbol": "SRPT",
    "price": 111.91,
    "beta": 1.001408,
    "volAvg": 1513612,
    "mktCap": 10424271465,
    "lastDiv": 0,
    "range": "72.02-159.89",
    "changes": 5.51,
    "companyName": "Sarepta Therapeutics, Inc.",
    "currency": "USD",
    "cik": "0000873303",
    "isin": "US8036071004",
    "cusip": "803607100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.sarepta.com",
    "description": "Sarepta Therapeutics, Inc., a commercial-stage biopharmaceutical company, focuses on the discovery and development of RNA-targeted therapeutics, gene therapies, and other genetic therapeutic modalities for the treatment of rare diseases. It offers EXONDYS 51 injection to treat duchenne muscular dystrophy (duchenne) in patients with confirmed mutation of the dystrophin gene that is amenable to exon 51 skipping; and VYONDYS 53 for the treatment of duchenne in patients with confirmed mutation of the dystrophin gene that is amenable to exon 53 skipping. The company is also developing AMONDYS 45, a product candidate that uses phosphorodiamidate morpholino oligomer chemistry and exon-skipping technology to skip exon 45 of the dystrophin gene; SRP-5051, a peptide conjugated PMO that binds exon 51 of dystrophin pre-mRNA; SRP-9001, a DMD micro-dystrophin gene therapy program; and SRP-9003, a limb-girdle muscular dystrophies gene therapy program. It has collaboration agreements with F. Hoffman-La Roche Ltd; Nationwide Children's Hospital; Lysogene; Duke University; Genethon; and StrideBio. The company was incorporated in 1980 and is headquartered in Cambridge, Massachusetts.",
    "ceo": "Mr. Douglas S. Ingram Esq.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "1162",
    "phone": "617 274 4000",
    "address": "215 First Street",
    "city": "Cambridge",
    "state": "MA",
    "zip": "02142",
    "dcfDiff": 14.8018,
    "dcf": 137.692,
    "image": "https://financialmodelingprep.com/image-stock/SRPT.png",
    "ipoDate": "1997-06-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]