[
  {
    "symbol": "SSAAY",
    "price": 3.51,
    "beta": 1.331417,
    "volAvg": 1637,
    "mktCap": 7229441756,
    "lastDiv": 0.42,
    "range": "2.03-3.97",
    "changes": -0.145,
    "companyName": "SSAB AB (publ)",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Steel",
    "website": "https://www.ssab.com",
    "description": "SSAB AB (publ) produces and sells steel products in the United States, Sweden, Finland, Germany, Denmark, and internationally. It operates through five segments: SSAB Special Steels, SSAB Europe, SSAB Americas, Tibnor, and Ruukki Construction. The SSAB Special Steels segment offers quenched and tempered steels, and hot-rolled advanced high-strength steel products. The SSAB Europe segment provides strip, plate, and tubular products. The SSAB Americas segment offers heavy steel plates. The Tibnor segment distributes a range of steel and non-ferrous metals in the Nordic region and the Baltics. The Ruukki Construction segment produces and sells building and construction products and services for residential and non-residential construction. The company markets its steel products under the Strenx, Hardox, Docol, GreenCoat, Toolox, Armox, Duroxite, SSAB Boron, SSAB Domex, SSAB Form, SSAB Laser, SSAB Weathering and Cor-Ten, and SSAB Multisteel brands. It serves the heavy transport, construction, automotive, industrial, construction machinery, energy, material handling, and service center industries. The company has a collaboration agreement with Faurecia S.E. to deliver fossil-free steel for automotive seat structures. SSAB AB (publ) was founded in 1878 and is headquartered in Stockholm, Sweden.",
    "ceo": "Mr. Martin  Lindqvist Eng., M.B.A.",
    "sector": "Basic Materials",
    "country": "SE",
    "fullTimeEmployees": "14634",
    "phone": "46 84 54 57 00",
    "address": "Klarabergsviadukten 70, D6",
    "city": "Stockholm",
    "state": null,
    "zip": "101 21",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SSAAY.png",
    "ipoDate": "2011-07-27",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]