[
  {
    "symbol": "SSB",
    "price": 65.06,
    "beta": 0.788732,
    "volAvg": 628530,
    "mktCap": 4939543614,
    "lastDiv": 2,
    "range": "59.51-91.74",
    "changes": -0.59,
    "companyName": "SouthState Corporation",
    "currency": "USD",
    "cik": "0000764038",
    "isin": "US8404411097",
    "cusip": "840441109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.southstatebank.com",
    "description": "SouthState Corporation operates as the bank holding company for SouthState Bank, National Association that provides a range of banking services and products to individuals and companies. It accepts checking accounts, savings deposits, interest-bearing transaction accounts, certificates of deposits, money market accounts, and other time deposits. The company also offers commercial real estate loans, residential real estate loans, commercial, and industrial loans, as well as consumer loans, including auto, boat, and personal installment loans. In addition, it provides debit card, mobile and funds transfer products, and treasury management services comprising merchant, automated clearing house, lock-box, remote deposit capture, and other treasury services. Further, the company offers safe deposit boxes, bank money orders, wire transfer, brokerage services, and alternative investment products, including annuities, mutual funds, and trust and asset management services; and credit cards, letters of credit, and home equity lines of credit. As of December 31, 2021, it served customers through 281 branches in Florida, South Carolina, Alabama, Georgia, North Carolina, and Virginia. SouthState Corporation also serves its customers through online, mobile, and telephone banking platforms. The company was formerly known as First Financial Holdings, Inc. and changed its name to SouthState Corporation in July 2013. SouthState Corporation was founded in 1933 and is headquartered in Winter Haven, Florida.",
    "ceo": "Mr. John C. Corbett",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "5085",
    "phone": "863 293 4710",
    "address": "1101 First Street South",
    "city": "Winter Haven",
    "state": "FL",
    "zip": "33880",
    "dcfDiff": 18.355,
    "dcf": 95.485,
    "image": "https://financialmodelingprep.com/image-stock/SSB.png",
    "ipoDate": "1997-01-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]