[
  {
    "symbol": "SSD",
    "price": 136.7,
    "beta": 1.21338,
    "volAvg": 160890,
    "mktCap": 5833016340,
    "lastDiv": 1.08,
    "range": "75.25-137.33",
    "changes": 1.04,
    "companyName": "Simpson Manufacturing Co., Inc.",
    "currency": "USD",
    "cik": "0000920371",
    "isin": "US8290731053",
    "cusip": "829073105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.simpsonmfg.com",
    "description": "Simpson Manufacturing Co., Inc., through its subsidiaries, designs, engineers, manufactures, and sells wood and concrete construction products. The company offers wood construction products, including connectors, truss plates, fastening systems, fasteners and shearwalls, and pre-fabricated lateral systems for use in light-frame construction; and concrete construction products comprising adhesives, specialty chemicals, mechanical anchors, carbide drill bits, powder actuated tools, fiber-reinforced materials, and other repair products for use in concrete, masonry, and steel construction, as well as grouts, coatings, sealers, mortars, fiberglass and fiber-reinforced polymer systems, and asphalt products for use in concrete construction repair, and strengthening and protection products. It also provides connectors and lateral products for wood framing, timber and offsite construction, structural steel construction, and cold-formed steel applications; and mechanical and adhesive anchors for concrete and masonry construction applications. In addition, the company offers engineering and design services, as well as software solutions that facilitate the specification, selection, and use of its products. It markets its products to the residential construction, light industrial and commercial construction, remodeling, and do-it-yourself markets in the United States, Canada, France, the United Kingdom, Germany, Denmark, Switzerland, Portugal, Poland, the Netherlands, Belgium, Spain, Sweden, Norway, Australia, New Zealand, China, Taiwan, and Vietnam. The company was founded in 1956 and is headquartered in Pleasanton, California.",
    "ceo": "Mr. Michael L. Olosky",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5158",
    "phone": "925 560 9000",
    "address": "5956 West Las Positas Boulevard",
    "city": "Pleasanton",
    "state": "CA",
    "zip": "94588",
    "dcfDiff": 4.65451,
    "dcf": 98.5455,
    "image": "https://financialmodelingprep.com/image-stock/SSD.png",
    "ipoDate": "1994-05-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]