[
  {
    "symbol": "SSL",
    "price": 12.37,
    "beta": 2.232191,
    "volAvg": 278714,
    "mktCap": 7846736320,
    "lastDiv": 1.24,
    "range": "11.56-24.01",
    "changes": 0.04,
    "companyName": "Sasol Limited",
    "currency": "USD",
    "cik": "0000314590",
    "isin": "US8038663006",
    "cusip": "803866300",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.sasol.com",
    "description": "Sasol Limited, together with its subsidiaries, operates as an integrated chemical and energy company in South Africa. The company operates through six segments: Mining, Gas, Fuels, Chemicals Africa, Chemicals America, and Chemicals Eurasia. It offers acetate, acrylate monomer, ammonia, carbon, chlor alkali, explosive, fertilizer, glycol ether, hydrocarbon blend, inorganic, ketone, mining, polymer, and wax chemicals, as well as lacquer thinners, light alcohols, and phenolics or cresylic acids. The company also markets and sells brick, electrical, engine, hand, non-ferrous, and window cleaners, as well as parts wash products and super soaps; degreasers; bitumen, fuel oils, lubricants, motor fuels, and gas-to-liquid fuels; and other fuels, such as illuminating paraffin, light cycle and distillate oils, light straight run fuels, and synthetic paraffinic kerosene. In addition, it wholesales diesel and petrol; operates coal mines; offers engineering services; and develops lower carbon solutions. Further, the company explores, develops, produces, markets, and distributes natural gas and related products through pipelines. It serves adhesive, agriculture and forestry, automotive and transportation, aviation, burner fuel, chemical, construction and material, corrosion protection, electrical and electronic, flavor and fragrance, furniture, health and medical, household and consumer goods, industrial product, lubricant, manufacturing, mining, packaging, paint and coating, personal care, pharmaceutical, plastic and polymer, publishing and ink, pulp and paper, rubber and tyre, specialty graphite, steel and foundry, textile and leather, water treatment, and other industries. Sasol Limited was founded in 1950 and is headquartered in Johannesburg, South Africa.",
    "ceo": "Mr. Fleetwood Rawstorne Grobler B Eng(Mech), BEng(Mech)",
    "sector": "Basic Materials",
    "country": "ZA",
    "fullTimeEmployees": "28279",
    "phone": "27 10 344 5000",
    "address": "Sasol Place",
    "city": "Johannesburg",
    "state": null,
    "zip": "2196",
    "dcfDiff": 48.3367,
    "dcf": 66.6967,
    "image": "https://financialmodelingprep.com/image-stock/SSL.png",
    "ipoDate": "1982-04-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]