[
  {
    "symbol": "SSMXY",
    "price": 34.09,
    "beta": 0.619157,
    "volAvg": 15067,
    "mktCap": 14268642765,
    "lastDiv": 0.29,
    "range": "25.08-36.57",
    "changes": -0.01,
    "companyName": "Sysmex Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US87184P1093",
    "cusip": "87184P109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.sysmex.co.jp",
    "description": "Sysmex Corporation engages in the development, manufacture, and sale of diagnostic instruments, reagents, and related software in Japan. The company offers three-part and five-part white blood cell differentiation instruments for use in hematology; and transport systems for high-volume testing in labs. It also provides urine formed sediment analysis systems; automated immunochemistry systems, which perform assays on minute sample quantities, as well as reagents to test for infectious disease and tumor markers; and flow cytometers to perform analysis in diagnosing leukemia, malignant lymphoma, and HIV/AIDS. In addition, the company offers cancer lymph node metastasis testing systems to detect information to help in diagnosing lymph node metastasis; cancer genome profiling systems; and cytogenic testing and lab assay services. It is also involved in the development and sale of software for diagnostic information systems; provision of facility management, office, and welfare services; development, manufacture, and sale of nucleic acid analogs; development, operation, and maintenance of IT solutions, platforms, and applications related to digital medicine; marketing, development, design, manufacture, sale, and after-sales service related to medical robots; and distribution and after sales support of medical devices and reagents for biotechnology, medical technology, and molecular cell analysis. The company serves national and other public hospitals, private hospitals, universities, research institutes, other medical institutions, etc. It also exports its products to approximately 190 countries. Sysmex Corporation has a strategic alliance with QIAGEN N.V. for the development and commercialization of cancer companion diagnostics using Plasma-Safe-SeqS technology. The company was formerly known as TOA Medical Electronics Co., Ltd. and changed its name to Sysmex Corporation in October 1998. Sysmex Corporation was founded in 1968 and is headquartered in Kobe, Japan.",
    "ceo": "Mr. Hisashi  Ietsugu",
    "sector": "Healthcare",
    "country": "JP",
    "fullTimeEmployees": "8771",
    "phone": "81 78 265 0500",
    "address": "1-5-1, Wakinohama-Kaigandori",
    "city": "Kobe",
    "state": null,
    "zip": "651-0073",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SSMXY.png",
    "ipoDate": "2011-10-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]