[
  {
    "symbol": "ST",
    "price": 44.43,
    "beta": 1.32183,
    "volAvg": 991983,
    "mktCap": 6793080420,
    "lastDiv": 0.48,
    "range": "36.64-54.34",
    "changes": -0.06,
    "companyName": "Sensata Technologies Holding plc",
    "currency": "USD",
    "cik": "0001477294",
    "isin": "GB00BFMBMT84",
    "cusip": "G8060N102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.sensata.com",
    "description": "Sensata Technologies Holding plc develops, manufactures, and sells sensors, sensor-based solutions, controls, and other products in the Americas, Europe, Asia, and internationally. It operates in two segments, Performance Sensing and Sensing Solutions. The Performance Sensing segment develops and manufactures sensors, high-voltage contactors, and other solutions used in mission-critical systems and applications, such as tire pressure monitoring, thermal management, electrical protection, regenerative braking, powertrain (engine/transmission), and exhaust management. This segment serves customers in the automotive, and heavy vehicle and off-road industries. The Sensing Solutions segment develops and manufactures application-specific sensor and electrical protection products primarily serving the industrial and aerospace markets. Its products include pressure and position sensors, motor and compressor protectors, high-voltage contactors, solid state relays, bimetal electromechanical controls, power inverters, charge controllers, battery management systems, operator controls, and Internet of Things solutions. The company was founded in 1916 and is headquartered in Attleboro, Massachusetts.",
    "ceo": "Mr. Jeffrey J. Cote CPA",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "21000",
    "phone": "508 236 3800",
    "address": "529 Pleasant Street",
    "city": "Attleboro",
    "state": "MA",
    "zip": "02703",
    "dcfDiff": 7.67586,
    "dcf": 54.4659,
    "image": "https://financialmodelingprep.com/image-stock/ST.png",
    "ipoDate": "2010-03-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]