[
  {
    "symbol": "STAA",
    "price": 51.19,
    "beta": 1.179577,
    "volAvg": 635485,
    "mktCap": 2474176508,
    "lastDiv": 0,
    "range": "46.36-112.27",
    "changes": 0.39,
    "companyName": "STAAR Surgical Company",
    "currency": "USD",
    "cik": "0000718937",
    "isin": "US8523123052",
    "cusip": "852312305",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.staar.com",
    "description": "STAAR Surgical Company, together with its subsidiaries, designs, develops, manufactures, markets, and sells implantable lenses for the eye, and companion delivery systems to deliver the lenses into the eye. The company provides Visian implantable Collamer lens product family (ICLs) to treat visual disorders, such as myopia, hyperopia, astigmatism, and presbyopia; and Hyperopic ICL, which treats far-sightedness. It also offers preloaded silicone cataract intraocular lenses and injector systems for use in cataract surgery. In addition, the company sells injector parts, and other related instruments and devices. It markets its products to health care providers, including ophthalmic surgeons, vision and surgical centers, hospitals, government facilities, and distributors, as well as products are primarily used by ophthalmologists. The company sells its products directly through its sales representatives in the United States, Japan, Germany, Spain, Canada, the United Kingdom, and Singapore, as well as through own representatives and independent distributors in China, Korea, India, France, Benelux, Italy, and internationally. STAAR Surgical Company was incorporated in 1982 and is headquartered in Lake Forest, California.",
    "ceo": "Mr. Thomas G. Frinzi",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "882",
    "phone": "626 303 7902",
    "address": "25651 Atlantic Ocean Drive",
    "city": "Lake Forest",
    "state": "CA",
    "zip": "92630",
    "dcfDiff": 7.96538,
    "dcf": 63.9346,
    "image": "https://financialmodelingprep.com/image-stock/STAA.png",
    "ipoDate": "1992-02-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]