[
  {
    "symbol": "STE",
    "price": 216.89,
    "beta": 0.844014,
    "volAvg": 424619,
    "mktCap": 21396415390,
    "lastDiv": 1.88,
    "range": "159.21-227.36",
    "changes": 0.07,
    "companyName": "STERIS plc",
    "currency": "USD",
    "cik": "0001757898",
    "isin": "IE00BFY8C754",
    "cusip": "G8473T100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.steris.com",
    "description": "STERIS plc provides infection prevention and other procedural products and services worldwide. It operates through four segments: Healthcare, Applied Sterilization Technologies, Life Sciences, and Dental. The Healthcare segment offers cleaning chemistries and sterility assurance products; automated endoscope reprocessing system and tracking products; accessories for gastrointestinal (GI) procedures, washers, sterilizers, and other pieces of capital equipment for the operation of a sterile processing department; and equipment used directly in the operating room, including surgical tables, lights, and connectivity solutions, as well as equipment management services. It also provides capital equipment installation, maintenance, upgradation, repair, and troubleshooting services; preventive maintenance programs and repair services; instrument and endoscope repair and maintenance services; and custom process improvement consulting and outsourced instrument sterile processing services. The Applied Sterilization Technologies segment provides contract sterilization and testing services for medical device and pharmaceutical manufacturers through a network of approximately 50 contract sterilization and laboratory facilities. The Life Sciences segment designs, manufactures and sells consumable products, such as formulated cleaning chemistries, barrier and sterility assurance products, steam and vaporized hydrogen peroxide sterilizers, and washer disinfectors. This segment also offers equipment installation, maintenance, upgradation, repair, and troubleshooting services; and preventive maintenance programs and repair services. The Dental segment provides hand and powered dental instruments, infection control products, personal protective equipment, and water quality products for dental suite. The company serves its products and services to hospitals, other healthcare providers, and pharmaceutical manufacturers. The company was founded in 1985 and is based in Dublin, Ireland.",
    "ceo": "Mr. Daniel A. Carestio",
    "sector": "Healthcare",
    "country": "IE",
    "fullTimeEmployees": "17000",
    "phone": "353 1 232 2000",
    "address": "70 Sir John Rogerson’s Quay",
    "city": "Dublin",
    "state": null,
    "zip": "D02 R296",
    "dcfDiff": 26.3226,
    "dcf": 179.777,
    "image": "https://financialmodelingprep.com/image-stock/STE.png",
    "ipoDate": "1992-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]