[
  {
    "symbol": "STEP",
    "price": 23.6,
    "beta": 1.378429,
    "volAvg": 296962,
    "mktCap": 2589415647,
    "lastDiv": 1.8,
    "range": "19.83-32.12",
    "changes": -0.03,
    "companyName": "StepStone Group Inc.",
    "currency": "USD",
    "cik": "0001796022",
    "isin": "US85914M1071",
    "cusip": "85914M107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Asset Management",
    "website": "https://www.stepstonegroup.com/",
    "description": "StepStone Group Inc. is an investment firm specializing in direct, fund of funds, secondary direct, and secondary indirect investments. For direct investment, it seeks to invest in venture debt, incubation, mezzanine, distressed/vulture, seed/startup, early venture, mid venture, late venture, emerging growth, later stage, turnaround, growth capital, industry consolidation, recapitalization, and buyout investments in mature and middle market companies. It prefers to invest in natural resources, technology, healthcare, services, materials, manufacturing, consumer durables, apparel, hotels, restaurants and leisure, media, retailing, consumer staples, financials, telecommunication services, energy, infrastructure, real estate, and real asset. The firm invests globally with a focus on United States, North America, Europe, Asia, Latin America, Middle East, Africa, Brazil, Mexico, Argentina, Colombia, New Zealand, China, India, Korea, Japan, Taiwan, and Australia region. It typically invests between $15 million and $200 million in firms with enterprise value between $150 million and $25000 million. The firm invests between 5% and 40% in emerging markets. For fund of fund investment, it seeks to invest in private equity funds, venture capital funds, Special situation funds, Real estate funds, Infrastructure funds, mezzanine funds, and turnaround/distressed funds. It considers investments in both domestic and international funds. It also seeks to make co-investments and follow-on investments and considers partial interests in funds. StepStone Group Inc. was founded in 2007 and is based in New York, New York with additional offices across North America, South America, Europe, Australia, and Asia.",
    "ceo": "Mr. Scott  Hart",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "956",
    "phone": "212 351 6100",
    "address": "450 Lexington Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10017",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/STEP.png",
    "ipoDate": "2020-09-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]