[
  {
    "symbol": "STGW",
    "price": 7.46,
    "beta": 0,
    "volAvg": 801488,
    "mktCap": 3185852755,
    "lastDiv": 3.7366659999999987,
    "range": "4.8-9.23",
    "changes": -0.07,
    "companyName": "Stagwell Inc.",
    "currency": "USD",
    "cik": "0000876883",
    "isin": "US85256A1097",
    "cusip": "85256A109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Advertising Agencies",
    "website": "https://www.stagwellglobal.com",
    "description": "Stagwell Inc. provides digital transformation, performance media and data, consumer insights and strategy, and creativity and communications services. The company operates through three segments: Integrated Agencies Network, Media Network, and Communications Network. It designs and builds digital platforms and experiences that support the delivery of content, commerce, service, and sales; creates websites, mobile applications, back-end systems, content and data management systems, and other digital environments; designs and implements technology and data strategies; and develops software and related technology products, including cookie-less data platforms for audience targeting and activation, software tools for e-commerce applications, and text messaging applications for consumer engagement. The company also provides media buying and planning services; and strategic insights and guidance services that offers business content, product, communications, and media strategies. In addition, it offers strategy development, advertising creation, live events, cross platform engagement, and social media content services; and leadership, social media, executive positioning and visibility, strategic communication, public relation, and public affair services. Further, the company provides influencer marketing, brand insights, communications technology, and augmented reality services for in-house marketers, as well as tech-driven solutions. Stagwell Inc. is headquartered in New York, New York.",
    "ceo": "Mr. Mark J. Penn",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "11100",
    "phone": "646 429 1800",
    "address": "One World Trade Center",
    "city": "New York",
    "state": "NY",
    "zip": "10007",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/STGW.png",
    "ipoDate": "1995-04-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]