[
  {
    "symbol": "STLD",
    "price": 106.97,
    "beta": 1.495774,
    "volAvg": 1709864,
    "mktCap": 18081566980,
    "lastDiv": 1.7,
    "range": "62.44-136.46",
    "changes": 0.24,
    "companyName": "Steel Dynamics, Inc.",
    "currency": "USD",
    "cik": "0001022671",
    "isin": "US8581191009",
    "cusip": "858119100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Steel",
    "website": "https://stld.steeldynamics.com",
    "description": "Steel Dynamics, Inc., together with its subsidiaries, operates as a steel producer and metal recycler in the United States. It operates through three segments: Steel Operations, Metals Recycling Operations, and Steel Fabrication Operations. The Steel Operations segment offers hot roll, cold roll, and coated steel products; parallel flange beams and channel sections, flat bars, large unequal leg angles, and reinforcing bars, as well as standard strength carbon, intermediate alloy hardness, and premium grade rail products; and engineered special-bar-quality products, merchant-bar-quality products, and other engineered round steel bars. The company also engages in turning, polishing, straightening, chamfering, threading, precision saw-cutting, and heat treating of bar products; and cutting to length, straightening, hole punching, shot blasting, welding, galvanizing, and coating of specialty products. Its products are used in construction, automotive, manufacturing, transportation, heavy and agriculture equipment, and pipe and tube markets. This segment sells directly to end-users, steel fabricators, and service centers. The Metals Recycling Operations segment purchases, processes, and resells ferrous and nonferrous scrap metals into reusable forms and grades. Its ferrous products include heavy melting steel, busheling, bundled scrap, shredded scrap, steel turnings, and cast-iron products; and nonferrous products comprise aluminum, brass, copper, stainless steel, and other nonferrous metals. This segment also provides transportation logistics, marketing, brokerage, and scrap management services. The Steel Fabrication Operations segment produces non-residential steel building components, such as steel joists, girders, trusses, and steel deck products. The company also exports its products. Steel Dynamics, Inc. was incorporated in 1993 and is headquartered in Fort Wayne, Indiana.",
    "ceo": "Mr. Mark D. Millett",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "12060",
    "phone": "260 969 3500",
    "address": "7575 West Jefferson Boulevard",
    "city": "Fort Wayne",
    "state": "IN",
    "zip": "46804",
    "dcfDiff": 9.8176,
    "dcf": 109.112,
    "image": "https://financialmodelingprep.com/image-stock/STLD.png",
    "ipoDate": "1996-11-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]