[
  {
    "symbol": "STM",
    "price": 48.23,
    "beta": 1.354789,
    "volAvg": 3499480,
    "mktCap": 43412932676,
    "lastDiv": 0.24,
    "range": "28.35-53.53",
    "changes": 0.19,
    "companyName": "STMicroelectronics N.V.",
    "currency": "USD",
    "cik": "0000932787",
    "isin": "US8610121027",
    "cusip": "861012102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Semiconductors",
    "website": "https://www.st.com",
    "description": "STMicroelectronics N.V., together with its subsidiaries, designs, develops, manufactures, and sells semiconductor products in Europe, the Middle East, Africa, the Americas, and the Asia Pacific. The company operates through Automotive and Discrete Group; Analog, MEMS and Sensors Group; and Microcontrollers and Digital ICs Group segments. The Automotive and Discrete Group segment offers automotive integrated circuits (ICs); and discrete and power transistor products. The Analog, MEMS and Sensors Group segment provides industrial application-specific integrated circuits (ASICs) and application-specific standard products (ASSPs); general purpose analog products; custom analog ICs; wireless charging solutions; galvanic isolated gate drivers; low and high voltage amplifiers, comparators, and current-sense amplifiers; MasterGaN, a solution that integrates a silicon driver and GaN power transistors in a single package; wireline and wireless connectivity ICs; touch screen controllers; micro-electro-mechanical systems (MEMS) products, including sensors or actuators; and optical sensing solutions. The Microcontrollers and Digital ICs Group segment offers general purpose and secure microcontrollers; radio frequency (RF) and electrically erasable programmable read-only memories; and RF, digital, and mixed-signal ASICs. It also provides assembly and other services. The company sells its products through distributors and retailers, as well as through sales representatives. It serves automotive, industrial, personal electronics and communications equipment, and computers and peripherals markets. STMicroelectronics N.V. was incorporated in 1987 and is headquartered in Geneva, Switzerland.",
    "ceo": "Mr. Jean-Marc  Chery",
    "sector": "Technology",
    "country": "CH",
    "fullTimeEmployees": "51370",
    "phone": "41 22 929 2929",
    "address": "39 Chemin du Champ des Filles",
    "city": "Geneva",
    "state": null,
    "zip": null,
    "dcfDiff": 6.47495,
    "dcf": 41.315,
    "image": "https://financialmodelingprep.com/image-stock/STM.png",
    "ipoDate": "1994-12-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]