[
  {
    "symbol": "STT",
    "price": 72.14,
    "beta": 1.582746,
    "volAvg": 2722314,
    "mktCap": 24113444837,
    "lastDiv": 2.52,
    "range": "58.62-94.74",
    "changes": -0.45,
    "companyName": "State Street Corporation",
    "currency": "USD",
    "cik": "0000093751",
    "isin": "US8574771031",
    "cusip": "857477103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Asset Management",
    "website": "https://www.statestreet.com",
    "description": "State Street Corporation, through its subsidiaries, provides a range of financial products and services to institutional investors worldwide. The company offers investment servicing products and services, including custody; product accounting; daily pricing and administration; master trust and master custody; depotbank services; record-keeping; cash management; foreign exchange, brokerage and other trading services; securities finance and enhanced custody products; deposit and short-term investment facilities; loans and lease financing; investment manager and alternative investment manager operations outsourcing; performance, risk, and compliance analytics; and financial data management to support institutional investors. It also engages in the provision of portfolio management and risk analytics, as well as trading and post-trade settlement services with integrated compliance and managed data. In addition, the company offers investment management strategies and products, such as core and enhanced indexing, multi-asset strategies, active quantitative and fundamental active capabilities, and alternative investment strategies. Further, it provides services and solutions, including environmental, social, and governance investing; defined benefit and defined contribution; and global fiduciary solutions, as well as exchange-traded fund under the SPDR ETF brand. The company provides its products and services to mutual funds, collective investment funds and other investment pools, corporate and public retirement plans, insurance companies, foundations, endowments, and investment managers. State Street Corporation was founded in 1792 and is headquartered in Boston, Massachusetts.",
    "ceo": "Mr. Ronald Philip O'Hanley",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "42786",
    "phone": "617 786 3000",
    "address": "State Street Financial Center",
    "city": "Boston",
    "state": "MA",
    "zip": "02111",
    "dcfDiff": 281.967,
    "dcf": 372.697,
    "image": "https://financialmodelingprep.com/image-stock/STT.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]