[
  {
    "symbol": "STWD",
    "price": 19.46,
    "beta": 1.62007,
    "volAvg": 3531282,
    "mktCap": 6263978738,
    "lastDiv": 1.92,
    "range": "16.06-24.44",
    "changes": 0.24,
    "companyName": "Starwood Property Trust, Inc.",
    "currency": "USD",
    "cik": "0001465128",
    "isin": "US85571B1052",
    "cusip": "85571B105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "REIT—Mortgage",
    "website": "https://www.starwoodpropertytrust.com",
    "description": "Starwood Property Trust, Inc. operates as a real estate investment trust (REIT) in the United States, Europe, and Australia. It operates through four segments: Commercial and Residential Lending, Infrastructure Lending, Property, and Investing and Servicing segments. The Commercial and Residential Lending segment originates, acquires, finances, and manages commercial first mortgages, non-agency residential mortgages, subordinated mortgages, mezzanine loans, preferred equity, commercial mortgage-backed securities (CMBS), and residential mortgage-backed securities, as well as other real estate and real estate-related debt investments, including distressed or non-performing loans. The Infrastructure lending segment originates, acquires, finances, and manages infrastructure debt investments. The Property segment engages primarily in acquiring and managing equity interests in stabilized commercial real estate properties, such as multifamily properties and commercial properties subject to net leases, that are held for investment. The Investing and Servicing segment manages and works out problem assets; acquires and manages unrated, investment grade, and non-investment grade rated CMBS comprising subordinated interests of securitization and re-securitization transactions; originates conduit loans for the primary purpose of selling these loans into securitization transactions; and acquires commercial real estate assets that include properties acquired from CMBS trusts. The company qualifies as a REIT for federal income tax purposes and would not be subject to federal corporate income taxes, if it distributes at least 90% of its taxable income to its stockholders. Starwood Property Trust, Inc. was incorporated in 2009 and is headquartered in Greenwich, Connecticut.",
    "ceo": "Mr. Barry Stuart Sternlicht",
    "sector": "Real Estate",
    "country": "US",
    "fullTimeEmployees": "290",
    "phone": "203 422 7700",
    "address": "591 West Putnam Avenue",
    "city": "Greenwich",
    "state": "CT",
    "zip": "06830",
    "dcfDiff": 0.879469,
    "dcf": 21.5695,
    "image": "https://financialmodelingprep.com/image-stock/STWD.png",
    "ipoDate": "2009-08-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]