[
  {
    "symbol": "SU",
    "price": 29.03,
    "beta": 1.665223,
    "volAvg": 4625411,
    "mktCap": 38019140893,
    "lastDiv": 1.55,
    "range": "26.43-37.45",
    "changes": 0.19,
    "companyName": "Suncor Energy Inc.",
    "currency": "USD",
    "cik": "0000311337",
    "isin": "CA8672241079",
    "cusip": "867224107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.suncor.com",
    "description": "Suncor Energy Inc. operates as an integrated energy company. The company primarily focuses on developing petroleum resource basins in Canada's Athabasca oil sands; explores, acquires, develops, produces, transports, refines, and markets crude oil in Canada and internationally; markets petroleum and petrochemical products under the Petro-Canada name primarily in Canada. It operates through Oil Sands; Exploration and Production; Refining and Marketing; and Corporate and Eliminations segments. The Oil Sands segment recovers bitumen from mining and in situ operations, and upgrades it into refinery feedstock and diesel fuel, or blends the bitumen with diluent for direct sale to market. The Exploration and Production segment is involved in offshore operations off the east coast of Canada and in the North Sea; and operating onshore assets in Libya and Syria. The Refining and Marketing segment refines crude oil and intermediate feedstock into various petroleum and petrochemical products; and markets refined petroleum products to retail, commercial, and industrial customers through its other retail sellers. The Corporate and Eliminations segment operates four wind farms in Ontario and Western Canada. The company also markets and trades in crude oil, natural gas, byproducts, refined products, and power. The company was formerly known as Suncor Inc. and changed its name to Suncor Energy Inc. in April 1997. Suncor Energy Inc. was founded in 1917 and is headquartered in Calgary, Canada.",
    "ceo": "Mr. Richard M. Kruger",
    "sector": "Energy",
    "country": "CA",
    "fullTimeEmployees": "16558",
    "phone": "14032968000",
    "address": "150 – 6th Avenue S.W",
    "city": "Calgary",
    "state": "AB",
    "zip": "T2P 3E3",
    "dcfDiff": 2.00495,
    "dcf": 36.625,
    "image": "https://financialmodelingprep.com/image-stock/SU.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]