[
  {
    "symbol": "SUBCY",
    "price": 10.65,
    "beta": 1.531417,
    "volAvg": 6722,
    "mktCap": 3197044800,
    "lastDiv": 0.38,
    "range": "7.06-14.27",
    "changes": 0.27,
    "companyName": "Subsea 7 S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US8643231009",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Oil & Gas Equipment & Services",
    "website": "https://www.subsea7.com",
    "description": "Subsea 7 S.A. delivers offshore projects and services for the evolving energy industry worldwide. It provides subsea field development products and services, including project management, design and engineering, procurement, fabrication, survey, installation, and commissioning of production facilities on the seabed and the tie-back of its facilities to fixed or floating platforms or to the shore. The company also offers engineering, procurement, commissioning, and installation of subsea umbilicals, risers, and flowlines; inspection, repair, maintenance, remote intervention, and integrity management of subsea infrastructure services; conventional services comprising fabrication, installation, extension, and refurbishment of fixed and floating platforms and associated pipelines in shallow water; and hook-up services. In addition, it operates heavy lifting operations and heavy transportation services for renewables structures; and installs offshore wind turbine foundations and inter-array cables, as well as engages in the decommissioning of redundant offshore structures. Further, the company provides remotely operated vehicles (ROVs) and tooling services to support exploration and production activities, as well as engineering and advisory services for customers in the oil and gas, renewables, and utilities industries. As of December 31, 2021, it has a fleet of 38 vessels. Subsea 7 S.A. was incorporated in 1993 and is based in Luxembourg.",
    "ceo": "Mr. John  Evans",
    "sector": "Energy",
    "country": "LU",
    "fullTimeEmployees": "13437",
    "phone": null,
    "address": "Route d'Esch",
    "city": "Luxembourg City",
    "state": null,
    "zip": "2086",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SUBCY.png",
    "ipoDate": "1998-06-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]