[
  {
    "symbol": "SUN",
    "price": 43.52,
    "beta": 1.324647,
    "volAvg": 156237,
    "mktCap": 3658321838,
    "lastDiv": 3.37,
    "range": "34.62-48.59",
    "changes": 0.24,
    "companyName": "Sunoco LP",
    "currency": "USD",
    "cik": "0001552275",
    "isin": "US86765K1097",
    "cusip": "86765K109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Refining & Marketing",
    "website": "https://www.sunocolp.com",
    "description": "Sunoco LP, together with its subsidiaries, distributes and retails motor fuels in the United States. It operates in two segments, Fuel Distribution and Marketing, and All Other. The Fuel Distribution and Marketing segment purchases motor fuel from independent refiners and oil companies and supplies it to independently operated dealer stations, distributors and other consumer of motor fuel, and partnership operated stations, as well as to commission agent locations. The All Other segment operates retail stores that offer motor fuel, merchandise, foodservice, and other services that include credit card processing, car washes, lottery, automated teller machines, money orders, prepaid phone cards, and wireless services. It also leases and subleases real estate properties; and operates terminal facilities on the Hawaiian Islands. As of December 31, 2021, the company operated 78 retail stores in Hawaii and New Jersey. Sunoco GP LLC serves as the general partner of the company. The company was formerly known as Susser Petroleum Partners LP and changed its name to Sunoco LP in October 2014. Sunoco LP was founded in 1886 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Joseph  Kim",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "2302",
    "phone": "214 981 0700",
    "address": "8111 Westchester Drive",
    "city": "Dallas",
    "state": "TX",
    "zip": "75225",
    "dcfDiff": 4.24393,
    "dcf": 43.1461,
    "image": "https://financialmodelingprep.com/image-stock/SUN.png",
    "ipoDate": "2012-09-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]