[
  {
    "symbol": "SURVF",
    "price": 0.9395,
    "beta": 0.599616,
    "volAvg": 1798,
    "mktCap": 2712035920,
    "lastDiv": 0.06,
    "range": "0.9395-1.22",
    "changes": -0.0105,
    "companyName": "Suntec Real Estate Investment Trust",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "REIT—Diversified",
    "website": "https://www.suntecreit.com",
    "description": "Listed on 9 December 2004, Suntec REIT holds properties in Suntec City, Singapore's largest integrated commercial development (including one of Singapore's largest shopping Mall), a 66.3% interest in Suntec Singapore Convention & Exhibition Centre, a one-third interest in One Raffles Quay, a one-third interest in Marina Bay Financial Centre Towers 1 and 2 and the Marina Bay Link Mall, and a 30.0% interest in 9 Penang Road. Suntec REIT holds a 100% interest in a commercial building located at 177 Pacific Highway, Sydney, a 100% interest in a commercial building located at 21 Harris Street, Pyrmont, Sydney, a 50.0% interest in Southgate Complex, Melbourne, a 50.0% interest in a commercial building located at Olderfleet 477 Collins Street, Melbourne and a 100% interest in a commercial building located at 55 Currie Street, Adelaide, Australia. Suntec REIT also holds a 50.0% interest in Nova Properties located in London, United Kingdom. Its aim is to invest in income-producing real estate which is primarily used for office and/or retail purposes. Suntec REIT is managed by an external manager, ARA Trust Management (Suntec) Limited.",
    "ceo": "Mr. Kee Hiong  Chong",
    "sector": "Real Estate",
    "country": "SG",
    "fullTimeEmployees": null,
    "phone": "65 6835 9232",
    "address": "5 Temasek Boulevard",
    "city": "Singapore",
    "state": null,
    "zip": "038985",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SURVF.png",
    "ipoDate": "2010-06-09",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": true
  }
]