[
  {
    "symbol": "SUZ",
    "price": 9.06,
    "beta": 0.690753,
    "volAvg": 1542679,
    "mktCap": 11759608635,
    "lastDiv": 0.48,
    "range": "7.46-11.09",
    "changes": -0.28,
    "companyName": "Suzano S.A.",
    "currency": "USD",
    "cik": "0000909327",
    "isin": "US86959K1051",
    "cusip": "86959K105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Paper & Paper Products",
    "website": "https://www.suzano.com.br",
    "description": "Suzano S.A. produces and sells eucalyptus pulp and paper products in Brazil and internationally. It operates through Pulp and Paper segments. The company offers coated and uncoated printing and writing papers, paperboards, tissue papers, and market and fluff pulps; and lignin and its byproducts. It also engages in the research, development, and production of biofuel; operation of port terminals; power generation and distribution business; commercialization of equipment and parts; biotechnology research and development; and commercialization of paper and computer materials. In addition, the company is involved in the business office, production packaging, and financial fundraising activities; research, development, production, commercialization, and distribution of wood-based textile fibers, yarns, and filaments produced from cellulose and microfibrillated cellulose; and research and development of wood raw materials for the textile industry. Suzano S.A. was formerly known as Suzano Papel e Celulose S.A. and changed its name to Suzano S.A. in April 2019. The company was founded in 1924 and is headquartered in Salvador, Brazil.",
    "ceo": "Mr. Walter  Schalka",
    "sector": "Basic Materials",
    "country": "BR",
    "fullTimeEmployees": "35000",
    "phone": "55 11 3503 9000",
    "address": "Av. Professor MagalhAes Neto, 1,752",
    "city": "Salvador",
    "state": "BA",
    "zip": "41810-012",
    "dcfDiff": 11.683,
    "dcf": 20.563,
    "image": "https://financialmodelingprep.com/image-stock/SUZ.png",
    "ipoDate": "2008-11-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]