[
  {
    "symbol": "SVNDY",
    "price": 21.54,
    "beta": 0.2659,
    "volAvg": 55711,
    "mktCap": 38049334034,
    "lastDiv": 0.41,
    "range": "17.59-24.19",
    "changes": 0.32,
    "companyName": "Seven & i Holdings Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US81783H1059",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Grocery Stores",
    "website": "https://www.7andi.com",
    "description": "Seven & i Holdings Co., Ltd. engages in retail, food, financial, and IT businesses in Japan, North America, and internationally. It operates through seven segments: Domestic Convenience Store operations, Overseas Convenience Store Operations, Superstore Operations, Department Store Operations, Financial Services, Specialty Stores Operations, and Others. The company's Domestic Convenience Store Operations segment operates convenience stores comprising directly managed corporate stores and franchised stores. Its Overseas Convenience Store Operations segment engages in convenience store operation and gasoline retail businesses. The company's Superstore Operations segment operates retail business that provide daily life necessities, such as food and other daily necessities. Its Department Store Operations operates department stores that provide various merchandise products. The company's Financial Services segment offers banking, leasing, and credit card services. Its Specialty Store Operations segment operates specialty retail stores. The company's others segment engages in real estate and other businesses. It operates approximately 22,500 stores in Japan and 71,800 stores internationally. The company was incorporated in 2005 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Ryuichi  Isaka",
    "sector": "Consumer Defensive",
    "country": "JP",
    "fullTimeEmployees": "84154",
    "phone": "81 3 6238 3000",
    "address": "8-8, Nibancho",
    "city": "Tokyo",
    "state": null,
    "zip": "102-8452",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SVNDY.png",
    "ipoDate": "2009-03-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]