[
  {
    "symbol": "SVNLY",
    "price": 4.09,
    "beta": 0.624521,
    "volAvg": 383967,
    "mktCap": 16196645007,
    "lastDiv": 0.38,
    "range": "3.87-5.34",
    "changes": -0.03,
    "companyName": "Svenska Handelsbanken AB (publ)",
    "currency": "USD",
    "cik": null,
    "isin": "US86959C1036",
    "cusip": "86959C103",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Diversified",
    "website": "https://www.handelsbanken.se",
    "description": "Svenska Handelsbanken AB (publ) provides various banking products and services for private and corporate customers primarily in Sweden, the United Kingdom, Norway, the Netherlands, the United States, Luxembourg, China, Germany, France, and Poland. The company offers savings, transactions, business, currency, and investment accounts, as well as accounts for cash pool, and forestry and agriculture; mortgage and committed loans, and private loans; mutual funds; pension products; credit and debit cards; and payment and reconciliation services. It also provides financing for investments, such as equipment, cars, computers, and other inventories, as well as vehicle and real estate financing services; green loans and advisor services; investment and other financing services; medical care, group and health, and travel insurance products; forestry and farming banking products; and online and mobile banking services. In addition, the company offers transaction, trade finance, cash management, risk management, and foreign exchange services, as well as various banking services for children and young people. It operates approximately 214 branches in Sweden, 196 in the Great Britain, 41 in Norway, 42 in Denmark, 27 in Finland, and 28 in the Netherlands. Svenska Handelsbanken AB (publ) was incorporated in 1871 and is headquartered in Stockholm, Sweden.",
    "ceo": "Mr. Carl  Cederschiold",
    "sector": "Financial Services",
    "country": "SE",
    "fullTimeEmployees": "11331",
    "phone": "46 87 01 10 00",
    "address": "Kungsträdgårdsgatan 2",
    "city": "Stockholm",
    "state": null,
    "zip": "106 70",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SVNLY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]