[
  {
    "symbol": "SWK",
    "price": 92.12,
    "beta": 1.308802,
    "volAvg": 1588462,
    "mktCap": 14107533897,
    "lastDiv": 3.2,
    "range": "70.24-118.37",
    "changes": -0.59,
    "companyName": "Stanley Black & Decker, Inc.",
    "currency": "USD",
    "cik": "0000093556",
    "isin": "US8545021011",
    "cusip": "854502101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Tools & Accessories",
    "website": "https://www.stanleyblackanddecker.com",
    "description": "Stanley Black & Decker, Inc. engages in the tools and storage and industrial businesses in the United States, Canada, rest of Americas, France, rest of Europe, and Asia. Its Tools & Storage segment offers professional products, including professional grade corded and cordless electric power tools and equipment, and pneumatic tools and fasteners; and consumer products, such as corded and cordless electric power tools primarily under the BLACK+DECKER brand, as well as corded and cordless lawn and garden products and related accessories; home products; and hand tools, power tool accessories, and storage products. This segment sells its products through retailers, distributors, dealers, and a direct sales force to professional end users, distributors, dealers, retail consumers, and industrial customers in various industries. The company's Industrial segment provides engineered fastening systems and products to customers in the automotive, manufacturing, electronics, construction, aerospace, and other industries; sells and rents custom pipe handling, joint welding, and coating equipment for use in the construction of large and small diameter pipelines, as well as provides pipeline inspection services; and sells hydraulic tools and performance-driven heavy equipment attachment tools. This segment serves oil and natural gas pipeline industry and other industrial customers. It also sells automatic doors to commercial customers. The company was formerly known as The Stanley Works and changed its name to Stanley Black & Decker, Inc. in March 2010. Stanley Black & Decker, Inc. was founded in 1843 and is headquartered in New Britain, Connecticut.",
    "ceo": "Mr. Donald  Allan Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "54200",
    "phone": "860-225-5111",
    "address": "1000 Stanley Drive",
    "city": "New Britain",
    "state": "CT",
    "zip": "06053",
    "dcfDiff": 4.487,
    "dcf": 81.673,
    "image": "https://financialmodelingprep.com/image-stock/SWK.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]