[
  {
    "symbol": "SWKS",
    "price": 108.15,
    "beta": 1.266901,
    "volAvg": 1870943,
    "mktCap": 17212614115,
    "lastDiv": 2.48,
    "range": "76.16-123.69",
    "changes": 0.03,
    "companyName": "Skyworks Solutions, Inc.",
    "currency": "USD",
    "cik": "0000004127",
    "isin": "US83088M1027",
    "cusip": "83088M102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.skyworksinc.com",
    "description": "Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products, including intellectual property in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, automotive tuners and digital radios, circulators/isolators, DC/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers/optoisolators, phase locked loops, phase shifters, power dividers/combiners, receivers, switches, synthesizers, timing devices, technical ceramics, voltage controlled oscillators/synthesizers, and voltage regulators. The company provides its products for use in the aerospace, automotive, broadband, cellular infrastructure, connected home, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. The company was incorporated in 1962 and is headquartered in Irvine, California.",
    "ceo": "Mr. Liam K. Griffin",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "11150",
    "phone": "949 231 3000",
    "address": "5260 California Avenue",
    "city": "Irvine",
    "state": "CA",
    "zip": "92617",
    "dcfDiff": 13.7932,
    "dcf": 97.3668,
    "image": "https://financialmodelingprep.com/image-stock/SWKS.png",
    "ipoDate": "1984-09-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]