[
  {
    "symbol": "SWRAY",
    "price": 7.63,
    "beta": 0.836398,
    "volAvg": 48609,
    "mktCap": 28834991288,
    "lastDiv": 0.38,
    "range": "5.38-9.4",
    "changes": 0.54,
    "companyName": "Swire Pacific Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US8707943028",
    "cusip": "870794302",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Conglomerates",
    "website": "https://www.swirepacific.com",
    "description": "Swire Pacific Limited engages in property, aviation, beverages, marine, and trading and industrial businesses in Hong Kong, Mainland China, rest of Asia, the United States, and internationally. The company's Property division develops, owns, and operates mixed-use properties. This division's property investment portfolio comprises office and retail premises, serviced apartments, other luxury residential accommodations, and commercial mixed-use developments; and trading portfolio consists of residential properties. It also owns and manages two hotels in Hong Kong and four hotels in Mainland China, as well as owns interests in the Mandarin Oriental hotel in the United States. The company's Aviation division provides flight catering and ramp, passenger and cargo services, and aircraft maintenance and modification services. As of December 31, 2021, it had a fleet of 234 aircraft. Its Beverages division owns rights to manufacture, market, and distribute refreshing soft drinks to consumers. The company's Trading & Industrial division retails and distributes footwear, apparel, and accessories through its 164 retail outlets; sells passenger cars, commercial vehicles, motorcycles, and scooters; operates a chain of 538 bakery stores; packages and sells sugar products under the Taikoo Sugar brand; and offers waste management services. The company was founded in 1816 and is based in Central, Hong Kong.",
    "ceo": "Mr. Guy Martin Coutts  Bradley",
    "sector": "Industrials",
    "country": "HK",
    "fullTimeEmployees": "80000",
    "phone": "852 2840 8888",
    "address": "One Pacific Place",
    "city": "Central",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SWRAY.png",
    "ipoDate": "1999-04-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]