[
  {
    "symbol": "SXT",
    "price": 69.62,
    "beta": 0.890492,
    "volAvg": 132403,
    "mktCap": 2941055128,
    "lastDiv": 1.64,
    "range": "63.17-89.34",
    "changes": -0.29,
    "companyName": "Sensient Technologies Corporation",
    "currency": "USD",
    "cik": "0000310142",
    "isin": "US81725T1007",
    "cusip": "81725T100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.sensient.com",
    "description": "Sensient Technologies Corporation, together with its subsidiaries, develops, manufactures, and markets colors, flavors, and other specialty ingredients in North America, Europe, the Asia Pacific, and internationally. It operates through three segments: Flavors & Extracts Group, Color Group, and Asia Pacific Group. The company offers flavor-delivery systems, and compounded and blended products; ingredient products, such as essential oils, natural and synthetic flavors, and natural extracts; and chili powder, paprika, and chili pepper, as well as dehydrated vegetables comprising parsley, celery, and spinach to the food, beverage, personal care, and household-products industries. It also provides natural and synthetic color systems for use in foods, beverages, pharmaceuticals, and nutraceuticals; colors and other ingredients for cosmetics, such as active ingredients, solubilizers, and surface treated pigments; pharmaceutical and nutraceutical excipients, including colors, flavors, coatings, and nutraceutical ingredients; and technical colors for industrial applications under the Sensient Food Colors, Sensient Pharmaceutical Coating Systems, Sensient Cosmetic Technologies, and Sensient Industrial Colors trade names. The company was incorporated in 1882 and is headquartered in Milwaukee, Wisconsin.",
    "ceo": "Mr. Paul  Manning",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "4094",
    "phone": "414 271 6755",
    "address": "777 East Wisconsin Avenue",
    "city": "Milwaukee",
    "state": "WI",
    "zip": "53202-5304",
    "dcfDiff": 0.887849,
    "dcf": 73.4278,
    "image": "https://financialmodelingprep.com/image-stock/SXT.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]