[
  {
    "symbol": "SYF",
    "price": 33.85,
    "beta": 1.573239,
    "volAvg": 6068530,
    "mktCap": 14507128621,
    "lastDiv": 0.92,
    "range": "26.59-40.885",
    "changes": 0.48,
    "companyName": "Synchrony Financial",
    "currency": "USD",
    "cik": "0001601712",
    "isin": "US87165B1035",
    "cusip": "87165B103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Credit Services",
    "website": "https://www.synchrony.com",
    "description": "Synchrony Financial, together with its subsidiaries, operates as a consumer financial services company in the United States. It provides credit products, such as credit cards, commercial credit products, and consumer installment loans. The company also offers private label credit cards, dual cards, co-brand and general purpose credit cards, short- and long-term installment loans, and consumer banking products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts to retail and commercial customers, as well as accepts deposits through third-party securities brokerage firms. In addition, it provides debt cancellation products to its credit card customers through online, mobile, and direct mail; healthcare payments and financing solutions under the CareCredit, Pets Best, and Walgreens brands; payments and financing solutions in the apparel, specialty retail, outdoor, music, and luxury industries; and point-of-sale consumer financing for audiology products and dental services. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. It serves digital, health and wellness, retail, home, auto, powersports, jewelry, pets, and other industries. Synchrony Financial was founded in 1932 and is headquartered in Stamford, Connecticut.",
    "ceo": "Mr. Brian D. Doubles",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "18500",
    "phone": "203 585 2400",
    "address": "777 Long Ridge Road",
    "city": "Stamford",
    "state": "CT",
    "zip": "06902",
    "dcfDiff": 13.3514,
    "dcf": 50.4114,
    "image": "https://financialmodelingprep.com/image-stock/SYF.png",
    "ipoDate": "2014-07-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]