[
  {
    "symbol": "SYIEY",
    "price": 25.64,
    "beta": 0.534482,
    "volAvg": 97458,
    "mktCap": 14335016320,
    "lastDiv": 0.28,
    "range": "22.2-30.4",
    "changes": 0.09,
    "companyName": "Symrise AG",
    "currency": "USD",
    "cik": null,
    "isin": "US87155N1090",
    "cusip": "87155N109",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Chemicals",
    "website": "https://www.symrise.com",
    "description": "Symrise AG supplies fragrances, flavorings, cosmetic active ingredients and raw materials, and functional ingredients. It operates through two segments, Taste, Nutrition & Health, and Scent & Care. The Taste, Nutrition & Health segment provides functional ingredients and flavor solutions used in the production of food and beverages; savory flavors; natural and sustainable ingredients for food and beverage manufacturers, baby food, and dietary supplements; product solutions and services for pet food manufacturers; sustainable ingredients and services for aqua feed manufacturers to develop solutions for fish and shrimp farms; and probiotics for food supplements and functional foods. The Scent & Care segment develops, produces, and sells fragrance ingredients and compositions, aroma molecules, cosmetic ingredients, and mint flavors, as well as specific application processes for such substances. This segment's products are used by manufacturers of perfumes, personal care and cosmetic products, cleaning products, detergents, air fresheners, and oral care products. It operates in Europe, Africa, the Middle East, North America, the Asia Pacific, and Latin America. Symrise AG was founded in 1874 and is headquartered in Holzminden, Germany.",
    "ceo": "Dr. Heinz-Jurgen  Bertram Ph.D.",
    "sector": "Basic Materials",
    "country": "DE",
    "fullTimeEmployees": "12169",
    "phone": "49 55 31 90 0",
    "address": "MUehlenfeldstrasse 1",
    "city": "Holzminden",
    "state": null,
    "zip": "37603",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/SYIEY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]