[
  {
    "symbol": "SYK",
    "price": 300.28,
    "beta": 0.95,
    "volAvg": 1306256,
    "mktCap": 113988690240,
    "lastDiv": 3,
    "range": "188.84-306.56",
    "changes": 1.53,
    "companyName": "Stryker Corporation",
    "currency": "USD",
    "cik": "0000310764",
    "isin": "US8636671013",
    "cusip": "863667101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.stryker.com",
    "description": "Stryker Corporation operates as a medical technology company. The company operates through two segments, MedSurg and Neurotechnology, and Orthopaedics and Spine. The Orthopaedics and Spine segment provides implants for use in hip and knee joint replacements, and trauma and extremities surgeries. This segment also offers spinal implant products comprising cervical, thoracolumbar, and interbody systems that are used in spinal injury, deformity, and degenerative therapies. The MedSurg and Neurotechnology segment offers surgical equipment and surgical navigation systems, endoscopic and communications systems, patient handling, emergency medical equipment and intensive care disposable products, reprocessed and remanufactured medical devices, and other medical device products that are used in various medical specialties. This segment also provides neurotechnology products, which include products used for minimally invasive endovascular techniques; products for brain and open skull based surgical procedures; orthobiologic and biosurgery products, such as synthetic bone grafts and vertebral augmentation products; minimally invasive products for the treatment of acute ischemic and hemorrhagic stroke; and craniomaxillofacial implant products, including cranial, maxillofacial, and chest wall devices, as well as dural substitutes and sealants. The company sells its products to doctors, hospitals, and other healthcare facilities through company-owned subsidiaries and branches, as well as third-party dealers and distributors in approximately 75 countries. Stryker Corporation was founded in 1941 and is headquartered in Kalamazoo, Michigan.",
    "ceo": "Mr. Kevin A. Lobo",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "51000",
    "phone": "269 385 2600",
    "address": "2825 Airview Boulevard",
    "city": "Kalamazoo",
    "state": "MI",
    "zip": "49002",
    "dcfDiff": 21.7787,
    "dcf": 232.391,
    "image": "https://financialmodelingprep.com/image-stock/SYK.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]