[
  {
    "symbol": "SYNA",
    "price": 84.14,
    "beta": 1.555985,
    "volAvg": 635795,
    "mktCap": 3325540946,
    "lastDiv": 0,
    "range": "67.73-149.96",
    "changes": -1.42,
    "companyName": "Synaptics Incorporated",
    "currency": "USD",
    "cik": "0000817720",
    "isin": "US87157D1090",
    "cusip": "87157D109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.synaptics.com",
    "description": "Synaptics Incorporated develops, markets, and sells semiconductor product solutions worldwide. The company offers AudioSmart for voice and audio processing; ConnectSmart for high-speed video/audio/data connectivity; DisplayLink for transmitting compressed video frames across low bandwidth connections; VideoSmart that enables set-top boxes or over-the-top, streaming devices, soundbars, surveillance cameras, and smart displays; and ImagingSmart solutions. It also provides Natural ID, a fingerprint ID product that is used in automobiles, notebook personal computers (PCs), PC peripherals, and other applications; TouchPad, a touch-sensitive pad that senses the position and movement of one or more fingers on its surface; SecurePad that integrates fingerprint sensor directly into the TouchPad area; ClickPad that offers a clickable mechanical design; and ForcePad. In addition, the company offers ClearPad, which enables users to interact directly with the display on mobile smartphones, tablets, and automobiles; ClearView products that provide advanced image processing and low power technology for displays on smartphones and tablets; and TouchView products, a touch controller and display driver integration product. Further, it provides TouchPad with a pointing stick in a single notebook computer enabling users to select their interface of choice; TouchStyk, a self-contained pointing stick module; ultra-low power edge artificial intelligence platform for battery powered wireless devices; wireless connectivity solutions comprising Wi-Fi, Bluetooth, global positioning system, global navigation satellite system, and ULE; and voice over IP and digital enhanced cordless telecommunications solutions. The company sells its products through direct sales, outside sales representatives, distributors, and resellers to mobile and PC OEMs; IoT OEMs; and automotive and consumer electronics manufacturers. The company was incorporated in 1986 and is headquartered in San Jose, California.",
    "ceo": "Mr. Michael E.  Hurlston",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1775",
    "phone": "408 904 1100",
    "address": "1109 McKay Drive",
    "city": "San Jose",
    "state": "CA",
    "zip": "95131",
    "dcfDiff": 4.33449,
    "dcf": 121.126,
    "image": "https://financialmodelingprep.com/image-stock/SYNA.png",
    "ipoDate": "2002-01-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]