[
  {
    "symbol": "SYNH",
    "price": 42.19,
    "beta": 1.611971,
    "volAvg": 2635045,
    "mktCap": 4372866930,
    "lastDiv": 0,
    "range": "22.894-79.77",
    "changes": 0.31,
    "companyName": "Syneos Health, Inc.",
    "currency": "USD",
    "cik": "0001610950",
    "isin": "US87166B1026",
    "cusip": "87166B102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Diagnostics & Research",
    "website": "https://www.syneoshealth.com",
    "description": "Syneos Health, Inc. provides biopharmaceutical outsourcing solutions company in North America, Europe, the Middle East, Africa, the Asia-Pacific, and Latin America. It operates through two segments, Clinical Solutions and Commercial Solutions. The Clinical Solutions segment offers services for the development of diagnostics, drugs, biologics, devices, and digital therapeutics in the Phase I to IV of clinical development. This segment also provides individual services, including product development and regulatory consulting, project management, protocol development, investigational site recruitment, clinical monitoring, technology-enabled patient recruitment and engagement, clinical home health, clinical trial diversity, biometric, and regulatory affair services. The Commercial Solutions segment provides commercialization services, including deployment solutions, communications solutions, such as public relations, advertising, and medical communication services; and consulting services to the pharmaceutical, biotechnology, and healthcare industries. The company was formerly known as INC Research Holdings, Inc. and changed its name to Syneos Health, Inc. in January 2018. Syneos Health, Inc. was incorporated in 2010 and is headquartered in Morrisville, North Carolina.",
    "ceo": "Ms. Michelle  Keefe",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "28768",
    "phone": "919 876 9300",
    "address": "1030 Sync Street",
    "city": "Morrisville",
    "state": "NC",
    "zip": "27560-5468",
    "dcfDiff": 1.90042,
    "dcf": 34.1896,
    "image": "https://financialmodelingprep.com/image-stock/SYNH.png",
    "ipoDate": "2014-11-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]