[
  {
    "symbol": "SYY",
    "price": 72.87,
    "beta": 1.099295,
    "volAvg": 2478648,
    "mktCap": 36989103480,
    "lastDiv": 2,
    "range": "69.22-88.84",
    "changes": -0.51,
    "companyName": "Sysco Corporation",
    "currency": "USD",
    "cik": "0000096021",
    "isin": "US8718291078",
    "cusip": "871829107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Food Distribution",
    "website": "https://www.sysco.com",
    "description": "Sysco Corporation, through its subsidiaries, engages in the marketing and distribution of various food and related products primarily to the foodservice or food-away-from-home industry in the United States, Canada, the United Kingdom, France, and internationally. It operates through U.S. Foodservice Operations, International Foodservice Operations, SYGMA, and Other segments. The company distributes frozen foods, such as meats, seafood, fully prepared entrées, fruits, vegetables, and desserts; canned and dry foods; fresh meats and seafood; dairy products; beverage products; imported specialties; and fresh produce. It also supplies various non-food items, including paper products comprising disposable napkins, plates, and cups; tableware consisting of China and silverware; cookware, which include pots, pans, and utensils; restaurant and kitchen equipment and supplies; and cleaning supplies. The company serves restaurants, hospitals and nursing homes, schools and colleges, hotels and motels, industrial caterers, and other foodservice venues. As of August 27, 2021, it operated 343 distribution facilities. Sysco Corporation was incorporated in 1969 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Kevin P. Hourican",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "71000",
    "phone": "281 584 1390",
    "address": "1390 Enclave Parkway",
    "city": "Houston",
    "state": "TX",
    "zip": "77077-2099",
    "dcfDiff": 13.1955,
    "dcf": 91.0855,
    "image": "https://financialmodelingprep.com/image-stock/SYY.png",
    "ipoDate": "1973-05-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]