[
  {
    "symbol": "T",
    "price": 15.78,
    "beta": 0.770774,
    "volAvg": 39012761,
    "mktCap": 112811223030,
    "lastDiv": 1.11,
    "range": "14.46-21.53",
    "changes": -0.06,
    "companyName": "AT&T Inc.",
    "currency": "USD",
    "cik": "0000732717",
    "isin": "US00206R1023",
    "cusip": "00206R102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.att.com",
    "description": "AT&T Inc. provides telecommunications, media, and technology services worldwide. Its Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, and carrying cases and hands-free devices through its own company-owned stores, agents, and third-party retail stores. It also provides data, voice, security, cloud solutions, outsourcing, and managed and professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband fiber and legacy telephony voice communication services to residential customers. It markets its communications services and products under the AT&T, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The company's Latin America segment provides wireless services in Mexico; and video services in Latin America. This segment markets its services and products under the AT&T and Unefon brand names. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. John T. Stankey",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "157790",
    "phone": "210 821 4105",
    "address": "208 South Akard Street",
    "city": "Dallas",
    "state": "TX",
    "zip": "75202",
    "dcfDiff": 1.8371,
    "dcf": 21.7871,
    "image": "https://financialmodelingprep.com/image-stock/T.png",
    "ipoDate": "1983-11-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]