[
  {
    "symbol": "TAK",
    "price": 15.7,
    "beta": 0.677011,
    "volAvg": 2084795,
    "mktCap": 49010060493,
    "lastDiv": 0.66,
    "range": "12.28-17.15",
    "changes": 0.13,
    "companyName": "Takeda Pharmaceutical Company Limited",
    "currency": "USD",
    "cik": "0001395064",
    "isin": "US8740602052",
    "cusip": "874060205",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.takeda.com",
    "description": "Takeda Pharmaceutical Company Limited engages in the research, development, manufacture, marketing, and out-licensing of pharmaceutical products in Japan, the United States, Europe, Canada, Latin America, Russia, rest of Asia, and internationally. It offers pharmaceutical products in the areas of gastroenterology, rare diseases, plasma derived therapies, oncology, and neuroscience. The company provides its products under the Entyvio, Gattex/Revestive, Takecab, Alofisel, Dexilant, Natpara, Adynovate/Adynovi, Takhzyro, Livtencity, Elaprase, Replagal, Advate, Vpriv, Gammagard Liquid/Kiovig, Hyqvia, Cuvitru, Exkivity, Velcade, Leuplin/Enantone, Adcetris, Vyvansese, Trintellix, and Alunbrig brands. Takeda Pharmaceutical Company Limited has out-licensing agreement with Neurocrine Biosciences, Inc.; collaborations and in-licensing agreements with the University of Texas MD Anderson Cancer Center, Arrowhead Pharmaceuticals Inc., and Ovid Therapeutics Inc.; and collaboration with Evox Therapeutics Ltd., as well as a licensing agreement with ProThera Biologics Inc. It also has research collaboration and licensing agreement with Crescendo Biologics, Code Bio, Immusoft, Poseida Therapeutics, Selecta Biosciences, BridGene Biosciences, Skyhawk Therapeutics, and StrideBio; and strategic alliances with Egle Therapeutics SAS; Evotec SE; Neurocrine Biosciences, Inc.; Carmine Therapeutics; KSQ Therapeutics; and Anima Biotech. Takeda Pharmaceutical Company Limited was founded in 1781 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Christophe  Weber",
    "sector": "Healthcare",
    "country": "JP",
    "fullTimeEmployees": "47347",
    "phone": "81 3 3278 2111",
    "address": "1-1, Nihonbashi-Honcho 2-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "103-8668",
    "dcfDiff": 305.062,
    "dcf": 321.092,
    "image": "https://financialmodelingprep.com/image-stock/TAK.png",
    "ipoDate": "2010-01-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]