[
  {
    "symbol": "TCBI",
    "price": 51.18,
    "beta": 1.28345,
    "volAvg": 488330,
    "mktCap": 2449971246,
    "lastDiv": 0,
    "range": "42.79-69.27",
    "changes": 0.12,
    "companyName": "Texas Capital Bancshares, Inc.",
    "currency": "USD",
    "cik": "0001077428",
    "isin": "US88224Q1076",
    "cusip": "88224Q107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.texascapitalbank.com",
    "description": "Texas Capital Bancshares, Inc. operates as the bank holding company for Texas Capital Bank, is a full-service financial services firm that delivers customized solutions to businesses, entrepreneurs, and individual customers. The company offers commercial banking, consumer banking, investment banking, and wealth management services. It offers business deposit products and services, including commercial checking accounts, lockbox accounts, and cash concentration accounts, as well as information, wire transfer initiation, ACH initiation, account transfer, and service integration services; and consumer deposit products, such as checking accounts, savings accounts, money market accounts, and certificates of deposit. The company also provides commercial loans for general corporate purposes comprising financing working capital, internal growth, acquisitions, and business insurance premiums, as well as consumer loans; loans to exploration and production companies; mortgage finance loans; commercial real estate and residential homebuilder finance loans; first and second lien loans for the purpose of purchasing or constructing 1-4 family residential dwellings, as well as home equity revolving lines of credit and loans to purchase lots for future construction of 1-4 family residential dwellings; and real estate loans originated through a small business administration program, as well as equipment finance and leasing services, and letters of credit. In addition, it offers online and mobile banking, and debit and credit card services; escrow services; personal wealth management and trust services; and depositors American Airlines AAdvantage miles. It operates in Austin, Fort Worth, Dallas, Houston, and San Antonio metropolitan areas of Texas. Texas Capital Bancshares, Inc. was incorporated in 1996 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Robert C. Holmes",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2198",
    "phone": "214 932 6600",
    "address": "2000 McKinney Avenue",
    "city": "Dallas",
    "state": "TX",
    "zip": "75201",
    "dcfDiff": 150.591,
    "dcf": 213.901,
    "image": "https://financialmodelingprep.com/image-stock/TCBI.png",
    "ipoDate": "2003-08-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]