[
  {
    "symbol": "TCOM",
    "price": 34.92,
    "beta": 0.528169,
    "volAvg": 4878840,
    "mktCap": 22563558559,
    "lastDiv": 0.11575,
    "range": "19.25-40.17",
    "changes": 0.04,
    "companyName": "Trip.com Group Limited",
    "currency": "USD",
    "cik": "0001269238",
    "isin": "US89677Q1076",
    "cusip": "89677Q107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Travel Services",
    "website": "https://group.trip.com",
    "description": "Trip.com Group Limited operates as a travel service provider for accommodation reservation, transportation ticketing, packaged tours and in-destination, corporate travel management, and other travel-related services in China and internationally. The company acts as an agent for hotel-related transactions and selling air tickets, as well as provides train, long-distance bus, and ferry tickets; travel insurance products, such as flight delay, air accident, and baggage loss coverage; and air-ticket delivery, online check-in and seat selection, express security screening, real-time flight status tracker, and airport VIP lounge services. It also provides independent leisure travelers bundled packaged-tour products comprising group, semi-group, and customized and packaged tours with various transportation arrangements, such as air, cruise, bus, and car rental services. In addition, the company offers integrated transportation and accommodation services; destination transportation and ticket, activity, insurance, visa, and tour guide services; user support, supplier management, and customer relationship management services; and in-destination products and services. Further, it provides its corporate clients with business visit, incentive trip, meeting and conference, travel data collection and analysis, industry benchmark, cost saving analysis, and travel management solutions; and Corporate Travel Management System, an online platform that integrates information management, online booking and authorization, online enquiry, and travel reporting systems. Additionally, the company offers online advertising and financial services. It operates under the Ctrip, Qunar, Trip.com, and Skyscanner brands. The company was formerly known as Ctrip.com International, Ltd. and changed its name to Trip.com Group Limited in October 2019. Trip.com Group Limited was founded in 1999 and is headquartered in Shanghai, the People's Republic of China.",
    "ceo": "Ms. Jie  Sun",
    "sector": "Consumer Cyclical",
    "country": "CN",
    "fullTimeEmployees": "32202",
    "phone": "86 21 3406 4880",
    "address": "968 Jin Zhong Road",
    "city": "Shanghai",
    "state": null,
    "zip": "200335",
    "dcfDiff": 23.3644,
    "dcf": 62.7744,
    "image": "https://financialmodelingprep.com/image-stock/TCOM.png",
    "ipoDate": "2003-12-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]