[
  {
    "symbol": "TD",
    "price": 60.75,
    "beta": 0.843674,
    "volAvg": 2330958,
    "mktCap": 111756913056,
    "lastDiv": 2.84,
    "range": "55.43-70.67",
    "changes": -0.01,
    "companyName": "The Toronto-Dominion Bank",
    "currency": "USD",
    "cik": "0000947263",
    "isin": "CA8911605092",
    "cusip": "891160509",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.td.com",
    "description": "The Toronto-Dominion Bank, together with its subsidiaries, provides various financial products and services in Canada, the United States, and internationally. It operates through three segments: Canadian Retail, U.S. Retail, and Wholesale Banking. The company offers personal deposits, such as chequing, savings, and investment products; financing, investment, cash management, international trade, and day-to-day banking services to businesses; and financing options to customers at point of sale for automotive and recreational vehicle purchases. It also provides credit cards and payments; real estate secured lending, auto finance, and consumer lending services; point-of-sale payment solutions for large and small businesses; wealth and asset management products, and advice to retail and institutional clients through direct investing, advice-based, and asset management businesses; and property and casualty insurance, as well as life and health insurance products. The company also provides capital markets, and corporate and investment banking products and services, including underwriting and distribution of new debt and equity issues; advice on strategic acquisitions and divestitures; and trading, funding, and investment services to corporations, governments, and institutions. It offers its products and services under the TD Bank and America's Most Convenient Bank brand names. The company operates through a network of 1,061 branches and 3,381 automated teller machines (ATMs) in Canada, and 1,148 stores and 2,701 ATMs in the United States, as well as offers telephone, digital, and mobile banking services. It has a strategic alliance with Canada Post Corporation. The Toronto-Dominion Bank was founded in 1855 and is headquartered in Toronto, Canada.",
    "ceo": "Mr. Bharat B. Masrani",
    "sector": "Financial Services",
    "country": "CA",
    "fullTimeEmployees": "101394",
    "phone": "14169446367",
    "address": "PO Box 1",
    "city": "Toronto",
    "state": "ON",
    "zip": "M5K 1A2",
    "dcfDiff": 89.21,
    "dcf": 157.88,
    "image": "https://financialmodelingprep.com/image-stock/TD.png",
    "ipoDate": "1996-08-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]