[
  {
    "symbol": "TDC",
    "price": 52.32,
    "beta": 0.919718,
    "volAvg": 855325,
    "mktCap": 5289552000,
    "lastDiv": 0,
    "range": "28.65-52.675",
    "changes": 0.81,
    "companyName": "Teradata Corporation",
    "currency": "USD",
    "cik": "0000816761",
    "isin": "US88076W1036",
    "cusip": "88076W103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.teradata.com",
    "description": "Teradata Corporation, together with its subsidiaries, provides a connected multi-cloud data platform for enterprise analytics. The company offers Teradata Vantage, a data platform that allows companies to leverage their data across an enterprise, as well as connects various sources of data to drive ecosystem simplification and support customers on their journey to the cloud through an integrated migration. Its business consulting services include support services for organizations to establish a data and analytic vision, and identify and operationalize analytical opportunities, as well as enable a multi-cloud ecosystem architecture and ensure the analytical infrastructure delivers value. In addition, it offers support and maintenance services. The company serves clients in financial services, government, healthcare, manufacturing, retail, telecommunications, and travel/transportation sectors through a direct sales force in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. Teradata Corporation was incorporated in 1979 and is headquartered in San Diego, California.",
    "ceo": "Mr. Stephen  McMillan",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "7000",
    "phone": "866 548 8348",
    "address": "17095 Via Del Campo",
    "city": "San Diego",
    "state": "CA",
    "zip": "92127",
    "dcfDiff": 2.54466,
    "dcf": 37.3047,
    "image": "https://financialmodelingprep.com/image-stock/TDC.png",
    "ipoDate": "2007-10-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]