[
  {
    "symbol": "TDG",
    "price": 875.42,
    "beta": 1.379225,
    "volAvg": 259725,
    "mktCap": 48085332386,
    "lastDiv": 18.5,
    "range": "499.63-883.71",
    "changes": 1.68,
    "companyName": "TransDigm Group Incorporated",
    "currency": "USD",
    "cik": "0001260221",
    "isin": "US8936411003",
    "cusip": "893641100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.transdigm.com",
    "description": "TransDigm Group Incorporated designs, produces, and supplies aircraft components in the United States and internationally. Its Power & Control segment offers mechanical/electro-mechanical actuators and controls, ignition systems and engine technology, specialized pumps and valves, power conditioning devices, specialized AC/DC electric motors and generators, batteries and chargers, databus and power controls, sensor products, switches and relay panels, hoists, winches and lifting devices, and cargo loading and handling systems. This segment serves engine and power system and subsystem suppliers, airlines, third party maintenance suppliers, military buying agencies, and repair depots. The company's Airframe segment provides engineered latching and locking devices, engineered rods, engineered connectors and elastomer sealing solutions, cockpit security components and systems, cockpit displays, engineered audio, radio and antenna systems, lavatory components, seat belts and safety restraints, engineered and customized interior surfaces and related components, thermal protection and insulation products, lighting and control technology, and parachutes. This segment serves airframe manufacturers, cabin system and subsystem suppliers, airlines, third party maintenance suppliers, military buying agencies, and repair depots. Its Non-aviation segment offers seat belts and safety restraints for ground transportation applications; electro-mechanical actuators for space applications; hydraulic/electromechanical actuators and fuel valves for land-based gas turbines; refueling systems for heavy equipment used in mining, construction, and other industries; and turbine controls for the energy and oil and gas markets. This segment serves off-road vehicle and subsystem suppliers, child restraint system suppliers, and satellite and space system suppliers; and manufacturers of heavy equipment. TransDigm Group Incorporated was founded in 1993 and is based in Cleveland, Ohio.",
    "ceo": "Dr. Kevin M. Stein Ph.D.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "14400",
    "phone": "216 706 2960",
    "address": "The Tower at Erieview",
    "city": "Cleveland",
    "state": "OH",
    "zip": "44114",
    "dcfDiff": 12.3308,
    "dcf": 698.359,
    "image": "https://financialmodelingprep.com/image-stock/TDG.png",
    "ipoDate": "2006-03-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]