[
  {
    "symbol": "TDOC",
    "price": 25.29,
    "beta": 1.07007,
    "volAvg": 3689317,
    "mktCap": 4139239792,
    "lastDiv": 0,
    "range": "21.6-44.66",
    "changes": 0.93,
    "companyName": "Teladoc Health, Inc.",
    "currency": "USD",
    "cik": "0001477449",
    "isin": "US87918A1051",
    "cusip": "87918A105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Health Information Services",
    "website": "https://www.teladochealth.com",
    "description": "Teladoc Health, Inc. provides virtual healthcare services in the United States and internationally. The company offers a portfolio of services and solutions covering non-urgent, episodic, chronic, and complicated medical conditions, including diabetes, hypertension, chronic kidney disease, cancer, congestive heart failure, and mental health conditions. It offers a range of programs and services, including primary and specialty care telehealth solutions, chronic condition management, expert medical services, mental health solutions, and platform and program services. The company serves employers, health plans, hospitals and health systems, and insurance and financial services companies, as well as individual members. It offers its products and services under the Teladoc, Livongo, and BetterHelp brands. The company was formerly known as Teladoc, Inc. and changed its name to Teladoc Health, Inc. in August 2018. The company was incorporated in 2002 and is headquartered in Purchase, New York.",
    "ceo": "Mr. Jason Nathanial Gorevic",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "4816",
    "phone": "203 635 2002",
    "address": "2 Manhattanville Road",
    "city": "Purchase",
    "state": "NY",
    "zip": "10577",
    "dcfDiff": 8.3017,
    "dcf": 37.7717,
    "image": "https://financialmodelingprep.com/image-stock/TDOC.png",
    "ipoDate": "2015-06-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]