[
  {
    "symbol": "TDW",
    "price": 47.89,
    "beta": 1.368309,
    "volAvg": 651938,
    "mktCap": 2435905694,
    "lastDiv": 529.8587169999996,
    "range": "17.51-51.88",
    "changes": 0.55,
    "companyName": "Tidewater Inc.",
    "currency": "USD",
    "cik": "0000098222",
    "isin": "US88642R1095",
    "cusip": "88642R109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Equipment & Services",
    "website": "https://www.tdw.com",
    "description": "Tidewater Inc., together with its subsidiaries, provides offshore marine support and transportation services to the offshore energy industry through the operation of a fleet of marine service vessels worldwide. It provides services in support of offshore oil and natural gas exploration, field development, and production, as well as windfarm development and maintenance, including towing of and anchor handling for mobile offshore drilling units; transporting supplies and personnel necessary to sustain drilling, workover, and production activities; offshore construction, and seismic and subsea support; geotechnical survey support for windfarm construction; and various specialized services, such as pipe and cable laying. The company operates and charters deepwater vessels, including platform supply and horsepower anchor handling tug supply vessels for use in transporting supplies and equipment from shore bases to deepwater and intermediate water depth offshore drilling rigs and production platforms; towing-supply vessels for use in intermediate and shallow waters; and crew boats, utility vessels, and offshore tugs to transport personnel and supplies from shore bases to offshore drilling rigs, platforms, and other installations. It also operates offshore tugs for use in tow floating drilling rigs and barges; and assisting in the docking of tankers, as well as in pipe and cable laying, and construction barges. The company serves oil and natural gas exploration, field development, and production companies; mid-sized and smaller independent exploration and production companies; foreign government-owned or government-controlled organizations, and other related companies; drilling contractors; and other companies, such as offshore construction, windfarm development, diving, and well stimulation companies. As of December 31, 2021, it owned 135 vessels. Tidewater Inc. was incorporated in 1956 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Quintin V. Kneen",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "6300",
    "phone": "713 470 5300",
    "address": "842 West Sam Houston Parkway North",
    "city": "Houston",
    "state": "TX",
    "zip": "77024",
    "dcfDiff": 9.76575,
    "dcf": 33.4842,
    "image": "https://financialmodelingprep.com/image-stock/TDW.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]