[
  {
    "symbol": "TEAM",
    "price": 166.89,
    "beta": 0.804577,
    "volAvg": 2024541,
    "mktCap": 42891901735,
    "lastDiv": 0,
    "range": "113.855-300.29",
    "changes": 5.01,
    "companyName": "Atlassian Corporation Plc",
    "currency": "USD",
    "cik": "0001650372",
    "isin": "GB00BZ09BD16",
    "cusip": "G06242104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.atlassian.com",
    "description": "Atlassian Corporation Plc, through its subsidiaries, designs, develops, licenses, and maintains various software products worldwide. Its products include Jira Software and Jira Work Management, a workflow management system for teams to plan, track, collaborate, and manage work, and projects; Jira Service Management, a service desk product for creating and managing service experiences for various service team providers, including IT, legal, and HR teams; Jira Align for enterprise organizations to build and manage a master plan that maps strategic projects to the various work streams required to deliver them; and Opsgenie, an incident management tool that enables IT teams to plan for and respond to service disruptions. The company also provides Confluence, a social and flexible content collaboration platform used to create, share, organize, and discuss projects; and Trello, a collaboration and organization product that captures and adds structure to fluid, fast-forming work for teams. In addition, it offers Bitbucket, a code management and collaboration product for teams using distributed version control systems; Atlassian Access, an enterprise-wide product for enhanced security and centralized administration that works across every Atlassian cloud product used, including Jira, Jira Service Management, Confluence, Trello, and Bitbucket; and various other products, such as Atlassian cloud apps, Bamboo, Crowd, Crucible, Fisheye, Halp, Sourcetree, and Statuspage. Atlassian Corporation Plc was founded in 2002 and is headquartered in Sydney, Australia.",
    "ceo": "Mr. Michael  Cannon-Brookes",
    "sector": "Technology",
    "country": "AU",
    "fullTimeEmployees": "8813",
    "phone": "61 2 9262 1443",
    "address": "341 George Street",
    "city": "Sydney",
    "state": "NSW",
    "zip": "2000",
    "dcfDiff": 43.0084,
    "dcf": 121.242,
    "image": "https://financialmodelingprep.com/image-stock/TEAM.png",
    "ipoDate": "2015-12-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]