[
  {
    "symbol": "TEF",
    "price": 3.96,
    "beta": 0.693103,
    "volAvg": 1059135,
    "mktCap": 22771821220,
    "lastDiv": 0.32,
    "range": "3.1-5.15",
    "changes": 0.01,
    "companyName": "Telefónica, S.A.",
    "currency": "USD",
    "cik": "0000814052",
    "isin": "US8793822086",
    "cusip": "879382208",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services - Foreign",
    "website": "https://www.telefonica.com",
    "description": "Telefónica, S.A., together with its subsidiaries, provides telecommunications services in Europe and Latin America. The company's mobile and related services and products comprise mobile voice, value added, mobile data and Internet, wholesale, corporate, roaming, fixed wireless, and trunking and paging services. Its fixed telecommunication services include PSTN lines; ISDN accesses; public telephone services; local, domestic, and international long-distance and fixed-to-mobile communications; corporate communications; supplementary value-added services; video telephony; intelligent network; and telephony information services, as well as leases and sells handset equipment. The company also provides Internet and broadband multimedia services comprising Internet service provider, portal and network, retail and wholesale broadband access, narrowband switched access, high-speed Internet through fibre to the home, and voice over Internet protocol services. In addition, it offers leased line, virtual private network, fibre optics, web hosting and application, outsourcing and consultancy, desktop, and system integration and professional services. Further, the company offers wholesale services for telecommunication operators, including domestic interconnection and international wholesale services; leased lines for other operators; and local loop leasing services, as well as bit stream services, wholesale line rental accesses, and leased ducts for other operators' fiber deployment. Additionally, it provides video/TV services; smart connectivity and services, and consumer IoT products; financial and other payment, security, cloud computing, advertising, big data, and digital telco experience services; virtual assistants; digital home platforms; and Movistar Home devices. It also offers online telemedicine, home insurance, music streaming, and consumer loan services. The company was incorporated in 1924 and is headquartered in Madrid, Spain.",
    "ceo": "Mr. Jose María  Alvarez-Pallete Lopez",
    "sector": "Technology",
    "country": "ES",
    "fullTimeEmployees": "103651",
    "phone": "34 900 11 10 04",
    "address": "Distrito Telefónica",
    "city": "Madrid",
    "state": null,
    "zip": "28050",
    "dcfDiff": 1.40827,
    "dcf": 5.24827,
    "image": "https://financialmodelingprep.com/image-stock/TEF.png",
    "ipoDate": "1987-06-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]