[
  {
    "symbol": "TEL",
    "price": 137.08,
    "beta": 1.314436,
    "volAvg": 1429008,
    "mktCap": 43195965297,
    "lastDiv": 2.36,
    "range": "104.76-138.24",
    "changes": 0.35,
    "companyName": "TE Connectivity Ltd.",
    "currency": "USD",
    "cik": "0001385157",
    "isin": "CH0102993182",
    "cusip": "H84989104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electronic Components",
    "website": "https://www.te.com",
    "description": "TE Connectivity Ltd., together with its subsidiaries, manufactures and sells connectivity and sensor solutions in Europe, the Middle East, Africa, the AsiaPacific, and the Americas. The company operates through three segments: Transportation Solutions, Industrial Solutions, and Communications Solutions. The Transportation Solutions segment provides terminals and connector systems and components, sensors, relays, antennas, heat shrink tubing, and application tooling products for use in the automotive, commercial transportation, and sensor markets. The Industrial Solutions segment offers terminals and connector systems and components; and heat shrink tubing, interventional medical components, relays, and wires and cables for aerospace, defense, oil and gas, industrial equipment, medical, and energy markets. The Communications Solutions segment supplies electronic components, such as terminals and connector systems and components, relays, heat shrink tubing, and antennas for the data and devices, and appliances markets. TE Connectivity Ltd. sells its products to approximately 140 countries primarily through direct sales to manufacturers, as well as through third-party distributors. The company was formerly known as Tyco Electronics Ltd. and changed its name to TE Connectivity Ltd. in March 2011. TE Connectivity Ltd. was incorporated in 2000 and is based in Schaffhausen, Switzerland.",
    "ceo": "Mr. Terrence R. Curtin CPA",
    "sector": "Technology",
    "country": "CH",
    "fullTimeEmployees": "92000",
    "phone": "41 52 633 66 61",
    "address": "MUehlenstrasse 26",
    "city": "Schaffhausen",
    "state": null,
    "zip": "8200",
    "dcfDiff": 2.95261,
    "dcf": 128.303,
    "image": "https://financialmodelingprep.com/image-stock/TEL.png",
    "ipoDate": "2007-06-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]