[
  {
    "symbol": "TEX",
    "price": 58.74,
    "beta": 1.62007,
    "volAvg": 932511,
    "mktCap": 3982572000,
    "lastDiv": 0.6,
    "range": "26.64-60.85",
    "changes": 0.01,
    "companyName": "Terex Corporation",
    "currency": "USD",
    "cik": "0000097216",
    "isin": "US8807791038",
    "cusip": "880779103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Farm & Heavy Construction Machinery",
    "website": "https://www.terex.com",
    "description": "Terex Corporation manufactures and sells aerial work platforms and materials processing machinery worldwide. It operates in two segments, Aerial Work Platforms (AWP) and Materials Processing (MP). The AWP segment designs, manufactures, services, and markets aerial work platform equipment, utility equipment, and telehandlers under the Terex and Genie brands. Its products include portable material lifts, portable aerial work platforms, trailer-mounted articulating booms, self-propelled articulating and telescopic booms, scissor lifts, utility equipment, and telehandlers, as well as related components and replacement parts for construction and maintenance of industrial, commercial, institutional, and residential buildings and facilities, utility and telecommunication lines, construction and foundation drilling applications, and other commercial operations, as well as in tree trimming and various infrastructure projects. The MP segment's materials processing and specialty equipment includes crushers, washing systems, screens, trommels, apron feeders, material handlers, pick and carry cranes, rough terrain cranes, tower cranes, wood processing, biomass and recycling equipment, concrete mixer trucks and concrete pavers, conveyors, and related components and replacement parts under the Terex, Powerscreen, Fuchs, EvoQuip, Canica, Cedarapids, CBI, Simplicity, Franna, Terex Ecotec, Finlay, Terex Washing Systems, Terex MPS, Terex Jaques, Terex Advance, ProStack, Terex Bid-Well, MDS, and Terex Recycling Systems brands and business lines. Its products are used in construction, infrastructure, and recycling projects; quarrying and mining, and material handling applications; maintenance applications to lift equipment or material; and landscaping and biomass production industries. The company offers financing solutions to assist customers in the rental, leasing, and acquisition of its products. Terex Corporation was incorporated in 1986 and is based in Norwalk, Connecticut.",
    "ceo": "Mr. John L. Garrison Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "9300",
    "phone": "203 222 7170",
    "address": "45 Glover Avenue",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06850",
    "dcfDiff": 1.59258,
    "dcf": 48.7174,
    "image": "https://financialmodelingprep.com/image-stock/TEX.png",
    "ipoDate": "1980-03-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]