[
  {
    "symbol": "TFC",
    "price": 30.47,
    "beta": 1.053521,
    "volAvg": 13726716,
    "mktCap": 40583602400,
    "lastDiv": 2.08,
    "range": "25.56-52.22",
    "changes": -0.02,
    "companyName": "Truist Financial Corporation",
    "currency": "USD",
    "cik": "0000092230",
    "isin": "US89832Q1094",
    "cusip": "89832Q109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.truist.com",
    "description": "Truist Financial Corporation, a holding company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings. Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; bankcard lending; consumer finance; home equity and mortgage lending; insurance, such as property and casualty, life, health, employee benefits, workers compensation and professional liability, surety coverage, title, and other insurance products; investment brokerage; mobile/online banking; and payment, lease financing, small business lending, and wealth management/private banking services. In addition, it offers association, capital market, institutional trust, insurance premium and commercial finance, international banking, leasing, merchant, commercial deposit and treasury, government finance, commercial middle market lending, small business and student lending, floor plan and commercial mortgage lending, mortgage warehouse lending, private equity investment, real estate lending, and supply chain financing services. Further, the company provides corporate and investment banking, retail and wholesale brokerage, securities underwriting, and investment advisory services. As of December 31, 2021, the company operated through 2,517 banking offices. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.",
    "ceo": "Mr. William Henry Rogers Jr.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "53653",
    "phone": "336 733 2000",
    "address": "214 North Tryon Street",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28202",
    "dcfDiff": 12.2316,
    "dcf": 61.0716,
    "image": "https://financialmodelingprep.com/image-stock/TFC.png",
    "ipoDate": "1980-03-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]