[
  {
    "symbol": "TFII",
    "price": 114.55,
    "beta": 1.429533,
    "volAvg": 244725,
    "mktCap": 9939640960,
    "lastDiv": 1.4,
    "range": "76.05-128.93",
    "changes": -0.55,
    "companyName": "TFI International Inc.",
    "currency": "USD",
    "cik": "0001588823",
    "isin": "CA87241L1094",
    "cusip": "87241L109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Trucking",
    "website": "https://www.tfiintl.com",
    "description": "TFI International Inc. provides transportation and logistics services in the United States, Canada, and Mexico. The company operates through Package and Courier, Less-Than-Truckload (LTL), Truckload (TL), and Logistics segments. The Package and Courier segment engages in the pickup, transport, and delivery of items. The LTL segment is involved in the pickup, consolidation, transportation, and delivery of smaller loads. The TL segment offers expedited transportation, flatbed, tank container, and dedicated services, as well as TL brokerage services. This segment carries full loads directly from the customer to the destination using a closed van or specialized equipment. The Logistics segment provides asset-light logistics services, including brokerage, freight forwarding, and transportation management, as well as small package parcel delivery. As of December 31, 2021, the company had 13,384 tractors, 50,091 trailers, and 9,428 independent contractors. The company was formerly known as TransForce Inc. and changed its name to TFI International Inc. in December 2016. TFI International Inc. is headquartered in Saint-Laurent, Canada.",
    "ceo": "Mr. Alain  Bedard CMA, F.C.A., FCA, FCPA",
    "sector": "Industrials",
    "country": "CA",
    "fullTimeEmployees": "24956",
    "phone": "15143314000",
    "address": "8801 Trans-Canada Highway",
    "city": "Saint-Laurent",
    "state": "QC",
    "zip": "H4S 1Z6",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TFII.png",
    "ipoDate": "2005-11-15",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]