[
  {
    "symbol": "TGLS",
    "price": 51.01,
    "beta": 1.741197,
    "volAvg": 499511,
    "mktCap": 2431850740,
    "lastDiv": 0.36,
    "range": "16.47-51.9799",
    "changes": 0.2,
    "companyName": "Tecnoglass Inc.",
    "currency": "USD",
    "cik": "0001534675",
    "isin": "KYG872641009",
    "cusip": "G87264100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Materials",
    "website": "https://www.tecnoglass.com",
    "description": "Tecnoglass Inc., through its subsidiaries, designs, produces, markets, and installs architectural systems for the commercial and residential construction industries in Colombia, the United States, Panama, and internationally. The company offers low emissivity, laminated/thermo-laminated, thermo-acoustic, tempered, silk-screened, curved, and digital print glass products. It also provides aluminum products, including bars, plates, profiles, rods, and tubes that are used in the manufacture of architectural glass settings, such as windows, doors, spatial separators, and related products. In addition, the company offers curtain wall/floating facades, windows and doors, interior dividers and commercial display windows, hurricane-proof windows, and stick facade systems; and other products comprising awnings, structures, automatic doors, and other components of architectural systems. It markets and sells its products primarily under the Tecnoglass, ESWindows, and Alutions brands through internal and independent sales representatives, as wells as directly to distributors. The company was founded in 1984 and is headquartered in Barranquilla, Colombia. Tecnoglass Inc. is a subsidiary of Energy Holding Corporation.",
    "ceo": "Mr. José Manuel  Daes",
    "sector": "Basic Materials",
    "country": "CO",
    "fullTimeEmployees": "8770",
    "phone": "57 605 373 4000",
    "address": "Avenida Circunvalar",
    "city": "Barranquilla",
    "state": null,
    "zip": null,
    "dcfDiff": 3.2278,
    "dcf": 30.5322,
    "image": "https://financialmodelingprep.com/image-stock/TGLS.png",
    "ipoDate": "2012-05-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]