[
  {
    "symbol": "TGNA",
    "price": 15.97,
    "beta": 0.613028,
    "volAvg": 1761541,
    "mktCap": 3593697160,
    "lastDiv": 0.46,
    "range": "15.09-22.29",
    "changes": 0.16,
    "companyName": "TEGNA Inc.",
    "currency": "USD",
    "cik": "0000039899",
    "isin": "US87901J1051",
    "cusip": "87901J105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Broadcasting",
    "website": "https://www.tegna.com",
    "description": "TEGNA Inc. operates as a media company in the United States. The company operates television stations that deliver television programming and digital content. It offers news content to consumers across various platforms, including online, mobile, and social platforms; owns and operates multicast networks under the names True Crime Network, Quest, and Twist that offer on-demand episodes of shows; and operates VAULT Studios, which provides true crime and investigative content in the form of podcasts and original television programs. The company also provides solutions for advertisers through TEGNA Marketing Solutions (TMS). TMS delivers results for advertisers across television and digital platforms, as well as over-the-top (OTT) platforms, including Premion OTT advertising network. As of February 28, 2022, it operated 64 television stations in 51 markets. The company was formerly known as Gannett Co., Inc. and changed its name to TEGNA Inc. in June 2015. TEGNA Inc. was founded in 1906 and is headquartered in Tysons, Virginia.",
    "ceo": "Mr. David T. Lougee",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "6300",
    "phone": "703 873 6600",
    "address": "8350 Broad Street",
    "city": "Tysons",
    "state": "VA",
    "zip": "22102-5151",
    "dcfDiff": 0.394256,
    "dcf": 20.0343,
    "image": "https://financialmodelingprep.com/image-stock/TGNA.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]