[
  {
    "symbol": "TGS",
    "price": 13.04,
    "beta": 0.933561,
    "volAvg": 183129,
    "mktCap": 3976026609,
    "lastDiv": 11.194,
    "range": "4.58-14.06",
    "changes": -0.11,
    "companyName": "Transportadora de Gas del Sur S.A.",
    "currency": "USD",
    "cik": "0000931427",
    "isin": "US8938702045",
    "cusip": "893870204",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.tgs.com.ar",
    "description": "Transportadora de Gas del Sur S.A. engages in transportation of natural gas, production, and commercialization of natural gas liquids in Argentina. The company operates through four segments: Natural Gas Transportation Services; Liquids Production and Commercialization; Other Services; and Telecommunications. The Natural Gas Transportation segment transports natural gas through 5,769 miles of pipeline system to distribution companies, power plants, and industrial customers. It also provides operation and maintenance services for the natural gas transportation facilities. The company's Liquids Production and Commercialization segment produces and commercializes natural gas liquids, such as ethane, liquid petroleum gas, natural gasoline, propane, and butane in Argentina and internationally. Its Other Services segment offers midstream services, including natural gas treatment, separation, and removal of impurities from the natural gas stream, as well as natural gas compression. It also provides services related to pipeline and compression plant construction, operation, and maintenance; and generates steam for electricity production. The Telecommunications segment provides telecommunication services with a network that includes a microwave digital network with synchronous digital hierarchy technology and a dark fiber optic network. As of December 31, 2021, it served 6.2 million residential, commercial, industrial, and electric power generation end users. The company was founded in 1992 and is headquartered in Buenos Aires, Argentina. Transportadora de Gas del Sur S.A. is a subsidiary of Compañía de Inversiones de Energía S.A.",
    "ceo": "Mr. Oscar  José Sardi",
    "sector": "Energy",
    "country": "AR",
    "fullTimeEmployees": "1095",
    "phone": "54 11 4865 9077",
    "address": "Don Bosco 3672",
    "city": "Buenos Aires",
    "state": null,
    "zip": "1206",
    "dcfDiff": 26.5562,
    "dcf": 37.6262,
    "image": "https://financialmodelingprep.com/image-stock/TGS.png",
    "ipoDate": "1994-11-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]