[
  {
    "symbol": "TGTX",
    "price": 24.02,
    "beta": 2.09014,
    "volAvg": 4249853,
    "mktCap": 3588491920,
    "lastDiv": 0,
    "range": "3.97-35.67",
    "changes": 1.19,
    "companyName": "TG Therapeutics, Inc.",
    "currency": "USD",
    "cik": "0001001316",
    "isin": "US88322Q1085",
    "cusip": "88322Q108",
    "exchange": "NASDAQ Capital Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.tgtherapeutics.com",
    "description": "TG Therapeutics, Inc., a commercial stage biopharmaceutical company, focuses on the acquisition, development, and commercialization of novel treatments for B-cell malignancies and autoimmune diseases. Its therapeutic product candidates include Ublituximab, an investigational glycoengineered monoclonal antibody for the treatment of B-cell non-hodgkin lymphoma, chronic lymphocytic leukemia (CLL), and relapsing forms of multiple sclerosis; and Umbralisib, an oral inhibitor of PI3K-delta and CK1-epsilon for the treatment of CLL, marginal zone lymphoma, and follicular lymphoma. The company also develops Cosibelimab, a human monoclonal antibody of IgG1 subtype that binds to programmed death-ligand 1 (PD-L1) and blocks its interactions with PD-1 and B7.1 receptors; TG-1701 is an orally available and covalently-bound Bruton's tyrosine kinase (BTK) inhibitor that exhibits selectivity to BTK compared to ibrutinib in in vitro kinase screening; and TG-1801, a bispecific CD47 and CD19 antibody. In addition, it has various licensed preclinical programs for BET, interleukin-1 receptor associated kinase-4, and GITR; and collaboration agreements with Checkpoint Therapeutics, Inc., Jiangsu Hengrui Medicine Co., Novimmune SA, Ligand Pharmaceuticals Incorporated, and Jubilant Biosys. The company has strategic alliances with LFB Biotechnologies S.A.S; GTC Biotherapeutics; LFB/GTC LLC; Ildong Pharmaceutical Co. Ltd.; and Rhizen Pharmaceuticals, S A. TG Therapeutics, Inc. was incorporated in 1993 and is headquartered in New York, New York.",
    "ceo": "Mr. Michael S. Weiss Esq.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "237",
    "phone": "212 554 4484",
    "address": "2 Gansevoort Street",
    "city": "New York",
    "state": "NY",
    "zip": "10014",
    "dcfDiff": 4.67735,
    "dcf": 9.95265,
    "image": "https://financialmodelingprep.com/image-stock/TGTX.png",
    "ipoDate": "2010-05-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]