[
  {
    "symbol": "THC",
    "price": 79.75,
    "beta": 2.149647,
    "volAvg": 1428416,
    "mktCap": 8129316250,
    "lastDiv": 12.606671000000002,
    "range": "36.69-85.4",
    "changes": 0.41,
    "companyName": "Tenet Healthcare Corporation",
    "currency": "USD",
    "cik": "0000070318",
    "isin": "US88033G4073",
    "cusip": "88033G407",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Care Facilities",
    "website": "https://www.tenethealth.com",
    "description": "Tenet Healthcare Corporation operates as a diversified healthcare services company. The company operates in three segments: Hospital Operations and Other, Ambulatory Care, and Conifer. Its general hospitals offer acute care services, operating and recovery rooms, radiology and respiratory therapy services, clinical laboratories, and pharmacies. The company also provides intensive and critical care, and coronary care units; cardiovascular, digestive disease, neurosciences, musculoskeletal, and obstetrics services; outpatient services, including physical therapy; cardiothoracic surgery, complex spinal surgery, neonatal intensive care, and neurosurgery services; quaternary care services in heart and kidney transplants; and limb-salvaging vascular procedure, acute level 1 trauma, intravascular stroke care, minimally invasive cardiac valve replacement, imaging, and telemedicine access services. In addition, it operates ambulatory surgery and urgent care centers, imaging centers, surgical hospitals, off-campus emergency departments, and micro-hospitals; and offers healthcare business process services in the areas of hospital and physician revenue cycle management, patient communications and engagement support, and value-based care solutions to hospitals, health systems, physician practices, employers, and other customers. As of February 09, 2022, the company operated 60 hospitals; and approximately 550 other healthcare facilities, including surgical hospitals, ambulatory surgery centers, urgent care and imaging centers, and other care sites and clinics. Tenet Healthcare Corporation was incorporated in 1975 and is headquartered in Dallas, Texas.",
    "ceo": "Dr. Saumya  Sutaria M.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "75776",
    "phone": "469-893-2200",
    "address": "14201 Dallas Parkway",
    "city": "Dallas",
    "state": "TX",
    "zip": "75254",
    "dcfDiff": 12.5067,
    "dcf": 65.2967,
    "image": "https://financialmodelingprep.com/image-stock/THC.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]