[
  {
    "symbol": "THG",
    "price": 110.25,
    "beta": 0.678169,
    "volAvg": 188753,
    "mktCap": 3938813550,
    "lastDiv": 3.18,
    "range": "109.13-149.64",
    "changes": -1.57,
    "companyName": "The Hanover Insurance Group, Inc.",
    "currency": "USD",
    "cik": "0000944695",
    "isin": "US4108671052",
    "cusip": "410867105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.hanover.com",
    "description": "The Hanover Insurance Group, Inc., through its subsidiaries, provides various property and casualty insurance products and services in the United States. The company operates through three segments: Commercial Lines, Personal Lines, and Other. The Commercial Lines segment offers commercial multiple peril, commercial automobile, and workers' compensation insurance products, as well as management and professional liability, marine, specialty industrial and commercial property, monoline general liability, surety, umbrella, fidelity, crime, and other commercial coverages. The Personal Lines segment provides personal automobile and homeowner's coverages, as well as other personal coverages, such as personal umbrella, inland marine, fire, personal watercraft, personal cyber, and other miscellaneous coverages. The Other segment markets investment management services to institutions, pension funds, and other organizations. The Hanover Insurance Group, Inc. markets its products and services through independent agents and brokers. The company was formerly known as Allmerica Financial Corp. and changed its name to The Hanover Insurance Group, Inc. in December 2005. The Hanover Insurance Group, Inc. was founded in 1852 and is headquartered in Worcester, Massachusetts.",
    "ceo": "Mr. John Conner Roche",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4600",
    "phone": "508 855 1000",
    "address": "440 Lincoln Street",
    "city": "Worcester",
    "state": "MA",
    "zip": "01653",
    "dcfDiff": 17.0804,
    "dcf": 150.21,
    "image": "https://financialmodelingprep.com/image-stock/THG.png",
    "ipoDate": "1995-10-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]