[
  {
    "symbol": "THKLY",
    "price": 10.33,
    "beta": 1.047892,
    "volAvg": 8398,
    "mktCap": 2532513047,
    "lastDiv": 0.32,
    "range": "7.98-11.98",
    "changes": 0.11,
    "companyName": "THK Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": "US8724341057",
    "cusip": "872434105",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.thk.com",
    "description": "THK Co., Ltd. manufactures and supplies machine components in Japan, the Americas, Europe, China, and internationally. The company provides linear motion (LM) guides, ball screws, ball splines, LM guide actuators, cross roller rings and tables, electric actuators and linear motor actuators, cam followers, roller followers, linear bushes, slide packs, slide rails, cross roller guides, linear ball slides, LM and flat rollers, spline nuts, LM strokes, screw nuts, change nuts, precision linear packs, link balls, rod ends, spherical plain bearings, lubrication accessories, and seismic isolation products. Its products are used in various applications, including machine tools, general industrial machinery, precision instruments, semiconductor and LCD manufacturing equipment, industrial robots, electronic devices, and transport systems, as well as in construction, aerospace, medical and assistive, and other manufacturing industries. The company was incorporated in 1946 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Akihiro  Teramachi",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "13502",
    "phone": "81 3 5730 3911",
    "address": "2-12-10 Shibaura",
    "city": "Tokyo",
    "state": null,
    "zip": "108-8506",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/THKLY.png",
    "ipoDate": "2010-01-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]