[
  {
    "symbol": "THS",
    "price": 50.8,
    "beta": 0.422183,
    "volAvg": 348419,
    "mktCap": 2860766440,
    "lastDiv": 0,
    "range": "39.78-55.3",
    "changes": 0.46,
    "companyName": "TreeHouse Foods, Inc.",
    "currency": "USD",
    "cik": "0001320695",
    "isin": "US89469A1043",
    "cusip": "89469A104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaged Foods",
    "website": "https://www.treehousefoods.com",
    "description": "TreeHouse Foods, Inc. manufactures and distributes private label foods and beverages in the United States and internationally. It operates through two segments, Meal Preparation, and Snacking & Beverages. The Meal Preparation segment provides aseptic cheese and pudding products; baking and mix powders; hot cereals; jams, preserves, and jellies; liquid and powdered non-dairy creamers; macaroni and cheese; mayonnaise; Mexican, barbeque, and other sauces; pastas; pickles and related products; powdered soups and gravies; refrigerated and shelf stable dressings and sauces; refrigerated dough; single serve hot beverages; skillet dinners; and table and flavored syrups. The Snacking & Beverages segment offers bars, broths, candies, cookies, crackers, in-store bakery products, pita chips, powdered drinks, pretzels, ready-to-drink coffee, retail griddle waffles, pancakes, French toasts, specialty teas, and sweeteners. The company sells its products through various distribution channels, including retailers, foodservice distributors, and co-manufacturers, as well as industrial and export, which includes food manufacturers and repackagers of foodservice products. TreeHouse Foods, Inc. was founded in 1862 and is based in Oak Brook, Illinois.",
    "ceo": "Mr. Steven T. Oakland",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "7500",
    "phone": "708 483 1300",
    "address": "2021 Spring Road",
    "city": "Oak Brook",
    "state": "IL",
    "zip": "60523",
    "dcfDiff": 5.96268,
    "dcf": 53.6727,
    "image": "https://financialmodelingprep.com/image-stock/THS.png",
    "ipoDate": "2005-06-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]