[
  {
    "symbol": "TIIAY",
    "price": 2.78,
    "beta": 1.053256,
    "volAvg": 21601,
    "mktCap": 6100097911,
    "lastDiv": 0.118,
    "range": "1.65-3.48",
    "changes": 0.085,
    "companyName": "Telecom Italia S.p.A.",
    "currency": "USD",
    "cik": "0000948642",
    "isin": "US87927Y1029",
    "cusip": "87927Y102",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.gruppotim.it/en.html",
    "description": "Telecom Italia S.p.A., together with its subsidiaries, provides fixed and mobile telecommunications services in Italy and internationally. The company operates through Domestic, Brazil, and Other Operations segments. It offers fixed and mobile voice and Internet, and public telephony services, as well as products managed and developed for individuals and families; and voice, data, and Internet services and products, and information and communications technology solutions for small and medium-size enterprises, small offices/home offices, the public sector, large accounts, and enterprises in the fixed and mobile telecommunications markets. The company also manages and develops a portfolio of regulated and unregulated wholesale services for fixed-line and mobile telecommunications operators; and development, engineering, construction, and operation of network infrastructures, information technology (IT), and systems and properties. In addition, it is involved in customer care, operating credit support, loyalty, and retention activities. The company has a strategic partnership with Google Cloud. Telecom Italia S.p.A. was incorporated in 1908 and is headquartered in Rome, Italy.",
    "ceo": "Mr. Pietro  Labriola",
    "sector": "Communication Services",
    "country": "IT",
    "fullTimeEmployees": "50305",
    "phone": "39 06 36881",
    "address": "Corso d’Italia 41",
    "city": "Rome",
    "state": "RM",
    "zip": "00198",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TIIAY.png",
    "ipoDate": "2003-08-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]