[
  {
    "symbol": "TKAMY",
    "price": 7.91,
    "beta": 2.110727,
    "volAvg": 15129,
    "mktCap": 4924227867,
    "lastDiv": 0.16,
    "range": "4.08-8.45",
    "changes": -0.07,
    "companyName": "thyssenkrupp AG",
    "currency": "USD",
    "cik": null,
    "isin": "US88629Q2075",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Metal Fabrication",
    "website": "https://www.thyssenkrupp.com",
    "description": "thyssenkrupp AG operates in the areas of automotive technology, industrial components, marine systems, steel, and materials services in Germany, the United States, China, and internationally. The company's Automotive Technology segment develops and manufactures components and systems, as well as automation solutions for the automotive industry. Its Industrial Components segment manufactures and sells forged components and system solutions for the resource, construction, and mobility sectors; and slewing rings, antifriction bearings, and seamless rolled rings for the wind energy and construction machinery sectors. The company's Multi Tracks segment builds plants for the chemical, cement, and mining industries. Its Marine Systems segment provides systems in the submarine and surface vessel construction, as well as in the field of maritime electronics and security technology. The company's Materials Services segment distributes materials and offers technical services for the production and manufacturing sectors. Its Steel Europe segment provides flat carbon steel products, intelligent material solutions, and finished parts. thyssenkrupp AG was founded in 1811 and is headquartered in Essen, Germany.",
    "ceo": "Mr. Miguel Angel  Lopez Borrego",
    "sector": "Industrials",
    "country": "DE",
    "fullTimeEmployees": "98224",
    "phone": "49 201 844 0",
    "address": "thyssenkrupp Allee 1",
    "city": "Essen",
    "state": null,
    "zip": "45143",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TKAMY.png",
    "ipoDate": "2014-12-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]