[
  {
    "symbol": "TKR",
    "price": 89.44,
    "beta": 1.535915,
    "volAvg": 591009,
    "mktCap": 6475026688,
    "lastDiv": 1.32,
    "range": "50.85-89.79",
    "changes": -0.07,
    "companyName": "The Timken Company",
    "currency": "USD",
    "cik": "0000098362",
    "isin": "US8873891043",
    "cusip": "887389104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Tools & Accessories",
    "website": "https://www.timken.com",
    "description": "The Timken Company designs, manufactures, and manages engineered bearings and power transmission products worldwide. It operates in two segments, Mobile Industries and Process Industries. The Mobile Industries segment offers a portfolio of bearings, seals, and lubrication devices and systems, as well as power transmission components, engineered chains, augers, belts, couplings, clutches, brakes, and related products and maintenance services to original equipment manufacturers (OEMs) and end-users of off-highway equipment for the agricultural, construction, mining, outdoor power equipment, and power sports markets; and on-highway vehicles, including passenger cars, light trucks, and medium- and heavy-duty trucks, as well as rail cars and locomotives. It also provides power transmission systems and flight-critical components for civil and military aircraft, which include bearings, rotor-head assemblies, helicopter transmission systems, turbine engine components, gears, and housings. This segment sells its parts through a network of authorized automotive and heavy-truck distributors to individual end-users, equipment owners, operators, and maintenance shops. The Process Industries segment provides industrial bearings and assemblies; power transmission components, such as gears and gearboxes; and linear motion products, couplings, seals, lubricants, chains, belts, and related products and services to OEMs and end-users in various industries. It also offers aftermarket sales and service needs through a network of authorized industrial distributors; and repair and service for bearings and gearboxes, as well as electric motor rewind, repair, and services to end-users. The company offers its products under the Timken, Philadelphia Gear, Drives, Cone Drive, Rollon, Lovejoy, Diamond, BEKA, and Groeneveld brands. The Timken Company was founded in 1899 and is headquartered in North Canton, Ohio.",
    "ceo": "Mr. Richard G. Kyle",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "19000",
    "phone": "234 262 3000",
    "address": "4500 Mount Pleasant Street NW",
    "city": "North Canton",
    "state": "OH",
    "zip": "44720-5450",
    "dcfDiff": 3.91487,
    "dcf": 77.5351,
    "image": "https://financialmodelingprep.com/image-stock/TKR.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]