[
  {
    "symbol": "TLK",
    "price": 26.45,
    "beta": 0.182876,
    "volAvg": 178696,
    "mktCap": 26201952323,
    "lastDiv": 1.13,
    "range": "23.03-31.95",
    "changes": -0.1,
    "companyName": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk",
    "currency": "USD",
    "cik": "0001001807",
    "isin": "US7156841063",
    "cusip": "715684106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.telkom.co.id",
    "description": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk provides telecommunications, informatics, and network services worldwide. The company's Mobile segment offers mobile voice, SMS, and mobile broadband services; and digital services, including financial services, video on demand, music, gaming, IoT, big data analytics, and digital advertising services. Its Consumer segment provides fixed voice and broadband services; and IPTV and related consumer digital services. The company's Enterprise segment offers ICT and digital platform that covers enterprise-grade connectivity services, including satellite, IT services, data center and cloud, and business process outsourcing services, as well as CPE trading and managed, cyber security, financial, big data, digital advertising, e-health, managed ATM, and professional services. Its Wholesale and International Business segment provides wholesale voice, managed, A2P SMS, IP transit and connectivity, data center and cloud, security, and value added and digital services; mobile network operator, mobile virtual network operator, and call center services; and tower and infrastructure services to other licensed operator companies and institutions. The company's Others segment offers digital services, such as digital platform, digital content, and e-commerce; and property management services. The company also provides building management and maintenance services, payment, business management consulting and capital venture, health insurance administration, tourism, directory information, telecommunication construction, and multimedia portal services; acts as a civil consultant and developer; and leases offices. As of December 31, 2020, it had approximately 9.1 million fixed wireline subscribers, including 8.0 million fixed broadband subscribers; and 169.5 million cellular subscribers, including 115.9 million mobile broadband subscribers. The company was founded in 1884 and is headquartered in Bandung, Indonesia.",
    "ceo": "Mr. Ririek  Adriansyah",
    "sector": "Communication Services",
    "country": "ID",
    "fullTimeEmployees": "20887",
    "phone": "62 22 452 1404",
    "address": "Jalan Japati No. 1",
    "city": "Bandung",
    "state": null,
    "zip": "40133",
    "dcfDiff": 38673,
    "dcf": 38699.4,
    "image": "https://financialmodelingprep.com/image-stock/TLK.png",
    "ipoDate": "1995-11-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]