[
  {
    "symbol": "TLSNY",
    "price": 4.31,
    "beta": 0.129501,
    "volAvg": 150162,
    "mktCap": 8473675707,
    "lastDiv": 0.29,
    "range": "4.08-7.75",
    "changes": -0.02,
    "companyName": "Telia Company AB (publ)",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.teliacompany.com",
    "description": "Telia Company AB (publ) provides communication services in Sweden, Finland, Norway, Denmark, Lithuania, Estonia, and Latvia. The company offers mobile, broadband, television, and fixed-line services to businesses, individuals, families, and communities. It provides networking, cloud and security, mobility, enterprise mobile network, contact center, managed mobility services, collaboration solutions, enterprise telephony, Internet of Things (IoT), carrier ethernet, dedicated internet access, wavelengths, IP Transit, dark fiber, colocation, and IoT connectivity solutions, as well as broadcasting and content production services, and customer financing services. The company markets its products and services under the Telia, halebop, Fello, TV4, C More, MTV, MyCall, OneCall, Phonero, Call me, Mit tele, Diil, Lmt Okarte, Telia Latvija, Cloudy, Tet, and Ezys brands for logistics, public transport, manufacturing, retail, utilities, building, and public sector industries. It has 18.1 million mobile subscriptions, 1.0 million fixed telephony subscriptions, 2.9 fixed million broadband subscriptions, and 3.4 million TV subscriptions. The company was formerly known as TeliaSonera AB (publ) and changed its name to Telia Company AB (publ) in April 2016. Telia Company AB (publ) was founded in 1853 and is headquartered in Solna, Sweden.",
    "ceo": "Ms. Allison  Kirkby FCMA",
    "sector": "Communication Services",
    "country": "SE",
    "fullTimeEmployees": "19159",
    "phone": "46 8 50 45 50 00",
    "address": "Stjärntorget 1",
    "city": "Solna",
    "state": null,
    "zip": "169 94",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TLSNY.png",
    "ipoDate": "2010-02-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]