[
  {
    "symbol": "TLTZY",
    "price": 4.11,
    "beta": 0.316858,
    "volAvg": 2685,
    "mktCap": 5680102068,
    "lastDiv": 0.31,
    "range": "3.787-5.86",
    "changes": 0.02,
    "companyName": "Tele2 AB (publ)",
    "currency": "USD",
    "cik": "0001122535",
    "isin": "US87952P3073",
    "cusip": "87952P307",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Telecom Services",
    "website": "https://www.tele2.com",
    "description": "Tele2 AB (publ), a telecom operator, provides fixed and mobile connectivity and entertainment services in Sweden, Lithuania, Latvia, and Estonia. The company offers mobile telephony and data, fixed broadband, fixed telephony, switch and contact center, cloud services, IT services, network services, workplace, video and collaboration, and security services. It also provides data network services, including dark fiber, dedicated wavelength, ethernet and IP VPN, and internet services; and unified communications comprising service provider, mobile virtual network operator, and carrier SIP-interconnect services. In addition, the company offers single and dual IMSI solutions for consumer and IoT applications; on-demand roaming services, such as subscription management, data plan management, real time charging, eSIM delivery, SIM management, and set up services; routing and termination solutions for international voice traffic; application-2-person messaging services; and value-added services comprising shortcodes and long numbers for businesses to have 2-way communication with their customers. Tele2 AB (publ) was founded in 1993 and is based in Stockholm, Sweden.",
    "ceo": "Mr. Kjell Morten Johnsen",
    "sector": "Communication Services",
    "country": "SE",
    "fullTimeEmployees": "4438",
    "phone": "46 8 56 20 00 60",
    "address": "Skeppsbron 18",
    "city": "Stockholm",
    "state": null,
    "zip": "103 13",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TLTZY.png",
    "ipoDate": "2021-01-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]