[
  {
    "symbol": "TME",
    "price": 7.55,
    "beta": 0.803056,
    "volAvg": 6366129,
    "mktCap": 12956404000,
    "lastDiv": 0,
    "range": "3.14-9.29",
    "changes": -0.1,
    "companyName": "Tencent Music Entertainment Group",
    "currency": "USD",
    "cik": "0001744676",
    "isin": "US88034P1093",
    "cusip": "88034P109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Internet Content & Information",
    "website": "https://www.tencentmusic.com",
    "description": "Tencent Music Entertainment Group operates online music entertainment platforms to provide music streaming, online karaoke, and live streaming services in the People's Republic of China. It offers QQ Music, Kugou Music, and Kuwo Music that enable users to discover and listen to music in personalized ways; and WeSing, which enables users to have fun by singing and interacting with friends, sharing their singing performances with friends, and discovering songs that others have sung. The company also operates Kugou Music, Kuwo Music, WeSing, QQ Music, Kugou Live, and Kuwo Live that provides an interactive online stage for performers and users to showcase their talent and engage with those interested in their performance; and Kuwo Changting, an audio platform that offers users various audio content, including audio books, cross-talks, radio dramas, and other entertainment. In addition, it sells music-related merchandise, including Kugou headsets, smart speakers, WeSing karaoke microphones, and Hi-Fi systems; and offers online music event ticketing services, as well as services to smart device and automobile makers to build and operate music services on devices and vehicles. Tencent Music Entertainment Group has a strategic partnership with China Literature. The company is headquartered in Shenzhen, China. Tencent Music Entertainment Group is a subsidiary of Tencent Holdings Limited.",
    "ceo": "Mr. Zhu  Liang",
    "sector": "Communication Services",
    "country": "CN",
    "fullTimeEmployees": "5805",
    "phone": "86 75 5860 13388",
    "address": "Building D",
    "city": "Shenzhen",
    "state": null,
    "zip": "518057",
    "dcfDiff": 1.14866,
    "dcf": 7.52134,
    "image": "https://financialmodelingprep.com/image-stock/TME.png",
    "ipoDate": "2018-12-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]