[
  {
    "symbol": "TMNSF",
    "price": 84.675,
    "beta": 0.943678,
    "volAvg": 19,
    "mktCap": 6085575315,
    "lastDiv": 1.24,
    "range": "53.77-84.99",
    "changes": -0.313,
    "companyName": "Temenos AG",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Software—Application",
    "website": "https://www.temenos.com",
    "description": "Temenos AG develops, markets, and sells integrated banking software systems to banking and other financial institutions worldwide. The company provides Temenos Transact, a banking solution that offers banking software, and data and analytics; and Temenos Payments, a payment solution that gives banks real-time control, customer service experience, and cost efficiencies and risk management solutions. It also offers Temenos Infinity, a digital banking product; Temenos Multifonds, a fund administration solution; Temenos SaaS solution that supports banks in various sectors and geographies; Temenos Quantum, a multi-experience development platform that delivers digital transformation; and Temenos AI that provides frictionless customer experiences and automate processes. In addition, the company provides Temenos Financial Crime Mitigation that allows banks and financial institutions to avoid regulatory fines, detect fraud, and mitigate reputational risks; Temenos Analytics, a reporting, analytics, and business intelligence product; and Temenos Regulatory Compliance, which is used to address fraud, remain compliant with regulations, and manage risk. Further, it offers retail and private banking, corporate and business banking, Islamic banking, wealth management, financial inclusion, mobile banking, consultancy and training services, and support services. Additionally, the company provides Temenos Developer Community, an open API catalogue that brings standardized out-of-the-box APIs to fast track innovation with online support and resources. The company was formerly known as Temenos Group AG and changed its name to Temenos AG in May 2018. Temenos AG was founded in 1993 and is headquartered in Geneva, Switzerland.",
    "ceo": "Mr. Andreas  Andreades",
    "sector": "Technology",
    "country": "CH",
    "fullTimeEmployees": "7498",
    "phone": "41 22 708 1150",
    "address": "2 Rue de L’Ecole-de-Chimie",
    "city": "Geneva",
    "state": null,
    "zip": "1205",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TMNSF.png",
    "ipoDate": "2010-10-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]