[
  {
    "symbol": "TMO",
    "price": 510.15,
    "beta": 0.795774,
    "volAvg": 1593772,
    "mktCap": 196775564069,
    "lastDiv": 1.4,
    "range": "475.77-611.06",
    "changes": 0.53,
    "companyName": "Thermo Fisher Scientific Inc.",
    "currency": "USD",
    "cik": "0000097745",
    "isin": "US8835561023",
    "cusip": "883556102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Diagnostics & Research",
    "website": "https://www.thermofisher.com",
    "description": "Thermo Fisher Scientific Inc. offers life sciences solutions, analytical instruments, specialty diagnostics, and laboratory products and service worldwide. The company's Life Sciences Solutions segment offers reagents, instruments, and consumables for biological and medical research, discovery, and production of drugs and vaccines, as well as diagnosis of infections and diseases to pharmaceutical, biotechnology, agricultural, clinical, healthcare, academic, and government markets. Its Analytical Instruments segment provides instruments, consumables, software, and services for use in laboratory, on production line, and in field for pharmaceutical, biotechnology, academic, government, environmental, and other research and industrial markets, as well as clinical laboratories. The company's Specialty Diagnostics segment offers liquid, ready-to-use, and lyophilized immunodiagnostic reagent kits, as well as calibrators, controls, and calibration verification fluids; ImmunoCAP for allergy and asthma tests, and EliA for autoimmunity tests; dehydrated and prepared culture media, collection and transport systems, instrumentation, and consumables; human leukocyte antigen typing and testing for organ transplant market; and healthcare products. Its Laboratory Products and Services segment provides laboratory refrigerators and freezers, ultralow-temperature freezers, and cryopreservation storage tanks; temperature control, sample preparation and preservation, centrifugation, and biological safety cabinet products; water analysis instruments; laboratory plastics products; laboratory chemicals; and pharma services. The company offers products and services through a direct sales force, customer-service professionals, electronic commerce, third-party distributors, and catalogs. It has a strategic alliance with the University of California, San Francisco. The company was incorporated in 1956 and is based in Waltham, Massachusetts.",
    "ceo": "Mr. Marc N. Casper",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "130000",
    "phone": "781 622 1000",
    "address": "168 Third Avenue",
    "city": "Waltham",
    "state": "MA",
    "zip": "02451",
    "dcfDiff": 26.1294,
    "dcf": 547.501,
    "image": "https://financialmodelingprep.com/image-stock/TMO.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]