[
  {
    "symbol": "TMUS",
    "price": 136.27,
    "beta": 0.564436,
    "volAvg": 6636341,
    "mktCap": 163509016841,
    "lastDiv": 4.06,
    "range": "124.92-154.38",
    "changes": 0.1,
    "companyName": "T-Mobile US, Inc.",
    "currency": "USD",
    "cik": "0001283699",
    "isin": "US8725901040",
    "cusip": "872590104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Telecom Services",
    "website": "https://www.t-mobile.com",
    "description": "T-Mobile US, Inc., together with its subsidiaries, provides mobile communications services in the United States, Puerto Rico, and the United States Virgin Islands. The company offers voice, messaging, and data services to 108.7 million customers in the postpaid, prepaid, and wholesale markets. It also provides wireless devices, including smartphones, wearables, and tablets and other mobile communication devices, as well as wireless devices and accessories. In addition, the company offers services, devices, and accessories under the T-Mobile and Metro by T-Mobile brands through its owned and operated retail stores, T-Mobile app and customer care channels, and its websites. It also sells its devices to dealers and other third-party distributors for resale through independent third-party retail outlets and various third-party websites. As of December 31, 2021, it operated approximately 102,000 macro cell and 41,000 small cell/distributed antenna system sites. The company was founded in 1994 and is headquartered in Bellevue, Washington.",
    "ceo": "Mr. G. Michael Sievert",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "71000",
    "phone": "425 378 4000",
    "address": "12920 SE 38th Street",
    "city": "Bellevue",
    "state": "WA",
    "zip": "98006-1350",
    "dcfDiff": 8.89238,
    "dcf": 155.622,
    "image": "https://financialmodelingprep.com/image-stock/TMUS.png",
    "ipoDate": "2007-04-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]