[
  {
    "symbol": "TOL",
    "price": 78.55,
    "beta": 1.382746,
    "volAvg": 1555380,
    "mktCap": 8588814100,
    "lastDiv": 0.84,
    "range": "39.53-79.47",
    "changes": 0.21,
    "companyName": "Toll Brothers, Inc.",
    "currency": "USD",
    "cik": "0000794170",
    "isin": "US8894781033",
    "cusip": "889478103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Residential Construction",
    "website": "https://www.tollbrothers.com",
    "description": "Toll Brothers, Inc., together with its subsidiaries, designs, builds, markets, sells, and arranges finance for a range of detached and attached homes in luxury residential communities in the United States. The company operates in two segments, Traditional Home Building and City Living. It also designs, builds, markets, and sells condominiums through Toll Brothers City Living. In addition, the company develops, owns, and operates golf courses and country clubs; develops and sells land; and develops, operates, and rents apartments, as well as provides various interior fit-out options, such as flooring, wall tile, plumbing, cabinets, fixtures, appliances, lighting, and home-automation and security technologies. Further, it owns and operates architectural, engineering, mortgage, title, insurance, smart home technology, landscaping, lumber distribution, house component assembly, and manufacturing operations. The company serves move-up, empty-nester, active-adult, and second-home buyers. It has a strategic partnership with Equity Residential to develop new rental apartment communities in the United States markets. The company was founded in 1967 and is headquartered in Fort Washington, Pennsylvania.",
    "ceo": "Mr. Douglas C. Yearley Jr.",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "5200",
    "phone": "215 938 8000",
    "address": "1140 Virginia Drive",
    "city": "Fort Washington",
    "state": "PA",
    "zip": "19034",
    "dcfDiff": 0.673869,
    "dcf": 58.0639,
    "image": "https://financialmodelingprep.com/image-stock/TOL.png",
    "ipoDate": "1986-07-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]