[
  {
    "symbol": "TOST",
    "price": 22.32,
    "beta": 0,
    "volAvg": 6348824,
    "mktCap": 11840381207,
    "lastDiv": 0,
    "range": "12.15-26.035",
    "changes": 0.24,
    "companyName": "Toast, Inc.",
    "currency": "USD",
    "cik": "0001650164",
    "isin": "US8887871080",
    "cusip": "888787108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.toasttab.com",
    "description": "Toast, Inc. operates a cloud-based and digital technology platform for the restaurant industry in the United States and Ireland. The company offers Toast Point of Sale (POS), a hardware product; Toast Order & Pay, which allows guests to order and pay from their mobile devices; Toast Flex that is used for on-counter order and pay, as well as used as a server station, guest kiosk, kitchen display system, or order fulfillment station; Toast Go, a handheld POS device that enhances the table turn times through tableside ordering and payment acceptance; and Toast Tap, a card reader. It also provides kitchen display system software that connects the front of the house with the kitchen staff; multi-location management software, which allows customers to manage and standardize their operations and configure menus; xtraCHEF that provides back-office tools; and Toast Flex for Kitchen, a larger format mountable piece of hardware that can be used as a kitchen screen. In addition, the company offers Toast Online Ordering & Toast TakeOut app, a software-based platform that provides restaurants to take off-premises orders directly through their branded website; First-Party Delivery services for restaurants to manage a fleet of drivers, and customize delivery hours, zones, fees, and minimum ticket sizes; Toast Delivery Services, which enables restaurants to utilize a partner network of delivery drivers; and Toast Delivery Partners services. Further, it provides loyalty programs and gift cards; payroll and team management products; business owner policy insurance and restaurant-specific add-ons; payment processing solutions; loans advanced to restaurants; purchase financing; reporting and analytics solutions; Toast Partner Connect that allows customers to discover, select, and connect their restaurant to its partners; and bi-directional APIs. The company was incorporated in 2011 and is headquartered in Boston, Massachusetts.",
    "ceo": "Mr. Christopher P. Comparato",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "4500",
    "phone": "617 297 1005",
    "address": "401 Park Drive",
    "city": "Boston",
    "state": "MA",
    "zip": "02215",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TOST.png",
    "ipoDate": "2021-09-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]