[
  {
    "symbol": "TOSYY",
    "price": 15.68,
    "beta": 0.574329,
    "volAvg": 25246,
    "mktCap": 13567277302,
    "lastDiv": 1.25,
    "range": "14.99-20.5",
    "changes": -0.07,
    "companyName": "Toshiba Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US8914933069",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.toshiba.co.jp",
    "description": "Toshiba Corporation, together with its subsidiaries, provides electronic devices and storage solutions worldwide. It operates through Energy Systems and Solutions, Infrastructure Systems and Solutions, Building Solutions, Retail and Printing Solutions, Electronic Devices and Storage Solutions, Digital Solutions, and Other segments. The company provides energy systems and solutions, including nuclear, thermal, and renewable energy power generation systems; transmission and distribution, hydro, geothermal, solar, and wind power services. It also offers infrastructure systems and solutions, such as water supply, sewerage, waste, subways, railways, airports, road, and ports service; security and automation, and motor/drive systems, equipment, facilities, maintenance services; telecommunication, power distribution, communication, and broadcast systems. In addition, the company provides building solutions comprising light fixtures, industrial light parts, commercial air-conditioner compressors, elevators, escalators for buildings and facilities, ventilation, and lighting, as well as energy-saving, environmentally products and services, and building solutions for security. Further, the company offers power, small-signal, and optoelectronic devices, In-vehicle digital and logic microcomputers, analog ICs, semiconductor manufacturing equipment , and parts materials. Additionally, it provides automotive, industrial semiconductors, manufacturing equipment, battery systems, and IT solution services. Toshiba Corporation was founded in 1875 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Taro  Shimada",
    "sector": "Industrials",
    "country": "JP",
    "fullTimeEmployees": "116224",
    "phone": "81 3 3457 4511",
    "address": "1-1, Shibaura 1-chome",
    "city": "Tokyo",
    "state": null,
    "zip": "105-8001",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TOSYY.png",
    "ipoDate": "2010-01-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]