[
  {
    "symbol": "TPH",
    "price": 32.3,
    "beta": 1.455985,
    "volAvg": 1167556,
    "mktCap": 3233165400,
    "lastDiv": 0,
    "range": "14.59-33.56",
    "changes": -0.19,
    "companyName": "Tri Pointe Homes, Inc.",
    "currency": "USD",
    "cik": "0001561680",
    "isin": "US87265H1095",
    "cusip": "87265H109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Residential Construction",
    "website": "https://www.tripointehomes.com",
    "description": "Tri Pointe Homes, Inc. engages in the design, construction, and sale of single-family attached and detached homes in the United States. The company operates through a portfolio of six brands comprising Maracay in Arizona; Pardee Homes in California and Nevada; Quadrant Homes in Washington; Trendmaker Homes in Texas; TRI Pointe Homes in California, Colorado, and the Carolinas; and Winchester Homes in Maryland, Virginia, and the District of Columbia. As of December 31, 2021, its operations consisted of 112 active selling communities and 41,675 owned or controlled lots. The company sells its homes through own sales representatives and independent real estate brokers. It also provides financial services, such as mortgage financing, title and escrow, and property and casualty insurance agency services. The company was formerly known as TRI Pointe Group, Inc. and changed its name to Tri Pointe Homes, Inc. in January 2021. Tri Pointe Homes, Inc. was founded in 2009 and is headquartered in Irvine, California.",
    "ceo": "Mr. Douglas F. Bauer",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "1470",
    "phone": "949 438 1400",
    "address": "19540 Jamboree Road",
    "city": "Irvine",
    "state": "CA",
    "zip": "92612",
    "dcfDiff": 1.27449,
    "dcf": 22.8445,
    "image": "https://financialmodelingprep.com/image-stock/TPH.png",
    "ipoDate": "2013-01-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]