[
  {
    "symbol": "TPL",
    "price": 1299.75,
    "beta": 1.877112,
    "volAvg": 33938,
    "mktCap": 9997910955,
    "lastDiv": 13,
    "range": "1266.21-2739.0",
    "changes": 12.96,
    "companyName": "Texas Pacific Land Corporation",
    "currency": "USD",
    "cik": "0001811074",
    "isin": "US88262P1021",
    "cusip": "88262P102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas E&P",
    "website": "https://www.texaspacific.com",
    "description": "Texas Pacific Land Corporation engages in the land and resource management, and water services and operations businesses. The company's Land and Resource Management segment manages approximately 880,000 acres of land. This segment also holds own a 1/128th nonparticipating perpetual oil and gas royalty interest (NPRI) under approximately 85,000 acres of land; a 1/16th NPRI under approximately 371,000 acres of land; and approximately 4,000 additional net royalty acres located in the western part of Texas. In addition, this segment engages in easements and commercial leases activities, such as oil, gas and related hydrocarbons, power line and utility easements, and subsurface wellbore easements. Further, this segment leases its land for processing, storage, and compression facilities and roads; and is involved in sale of materials, such as caliche. Its Water Services and Operations segment provides full-service water offerings, including water sourcing, produced-water gathering/treatment, infrastructure development, disposal solutions, water tracking, analytics, and well testing services to operators in the Permian Basin. This segment also holds royalties for water sourced from its land. Texas Pacific Land Corporation was founded in 1888 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Tyler  Glover",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "99",
    "phone": "214 969 5530",
    "address": "1700 Pacific Avenue",
    "city": "Dallas",
    "state": "TX",
    "zip": "75201",
    "dcfDiff": 535.933,
    "dcf": 2582.55,
    "image": "https://financialmodelingprep.com/image-stock/TPL.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]