[
  {
    "symbol": "TPR",
    "price": 42.77,
    "beta": 1.484507,
    "volAvg": 3177633,
    "mktCap": 9914000460,
    "lastDiv": 1.2,
    "range": "27.53-47.48",
    "changes": -0.63,
    "companyName": "Tapestry, Inc.",
    "currency": "USD",
    "cik": "0001116132",
    "isin": "US8760301072",
    "cusip": "876030107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Luxury Goods",
    "website": "https://www.tapestry.com",
    "description": "Tapestry, Inc. provides luxury accessories and branded lifestyle products in the United States, Japan, Greater China, and internationally. The company operates in three segments: Coach, Kate Spade, and Stuart Weitzman. It offers women's accessories, including handbags, such as wallets, money pieces, wristlets, and cosmetic cases; novelty accessories comprising address books, time management and travel accessories, sketchbooks, and portfolios; and key rings and charms. The company also provides bag collections, including business cases, computer bags, messenger-style bags, backpacks, and totes; small leather goods, such as wallets, card cases, travel organizers, and belts; and footwear, watches, fragrances, sunglasses, novelty accessories, and ready-to-wear for men. In addition, it offers women's footwear; sunglasses; bracelets, necklaces, rings, and earrings; fragrances and watches; women's seasonal lifestyle apparel collections, including outerwear and ready-to-wear, and cold weather accessories, which comprise gloves, scarves, and hats. Further, the company provides footwear items; and housewares and home accessories for kids, such as fashion bedding and tableware; and stationery and gifts. Additionally, it licenses rights to market and distribute its tech and soft accessories, jewelry, watches, eyewear, and fragrances under the Coach brand; and tableware and housewares, fashion beddings, tech accessories, watches, sleepwear, eyewear, stationery and gifts, and fragrances under the Kate Spade brand. As of July 2, 2022, the company operated through a network of 945 Coach stores, 398 Kate Spade stores, and 100 Stuart Weitzman stores. It sells its products through e-commerce sites and concession shop-in-shops, and wholesale customers, as well as through independent third-party distributors. The company was formerly known as Coach, Inc. and changed its name to Tapestry, Inc. in October 2017. Tapestry, Inc. was founded in 1941 and is headquartered in New York, New York.",
    "ceo": "Ms. Joanne C. Crevoiserat",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "12600",
    "phone": "212 946 8400",
    "address": "10 Hudson Yards",
    "city": "New York",
    "state": "NY",
    "zip": "10001",
    "dcfDiff": 2.46565,
    "dcf": 41.6543,
    "image": "https://financialmodelingprep.com/image-stock/TPR.png",
    "ipoDate": "2000-10-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]