[
  {
    "symbol": "TR",
    "price": 35.11,
    "beta": 0.129929,
    "volAvg": 191625,
    "mktCap": 2429008319,
    "lastDiv": 0.36,
    "range": "32.038834-46.106796",
    "changes": -1.13,
    "companyName": "Tootsie Roll Industries, Inc.",
    "currency": "USD",
    "cik": "0000098677",
    "isin": "US8905161076",
    "cusip": "890516107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Confectioners",
    "website": "https://www.tootsie.com",
    "description": "Tootsie Roll Industries, Inc., together with its subsidiaries, engages in manufacture and sale of confectionery products in the United States, Canada, Mexico, and internationally. It sells its products under the Tootsie Roll, Tootsie Pops, Child's Play, Caramel Apple Pops, Charms, Blow-Pop, Charms Mini Pops, Cella's, Dots, Junior Mints, Charleston Chew, Sugar Daddy, Sugar Babies, Andes, Fluffy Stuff, Dubble Bubble, Razzles, Cry Baby, NIK-L-NIP, and Tutsi Pop trademarks. The company sells its products directly to wholesale distributors of candy, food and groceries, supermarkets, variety stores, dollar stores, chain grocers, drug chains, discount chains, cooperative grocery associations, mass merchandisers, warehouse and membership club stores, vending machine operators, e-commerce merchants, the United States military, and fund-raising charitable organizations, as well as through food and grocery brokers. Tootsie Roll Industries, Inc. was founded in 1896 and is based in Chicago, Illinois.",
    "ceo": "Ms. Ellen R. Gordon",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "2300",
    "phone": "773 838 3400",
    "address": "7401 South Cicero Avenue",
    "city": "Chicago",
    "state": "IL",
    "zip": "60629",
    "dcfDiff": 1.95994,
    "dcf": 45.6499,
    "image": "https://financialmodelingprep.com/image-stock/TR.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]