[
  {
    "symbol": "TREX",
    "price": 64.4,
    "beta": 1.48838,
    "volAvg": 1032122,
    "mktCap": 7006977600,
    "lastDiv": 0,
    "range": "38.68-66.65",
    "changes": 0.62,
    "companyName": "Trex Company, Inc.",
    "currency": "USD",
    "cik": "0001069878",
    "isin": "US89531P1057",
    "cusip": "89531P105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.trex.com",
    "description": "Trex Company, Inc. manufactures and distributes decking, railing, and outdoor living products and accessories for residential and commercial markets in the United States. The company operates in two segments, Trex Residential and Trex Commercial. It offers decking products under the names Trex Transcend, Trex Select, and Trex Enhance for protection against fading, staining, mold, and scratching; Trex Hideaway, a hidden fastening system; and Trex DeckLighting, a LED dimmable deck lighting for use on posts, floors, and steps. The company also provides Trex Transcend Railing products that are used in Trex decking products and other decking materials; Trex Select Railing products for a simple clean finished look; Trex Enhance Railing system; and Trex Signature aluminum railing for a contemporary look. In addition, it offers Trex Seclusions, a fencing product that includes structural posts, bottom and top rails, pickets, and decorative post caps. In addition, it designs, engineers, and markets architectural and aluminum railing systems, and staging equipment and accessories for the commercial market, as well as sports stadiums and performing arts venues. Further, the company acts as a licensor in various licensing agreements with third parties to manufacture and sell products under the Trex name, including Trex Outdoor Furniture; Trex RainEscape, an above joist deck drainage system; Trex Pergola, a cellular PVC product; Trex Latticeworks outdoor lattice boards; Trex Cornhole boards; Diablo Trex Blade, a saw blade for wood-alternative composite decking; Trex SpiralStairs and structural steel posts; and Trex Outdoor Kitchens, Cabinetry, and Storage products. It sells its products through wholesale distributors, retail lumber dealers, and Home Depot and Lowe's stores, as well as through its direct sales staff, independent sales representatives, and bidding on projects. Trex Company, Inc. was founded in 1996 and is headquartered in Winchester, Virginia.",
    "ceo": "Mr. Bryan Horix Fairbanks",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "1636",
    "phone": "540 542 6300",
    "address": "160 Exeter Drive",
    "city": "Winchester",
    "state": "VA",
    "zip": "22603-8605",
    "dcfDiff": 4.21667,
    "dcf": 46.7833,
    "image": "https://financialmodelingprep.com/image-stock/TREX.png",
    "ipoDate": "1999-04-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]