[
  {
    "symbol": "TRGP",
    "price": 74.11,
    "beta": 2.272535,
    "volAvg": 1588312,
    "mktCap": 16750268683,
    "lastDiv": 2,
    "range": "55.56-79.7",
    "changes": 1.42,
    "companyName": "Targa Resources Corp.",
    "currency": "USD",
    "cik": "0001389170",
    "isin": "US87612G1013",
    "cusip": "87612G101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.targaresources.com",
    "description": "Targa Resources Corp., together with its subsidiary, Targa Resources Partners LP, owns, operates, acquires, and develops a portfolio of midstream energy assets in North America. The company operates in two segments, Gathering and Processing, and Logistics and Transportation. It engages in gathering, compressing, treating, processing, transporting, and selling natural gas; storing, fractionating, treating, transporting, and selling natural gas liquids (NGL) and NGL products, including services to liquefied petroleum gas exporters; and gathering, storing, terminaling, purchasing, and selling crude oil. The company is also involved in the purchase and resale of NGL products; and wholesale of propane, as well as provision of related logistics services to multi-state retailers, independent retailers, and other end-users. In addition, it offers NGL balancing services; and transportation services to refineries and petrochemical companies in the Gulf Coast area, as well as purchases, markets, and resells natural gas. The company operates approximately 28,400 miles of natural gas pipelines, including 42 owned and operated processing plants; and owns or operates a total of 34 storage wells with a gross storage capacity of approximately 76 million barrels. As of December 31, 2021, it leased and managed approximately 648 railcars; 119 transport tractors; and two company-owned pressurized NGL barges. The company was incorporated in 2005 and is headquartered in Houston, Texas.",
    "ceo": "Mr. Matthew J. Meloy",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "2850",
    "phone": "713 584 1000",
    "address": "811 Louisiana Street",
    "city": "Houston",
    "state": "TX",
    "zip": "77002",
    "dcfDiff": 4.0374,
    "dcf": 71.3126,
    "image": "https://financialmodelingprep.com/image-stock/TRGP.png",
    "ipoDate": "2010-12-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]