[
  {
    "symbol": "TRI",
    "price": 134.96,
    "beta": 0.298701,
    "volAvg": 403859,
    "mktCap": 63542948769,
    "lastDiv": 2.03,
    "range": "97.59-138.2",
    "changes": -3.17,
    "companyName": "Thomson Reuters Corporation",
    "currency": "USD",
    "cik": "0001075124",
    "isin": "CA8849037095",
    "cusip": "884903709",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Business Services",
    "website": "https://www.tr.com",
    "description": "Thomson Reuters Corporation provides business information services in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates in five segments: Legal Professionals, Corporates, Tax & Accounting Professionals, Reuters News, and Global Print. The Legal Professionals segment offers research and workflow products focusing on legal research and integrated legal workflow solutions that combine content, tools, and analytics to law firms and governments. The Corporates segment provides a suite of content-enabled technology solutions for legal, tax, regulatory, compliance, and IT professionals. The Tax & Accounting Professionals segment offers research and workflow products focusing on tax offerings and automating tax workflows to tax, accounting, and audit professionals in accounting firms. The Reuters News segment provides business, financial, and international news to media organizations, professional, and news consumers through news agency and industry events. The Global Print segment offers legal and tax information primarily in print format to legal and tax professionals, governments, law schools, and corporations. The company was formerly known as The Thomson Corporation and changed its name to Thomson Reuters Corporation in April 2008. The company was founded in 1851 and is headquartered in Toronto, Canada. Thomson Reuters Corporation is a subsidiary of The Woodbridge Company Limited.",
    "ceo": "Mr. Stephen John Hasker B.Com., M.B.A.",
    "sector": "Industrials",
    "country": "CA",
    "fullTimeEmployees": "25200",
    "phone": "14166877500",
    "address": "333 Bay Street",
    "city": "Toronto",
    "state": "ON",
    "zip": "M5H 2R2",
    "dcfDiff": 2.82785,
    "dcf": 115.202,
    "image": "https://financialmodelingprep.com/image-stock/TRI.png",
    "ipoDate": "2002-06-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]