[
  {
    "symbol": "TRMB",
    "price": 52.28,
    "beta": 1.568309,
    "volAvg": 1156683,
    "mktCap": 12952213578,
    "lastDiv": 0,
    "range": "45.43-72.24",
    "changes": 0.61,
    "companyName": "Trimble Inc.",
    "currency": "USD",
    "cik": "0000864749",
    "isin": "US8962391004",
    "cusip": "896239100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.trimble.com",
    "description": "Trimble Inc. provides technology solutions that enable professionals and field mobile workers to enhance or transform their work processes worldwide. The company's Buildings and Infrastructure segment offers field and office software for route selection and design; systems to guide and control construction equipment; software for 3D design and data sharing; systems to monitor, track, and manage assets, equipment, and workers; software to share and communicate data; program management solutions for construction owners; 3D conceptual design and modeling software; building information modeling software; enterprise resource planning, project management, and project collaboration solutions; integrated site layout and measurement systems; cost estimating, scheduling, and project controls solutions; and applications for sub-contractors and trades. Its Geospatial segment provides surveying and geospatial products, and geographic information systems. The company's Resources and Utilities segment offers precision agriculture products and services, such as guidance and positioning systems, including autonomous steering systems, automated and variable-rate application and technology systems, and information management solutions; manual and automated navigation guidance for tractors and other farm equipment; solutions to automate application of pesticide and seeding; water solutions; and agricultural software. Its Transportation segment offers solutions for long haul trucking and freight shipper markets; mobility solutions comprising route management, safety and compliance, end-to-end vehicle management, video intelligence, and supply chain communications; and fleet and transportation management systems, analytics, routing, mapping, reporting, and predictive modeling solutions. The company was formerly known as Trimble Navigation Limited and changed its name to Trimble Inc. in October 2016. Trimble Inc. was founded in 1978 and is headquartered in Sunnyvale, California.",
    "ceo": "Mr. Robert G. Painter",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "11825",
    "phone": "408 481 8000",
    "address": "935 Stewart Drive",
    "city": "Sunnyvale",
    "state": "CA",
    "zip": "94085",
    "dcfDiff": 0.290922,
    "dcf": 58.3009,
    "image": "https://financialmodelingprep.com/image-stock/TRMB.png",
    "ipoDate": "1990-07-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]