[
  {
    "symbol": "TRP",
    "price": 40.39,
    "beta": 0.884559,
    "volAvg": 1852654,
    "mktCap": 40390000000,
    "lastDiv": 2.73,
    "range": "36.79-55.5",
    "changes": -0.13,
    "companyName": "TC Energy Corporation",
    "currency": "USD",
    "cik": "0001232384",
    "isin": "CA87807B1076",
    "cusip": "87807B107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.tcenergy.com",
    "description": "TC Energy Corporation operates as an energy infrastructure company in North America. It operates through five segments: Canadian Natural Gas Pipelines; U.S. Natural Gas Pipelines; Mexico Natural Gas Pipelines; Liquids Pipelines; and Power and Storage. The company builds and operates 93,300 km network of natural gas pipelines, which transports natural gas from supply basins to local distribution companies, power generation plants, industrial facilities, interconnecting pipelines, LNG export terminals, and other businesses. It also has regulated natural gas storage facilities with a total working gas capacity of 535 billion cubic feet. In addition, it has approximately 4,900 km liquids pipeline system that connects Alberta crude oil supplies to refining markets in Illinois, Oklahoma, Texas, and the U.S. Gulf Coast. Further, the company owns or has interests in seven power generation facilities with a combined capacity of approximately 4,300 megawatts that are powered by natural gas and nuclear fuel sources located in Alberta, Ontario, Québec, and New Brunswick; and owns and operates approximately 118 billion cubic feet of non-regulated natural gas storage capacity in Alberta. The company was formerly known as TransCanada Corporation and changed its name to TC Energy Corporation in May 2019. TC Energy Corporation was incorporated in 1951 and is headquartered in Calgary, Canada.",
    "ceo": "Mr. Francois Lionel Poirier",
    "sector": "Energy",
    "country": "CA",
    "fullTimeEmployees": "7477",
    "phone": "14039202000",
    "address": "450 - 1 Street SW",
    "city": "Calgary",
    "state": "AB",
    "zip": "T2P 5H1",
    "dcfDiff": 4.78596,
    "dcf": 48.136,
    "image": "https://financialmodelingprep.com/image-stock/TRP.png",
    "ipoDate": "1982-09-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]