[
  {
    "symbol": "TRUMY",
    "price": 31.44,
    "beta": 0.462835,
    "volAvg": 39529,
    "mktCap": 23083404948,
    "lastDiv": 0.27,
    "range": "25.59-35.79",
    "changes": 0.41,
    "companyName": "Terumo Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US88156J1051",
    "cusip": "88156J105",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.terumo.co.jp",
    "description": "Terumo Corporation engages in the manufacture and sale of medical products and equipment worldwide. The company operates through three segments: Cardiac and Vascular Company, Medical Care Solutions Company, and Blood and Cell Technologies Company. The Cardiac and Vascular Company segment offers angiographic guidewires, angiographic catheters, introducer sheaths, vascular closure devices, PTCA balloon catheters, coronary stents, self-expanding peripheral stents, intravascular ultrasound systems, imaging catheters, and others; coils, stents, and intrasaccular devices for treating cerebral aneurysm; embolization systems, aspiration catheters, and clot retrievers for treating ischemic stroke and others; oxygenators, cardio-pulmonary bypass systems, and others; and artificial vascular and stent grafts. The Medical Care Solutions Company segment provides syringes, infusion pumps, syringe pumps, infusion lines, I.V. solutions, peritoneal dialysis fluids, pain management and nutritious food products, adhesion barriers, and others; blood glucose monitoring systems, disposable needles for pen-injector, insulin patch pumps, blood pressure monitors, digital thermometers, and others; and contract manufacturing of prefilled syringes, devices to pharmaceutical companies for use in drug kits, such as prefillable syringes, needles for pharmaceutical packaging business, and others. The Blood and Cell Technologies Company segment offers blood bags, component collection systems, automated blood processing systems, pathogen reduction systems, centrifugal apheresis systems, cell expansion systems, and others. The company was formerly known as Sekisen Ken-onki Corporation and changed its name to Terumo Corporation in October 1974. Terumo Corporation was incorporated in 1921 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Shinjiro  Sato",
    "sector": "Healthcare",
    "country": "JP",
    "fullTimeEmployees": "28294",
    "phone": "81 3 3374 8111",
    "address": "2-44-1, Hatagaya",
    "city": "Tokyo",
    "state": null,
    "zip": "151-0072",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TRUMY.png",
    "ipoDate": "2010-01-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]