[
  {
    "symbol": "TRYIY",
    "price": 11.01,
    "beta": 0.797318,
    "volAvg": 20688,
    "mktCap": 8811963600,
    "lastDiv": 0.25,
    "range": "9.25-12.65",
    "changes": 0.0929,
    "companyName": "Toray Industries, Inc.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Textile Manufacturing",
    "website": "https://www.toray.co.jp",
    "description": "Toray Industries, Inc., together with its subsidiaries, manufactures, processes, and sells fibers and textiles, performance chemicals, carbon fiber composite materials, environment and engineering products, and life science products in Japan, China, North America, Europe, and internationally. The company offers filament yarns, staple fibers, and spun yarns, as well as woven and knitted fabrics of nylon, polyester, acrylics, and others; non-woven fabrics; ultra-fine fibers; and apparel products. It also provides nylon, ABS, PBT, PPS, and other resins and molded products; polyolefin foam products; polyester, polyethylene, polypropylene, and other films; processed film products; raw materials for synthetic fibers and other plastics; fine chemicals; electronic and information materials; and graphic materials. In addition, the company offers carbon fibers, carbon fiber composite materials, and molded products; analysis, physical evaluation, research, and other services; and pharmaceuticals, medical devices, etc. Further, it provides engineering services; condominiums; industrial equipment and machinery; IT-related equipment; water treatment membranes and related equipment; and materials for housing, building, and civil engineering applications. The company was formerly known as Toyo Rayon Co., Ltd. and changed its name to Toray Industries, Inc. in 1970. The company was incorporated in 1926 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Akihiro  Nikkaku",
    "sector": "Consumer Cyclical",
    "country": "JP",
    "fullTimeEmployees": "48842",
    "phone": "81 3 3245 5111",
    "address": "Nihonbashi Mitsui Tower",
    "city": "Tokyo",
    "state": null,
    "zip": "103-8666",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TRYIY.png",
    "ipoDate": "2006-03-15",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]