[
  {
    "symbol": "TSCO",
    "price": 216.6,
    "beta": 0.817605,
    "volAvg": 1214848,
    "mktCap": 23732428800,
    "lastDiv": 4.12,
    "range": "181.4-251.17",
    "changes": -6.53,
    "companyName": "Tractor Supply Company",
    "currency": "USD",
    "cik": "0000916365",
    "isin": "US8923561067",
    "cusip": "892356106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Specialty Retail",
    "website": "https://www.tractorsupply.com",
    "description": "Tractor Supply Company operates as a rural lifestyle retailer in the United States. The company offers a selection of merchandise, including equine, livestock, pet, and small animal products necessary for their health, care, growth, and containment; hardware, truck, towing, and tool products; seasonal products, such as heating products, lawn and garden items, power equipment, gifts, and toys; work/recreational clothing and footwear; and maintenance products for agricultural and rural use. It provides its products under the 4health, Producer's Pride, American Farmworks, Red Shed, Bit & Bridle, Redstone, Blue Mountain, Retriever, C.E. Schmidt, Ridgecut, Countyline, Royal Wing, Dumor, Strive, Groundwork, Traveller, Huskee, Treeline, JobSmart, TSC Tractor Supply Co, Paws & Claws, and Untamed brands. As of June 25, 2022, it operated 2,016 Tractor Supply stores in 49 states; and 178 Petsense stores in 23 states. The company operates its retail stores under the Tractor Supply Company, Del's Feed & Farm Supply, and Petsense names; and operates websites under the TractorSupply.com and Petsense.com names. It sells its products to recreational farmers, ranchers, and others. The company was founded in 1938 and is based in Brentwood, Tennessee.",
    "ceo": "Mr. Harry A. Lawton III",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "24000",
    "phone": "615 440 4000",
    "address": "5401 Virginia Way",
    "city": "Brentwood",
    "state": "TN",
    "zip": "37027",
    "dcfDiff": 2.24667,
    "dcf": 227.917,
    "image": "https://financialmodelingprep.com/image-stock/TSCO.png",
    "ipoDate": "1994-02-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]