[
  {
    "symbol": "TSYHY",
    "price": 16.985,
    "beta": 0.630268,
    "volAvg": 2003,
    "mktCap": 4970167549,
    "lastDiv": 0.08,
    "range": "14.0-23.53",
    "changes": -0.028,
    "companyName": "TravelSky Technology Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Information Technology Services",
    "website": "https://www.travelskyir.com",
    "description": "TravelSky Technology Limited, together with its subsidiaries, provides information technology solutions for aviation and travel industry in the People's Republic of China. It primarily offers aviation information technology (AIT), distribution information technology, accounting, settlement, and clearing services. The company's AIT services consist of electronic travel distribution services, including inventory control system, computer reservation system, and airport passenger processing system services, as well as other related information technology solutions. It also provides cargo management services, as well as sells and installs related information systems; computer hardware and software development, and data network services; and computer system engineering design and installation services. In addition, the company engages in technology development, support, and transfer services; sales of computers, software, and auxiliary equipment; contracting of computer software and hardware engineering projects; technical consultation and service; system integration; real estate development and sales; self-developed commercial housing contracting; labor service subcontracting; freight management services; and trade financing services. TravelSky Technology Limited was founded in 1979 and is based in Beijing, the People's Republic of China.",
    "ceo": "Mr. Rongshun  Huang",
    "sector": "Technology",
    "country": "CN",
    "fullTimeEmployees": "6570",
    "phone": "86 10 5765 0696",
    "address": "TravelSky High-Tech Industrial Park",
    "city": "Beijing",
    "state": null,
    "zip": "101308",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TSYHY.png",
    "ipoDate": "2013-01-07",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]