[
  {
    "symbol": "TT",
    "price": 186.74,
    "beta": 1.184507,
    "volAvg": 1608425,
    "mktCap": 42586430480,
    "lastDiv": 3,
    "range": "125.26-196.22",
    "changes": -1.6,
    "companyName": "Trane Technologies plc",
    "currency": "USD",
    "cik": "0001466258",
    "isin": "IE00BK9ZQ967",
    "cusip": "G8994E103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.tranetechnologies.com",
    "description": "Trane Technologies plc, together with its subsidiaries, engages in the designing, manufacturing, selling, and servicing of solutions for heating, ventilation, air conditioning, and transport refrigeration. It offers air conditioners, exchangers, and handlers; airside and terminal devices; auxiliary power units; chillers; coils and condensers; gensets; furnaces; heat pumps; home automation products; humidifiers; hybrid and non-diesel transport refrigeration, and ice energy storage solutions; indoor air quality assessments and related products; large and light commercial unitary products; motor replacements; refrigerant reclamation products; thermostats/controls; transport heater products; variable refrigerant flow products; and water source heat pumps. The company also provides building management, control, ductless, geothermal, package heating and cooling, temporary heating and cooling, and unitary systems; bus, rail, and multi-pipe heating, ventilation, and air conditioning systems; and container, cryogenic, diesel-powered, electric-powered trailer and truck, hybrid-powered trailer, industrial, rail, self-powered truck, trailer, and vehicle-powered truck refrigeration systems, as well as aftermarket and OEM parts and supplies. In addition, it offers energy and facility management, installation and performance contracting, repair and maintenance, and rental services. It markets and sells its products under the Trane and Thermo King brands through sales offices, distributors, and dealers in the United States; and through sales and service companies with a supporting chain of distributors worldwide. The company was formerly known as Ingersoll-Rand Plc and changed its name to Trane Technologies plc in March 2020. Trane Technologies plc was founded in 1885 and is headquartered in Swords, Ireland.",
    "ceo": "Mr. David S. Regnery",
    "sector": "Industrials",
    "country": "IE",
    "fullTimeEmployees": "39000",
    "phone": "353 1 870 7400",
    "address": "170/175 Lakeview Drive",
    "city": "Swords",
    "state": null,
    "zip": null,
    "dcfDiff": 8.07194,
    "dcf": 185.102,
    "image": "https://financialmodelingprep.com/image-stock/TT.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]