[
  {
    "symbol": "TTC",
    "price": 100.03,
    "beta": 0.727112,
    "volAvg": 516774,
    "mktCap": 10393717180,
    "lastDiv": 1.36,
    "range": "74.67-117.66",
    "changes": -0.32,
    "companyName": "The Toro Company",
    "currency": "USD",
    "cik": "0000737758",
    "isin": "US8910921084",
    "cusip": "891092108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Tools & Accessories",
    "website": "https://www.thetorocompany.com",
    "description": "The Toro Company engages in the designing, manufacturing, marketing, and selling professional and residential equipment worldwide. The company's Professional segment offers turf and landscape equipment products, including sports fields and grounds mowing and maintenance equipment, golf course mowing and maintenance equipment, landscape contractor mowing equipment, landscape creation and renovation equipment, and other maintenance equipment; rental, specialty, and underground construction equipment; and snow and ice management equipment, such as snowplows, brush, snow thrower attachment, salt and sand spreaders, and related parts and accessories for light and medium duty trucks, utility task vehicles, skid steers, and front-end loaders. It also provides irrigation and lighting products that consist of sprinkler heads, electric and hydraulic valves, controllers, computer irrigation central control systems, coupling systems, and ag-irrigation drip tape and hose products, as well as professionally installed landscape lighting products offered through distributors and landscape contractors. This segment sells its products primarily through a network of distributors and dealers to professional users engaged in maintaining golf courses, sports fields, municipal properties, agricultural fields, residential and commercial landscapes, and removing snow and ice, as well as directly to government customers, rental companies, and retailers. Its Residential segment provides walk power mowers, zero-turn riding mowers, snow throwers, replacement parts, and home solution products that include grass and hedge trimmers, leaf blowers, blower-vacuums, chainsaws, string trimmers, hoses, and hose-end retail irrigation products. This segment sells its products to homeowners through a network of distributors and dealers; and home centers, hardware retailers, and mass retailers, as well as online. The Toro Company was founded in 1914 and is headquartered in Bloomington, Minnesota.",
    "ceo": "Mr. Richard M. Olson",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "11287",
    "phone": "952 888 8801",
    "address": "8111 Lyndale Avenue South",
    "city": "Bloomington",
    "state": "MN",
    "zip": "55420-1196",
    "dcfDiff": 5.95929,
    "dcf": 115.739,
    "image": "https://financialmodelingprep.com/image-stock/TTC.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]