[
  {
    "symbol": "TTDKY",
    "price": 38.18,
    "beta": 0.962452,
    "volAvg": 8114,
    "mktCap": 14480986149,
    "lastDiv": 0.76,
    "range": "27.09-40.96",
    "changes": 0.5199,
    "companyName": "TDK Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US8723514084",
    "cusip": "872351408",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Electronic Components",
    "website": "https://www.jp.tdk.com",
    "description": "TDK Corporation, together with its subsidiaries, engages in manufacture and sale of electronic components in Japan, Europe, China, Asia, the Americas, and internationally. The company operates through four segments: Passive Components, Sensor Application Products, Magnetic Application Products, Energy Application Products, and Other segments. The Passive Components segment offers ceramic capacitors, aluminum electrolytic capacitors, film capacitors, inductive devices, ferrite cores, transformers, high-frequency devices, piezoelectric materials, and circuit protection components. The Sensor Application Products segment provides temperature and pressure, magnetic, and MEMS sensors. The Magnetic Application Products segment offers hard disk drives (HDD) heads, HDD suspension assemblies, and magnets. The Energy Application Products segment provides energy devices, such as rechargeable batteries and power supplies. The Other segment provides mechatronics production equipment and camera module micro actuators for smartphones and other products. The company was formerly known as Tokyo Denki Kagaku Kogyo K.K. and changed its name to TDK Corporation in 1983. TDK Corporation was founded in 1935 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Noboru  Saito",
    "sector": "Technology",
    "country": "JP",
    "fullTimeEmployees": "102908",
    "phone": "81 3 6778 1000",
    "address": "Nihonbashi Takashimaya Mitsui Building",
    "city": "Tokyo",
    "state": null,
    "zip": "103-6128",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TTDKY.png",
    "ipoDate": "1982-04-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]