[
  {
    "symbol": "TTE",
    "price": 56.62,
    "beta": 0.941379,
    "volAvg": 1430122,
    "mktCap": 137220267694,
    "lastDiv": 2.85,
    "range": "44.61-65.05",
    "changes": -0.11,
    "companyName": "TotalEnergies SE",
    "currency": "USD",
    "cik": "0000879764",
    "isin": "US89151E1091",
    "cusip": "89151E109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.totalenergies.com",
    "description": "TotalEnergies SE operates as an integrated oil and gas company worldwide. The company operates through four segments: Integrated Gas, Renewables & Power; Exploration & Production; Refining & Chemicals; and Marketing & Services. The Integrated Gas, Renewables & Power segment engages in the liquefied natural gas production, shipping, trading, and regasification activities; trading of liquefied petroleum gas (LPG), petcoke and sulfur, natural gas, and electricity; transportation of natural gas; electricity production from natural gas, wind, solar, hydroelectric, and biogas sources; energy storage activities; and development and operation of biomethane production units, as well as provides energy efficiency services. The Exploration & Production segment is involved in the oil and natural gas exploration and production activities. The Refining & Chemicals segment engages in refining petrochemicals, including olefins and aromatics; and polymer derivatives, such as polyethylene, polypropylene, polystyrene, and hydrocarbon resins, as well as biomass conversion and elastomer processing. This segment is also involved in trading and shipping crude oil and petroleum products. The Marketing & Services segment produces and sells lubricants; supplies and markets petroleum products, including bulk fuel, aviation and marine fuel, special fluids, compressed natural gas, LPG, and bitumen; and provides fuel payment solutions. It operates approximately 16,000 service stations and 25,000 EV charge points. As of December 31, 2021, the company had 12,062 Mboe of combined proved reserves of oil and gas. TotalEnergies SE has strategic partnerships with PureCycle Technologies, Plastic Energy, Freepoint Eco-Systems, and Plastic Omnium for various development projects. The company was formerly known as TOTAL SE and changed its name to TotalEnergies SE in June 2021. TotalEnergies SE was incorporated in 1924 and is headquartered in Courbevoie, France.",
    "ceo": "Mr. Patrick  Pouyanné",
    "sector": "Energy",
    "country": "FR",
    "fullTimeEmployees": "101279",
    "phone": "33 01 47 44 45 46",
    "address": "2, place Jean Millier",
    "city": "Courbevoie",
    "state": null,
    "zip": "92400",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TTE.png",
    "ipoDate": "1991-10-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]