[
  {
    "symbol": "TTEK",
    "price": 160.78,
    "beta": 0.958098,
    "volAvg": 294116,
    "mktCap": 8558239010,
    "lastDiv": 1.04,
    "range": "122.86-169.67",
    "changes": -1.67,
    "companyName": "Tetra Tech, Inc.",
    "currency": "USD",
    "cik": "0000831641",
    "isin": "US88162G1031",
    "cusip": "88162G103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Engineering & Construction",
    "website": "https://www.tetratech.com",
    "description": "Tetra Tech, Inc. provides consulting and engineering services worldwide. The company operates through two segments Government Services Group (GSG) and Commercial/International Services Group (CIG). The GSG segment offers early data collection and monitoring, data analysis and information management, science and engineering applied research, engineering design, project management, and operations and maintenance services; and climate change and energy management consulting, as well as greenhouse gas inventory assessment, certification, reduction, and management services. This segment serves federal, state, and local governments, and development agencies in water resources analysis and water management, environmental monitoring, data analytics, government consulting, waste management, and a range of civil infrastructure master planning and engineering design markets. The CIG segment provides early data collection and monitoring, data analysis and information management, feasibility studies and assessments, science and engineering applied research, engineering design, project management, and operations and maintenance services. This segment serves natural resources, energy, and utilities markets, as well as sustainable infrastructure master planning and engineering design markets. Tetra Tech, Inc. was founded in 1966 and is headquartered in Pasadena, California.",
    "ceo": "Mr. Dan L. Batrack",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "27000",
    "phone": "626 351 4664",
    "address": "3475 East Foothill Boulevard",
    "city": "Pasadena",
    "state": "CA",
    "zip": "91107-6024",
    "dcfDiff": 5.00651,
    "dcf": 158.887,
    "image": "https://financialmodelingprep.com/image-stock/TTEK.png",
    "ipoDate": "1991-12-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]