[
  {
    "symbol": "TTWO",
    "price": 145.98,
    "beta": 0.680985,
    "volAvg": 1734250,
    "mktCap": 24719377320,
    "lastDiv": 0.001,
    "range": "90.0-149.04",
    "changes": -0.36,
    "companyName": "Take-Two Interactive Software, Inc.",
    "currency": "USD",
    "cik": "0000946581",
    "isin": "US8740541094",
    "cusip": "874054109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Electronic Gaming & Multimedia",
    "website": "https://www.take2games.com",
    "description": "Take-Two Interactive Software, Inc. develops, publishes, and markets interactive entertainment solutions for consumers worldwide. The company offers its products under the Rockstar Games, 2K, Private Division, and T2 Mobile Games names. It develops and publishes action/adventure products under the Grand Theft Auto, Max Payne, Midnight Club, and Red Dead Redemption names; and offers episodes and content, as well as develops brands in other genres, including the LA Noire, Bully, and Manhunt franchises. The company also publishes various entertainment properties across various platforms and a range of genres, such as shooter, action, role-playing, strategy, sports, and family/casual entertainment under the BioShock, Mafia, Sid Meier's Civilization, XCOM series, and Borderlands. In addition, it publishes sports simulation titles comprising NBA 2K series, a basketball video game; the WWE 2K professional wrestling series; and PGA TOUR 2K. Further, the company offers Kerbal Space Program, OlliOlli World, and The Outer Worlds and Ancestors: the Humankind Odyssey under Private Division; and free-to-play mobile games, such as Dragon City, Monster Legends, Two Dots, and Top Eleven. Its products are designed for console gaming systems, including PlayStation 4 and PlayStation 5; Xbox One; the Nintendo's Switch; personal computers; and mobile comprising smartphones and tablets. The company provides its products through physical retail, digital download, online platforms, and cloud streaming services. Take-Two Interactive Software, Inc. was incorporated in 1993 and is based in New York, New York.",
    "ceo": "Mr. Strauss H. Zelnick Esq., J.D.",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "11580",
    "phone": "646 536 2842",
    "address": "110 West 44th Street",
    "city": "New York",
    "state": "NY",
    "zip": "10036",
    "dcfDiff": 4.66516,
    "dcf": 109.615,
    "image": "https://financialmodelingprep.com/image-stock/TTWO.png",
    "ipoDate": "1997-04-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]