[
  {
    "symbol": "TU",
    "price": 19.24,
    "beta": 0.706108,
    "volAvg": 1422227,
    "mktCap": 27840281231,
    "lastDiv": 1.08,
    "range": "18.85-23.68",
    "changes": 0.11,
    "companyName": "TELUS Corporation",
    "currency": "USD",
    "cik": "0000868675",
    "isin": "CA87971M1032",
    "cusip": "87971M103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.telus.com",
    "description": "TELUS Corporation, together with its subsidiaries, provides a range of telecommunications and information technology products and services in Canada. It operates through Technology Solutions and Digitally-Led Customer Experiences segments. The Technology Solutions segment offers a range of telecommunications products and services; network revenue; mobile technologies equipment sale; data revenues, such as internet protocol; television; hosting, managed information technology, and cloud-based services; software, data management, and data analytics-driven smart food-chain technologies; home and business security; healthcare software and technology solutions; and voice and other telecommunications services. The Digitally-Led Customer Experiences segment provides digital customer experience and digital-enablement transformation solutions, including artificial intelligence and content management solutions. It has 16.9 million subscriber connections, which include 9.3 million mobile phone subscribers; 2.1 million connected device subscribers; 2.3 million internet subscribers; 1.1 million residential voice subscribers; 1.3 million TV subscribers; and 804,000 security subscribers. The company was formerly known as TELUS Communications Inc. and changed its name to TELUS Corporation in February 2005. TELUS Corporation was incorporated in 1998 and is headquartered in Vancouver, Canada.",
    "ceo": "Mr. Darren  Entwistle B.A., LL.D., M.B.A.",
    "sector": "Communication Services",
    "country": "CA",
    "fullTimeEmployees": "108500",
    "phone": "16046978044",
    "address": "510 West Georgia Street",
    "city": "Vancouver",
    "state": "BC",
    "zip": "V6B 0M3",
    "dcfDiff": 0.24,
    "dcf": 21.58,
    "image": "https://financialmodelingprep.com/image-stock/TU.png",
    "ipoDate": "1996-06-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]