[
  {
    "symbol": "TV",
    "price": 5.21,
    "beta": 0.95,
    "volAvg": 1782125,
    "mktCap": 2902152392,
    "lastDiv": 0.1,
    "range": "4.38-8.72",
    "changes": -0.06,
    "companyName": "Grupo Televisa, S.A.B.",
    "currency": "USD",
    "cik": "0000912892",
    "isin": "US40049J2069",
    "cusip": "40049J206",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.televisa.com",
    "description": "Grupo Televisa, S.A.B. operates as a media company in the Spanish-speaking world. It operates in four segments: Cable, Sky, Content, and Other Businesses. The Cable segment operates cable multiple system and telecommunication facilities; provides basic and premium television subscription, pay-per-view, installation, Internet subscription, and telephone and mobile services subscription, as well as local and national advertising sales; and offers data and long-distance services solutions to carriers and other telecommunications service providers through its fiber-optic network. The Sky segment offers direct-to-home broadcast satellite pay television services comprising program, installation, and equipment rental services to subscribers in Mexico, Central America, and the Dominican Republic; and national advertising sales. The Content segment produces television programming and broadcasts Channels 2, 4, 5, and 9; sells advertising time on programs; provides Internet services; and produces television programming and broadcasting for local television stations in Mexico. This segment also offers programming services for cable and pay-per-view television companies in Mexico, other countries in Latin America, the United States, and Europe; and licenses and syndicates television programming. The Other Businesses segment is involved in sports and show business promotion, soccer, feature film production and distribution, gaming, publishing, and publishing distribution businesses. The company was founded in 1969 and is headquartered in Mexico City, Mexico.",
    "ceo": "Mr. Alfonso  de Angoitia Noriega",
    "sector": "Communication Services",
    "country": "MX",
    "fullTimeEmployees": "36807",
    "phone": "52 55 5261 2000",
    "address": "Av. Vasco de Quiroga No. 2000",
    "city": "Mexico City",
    "state": "DF",
    "zip": "01210",
    "dcfDiff": 45.2477,
    "dcf": 51.2377,
    "image": "https://financialmodelingprep.com/image-stock/TV.png",
    "ipoDate": "1993-12-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]