[
  {
    "symbol": "TW",
    "price": 68.46,
    "beta": 0.962554,
    "volAvg": 909198,
    "mktCap": 16070233309,
    "lastDiv": 0.36,
    "range": "51.47-79.98",
    "changes": -0.31,
    "companyName": "Tradeweb Markets Inc.",
    "currency": "USD",
    "cik": "0001758730",
    "isin": "US8926721064",
    "cusip": "892672106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Capital Markets",
    "website": "https://www.tradeweb.com",
    "description": "Tradeweb Markets Inc. builds and operates electronic marketplaces in the Americas, Europe, the Middle East, Africa, Asia Pacific, and internationally. The company's marketplaces facilitate trading in a range of asset classes, including rates, credit, money markets, and equities. It offers pre-trade data and analytics, trade execution, and trade processing, as well as post-trade data, analytics, and reporting services. The company provides flexible order and trading systems to institutional investors in 45 markets across 25 currencies. It also offers a range of electronic, voice, and hybrid platforms to approximately 300 dealers and financial institutions on electronic or hybrid markets with Dealerweb platform; and trading solutions for financial advisory firms and traders with Tradeweb Direct platform. The company serves a network of approximately 2,500 clients in the institutional, wholesale, and retail client sectors. Its customers include asset managers, hedge funds, insurance companies, central banks, banks and dealers, proprietary trading firms, retail brokerage and financial advisory firms, and regional dealers. Tradeweb Markets Inc. was founded in 1996 and is headquartered in New York, New York. Tradeweb Markets Inc. is a subsidiary of Refinitiv Parent Limited.",
    "ceo": "Mr. William E. Hult",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1091",
    "phone": "646 430 6000",
    "address": "1177 Avenue of the Americas",
    "city": "New York",
    "state": "NY",
    "zip": "10036",
    "dcfDiff": 12.9557,
    "dcf": 63.0243,
    "image": "https://financialmodelingprep.com/image-stock/TW.png",
    "ipoDate": "2019-04-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]