[
  {
    "symbol": "TWKS",
    "price": 7.52,
    "beta": 0,
    "volAvg": 1144922,
    "mktCap": 2385704960,
    "lastDiv": 0,
    "range": "5.93-17.44",
    "changes": 0.03,
    "companyName": "Thoughtworks Holding, Inc.",
    "currency": "USD",
    "cik": "0001866550",
    "isin": "US88546E1055",
    "cusip": "88546E105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Information Technology Services",
    "website": "https://www.thoughtworks.com",
    "description": "Thoughtworks Holding, Inc. provides technology consultancy services in North America, the Asia Pacific, Europe, and Latin America. The company's consultancy services integrate strategy, design, and software engineering to enable enterprises and technology disruptors to thrive as modern digital businesses. It offers enterprise modernization, platforms, and cloud services, including modernization strategy and execution, digital platform strategy and engineering organization transformation, cloud modernization, cloud-native application support and evolution, and platform assessment and remediation; and customer experience, product, and design services comprising idea to market, customer experience strategy, product management transformation, and product design and delivery. The company also provides data and artificial intelligence services, such as data strategy, intelligent products, data platforms and data mesh, continuous delivery for machine learning, and data governance; and digital transformation and operations services, which include delivery transformation, digital fluency, organization transformation, value-driven portfolio management, technology strategy, executive advisory, and digital foundations training. It serves its clients in various industry verticals, including technology and business services; energy, public, and health services; retail and consumer; financial services and insurance; and automotive, travel, and transportation. The company was founded in 1993 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Xiao  Guo",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "11840",
    "phone": "312 373 1000",
    "address": "200 East Randolph Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60601",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/TWKS.png",
    "ipoDate": "2021-09-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]