[
  {
    "symbol": "TXG",
    "price": 57.26,
    "beta": 1.750241,
    "volAvg": 920922,
    "mktCap": 6653153748,
    "lastDiv": 0,
    "range": "23.81-59.561",
    "changes": 2.66,
    "companyName": "10x Genomics, Inc.",
    "currency": "USD",
    "cik": "0001770787",
    "isin": "US88025U1097",
    "cusip": "88025U109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Health Information Services",
    "website": "https://www.10xgenomics.com",
    "description": "10x Genomics, Inc., a life science technology company, develops and sells instruments, consumables, and software for analyzing biological systems in North America, Europe, the Middle East, Africa, China, and the Asia Pacific. The company provides chromium and chromium connect instruments, microfluidic chips, slides, reagents, and other consumables products. Its single cell solutions runs on its chromium instruments, which include single cell gene expression for measuring gene activity on a cell-by-cell basis; single cell immune profiling for measuring the activity of immune cells and their targets; single cell Assay for Transposase Accessible Chromati (ATAC) for measuring epigenetics comprising the physical organization of DNA; and single cell multiome ATAC + gene expression for measuring the genetic activity and epigenetic programming in the same cells across tens of thousands of cells in a single experiment. The company also provides visium spatial gene expression solution for measuring spatial gene expression patterns across a single tissue sample or gene expression and protein co-detection when combined with immunofluorescence. It serves various academic, government, biopharmaceutical, biotechnology, and other institutions. The company was formerly known as 10X Technologies, Inc. and changed its name to 10x Genomics, Inc. in November 2014. 10x Genomics, Inc. was incorporated in 2012 and is headquartered in Pleasanton, California.",
    "ceo": "Dr. Serge  Saxonov Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "1243",
    "phone": "925 401 7300",
    "address": "6230 Stoneridge Mall Road",
    "city": "Pleasanton",
    "state": "CA",
    "zip": "94588-3260",
    "dcfDiff": 7.54241,
    "dcf": 41.1076,
    "image": "https://financialmodelingprep.com/image-stock/TXG.png",
    "ipoDate": "2019-09-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]