[
  {
    "symbol": "TXN",
    "price": 174.96,
    "beta": 1.015492,
    "volAvg": 4985101,
    "mktCap": 158803146639,
    "lastDiv": 4.96,
    "range": "144.46-186.3",
    "changes": -1.35,
    "companyName": "Texas Instruments Incorporated",
    "currency": "USD",
    "cik": "0000097476",
    "isin": "US8825081040",
    "cusip": "882508104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.ti.com",
    "description": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers worldwide. It operates in two segments, Analog and Embedded Processing. The Analog segment offers power products to manage power requirements in various levels using battery-management solutions, DC/DC switching regulators, AC/DC and isolated controllers and converters, power switches, linear regulators, voltage supervisors, voltage references, and lighting products. This segment also provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control for use in end markets, including amplifiers, data converters, interface products, motor drives, clocks, and sensing products. The Embedded Processing segment offers microcontrollers that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, personal electronics, communications equipment, enterprise systems, and calculators and other. The company also provides DLP products primarily for use in projectors to create high-definition images; calculators; and application-specific integrated circuits. It markets and sells its semiconductor products through direct sales and distributors, as well as through its website. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Haviv  Ilan",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "33000",
    "phone": "214 479 3773",
    "address": "12500 TI Boulevard",
    "city": "Dallas",
    "state": "TX",
    "zip": "75243",
    "dcfDiff": 2.12356,
    "dcf": 177.364,
    "image": "https://financialmodelingprep.com/image-stock/TXN.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]