[
  {
    "symbol": "TXT",
    "price": 66.44,
    "beta": 1.479577,
    "volAvg": 1301580,
    "mktCap": 13399619200,
    "lastDiv": 0.08,
    "range": "57.96-76.11",
    "changes": -0.02,
    "companyName": "Textron Inc.",
    "currency": "USD",
    "cik": "0000217346",
    "isin": "US8832031012",
    "cusip": "883203101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.textron.com",
    "description": "Textron Inc. operates in the aircraft, defense, industrial, and finance businesses. The company's Textron Aviation segment manufactures, sells, and services business jets, turboprop and piston engine aircraft, and military trainer and defense aircraft; and offers maintenance, inspection, and repair services, as well as sells commercial parts. Its Bell segment supplies military and commercial helicopters, tiltrotor aircrafts, and related spare parts and services. The company's Textron Systems segment offers unmanned aircraft systems, electronic systems and solutions, advanced marine crafts, piston aircraft engines, live military air-to-air and air-to-ship training, weapons and related components, and armored and specialty vehicles. Its Industrial segment offers blow-molded plastic fuel systems, including conventional plastic fuel tanks and pressurized fuel tanks for hybrid vehicle applications, clear-vision systems, and plastic tanks for catalytic reduction systems primarily to automobile original equipment manufacturers; and golf cars, off-road utility vehicles, recreational side-by-side and all-terrain vehicles, snowmobiles, light transportation vehicles, aviation ground support equipment, professional turf-maintenance equipment, and turf-care vehicles to golf courses and resorts, government agencies and municipalities, consumers, outdoor enthusiasts, and commercial and industrial users. The company's Finance segment provides financing services to purchase new and pre-owned aircraft and bell helicopters. It serves in the United States, Europe, Asia, Australia, and internationally. Textron Inc. was founded in 1923 and is headquartered in Providence, Rhode Island.",
    "ceo": "Mr. Scott C. Donnelly",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "34000",
    "phone": "401 421 2800",
    "address": "40 Westminster Street",
    "city": "Providence",
    "state": "RI",
    "zip": "02903",
    "dcfDiff": 7.60071,
    "dcf": 79.8807,
    "image": "https://financialmodelingprep.com/image-stock/TXT.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]