[
  {
    "symbol": "UAA",
    "price": 7.13,
    "beta": 1.61514,
    "volAvg": 6772027,
    "mktCap": 3053258631,
    "lastDiv": 0,
    "range": "6.38-13.05",
    "changes": -0.16,
    "companyName": "Under Armour, Inc.",
    "currency": "USD",
    "cik": "0001336917",
    "isin": "US9043111072",
    "cusip": "904311107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Apparel Manufacturing",
    "website": "https://www.underarmour.com",
    "description": "Under Armour, Inc., together with its subsidiaries, engages in the developing, marketing, and distributing performance apparel, footwear, and accessories for men, women, and youth. The company offers its apparel in compression, fitted, and loose fit types. It also provides footwear products for running, training, basketball, cleated sports, recovery, and outdoor applications. In addition, the company offers accessories, which include gloves, bags, headwear, and sports masks; and digital subscription and advertising services under the MapMyRun and MapMyRide platforms. It primarily offers its products under the UNDER ARMOUR, UA, HEATGEAR, COLDGEAR, HOVR, PROTECT THIS HOUSE, I WILL, UA Logo, ARMOUR FLEECE, and ARMOUR BRA brands. The company sells its products through wholesale channels, including national and regional sporting goods chains, independent and specialty retailers, department store chains, mono-branded Under Armour retail stores, institutional athletic departments, and leagues and teams, as well as independent distributors; and directly to consumers through a network of 422 brand and factory house stores, as well as through e-commerce websites. It operates in the United States, Canada, Europe, the Middle East, Africa, the Asia-Pacific, and Latin America. Under Armour, Inc. was incorporated in 1996 and is headquartered in Baltimore, Maryland.",
    "ceo": "Ms. Stephanie Coleman Linnartz",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "7600",
    "phone": "410 468 2512",
    "address": "1020 Hull Street",
    "city": "Baltimore",
    "state": "MD",
    "zip": "21230-2080",
    "dcfDiff": 0.546489,
    "dcf": 12.7465,
    "image": "https://financialmodelingprep.com/image-stock/UAA.png",
    "ipoDate": "2005-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]