[
  {
    "symbol": "UBER",
    "price": 44.24,
    "beta": 1.190119,
    "volAvg": 23880833,
    "mktCap": 89534239908,
    "lastDiv": 0,
    "range": "19.895-45.24",
    "changes": 0.41,
    "companyName": "Uber Technologies, Inc.",
    "currency": "USD",
    "cik": "0001543151",
    "isin": "US90353T1007",
    "cusip": "90353T100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.uber.com",
    "description": "Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. It connects consumers with independent providers of ride services for ridesharing services; and connects riders and other consumers with restaurants, grocers, and other stores with delivery service providers for meal preparation, grocery, and other delivery services. The company operates through three segments: Mobility, Delivery, and Freight. The Mobility segment provides products that connect consumers with mobility drivers who provide rides in a range of vehicles, such as cars, auto rickshaws, motorbikes, minibuses, or taxis. It also offers financial partnerships, transit, and vehicle solutions offerings. The Delivery segment allows consumers to search for and discover local restaurants, order a meal, and either pick-up at the restaurant or have the meal delivered; and offers grocery, alcohol, and convenience store delivery, as well as select other goods. The Freight segment connects carriers with shippers on the company's platform and enable carriers upfront, transparent pricing, and the ability to book a shipment, as well as transportation management and other logistics services offerings. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Dara  Khosrowshahi",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "32700",
    "phone": "415 612 8582",
    "address": "1515 3rd Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94158",
    "dcfDiff": 0.340142,
    "dcf": 30.7001,
    "image": "https://financialmodelingprep.com/image-stock/UBER.png",
    "ipoDate": "2019-05-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]