[
  {
    "symbol": "UBS",
    "price": 19.83,
    "beta": 1.070498,
    "volAvg": 3547375,
    "mktCap": 64057045079,
    "lastDiv": 0.55,
    "range": "13.8-22.298",
    "changes": -0.05,
    "companyName": "UBS Group AG",
    "currency": "USD",
    "cik": "0001610520",
    "isin": "CH0244767585",
    "cusip": "H42097107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.ubs.com",
    "description": "UBS Group AG provides financial advice and solutions to private, institutional, and corporate clients worldwide. It operates through four divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management, and Investment Bank. The Global Wealth Management division offers investment advice and solutions, and lending solutions to ultra high net worth and high net worth clients. This segment also provides estate and wealth planning, investing, philanthropy, corporate and banking, and family advisory services, as well as mortgage, securities-based, and structured lending solutions. The Personal & Corporate Banking division provides personal banking products and services, such as deposits, cards, and online and mobile banking, as well as lending, investments, and retirement services; and corporate and institutional solutions, including equity and debt capital markets, syndicated and structured credit, private placements, leasing, traditional financing, trade and export finance, and global custody solutions, as well as transaction banking solutions for payment and cash management. The Asset Management division offers equities, fixed income, hedge funds, real estate and private markets, indexed and alternative beta strategies, asset allocation and currency investment strategies, customized multi-asset solutions, advisory and fiduciary services, and multi-manager hedge fund solutions and advisory services. The Investment Bank division advises clients on strategic business opportunities and helps them raise capital to fund their activities; enables its clients to buy, sell, and finance securities on capital markets and to manage their risks and liquidity; and offers clients differentiated content on major financial markets and securities. The company was formerly known as UBS AG and changed its name to UBS Group AG in December 2014. UBS Group AG was founded in 1862 and is based in Zurich, Switzerland.",
    "ceo": "Mr. Sergio P. Ermotti",
    "sector": "Financial Services",
    "country": "CH",
    "fullTimeEmployees": "73814",
    "phone": "41 44 234 11 11",
    "address": "Bahnhofstrasse 45",
    "city": "Zurich",
    "state": null,
    "zip": "8001",
    "dcfDiff": 48.9039,
    "dcf": 70.3439,
    "image": "https://financialmodelingprep.com/image-stock/UBS.png",
    "ipoDate": "2000-05-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]