[
  {
    "symbol": "UBSI",
    "price": 29.58,
    "beta": 1.044366,
    "volAvg": 813598,
    "mktCap": 3991347720,
    "lastDiv": 1.44,
    "range": "27.68-44.15",
    "changes": -0.42,
    "companyName": "United Bankshares, Inc.",
    "currency": "USD",
    "cik": "0000729986",
    "isin": "US9099071071",
    "cusip": "909907107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.ubsi-inc.com",
    "description": "United Bankshares, Inc., a financial holding company, primarily provides commercial and retail banking products and services in the United States. It operates through two segments, Community Banking and Mortgage Banking. The company accepts checking, savings, and time and money market accounts; individual retirement accounts; and demand deposits, statement and special savings, NOW accounts, and interest-bearing checking accounts. Its loan products include commercial loans and leases; construction and real estate loans; personal, student, credit card, commercial, and floor plan loans; and home equity loans. In addition, the company provides credit cards; safe deposit boxes, wire transfers, and other banking products and services; investment and security services; services to correspondent banks, including buying and selling federal funds; automated teller machine services; and internet and telephone banking services. Further, it offers community banking services, such as asset management, real property title insurance, financial planning, mortgage banking, and brokerage services. As of December 31, 2021, the company operated 250 offices in Virginia, Maryland, Washington, D.C., North Carolina, South Carolina, Georgia, Pennsylvania, West Virginia, and Ohio. United Bankshares, Inc. was incorporated in 1982 and is headquartered in Charleston, West Virginia.",
    "ceo": "Mr. Richard Matthew Adams Jr., M.D.",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2836",
    "phone": "304 424 8716",
    "address": "300 United Center",
    "city": "Charleston",
    "state": "WV",
    "zip": "25301",
    "dcfDiff": 35.2197,
    "dcf": 74.5897,
    "image": "https://financialmodelingprep.com/image-stock/UBSI.png",
    "ipoDate": "1987-06-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]