[
  {
    "symbol": "UFPI",
    "price": 95.17,
    "beta": 1.47183,
    "volAvg": 328369,
    "mktCap": 5909638252,
    "lastDiv": 1,
    "range": "66.0-99.4",
    "changes": 0.77,
    "companyName": "UFP Industries, Inc.",
    "currency": "USD",
    "cik": "0000912767",
    "isin": "US90278Q1085",
    "cusip": "90278Q108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Lumber & Wood Production",
    "website": "https://www.ufpi.com",
    "description": "UFP Industries, Inc., through its subsidiaries, designs, manufactures, and markets wood and wood-alternative products in North America, Europe, Asia, and Australia. It operates through Retail, Industrial, and Construction segments. The Retail segment offers preserved and unpreserved dimensional lumber; and outdoor living products, including wood and wood composite decking and related accessories, decorative lawn, garden, craft, and hobby products. This segment serves national home center retailers, and retail-oriented regional and contractor-oriented lumberyards under the ProWood, ProWood FR, Deckorators, UFP-Edge, Outdoor Essentials, Dimensions, and Handprint trademarks. The Industrial segment provides pallets, specialty crates, wooden boxes, and other containers and products that are used for packaging, shipping, and material handling applications, as well as various other protective packaging applications. The construction segment offers roof trusses, cut and shaped lumbers, plywood, oriented strand boards, and dimensional lumbers; and engineered wood components, including roof and floor trusses, wall panels, I-joists, and lumber packages, as well as distributes siding, electrical, and plumbing products to factory-built housing and recreational vehicle customers. This segment also engages in the manufacture of components; design, manufacture, and supply of wood forms and related products to set or form concrete for structures, such as parking garages, stadiums, and bridges, as well as provides farming services for builders. It also offers interior fixtures, millwork, and casework for retail, commercial, and other structures; and structural wood packaging, other packing materials, and original equipment manufacturer components for various industries. The company was formerly known as Universal Forest Products, Inc. and changed its name to UFP Industries, Inc. in April 2020. UFP Industries, Inc. was founded in 1955 and is headquartered in Grand Rapids, Michigan.",
    "ceo": "Mr. Matthew Jon Missad CPA, CPA",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "15500",
    "phone": "616 364 6161",
    "address": "2801 East Beltline Avenue, NE",
    "city": "Grand Rapids",
    "state": "MI",
    "zip": "49525",
    "dcfDiff": 7.18353,
    "dcf": 83.5265,
    "image": "https://financialmodelingprep.com/image-stock/UFPI.png",
    "ipoDate": "1993-11-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]