[
  {
    "symbol": "UGI",
    "price": 26.67,
    "beta": 1.102816,
    "volAvg": 1894503,
    "mktCap": 5582777760,
    "lastDiv": 1.5,
    "range": "26.44-43.75",
    "changes": -0.51,
    "companyName": "UGI Corporation",
    "currency": "USD",
    "cik": "0000884614",
    "isin": "US9026811052",
    "cusip": "902681105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Gas",
    "website": "https://www.ugicorp.com",
    "description": "UGI Corporation distributes, stores, transports, and markets energy products and related services in the United States and internationally. The company operates through four segments: AmeriGas Propane, UGI International, Midstream & Marketing, and UGI Utilities. It distributes propane to approximately 1.4 million residential, commercial/industrial, motor fuel, agricultural, and wholesale customers through 1,600 propane distribution location. The company also distributes liquefied petroleum gases (LPG) to residential, commercial, industrial, agricultural, wholesale and automobile fuel customers; and provides logistics, storage, and other services to third-party LPG distributors. In addition, it engages in the retail sale of natural gas, liquid fuels, and electricity to approximately 12,600 residential, commercial, and industrial customers at 42,400 locations. Further, the company distributes natural gas to approximately 672,000 customers in eastern and central Pennsylvania counties through its distribution system of approximately 12,400 miles of gas mains; and supplies electricity to approximately 62,500 customers in northeastern Pennsylvania through 2,600 miles of lines and 14 substations. Additionally, it operates electric generation facilities, which include coal-fired, landfill gas-fueled, solar-powered, and natural gas-fueled facilities; a natural gas liquefaction, storage, and vaporization facility; propane storage and propane-air mixing stations; and rail transshipment terminals. It also manages natural gas pipeline and storage contracts; develops, owns, and operates pipelines, gathering infrastructure, and gas storage facilities. UGI Corporation was incorporated in 1991 and is based in King of Prussia, Pennsylvania.",
    "ceo": "Mr. Roger  Perreault",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "10000",
    "phone": "610 337 1000",
    "address": "460 North Gulph Road",
    "city": "King of Prussia",
    "state": "PA",
    "zip": "19406",
    "dcfDiff": 5.06062,
    "dcf": 44.8706,
    "image": "https://financialmodelingprep.com/image-stock/UGI.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]