[
  {
    "symbol": "UGP",
    "price": 3.64,
    "beta": 0.901027,
    "volAvg": 1455861,
    "mktCap": 3965634284,
    "lastDiv": 0.13,
    "range": "2.13-3.83",
    "changes": -0.03,
    "companyName": "Ultrapar Participações S.A.",
    "currency": "USD",
    "cik": "0001094972",
    "isin": "US90400P1012",
    "cusip": "90400P101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Refining & Marketing",
    "website": "https://www.ultra.com.br",
    "description": "Ultrapar Participações S.A. engages in the gas distribution, fuel distribution, and storage businesses primarily in Brazil, Mexico, Uruguay, Venezuela, other Latin American countries, the United States, Canada, the Far East, Europe, and internationally. Its Gas Distribution segment distributes liquefied petroleum gas to residential, commercial, and industrial consumers primarily in the South, Southeast, and Northeast regions of Brazil. The company's Fuel Distribution segment distributes and markets gasoline, ethanol, diesel, fuel oil, kerosene, natural gas for vehicles, and lubricants; operates convenience stores; and offers lubricant-changing and automotive specialized services. The company's Storage segment operates liquid bulk terminals primarily in the Southeast and Northeast regions of Brazil. As of December 31, 2021, the company operated through 7,104 Ipiranga service stations and 1,841 AmPm convenience stores; 1,149 Jet Oil franchises; 4 distribution centers; and 7 Ultracargo terminals with storage capacity of 983 thousand cubic meters. It also operates Abastece Aí, a digital payments app; and offers Km de Vantagens, a loyalty program. The company was founded in 1937 and is headquartered in São Paulo, Brazil.",
    "ceo": "Mr. Marcos Marinho Lutz",
    "sector": "Energy",
    "country": "BR",
    "fullTimeEmployees": "10139",
    "phone": "55 11 3177 3820",
    "address": "Brigadeiro Luis AntOnio Avenue, 1343",
    "city": "São Paulo",
    "state": "SP",
    "zip": "01317-910",
    "dcfDiff": 2.03854,
    "dcf": 4.60854,
    "image": "https://financialmodelingprep.com/image-stock/UGP.png",
    "ipoDate": "1999-10-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]