[
  {
    "symbol": "UHS",
    "price": 155.77,
    "beta": 1.260915,
    "volAvg": 674525,
    "mktCap": 10931985019,
    "lastDiv": 0.8,
    "range": "82.5-157.77",
    "changes": -0.6,
    "companyName": "Universal Health Services, Inc.",
    "currency": "USD",
    "cik": "0000352915",
    "isin": "US9139031002",
    "cusip": "913903100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Care Facilities",
    "website": "https://uhs.com",
    "description": "Universal Health Services, Inc., through its subsidiaries, owns and operates acute care hospitals, and outpatient and behavioral health care facilities. The company operates through Acute Care Hospital Services and Behavioral Health Care Services segments. Its hospitals offer general and specialty surgery, internal medicine, obstetrics, emergency room care, radiology, oncology, diagnostic and coronary care, pediatric services, pharmacy services, and/or behavioral health services. As of February 24, 2022, it owned and/or operated 363 inpatient facilities, and 40 outpatient and other facilities located in 39 states; Washington, D.C.; the United Kingdom; and Puerto Rico. The company also provides commercial health insurance services; and various management services, which include central purchasing, information, finance and control systems, facilities planning, physician recruitment, administrative personnel management, marketing, and public relations services. Universal Health Services, Inc. founded in 1978 and is headquartered in King of Prussia, Pennsylvania.",
    "ceo": "Mr. Marc D. Miller",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "93800",
    "phone": "610-768-3300",
    "address": "Universal Corporate Center",
    "city": "King of Prussia",
    "state": "PA",
    "zip": "19406-0958",
    "dcfDiff": 16.1628,
    "dcf": 129.047,
    "image": "https://financialmodelingprep.com/image-stock/UHS.png",
    "ipoDate": "1981-07-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]