[
  {
    "symbol": "UI",
    "price": 173.34,
    "beta": 1.269366,
    "volAvg": 76512,
    "mktCap": 10476964278,
    "lastDiv": 2.4,
    "range": "160.49-350.63",
    "changes": -3.39,
    "companyName": "Ubiquiti Inc.",
    "currency": "USD",
    "cik": "0001511737",
    "isin": "US90353W1036",
    "cusip": "90353W103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Communication Equipment",
    "website": "https://www.ui.com",
    "description": "Ubiquiti Inc. develops networking technology for service providers, enterprises, and consumers. It develops technology platforms for high-capacity distributed Internet access, unified information technology, and consumer electronics for professional, home, and personal use. Its service provider product platforms offer carrier-class network infrastructure for fixed wireless broadband, wireless backhaul systems, and routing; and enterprise product platforms provide wireless LAN infrastructure, video surveillance products, switching and routing solutions, security gateways, and other WLAN products, as well as consumer products under the Ubiquiti Labs brand name. The company also provides technology platforms, such as airMAX, which include proprietary protocols that contain technologies for minimizing signal noise; EdgeMAX, a software and system routing platform; airFiber, a point-to-point radio system; and UFiber GPON, a plug and play fiber network technology to build high speed fiber internet networks. In addition, it offers UniFi -Enterprise WLAN, an enterprise Wi-Fi system that allows for on-site and remote management through the cloud; UniFi Protect, a video surveillance system, which provides statistical reporting and advanced analytics; UniFi Switch that deliver performance, switching, and power of Ethernet support for enterprise networks; UniFi Console, an enterprise class router and security gateway device; and UniFi Access, a door access system. Further, offers base stations, radios, backhaul equipment, and customer premise equipment; embedded radio products; antennas; and mounting brackets, cables, and power over Ethernet adapters. It serves customers through a network of approximately 100 distributors, online retailers, and direct to customers worldwide. The company was formerly known as Ubiquiti Networks, Inc. and changed its name to Ubiquiti Inc. in August 2019. Ubiquiti Inc. was incorporated in 2003 and is headquartered in New York, New York.",
    "ceo": "Mr. Robert J. Pera",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "1377",
    "phone": "646 780 7958",
    "address": "685 Third Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10017",
    "dcfDiff": 0.674242,
    "dcf": 291.996,
    "image": "https://financialmodelingprep.com/image-stock/UI.png",
    "ipoDate": "2011-10-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]