[
  {
    "symbol": "UMBF",
    "price": 61.31,
    "beta": 0.785563,
    "volAvg": 480862,
    "mktCap": 2974080659,
    "lastDiv": 1.52,
    "range": "50.68-99.19",
    "changes": -0.01,
    "companyName": "UMB Financial Corporation",
    "currency": "USD",
    "cik": "0000101382",
    "isin": "US9027881088",
    "cusip": "902788108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.umb.com",
    "description": "UMB Financial Corporation operates as the bank holding company for the UMB Bank that provides various banking and other financial services. The Commercial Banking segment provides commercial loans and credit card; commercial real estate financing; letters of credit; loan syndication, and consultative service; various business solutions including asset-based lending, accounts receivable financing, mezzanine debt, and minority equity investment; and treasury management service, such as depository service, account reconciliation, cash management tool, accounts payable and receivable solution, electronic fund transfer and automated payment, controlled disbursement, lockbox service, and remote deposit capture service. The Institutional Banking segment offers asset management and healthcare service provided to institutional client; and fund administration and accounting, investor service and transfer agency, marketing and distribution, custody, alternative investment service, fixed income sale, trading and underwriting, and corporate trust and escrow service, as well as institutional custody service. This segment also provides healthcare payment solution includes custodial service for health saving accounts and private label, multipurpose debit cards to insurance carriers, third-party administrator, software companies, employers, and financial institutions. The Personal Banking segment offers deposit account, retail credit card, private banking, installment loan, home equity line of credit, residential mortgage, and small business loan, as well as internet banking, ATM network, private banking, brokerage and insurance service, and advisory and trust service. It operates through a network of branches and offices in the states of Missouri, Kansas, Colorado, Illinois, Oklahoma, Texas, Arizona, Nebraska, Iowa, Pennsylvania, South Dakota, Indiana, Utah, Minnesota, California, and Wisconsin. The company was founded in 1913 and is headquartered in Kansas City, Missouri.",
    "ceo": "Mr. J. Mariner Kemper",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3770",
    "phone": "816 860 7000",
    "address": "1010 Grand Boulevard",
    "city": "Kansas City",
    "state": "MO",
    "zip": "64106",
    "dcfDiff": 187.227,
    "dcf": 275.067,
    "image": "https://financialmodelingprep.com/image-stock/UMBF.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]