[
  {
    "symbol": "UNCFF",
    "price": 22.35,
    "beta": 1.626053,
    "volAvg": 1500,
    "mktCap": 42898368288,
    "lastDiv": 1.08,
    "range": "8.18-22.35",
    "changes": 1.2335,
    "companyName": "UniCredit S.p.A.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.unicreditgroup.eu",
    "description": "UniCredit S.p.A. operates as a commercial bank that provides retail, corporate, and private banking services. It offers accounts and deposits, loans, cards, transactions and payments, funds, advisory, treasury, and insurance products, as well as digital and mobile banking services. The company also provides solutions for payments and liquidity, working capital, hedging, international trade, and treasury operations; and funding solutions comprising of structured, project, and commodity trade and export finance, as well as debt and equity funding; and structured investments and investments advisory solutions. In addition, the company provides corporate finance, capital structure, and rating advisory, as well as patient capital, financial sponsor solutions, and sustainable finance solutions. It servs retail, corporate, and public sector customers, as well as international companies and institutional clients. The company operates in Italy, Other European countries, America, Asia, and internationally. The company was formerly known as Unicredito Italiano S.p.A and changed its name to UniCredit S.p.A. UniCredit S.p.A. was founded in 1870 and is headquartered in Milan, Italy.",
    "ceo": "Mr. Andrea  Orcel",
    "sector": "Financial Services",
    "country": "IT",
    "fullTimeEmployees": "75040",
    "phone": "39 02 88 621",
    "address": "Tower A",
    "city": "Milan",
    "state": "MI",
    "zip": "20154",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/UNCFF.png",
    "ipoDate": "2009-02-13",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]