[
  {
    "symbol": "UNH",
    "price": 474.45,
    "beta": 0.682042,
    "volAvg": 3437451,
    "mktCap": 441728132400,
    "lastDiv": 6.83,
    "range": "445.68-558.1",
    "changes": -8.11,
    "companyName": "UnitedHealth Group Incorporated",
    "currency": "USD",
    "cik": "0000731766",
    "isin": "US91324P1021",
    "cusip": "91324P102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Healthcare Plans",
    "website": "https://www.unitedhealthgroup.com",
    "description": "UnitedHealth Group Incorporated operates as a diversified health care company in the United States. It operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage and well-being services to individuals age 50 and older addressing their needs for preventive and acute health care services, as well as services dealing with chronic disease and other specialized issues for older individuals; Medicaid plans, children's health insurance and health care programs; health and dental benefits; and hospital and clinical services. The OptumHealth segment provides access to networks of care provider specialists, health management services, care delivery, consumer engagement, and financial services. This segment serves individuals directly through care delivery systems, employers, payers, and government entities. The OptumInsight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The OptumRx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and compounding pharmacy, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease/drug therapy management. UnitedHealth Group Incorporated was incorporated in 1977 and is based in Minnetonka, Minnesota.",
    "ceo": "Sir Andrew Philip Witty",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "400000",
    "phone": "952 936 1300",
    "address": "UnitedHealth Group Center",
    "city": "Minnetonka",
    "state": "MN",
    "zip": "55343",
    "dcfDiff": 53.3824,
    "dcf": 539.432,
    "image": "https://financialmodelingprep.com/image-stock/UNH.png",
    "ipoDate": "1984-10-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]