[
  {
    "symbol": "UNICY",
    "price": 7.505,
    "beta": 0.148659,
    "volAvg": 98116,
    "mktCap": 22231386410,
    "lastDiv": 0.06,
    "range": "5.65-8.39",
    "changes": 0.045,
    "companyName": "Unicharm Corporation",
    "currency": "USD",
    "cik": null,
    "isin": "US90460M2044",
    "cusip": "90460M204",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Household & Personal Products",
    "website": "https://www.unicharm.co.jp",
    "description": "Unicharm Corporation engages in the manufacture and sale of baby and childcare, feminine care, health care, cosmetic, household, and pet care products in Japan and internationally. Its baby and child care products, including disposable diapers and baby wipes under the Moony, MamyPoko, Oyasumiman, and Torepanman brands; and feminine care products comprise napkins, tampons, panty liners, sanitary short, and other feminine care products under the Sofy, Center-In, and Unicharm brands. The company's wellness care products include napkin-type incontinence pads, pants-type diapers, tape-type diapers, pants-type specialized urine pads, and tape-type specialized urine pads under the Lifree and Charmnap brand; and masks under the Unicharm brands. It also provides home care products, including cleaning sheets under the Wave brand; cosmetic cotton and wet wipes under the Silcot brand; and paper towels under the Cook Up brand. In addition, the company offers pet care products that include pet foods, excrement cleanup sheets, system toilets, and disposable diapers under the Grand Deli, Best Balance, Physicalife Dog, Silver Plate, Manner Wear, Deo Sheet, Silver Spoon, AllWell, Physicalife Cat, Deo Toilet, Deo Sand, Deo Clean, Aiken Genki, and Neko Genki brands. Further, it is involved in the manufacture and sale of industrial materials, food-packaging materials, etc. The company was incorporated in 1941 and is headquartered in Tokyo, Japan.",
    "ceo": "Mr. Takahisa  Takahara",
    "sector": "Consumer Defensive",
    "country": "JP",
    "fullTimeEmployees": "16206",
    "phone": "81 3 3451 5111",
    "address": "Sumitomo Fudosan Mita Twin Bldg.",
    "city": "Tokyo",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/UNICY.png",
    "ipoDate": "2010-10-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]