[
  {
    "symbol": "UNM",
    "price": 46.89,
    "beta": 1.059154,
    "volAvg": 1267119,
    "mktCap": 9240565035,
    "lastDiv": 1.32,
    "range": "31.12-47.27",
    "changes": -0.14,
    "companyName": "Unum Group",
    "currency": "USD",
    "cik": "0000005513",
    "isin": "US91529Y1064",
    "cusip": "91529Y106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Life",
    "website": "https://www.unum.com",
    "description": "Unum Group, together with its subsidiaries, provides financial protection benefit solutions primarily in the United States, the United Kingdom, and Poland. It operates through Unum US, Unum International, Colonial Life, and Closed Block segments. The company offers group long-term and short-term disability, group life, and accidental death and dismemberment products; supplemental and voluntary products, such as individual disability, voluntary benefits, and dental and vision products; and accident, sickness, disability, life, and cancer and critical illness products. It also provides group pension, individual life and corporate-owned life insurance, reinsurance pools and management operations, and other products. The company sells its products primarily to employers for the benefit of employees. Unum Group sells its products through field sales personnel, independent brokers, consultants, and independent contractor agency sales force. The company was founded in 1848 and is based in Chattanooga, Tennessee.",
    "ceo": "Mr. Richard Paul McKenney",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "10665",
    "phone": "423 294 1011",
    "address": "1 Fountain Square",
    "city": "Chattanooga",
    "state": "TN",
    "zip": "37402",
    "dcfDiff": 0.471911,
    "dcf": 41.0881,
    "image": "https://financialmodelingprep.com/image-stock/UNM.png",
    "ipoDate": "1986-11-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]