[
  {
    "symbol": "UNVR",
    "price": 35.8,
    "beta": 1.699647,
    "volAvg": 2576740,
    "mktCap": 5647270714,
    "lastDiv": 0,
    "range": "21.49-35.86",
    "changes": 0.02,
    "companyName": "Univar Solutions Inc.",
    "currency": "USD",
    "cik": "0001494319",
    "isin": "US91336L1070",
    "cusip": "91336L107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Chemicals",
    "website": "https://www.univar.com",
    "description": "Univar Solutions Inc. distributes commodity and specialty chemical products, and provides related services worldwide. It offers epoxy resins, polyurethanes, titanium dioxide, fumed silica, esters, plasticizers, silicones, and specialty amines; ingredients for cleaners, detergents, and disinfectant products; and base stocks, performance-enhancing additives for lubricants and metalworking fluids. The company also distributes specialty and basic chemicals, and ingredients used in skin and hair care products; and commodity and specialty products for meat processing, baked goods, dairy, grain mill products, processed foods, carbonated soft drinks, fruit drinks, and alcoholic beverage markets, as well as provides excipients, solvents, reactants, active pharmaceutical ingredients, and intermediates to pharmaceutical ingredient producers. In addition, it offers chemical products for use at various stages of production, from sap stain prevention to pulp and paper manufacturing; and chemistries and products used to sanitize, balance, and supplement municipal and industrial water. Further, the company provides chemicals to midstream pipeline and downstream refinery operators, as well as chemicals and services to upstream oil and gas sector for offshore production, oil extraction, and waste management activities. Additionally, it offers transportation and warehousing services, chemicals and hazardous materials handling, waste management services, inventory management, and blending, mixing, and repackaging services. Univar Solutions Inc. distributes its products through warehouse and direct-to-consumer delivery channels. The company was formerly known as Univar Inc. and changed its name to Univar Solutions Inc. in September 2019. Univar Solutions Inc. was founded in 1924 and is headquartered in Downers Grove, Illinois.",
    "ceo": "Mr. David C. Jukes",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "9746",
    "phone": "331 777 6000",
    "address": "3075 Highland Parkway",
    "city": "Downers Grove",
    "state": "IL",
    "zip": "60515",
    "dcfDiff": 3.79885,
    "dcf": 30.4012,
    "image": "https://financialmodelingprep.com/image-stock/UNVR.png",
    "ipoDate": "2015-06-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]