[
  {
    "symbol": "UOVEY",
    "price": 40.97,
    "beta": 0.860536,
    "volAvg": 72145,
    "mktCap": 34326018993,
    "lastDiv": 1.98,
    "range": "35.28-47.09",
    "changes": -0.33,
    "companyName": "United Overseas Bank Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US9112713022",
    "cusip": "911271302",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Banks—Regional",
    "website": "https://www.uobgroup.com",
    "description": "United Overseas Bank Limited, together with its subsidiaries, provides banking products and services. It operates through three segments: Group Retail, Group Wholesale Banking, and Global Markets. The company offers loan products, including overdraft, cash credit, short term, and long-term loans. It also provides buyers credit, structured trade finance, SGD bonds, loan syndication, and M&A services. In addition, the company offers forex, documentary collection, credit, bank guarantee, export and import finance services. Further, the company provides inward and outward remittances, FX spot and forward, current account, and time deposit services. Additionally, the company offers letter of credit advising and negotiation/discounting services; and import and export services comprising of inward and outward bill collection services, and documents against acceptance and payment. Furthermore, the company provides private, commercial, corporate, and investment banking services. It also offers corporate finance, treasury, future broking, asset management, venture capital management, insurance, and stockbroking services; engages in capital market, credit card, and private residential home loan businesses; and loans to small and medium enterprises. The company operates approximately 500 branches and offices in Singapore, Malaysia, Indonesia, Thailand, China, and internationally. United Overseas Bank Limited was incorporated in 1935 and is headquartered in Singapore.",
    "ceo": "Mr. Ee Cheong  Wee B.Sc., M.A.",
    "sector": "Financial Services",
    "country": "SG",
    "fullTimeEmployees": "28661",
    "phone": "65 6533 9898",
    "address": "UOB Plaza",
    "city": "Singapore",
    "state": null,
    "zip": "048624",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/UOVEY.png",
    "ipoDate": "1996-11-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]