[
  {
    "symbol": "UPS",
    "price": 175.66,
    "beta": 1.089436,
    "volAvg": 3465667,
    "mktCap": 150871916692,
    "lastDiv": 6.48,
    "range": "154.87-209.39",
    "changes": 0.99,
    "companyName": "United Parcel Service, Inc.",
    "currency": "USD",
    "cik": "0001090727",
    "isin": "US9113121068",
    "cusip": "911312106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Integrated Freight & Logistics",
    "website": "https://www.ups.com",
    "description": "United Parcel Service, Inc. provides letter and package delivery, transportation, logistics, and related services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery of letters, documents, small packages, and palletized freight through air and ground services in the United States. The International Package segment provides guaranteed day and time-definite international shipping services in Europe, the Asia Pacific, Canada and Latin America, the Indian sub-continent, the Middle East, and Africa. This segment offers guaranteed time-definite express options. The company also provides international air and ocean freight forwarding, customs brokerage, distribution and post-sales, and mail and consulting services in approximately 200 countries and territories. In addition, it offers truckload brokerage services; supply chain solutions to the healthcare and life sciences industry; shipping, visibility, and billing technologies; and financial and insurance services. The company operates a fleet of approximately 121,000 package cars, vans, tractors, and motorcycles; and owns 59,000 containers that are used to transport cargo in its aircraft. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.",
    "ceo": "Ms. Carol B. Tome",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "500000",
    "phone": "404 828 6000",
    "address": "55 Glenlake Parkway, N.E.",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30328",
    "dcfDiff": 10.2938,
    "dcf": 192.384,
    "image": "https://financialmodelingprep.com/image-stock/UPS.png",
    "ipoDate": "1999-11-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]