[
  {
    "symbol": "URBN",
    "price": 32.54,
    "beta": 1.49507,
    "volAvg": 1816090,
    "mktCap": 3016386412,
    "lastDiv": 0,
    "range": "18.2-34.48",
    "changes": 0.92,
    "companyName": "Urban Outfitters, Inc.",
    "currency": "USD",
    "cik": "0000912615",
    "isin": "US9170471026",
    "cusip": "917047102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Apparel Retail",
    "website": "https://www.urbn.com",
    "description": "Urban Outfitters, Inc. engages in the retail and wholesale of general consumer products. The company operates through three segments: Retail, Wholesale, and Nully. It operates Urban Outfitters stores, which offer women's and men's fashion apparel, activewear, intimates, footwear, accessories, home goods, electronics, and beauty products for young adults aged 18 to 28; and Anthropologie stores that provide women's casual apparel, accessories, intimates, shoes, and home furnishings, as well as gifts, decorative items, and beauty and wellness products for women aged 28 to 45. The company also operates Bhldn stores, which offer heirloom quality wedding gowns, bridesmaid frocks, party dresses, assorted jewelry, headpieces, footwear, lingerie, and decorations; and Terrain stores that provide lifestyle home products, garden and outdoor living products, antiques, live plants, flowers, wellness products, and accessories. In addition, it operates Free People retail stores, which offer casual women's apparel, intimates, activewear, shoes, accessories, home products, gifts, and beauty and wellness products for young women aged 25 to 30; restaurants; and women's apparel subscription rental service under the Nuuly brand name. The company serves its customers directly through retail stores, Websites, mobile applications, catalogs and customer contact centers, franchised or third-party operated stores, and digital businesses. As of January 31, 2022, it operated 261 Urban Outfitters, 238 Anthropologie Group, and 173 Free People stores in the United States, Canada, and Europe; and 10 restaurants, as well as two Urban Outfitters and one Anthropologie franchisee-owned stores. The company is also involved in the wholesale of young women's contemporary casual apparel, intimates, activewear, and shoes under the Free People brand; and home goods through department and specialty stores worldwide. The company was founded in 1970 and is based in Philadelphia, Pennsylvania.",
    "ceo": "Mr. Richard A. Hayne",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "12220",
    "phone": "215 454 5500",
    "address": "5000 South Broad Street",
    "city": "Philadelphia",
    "state": "PA",
    "zip": "19112-1495",
    "dcfDiff": 0.866724,
    "dcf": 27.6267,
    "image": "https://financialmodelingprep.com/image-stock/URBN.png",
    "ipoDate": "1993-11-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]