[
  {
    "symbol": "UTHR",
    "price": 214.8,
    "beta": 0.604577,
    "volAvg": 405077,
    "mktCap": 10064346600,
    "lastDiv": 0,
    "range": "201.65-283.09",
    "changes": -0.32,
    "companyName": "United Therapeutics Corporation",
    "currency": "USD",
    "cik": "0001082554",
    "isin": "US91307C1027",
    "cusip": "91307C102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.unither.com",
    "description": "United Therapeutics Corporation, a biotechnology company, engages in the development and commercialization of products to address the unmet medical needs of patients with chronic and life-threatening diseases in the United States and internationally. Its commercial therapies include Remodulin to treat patients with pulmonary arterial hypertension (PAH) to diminish symptoms associated with exercise; Tyvaso, an inhaled formulation of prostacyclin analogue treprostinil to enhance the exercise ability in PAH patients and pulmonary hypertension associated with interstitial lung disease (PH-ILD); Orenitram, a tablet dosage form of treprostinil to enhance the exercise capacity in PAH patients; Unituxin, a monoclonal antibody for treating high-risk neuroblastoma; and Adcirca, an oral PDE-5 inhibitor to enhance the exercise ability in PAH patients. The company also engages in developing Tyvaso DPI, a dry powder inhalation form of Tyvaso; Remunity Pump, a small, lightweight, durable pump and separate controller; RemoPro and Ralinepag for the treatment of PAH; Aurora-GT, a gene therapy product to rebuild the blood vessels in the lungs; and Tyvaso PERFECT and TETON studies, which are the studies of Tyvaso in patients with World Health Organization (WHO) Group 3 pulmonary hypertension associated with chronic obstructive pulmonary disease (PH-COPD). It has licensing and collaboration agreements with DEKA Research & Development Corp. to develop a semi-disposable system for the subcutaneous delivery of treprostinil; MannKind Corporation to develop and license treprostinil inhalation powder and the Dreamboat device; and Arena Pharmaceuticals, Inc. to develop Ralinepag. The company was incorporated in 1996 and is headquartered in Silver Spring, Maryland.",
    "ceo": "Dr. Martine A. Rothblatt J.D., M.B.A., Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "985",
    "phone": "301 608 9292",
    "address": "1040 Spring Street",
    "city": "Silver Spring",
    "state": "MD",
    "zip": "20910",
    "dcfDiff": 25.9728,
    "dcf": 285.653,
    "image": "https://financialmodelingprep.com/image-stock/UTHR.png",
    "ipoDate": "1999-06-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]