[
  {
    "symbol": "VAC",
    "price": 120.82,
    "beta": 2.053521,
    "volAvg": 359495,
    "mktCap": 4447251298,
    "lastDiv": 2.88,
    "range": "112.7-165.85",
    "changes": -0.47,
    "companyName": "Marriott Vacations Worldwide Corporation",
    "currency": "USD",
    "cik": "0001524358",
    "isin": "US57164Y1073",
    "cusip": "57164Y107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Resorts & Casinos",
    "website": "https://www.marriottvacationsworldwide.com",
    "description": "Marriott Vacations Worldwide Corporation, a vacation company, develops, markets, sells, and manages vacation ownership and related products. It operates through two segments, Vacation Ownership and Exchange & Third-Party Management. The company manages vacation ownership and related products under the Marriott Vacation Club, Grand Residences by Marriott, Sheraton Vacation Club, Westin Vacation Club, Hyatt Residence Club, and Marriott Vacation Club Pulse brands. It also develops, markets, and sells vacation ownership and related products under The Ritz-Carlton Destination Club brand; and holds right to develop, market, and sell ownership residential products under The Ritz-Carlton Residences brand. In addition, the company offers exchange networks and membership programs, as well as provision of management services to other resorts and lodging properties through various brands, including Interval International, Trading Places International, Vacation Resorts International, and Aqua-Aston. As of December 31, 2021, the company operated approximately 120 properties in the United States and thirteen other countries and territories. The company sells its upscale tier vacation ownership products primarily through a network of resort-based sales centers and off-site sales locations. Marriott Vacations Worldwide Corporation was founded in 1984 and is headquartered in Orlando, Florida.",
    "ceo": "Mr. John E. Geller Jr.",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "21400",
    "phone": "407-206-6000",
    "address": "9002 San Marco Court",
    "city": "Orlando",
    "state": "FL",
    "zip": "32819",
    "dcfDiff": 6.19982,
    "dcf": 152.79,
    "image": "https://financialmodelingprep.com/image-stock/VAC.png",
    "ipoDate": "2011-11-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]