[
  {
    "symbol": "VC",
    "price": 142.93,
    "beta": 1.792605,
    "volAvg": 300756,
    "mktCap": 4051994035,
    "lastDiv": 43.400002,
    "range": "97.25-171.66",
    "changes": 0.39,
    "companyName": "Visteon Corporation",
    "currency": "USD",
    "cik": "0001111335",
    "isin": "US92839U2069",
    "cusip": "92839U206",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Auto Parts",
    "website": "https://www.visteon.com",
    "description": "Visteon Corporation, an automotive technology company, engineers, designs, and manufactures automotive electronics and connected car solutions for vehicle manufacturers worldwide. The company provides instrument clusters, including analog gauge clusters to 2-D and 3-D display-based devices; information displays that integrate a range of user interface technologies and graphics management capabilities, such as 3-D, active privacy, TrueColor enhancement, cameras, optics, haptic feedback, and light effects; and Phoenix, a display audio and embedded infotainment platform, as well as onboard artificial intelligence-based voice assistant with natural language understanding. It also offers wired and wireless battery management systems; telematics control unit to enable secure connected car services, software updates, and data; and head-up displays. In addition, the company provides SmartCore, an automotive-grade, integrated domain controller; DriveCore, a platform for addressing multiple levels of vehicle automation; and body domain modules, which integrate various functions, such as central gateway, body controls, comfort, and vehicle access solutions into one device. Visteon Corporation was incorporated in 2000 and is headquartered in Van Buren, Michigan.",
    "ceo": "Mr. Sachin S. Lawande",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "10000",
    "phone": "800 847 8366",
    "address": "One Village Center Drive",
    "city": "Van Buren",
    "state": "MI",
    "zip": "48111",
    "dcfDiff": 12.6307,
    "dcf": 162.581,
    "image": "https://financialmodelingprep.com/image-stock/VC.png",
    "ipoDate": "2010-10-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]