[
  {
    "symbol": "VCISY",
    "price": 28.71,
    "beta": 0.971647,
    "volAvg": 70643,
    "mktCap": 65478034322,
    "lastDiv": 1.08,
    "range": "19.54-31.06",
    "changes": -0.03,
    "companyName": "Vinci SA",
    "currency": "USD",
    "cik": null,
    "isin": "US9273201015",
    "cusip": "927320101",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Engineering & Construction",
    "website": "https://www.vinci.com",
    "description": "VINCI SA, together with its subsidiaries, operates in the concessions, energy, and construction segments primarily in France. It Concessions segment operates motorway concessions with a network of 4,419 kilometers in France; 45 airports; 4,437 kilometers of motorways; highways, railways, and 4 stadiums, as well as operates airports in France and in 11 other countries. The company's Energy segment provides services to the manufacturing, infrastructure, facilities management, and information and communication technology sectors; engineering, procurement, and construction services in the energy sector, and manufacturing and energy-related services; and renewable energy concession projects development services. Its Construction segments engages in designing and carrying out projects that involve general contractor capabilities; works related to geotechnical and structural engineering, digital technology, nuclear or renewable thermal energy; and focuses on business area, such as buildings, civil engineering, infrastructure, and in a specific geographical area. The company also provides property development services for residential and commercial properties; and property services, as well as operates managed residences. It also operates in Germany, the United Kingdom, Albania, Belarus, Bosnia-Herzegovina, Bulgaria, Croatia, Czech Republic, Estonia, Hungary, Kosovo, Latvia, Lithuania, Macedonia, Moldova, Montenegro, Poland, Romania, Serbia, Slovakia, Slovenia, Ukraine, Portugal, North America, Central and South America, Africa, Russia, the Asia-Pacific, the Middle East, and other European countries. The company was founded in 1899 and is headquartered in Nanterre, France.",
    "ceo": "Mr. Xavier M. P. Huillard",
    "sector": "Industrials",
    "country": "FR",
    "fullTimeEmployees": "265303",
    "phone": "33 1 57 98 61 00",
    "address": "1973 boulevard de la De´fense",
    "city": "Nanterre",
    "state": null,
    "zip": "92757",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/VCISY.png",
    "ipoDate": "2008-01-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]