[
  {
    "symbol": "VEEV",
    "price": 195.93,
    "beta": 0.913028,
    "volAvg": 1053646,
    "mktCap": 31392688124,
    "lastDiv": 0,
    "range": "151.02-232.26",
    "changes": -5.76,
    "companyName": "Veeva Systems Inc.",
    "currency": "USD",
    "cik": "0001393052",
    "isin": "US9224751084",
    "cusip": "922475108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Health Information Services",
    "website": "https://www.veeva.com",
    "description": "Veeva Systems Inc. provides cloud-based software for the life sciences industry in North America, Europe, the Asia Pacific, the Middle East, Africa, and Latin America. The company offers Veeva Commercial Cloud, a suite of software, data, and analytics solutions, which include Veeva customer relationship management (CRM) and Veeva Medical CRM, Veeva CLM, Veeva CRM MyInsights, Veeva CLM, Veeva CRM Approved Email, Veeva CRM Engage, Veeva Align, Veeva CRM Events Management, Veeva Nitro, Veeva OpenData, Veeva Link, Veeva Network, Veeva Crossix, Veeva Data Cloud, and MyVeeva for Patients; and Veeva Vault, a cloud-based enterprise content and data management applications for managing commercial functions, including sales and marketing, and medical content and communications, as well as research and development functions, such as clinical, regulatory, quality, and safety. It also provides professional and support services in the areas of implementation and deployment planning and project management; requirements analysis, solution design, and configuration; systems environment management and deployment services; services focused on advancing or transforming business and operating processes related to Veeva solutions; technical consulting services related to data migration and systems integrations; training on its solutions; and ongoing managed services that include outsourced systems administration. The company was formerly known as Verticals onDemand, Inc. and changed its name to Veeva Systems Inc. in April 2009. Veeva Systems Inc. was incorporated in 2007 and is headquartered in Pleasanton, California.",
    "ceo": "Mr. Peter P. Gassner",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "6744",
    "phone": "925 452 6500",
    "address": "4280 Hacienda Drive",
    "city": "Pleasanton",
    "state": "CA",
    "zip": "94588",
    "dcfDiff": 17.3104,
    "dcf": 188.76,
    "image": "https://financialmodelingprep.com/image-stock/VEEV.png",
    "ipoDate": "2013-10-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]