[
  {
    "symbol": "VEOEY",
    "price": 15.665,
    "beta": 1.070881,
    "volAvg": 91103,
    "mktCap": 22022327201,
    "lastDiv": 0.61,
    "range": "9.195-16.5",
    "changes": -0.015,
    "companyName": "Veolia Environnement S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US92334N1037",
    "cusip": "92334N103",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Waste Management",
    "website": "https://www.veolia.com/fr",
    "description": "Veolia Environnement S.A. designs and provides water, waste, and energy management solutions worldwide. The company is involved in the resource management, production, and delivery of drinking water and industrial process water; collection, treatment, and recycling of wastewater; and design and construction of treatment and network infrastructure. It also provides waste collection, waste material recovery, waste-to-energy, organic waste material recovery, hazardous waste treatment, dismantling and remediation, urban cleaning, and industrial maintenance and cleaning services. In addition, the company engages in the operation and maintenance of heating and cooling networks; development of energy services to reduce the energy consumption and CO2 emissions of buildings; optimization of industrial utilities; and energy use related to processes and industrial buildings, as well as produces electricity from biomass. It offers drinking water to 95 million people. The company was formerly known as Vivendi Environnement and changed its name to Veolia Environnement S.A. in 2003. Veolia Environnement S.A. was founded in 1853 and is based in Aubervilliers, France.",
    "ceo": "Ms. Estelle K. Brachlianoff",
    "sector": "Industrials",
    "country": "FR",
    "fullTimeEmployees": "188662",
    "phone": "33 1 85 57 70 00",
    "address": "30, rue Madeleine-Vionnet",
    "city": "Aubervilliers",
    "state": null,
    "zip": "93300",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/VEOEY.png",
    "ipoDate": "2001-10-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]