[
  {
    "symbol": "VET",
    "price": 12.25,
    "beta": 2.905242,
    "volAvg": 1212533,
    "mktCap": 2023700000,
    "lastDiv": 0.29,
    "range": "10.75-30.17",
    "changes": 0.04,
    "companyName": "Vermilion Energy Inc.",
    "currency": "USD",
    "cik": "0001293135",
    "isin": "CA9237251058",
    "cusip": "923725105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas E&P",
    "website": "https://www.vermilionenergy.com",
    "description": "Vermilion Energy Inc., together with its subsidiaries, engages in the acquisition, exploration, development, and production of petroleum and natural gas in North America, Europe, and Australia. The company owns 81% working interest in 636,714 net acres of developed land and 85% working interest in 301,026 net acres of undeveloped land in Canada; 130,715 net acres of land in the Powder River basin in the United States; 96% working interest in 248,873 net acres of developed land and 86% working interest in 134,160 net acres of undeveloped land in the Aquitaine and Paris Basins in France; 53% working interest in 901,791 net acres of land in the Netherlands; 54,625 net developed acres and 920,723 net undeveloped acres in Germany; 975,375 net acres land in Croatia; 946,666 net acres land in Hungary; and 48,954 net acres land in Slovakia. It also owns 20% interests in the offshore Corrib natural gas field located to the northwest coast of Ireland; and 100% working interest in the Wandoo offshore oil field and related production facilities that covers 59,553 acres located on Western Australia's northwest shelf. As of December 31, 2021, the company had 401 net producing conventional natural gas wells and 2,132 net producing light and medium crude oil wells in Canada; 167.6 net producing light and medium crude oil wells in the United States; 297.0 net producing light and medium crude oil wells and 3 net producing conventional natural gas wells in France; and 47 net producing natural gas wells in the Netherlands. Vermilion Energy Inc. was founded in 1994 and is headquartered in Calgary, Canada.",
    "ceo": "Mr. Anthony  Hatcher P.Eng.",
    "sector": "Energy",
    "country": "CA",
    "fullTimeEmployees": "740",
    "phone": "14032694884",
    "address": "520 - 3rd Avenue South West",
    "city": "Calgary",
    "state": "AB",
    "zip": "T2P 0R3",
    "dcfDiff": 3.65817,
    "dcf": 19.1382,
    "image": "https://financialmodelingprep.com/image-stock/VET.png",
    "ipoDate": "2010-09-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]