[
  {
    "symbol": "VFC",
    "price": 18.79,
    "beta": 1.492957,
    "volAvg": 6815541,
    "mktCap": 7303992280,
    "lastDiv": 1.2,
    "range": "16.77-48.63",
    "changes": -0.34,
    "companyName": "V.F. Corporation",
    "currency": "USD",
    "cik": "0000103379",
    "isin": "US9182041080",
    "cusip": "918204108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Apparel Manufacturing",
    "website": "https://www.vfc.com",
    "description": "V.F. Corporation, together with its subsidiaries, engages in the design, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and related products for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through three segments: Outdoor, Active, and Work. The company offers outdoor, merino wool and other natural fibers-based, lifestyle, and casual apparel; footwear; equipment; accessories; outdoor-inspired, performance-based, youth culture/action sports-inspired, streetwear, and protective work footwear; handbags, luggage, backpacks, and totes; and work and work-inspired lifestyle apparel and footwear. It provides its products under the North Face, Timberland, Smartwool, Icebreaker, Altra, Vans, Supreme, Kipling, Napapijri, Eastpak, JanSport, Dickies, and Timberland PRO brand names. The company sells its products primarily to specialty stores, department stores, national chains, and mass merchants, as well as sells through direct-to-consumer operations, including retail stores, concession retail stores, and e-commerce sites, and other digital platforms. V.F. Corporation was founded in 1899 and is headquartered in Denver, Colorado.",
    "ceo": "Mr. Benno O. Dorer",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "19800",
    "phone": "720 778 4000",
    "address": "1551 Wewatta Street",
    "city": "Denver",
    "state": "CO",
    "zip": "80202",
    "dcfDiff": 3.97881,
    "dcf": 34.4288,
    "image": "https://financialmodelingprep.com/image-stock/VFC.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]