[
  {
    "symbol": "VIPS",
    "price": 16.69,
    "beta": 0.461267,
    "volAvg": 5373343,
    "mktCap": 9397487956,
    "lastDiv": 0,
    "range": "6.36-18.48",
    "changes": -0.09,
    "companyName": "Vipshop Holdings Limited",
    "currency": "USD",
    "cik": "0001529192",
    "isin": "US92763W1036",
    "cusip": "92763W103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Internet Retail",
    "website": "https://www.vip.com",
    "description": "Vipshop Holdings Limited operates online platforms for various brands in the People's Republic of China. It operates in Vip.com, Shan Shan Outlets, and Others segments. The company offers women's apparel, such as casual wear, jeans, dresses, outerwear, lingerie, pajamas, and maternity clothes; men's apparel comprising casual and smart-casual T-shirts, polo shirts, jackets, pants, and underwear; and skin care and cosmetic products, including cleansers, lotions, face and body creams, face masks, sunscreen, foundations, lipsticks, eye shadows, and other cosmetics-related items. It also provides shoes and bags, which comprises casual and formal shoes, purses, satchels, luggage, duffel bags, and wallets; handbags; apparel, gears and accessories, furnishings and decor, toys, and games for boys, girls, infants, and toddlers; sportswear, sports gear, and footwear for various sporting activities; home furnishings, such as bed and bath products, home decor, kitchen and tabletop items, and home appliances; and consumer electronic products. In addition, the company offers food and snacks, beverages, fresh produce, and pet goods; beauty products; and internet finance services, including consumer and supplier financing, and microcredit. Vipshop Holdings Limited provides its branded products through its vip.com and vipshop.com online platforms, as well as through its internet website and cellular phone application. Further, it offers warehousing, logistics, product procurement, research and development, technology development, and consulting services; software development and information technology support solutions; and supply chain services. Vipshop Holdings Limited was founded in 2008 and is headquartered in Guangzhou, the People's Republic of China.",
    "ceo": "Mr. Ya  Shen",
    "sector": "Consumer Cyclical",
    "country": "CN",
    "fullTimeEmployees": "6815",
    "phone": "86 20 2233 0025",
    "address": "128 Dingxin Road",
    "city": "Guangzhou",
    "state": null,
    "zip": "510220",
    "dcfDiff": 17.0733,
    "dcf": 32.5133,
    "image": "https://financialmodelingprep.com/image-stock/VIPS.png",
    "ipoDate": "2012-03-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]