[
  {
    "symbol": "VIR",
    "price": 24.88,
    "beta": 0.255044,
    "volAvg": 837614,
    "mktCap": 3333347760,
    "lastDiv": 0,
    "range": "18.05-31.78",
    "changes": 0.14,
    "companyName": "Vir Biotechnology, Inc.",
    "currency": "USD",
    "cik": "0001706431",
    "isin": "US92764N1028",
    "cusip": "92764N102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.vir.bio",
    "description": "Vir Biotechnology, Inc., a commercial-stage immunology company, develops therapeutic products to treat and prevent serious infectious diseases. It develops Sotrovimab (VIR-7832), a SARS-CoV-2-neutralizing mAbs to treat and prevent COVID-19 infection under the Xevudy brand; VIR-2218 and VIR-3434 for the treatment of hepatitis B virus; VIR-2482 for the prevention of influenza A virus; and VIR-1111 for the prevention of human immunodeficiency virus. The company has grant agreements with Bill & Melinda Gates Foundation and National Institutes of Health; an option and license agreement with Brii Biosciences Limited and Brii Biosciences Offshore Limited; a collaboration and license agreement with Alnylam Pharmaceuticals, Inc.; license agreements with The Rockefeller University and MedImmune, Inc.; collaboration with WuXi Biologics and Glaxo Wellcome UK Ltd.; and a collaborative research agreement with GlaxoSmithKline Biologicals SA. It also has a manufacturing agreement with Samsung Biologics Co.,Ltd. for the manufacture of SARS-COV-2 antibodies; and clinical collaboration with Gilead Sciences, Inc. for chronic hepatitis B virus. Vir Biotechnology, Inc. was incorporated in 2016 and is headquartered in San Francisco, California.",
    "ceo": "Dr. Marianne  De Backer M.B.A., M.Sc., Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "576",
    "phone": "415 906 4324",
    "address": "499 Illinois Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94158",
    "dcfDiff": 1.2311,
    "dcf": 29.6189,
    "image": "https://financialmodelingprep.com/image-stock/VIR.png",
    "ipoDate": "2019-10-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]