[
  {
    "symbol": "VIV",
    "price": 8.91,
    "beta": 0.008561,
    "volAvg": 1803320,
    "mktCap": 14909013757,
    "lastDiv": 0.34,
    "range": "6.49-9.26",
    "changes": 0.02,
    "companyName": "Telefônica Brasil S.A.",
    "currency": "USD",
    "cik": "0001066119",
    "isin": "US87936R2058",
    "cusip": "87936R205",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.telefonica.com.br",
    "description": "Telefônica Brasil S.A., together with its subsidiaries, provides mobile and fixed telecommunications services to residential and corporate customers in Brazil. Its fixed line services portfolio includes local, domestic long-distance, and international long-distance calls; and mobile portfolio comprises voice and broadband internet access through 3G, 4G, 4.5G, and 5G as well as mobile value-added services and wireless roaming services. The company also offers data services, including broadband and mobile data services. In addition, it provides pay TV services through direct to home satellite technology, IPTV, and cable, as well as pay-per-view and video on demand services; network services, such as rental of facilities; other services comprising internet access, private network connectivity, computer equipment leasing, extended service, caller identification, voice mail, cellular blocker, and others; wholesale services, including interconnection services to users of other network providers; and digital services, such as entertainment, cloud, and security and financial services. Further, the company offers multimedia communication services, which include audio, data, voice and other sounds, images, texts, and other information, as well as sells devices, such as smartphones, broadband USB modems, and other devices. Additionally, it provides telecommunications solutions and IT support to various industries, such as retail, manufacturing, services, financial institutions, government, etc. It markets and sells its solutions through own stores, dealers, retail and distribution channels, door-to-door sales, and outbound tele sales. The company was formerly known as Telecomunicações de São Paulo S.A. - TELESP and changed its name to Telefônica Brasil S.A. in October 2011. The company was incorporated in 1998 and is headquartered in São Paulo, Brazil.",
    "ceo": "Mr. Christian  Mauad Gebara",
    "sector": "Communication Services",
    "country": "BR",
    "fullTimeEmployees": "32759",
    "phone": "55 11 3430 3687",
    "address": "Av. Engenheiro Luis Carlos Berrini",
    "city": "São Paulo",
    "state": "SP",
    "zip": "04571-936",
    "dcfDiff": 3.26911,
    "dcf": 11.1291,
    "image": "https://financialmodelingprep.com/image-stock/VIV.png",
    "ipoDate": "1998-11-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]