[
  {
    "symbol": "VIVHY",
    "price": 9.175,
    "beta": 0.898084,
    "volAvg": 39717,
    "mktCap": 9386575206,
    "lastDiv": 0.28,
    "range": "7.36-11.09",
    "changes": 0.085,
    "companyName": "Vivendi SE",
    "currency": "USD",
    "cik": "0001127055",
    "isin": null,
    "cusip": "92852T201",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Entertainment",
    "website": "https://www.vivendi.com",
    "description": "Vivendi SE operates as a entertainment, media, and communication company in France, the rest of Europe, the Americas, Asia/Oceania, and Africa. It operates through Canal+ Group, Havas Group, Editis, Prisma Media, Gameloft, Vivendi Village, Corporate, and New Initiative segments. The Canal+ Group segment publishes and distributes premium and thematic pay-TV and free-to-air channels; and produces, sells, and distributes movies and TV series. The Havas Group segment includes communications disciplines, such as creativity, media expertise, and healthcare/wellness. The Editis segment engages in the publishing of literature, educational, and reference books, as well as selling and distribution of books. The Prisma Media segment publishes online videos. The Gameloft segment engages in the creation and publishing of downloadable video games for mobile phones, tablets, triple-play boxes, and smart TVs. The Vivendi Village segment provides ticketing services and live performances through Olympia production, festival production, and venues. The Corporate segment offers centralized services. The New Initiative segment operates Dailymotion, a video content aggregation and distribution platform, as well as develops ultra-high-speed Internet service. Vivendi SA was founded in 1853 and is headquartered in Paris, France.",
    "ceo": "Mr. Arnaud Roy de Puyfontaine E.S.C.P., M.B.A.",
    "sector": "Communication Services",
    "country": "FR",
    "fullTimeEmployees": "35000",
    "phone": "33 1 71 71 10 00",
    "address": "42 avenue de Friedland",
    "city": "Paris",
    "state": null,
    "zip": "75380",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/VIVHY.png",
    "ipoDate": "2011-02-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]