[
  {
    "symbol": "VLEEY",
    "price": 10.45,
    "beta": 1.729118,
    "volAvg": 27262,
    "mktCap": 5039334766,
    "lastDiv": 0.2,
    "range": "7.32-11.64",
    "changes": -0.17,
    "companyName": "Valeo SE",
    "currency": "USD",
    "cik": null,
    "isin": "US9191343048",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Auto Parts",
    "website": "https://www.valeo.com",
    "description": "Valeo SE designs, produces, and sells components, systems, and services for automakers in France, other European countries, Africa, North America, South America, and Asia. The company operates through four segments: Comfort & Driving Assistance Systems, Powertrain Systems, Thermal Systems, and Visibility Systems. It offers parking and driving assistance products, such as ultrasonic sensors, radars, and cameras to detect obstacles around vehicles; intuitive control products; and a range of connectivity solutions from short-range to long-range connectivity, as well as develops systems that enable the integration of applications, such as car sharing services and remote parking systems. The company also provides powertrain systems, including electric powertrain systems for electric cars; torque converters, dual dry and wet clutches, and actuators that enable the automation of transmissions to reduce fuel consumption and enhance driving comfort; and clean engines for vehicles. In addition, it designs and manufactures systems, modules, and components to optimize thermal management of vehicles and passenger comfort in the cabin, including heating ventilation and air conditioning systems. Further, the company designs and produces lighting and wiper systems for drivers in various weather conditions. Additionally, it offers original equipment spares to auto manufacturers; and replacement parts and accessories to independent aftermarket for passenger cars and commercial vehicles. The company was incorporated in 1923 and is headquartered in Paris, France.",
    "ceo": "Mr. Christophe  Perillat-Piratoine",
    "sector": "Consumer Cyclical",
    "country": "FR",
    "fullTimeEmployees": "109900",
    "phone": "33 1 40 55 20 20",
    "address": "100, rue de Courcelles",
    "city": "Paris",
    "state": null,
    "zip": "75017",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/VLEEY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]