[
  {
    "symbol": "VLKAF",
    "price": 164.01,
    "beta": 1.280459,
    "volAvg": 948,
    "mktCap": 76292861196,
    "lastDiv": 9.44,
    "range": "148.0-209.9",
    "changes": -0.24,
    "companyName": "Volkswagen AG",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Auto Manufacturers",
    "website": "https://www.volkswagenag.com",
    "description": "Volkswagen AG manufactures and sells automobiles primarily in Europe, North America, South America, and the Asia-Pacific. The company operates in four segments: Passenger Cars and Light Commercial Vehicles, Commercial Vehicles, Power Engineering, and Financial Services. The Passenger Cars and Light Commercial Vehicles segment develops vehicles, engines, and vehicle software; and light commercial vehicles; and produces and sells passenger cars and related parts. The Commercial Vehicles segment develops, produces, and sells trucks and buses; and offers parts and related services. The Power Engineering segment offers large-bore diesel engines, turbomachinery, and propulsion components. The Financial Services segment provides dealer and customer financing, leasing, banking and insurance, fleet management, and mobility services. The company also offers motorcycles. It provides its products under the Volkswagen Passenger Cars, Audi, KODA, SEAT, Bentley, Porsche, Volkswagen Commercial Vehicles, Scania, MAN, Lamborghini, Ducati, and Bugatti brands. Volkswagen AG was founded in 1937 and is based in Wolfsburg, Germany. Volkswagen AG operates as a subsidiary of Porsche Automobil Holding SE.",
    "ceo": "Mr. Thomas  Schafer",
    "sector": "Consumer Cyclical",
    "country": "DE",
    "fullTimeEmployees": "676915",
    "phone": "49 5361 9 0",
    "address": "Berliner Ring 2",
    "city": "Wolfsburg",
    "state": null,
    "zip": "38440",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/VLKAF.png",
    "ipoDate": "2010-01-05",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]