[
  {
    "symbol": "VLO",
    "price": 115.69,
    "beta": 1.649295,
    "volAvg": 4534022,
    "mktCap": 41823900804,
    "lastDiv": 4.08,
    "range": "96.93-150.39",
    "changes": 0.34,
    "companyName": "Valero Energy Corporation",
    "currency": "USD",
    "cik": "0001035002",
    "isin": "US91913Y1001",
    "cusip": "91913Y100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Refining & Marketing",
    "website": "https://www.valero.com",
    "description": "Valero Energy Corporation manufactures, markets, and sells transportation fuels and petrochemical products in the United States, Canada, the United Kingdom, Ireland, and internationally. The company operates through three segments: Refining, Renewable Diesel, and Ethanol. It produces conventional, premium, and reformulated gasolines; gasoline meeting the specifications of the California Air Resources Board (CARB); diesel fuels, and low-sulfur and ultra-low-sulfur diesel fuels; CARB diesel; other distillates; jet fuels; blendstocks; and asphalts, petrochemicals, lubricants, and other refined petroleum products, as well as sells lube oils and natural gas liquids. As of December 31, 2021, the company owned 15 petroleum refineries with a combined throughput capacity of approximately 3.2 million barrels per day; and 12 ethanol plants with a combined ethanol production capacity of approximately 1.6 billion gallons per year. It sells its refined products through wholesale rack and bulk markets; and through approximately 7,000 outlets under the Valero, Beacon, Diamond Shamrock, Shamrock, Ultramar, and Texaco brands. The company also produces and sells ethanol, dry distiller grains, syrup, and inedible corn oil primarily to animal feed customers. In addition, it owns and operates crude oil and refined petroleum products pipelines, terminals, tanks, marine docks, truck rack bays, and other logistics assets; and owns and operates a plant that processes animal fats, used cooking oils, and inedible distillers corn oils into renewable diesel. The company was formerly known as Valero Refining and Marketing Company and changed its name to Valero Energy Corporation in August 1997. Valero Energy Corporation was founded in 1980 and is headquartered in San Antonio, Texas.",
    "ceo": "Mr. Joseph W. Gorder",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "9716",
    "phone": "210 345 2000",
    "address": "One Valero Way",
    "city": "San Antonio",
    "state": "TX",
    "zip": "78249",
    "dcfDiff": 2.87777,
    "dcf": 146.088,
    "image": "https://financialmodelingprep.com/image-stock/VLO.png",
    "ipoDate": "1982-01-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]