[
  {
    "symbol": "VLOWY",
    "price": 2.245,
    "beta": 2.534482,
    "volAvg": 1087,
    "mktCap": 2600024372,
    "lastDiv": 57.24,
    "range": "1.7-3.3",
    "changes": 0.125,
    "companyName": "Vallourec S.A.",
    "currency": "USD",
    "cik": null,
    "isin": "US92023R4074",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Steel",
    "website": "https://www.vallourec.com",
    "description": "Vallourec S.A., through its subsidiaries, provides tubular solutions for the oil and gas, industry, and energy markets in Europe, North America, South America, Asia, and internationally. It operates through Seamless Tubes and Specialty Products segments. The company offers seamless tubes for refineries, petrochemical facilities, and floating liquefied natural gas plants, as well as production, storage, and offloading units; casings; tubings; VAM connections; rigid subsea line pipes, onshore rigid line pipes, and specialized tubes for transportation of oil and gas; and carbon steel and steel alloy tubes, hollow bars, and connections for the processing of industrial fluids, and oil and gas. Its oil and gas market services include assistance in lowering tubes, inspecting connections, and supervising assembly; repair services for its products and thread tubes inventory management, advisory, and training services; tube inspection, maintenance, and repair services; on-site services; preparation for drilling operations; well coordination and supply services based on the drilling programs; integrated solutions for the subsea line pipe market comprising welding, coating, insulation, logistics, and service agreements; tube coating and welding services. The company's power generation market products and services comprise seamless tubes for steam generators. Its industrial market products and services include tubes and hollow bars, as well as circular, square, rectangular, and octagonal sections; tubular solutions for infrastructure construction; tubes and rings to manufacture cranes, construction machinery, agricultural machinery, and hydraulic cylinders; and tubes and axles for automotive manufacturers. The company is also involved in the iron ore production business; and various projects concerning renewable energies. Vallourec S.A. was founded in 1899 and is headquartered in Boulogne-Billancourt, France.",
    "ceo": "Mr. Philippe  Guillemot",
    "sector": "Basic Materials",
    "country": "FR",
    "fullTimeEmployees": "16000",
    "phone": "33 1 49 09 35 00",
    "address": "12, rue de la Verrerie",
    "city": "Boulogne-Billancourt",
    "state": null,
    "zip": "92190",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/VLOWY.png",
    "ipoDate": "2011-04-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]