[
  {
    "symbol": "VLVLY",
    "price": 20.17,
    "beta": 1.126053,
    "volAvg": 60012,
    "mktCap": 41014686177,
    "lastDiv": 0.68,
    "range": "13.661-21.07",
    "changes": 0.03,
    "companyName": "AB Volvo (publ)",
    "currency": "USD",
    "cik": null,
    "isin": "US9288541082",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "website": "https://www.volvogroup.com",
    "description": "AB Volvo (publ), together with its subsidiaries, manufactures and sells trucks, buses, construction equipment, and marine and industrial engines in Europe, North America, South America, Asia, Africa, and Oceania. The company offers trucks for long-haulage, construction, mining, and distribution purposes under the Volvo, UD Trucks, Renault Trucks, Mack, Eicher, Arquus, cellcentric, and Dongfeng Trucks brands; and city and intercity buses, coaches, and bus chassis, as well as associated transport systems under the Prevost and Nova Bus brands. It also provides construction equipment, including excavators, articulated and rigid haulers, wheel loaders, road construction machines, pavers, and compactors under the brand names of Volvo, and SDLG Trucks. In addition, the company offers engines and power solutions for leisure and commercial vessels, as well as for power generation, industrial, and off-road applications under the Volvo Penta brand name. Further, it provides financing, insurance, rental, spare parts, repair, preventive maintenance, service agreement, and assistance services. The company offers its products and services through a network of dealerships and workshops. It has a strategic alliance with Isuzu Motors within commercial vehicles; a partnership with Samsung SDI Co to develop battery packs for its trucks; and an agreement with NVIDIA and Aurora to develop autonomous trucks. AB Volvo (publ) was incorporated in 1915 and is headquartered in Gothenburg, Sweden.",
    "ceo": "Mr. Martin  Lundstedt M.Sc.",
    "sector": "Industrials",
    "country": "SE",
    "fullTimeEmployees": "88318",
    "phone": "46 31 66 00 00",
    "address": "GropegArdsgatan 2",
    "city": "Gothenburg",
    "state": null,
    "zip": "417 15",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/VLVLY.png",
    "ipoDate": "2018-02-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]