[
  {
    "symbol": "VLY",
    "price": 7.64,
    "beta": 1.107746,
    "volAvg": 6608167,
    "mktCap": 3880165061,
    "lastDiv": 0.44,
    "range": "6.39-13.07",
    "changes": -0.09,
    "companyName": "Valley National Bancorp",
    "currency": "USD",
    "cik": "0000714310",
    "isin": "US9197941076",
    "cusip": "919794107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.valley.com",
    "description": "Valley National Bancorp operates as the holding company for Valley National Bank that provides various commercial, retail, insurance, and wealth management financial services products. It operates through Commercial Lending, Consumer Lending, and Investment Management segments. The company offers non-interest bearing, savings, NOW, money market, and time deposit accounts; commercial and industrial, commercial real estate, residential mortgage, and automobile loans; loans secured by the cash surrender value of life insurance; home equity loans and lines of credit; and secured and unsecured other consumer loans. It also invests in various securities and interest-bearing deposits with other banks; and provides international banking services, such as standby and documentary letters of credit, and related products, as well as foreign exchange transactions, documentary collections, foreign wire transfers services, and transaction accounts for non-resident aliens. In addition, the company offers investment services for individuals and small to medium sized businesses; and trusts and custom -tailored investment strategies for various retirement plans. Further, it provides trust services, such as living and testamentary trusts, investment management, custodial and escrow services, and estate administration to individuals; tax credit advisory services; property and casualty, life, health, and title insurance agency services; and health care equipment lending and other commercial equipment leasing services, as well as owns real estate related investments. Additionally, the company offers online, mobile, and telephone banking services; and overdraft, drive-in and night deposit, automated teller machine, remote deposit capture, and safe deposit facility services. As of December 31,2021, it operated 232 branch offices in New Jersey, New York, Florida, and Alabama. The company was incorporated in 1927 and is headquartered in New York, New York.",
    "ceo": "Mr. Ira D. Robbins",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "3826",
    "phone": "973 305 8800",
    "address": "One Penn Plaza",
    "city": "New York",
    "state": "NY",
    "zip": "10119",
    "dcfDiff": 5.94095,
    "dcf": 17.371,
    "image": "https://financialmodelingprep.com/image-stock/VLY.png",
    "ipoDate": "1990-03-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]