[
  {
    "symbol": "VMC",
    "price": 220.86,
    "beta": 0.729577,
    "volAvg": 796274,
    "mktCap": 29387410740,
    "lastDiv": 1.72,
    "range": "137.54-221.63",
    "changes": 0.44,
    "companyName": "Vulcan Materials Company",
    "currency": "USD",
    "cik": "0001396009",
    "isin": "US9291601097",
    "cusip": "929160109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Materials",
    "website": "https://www.vulcanmaterials.com",
    "description": "Vulcan Materials Company, together with its subsidiaries, produces and supplies construction aggregates primarily in the United States. It operates through four segments: Aggregates, Asphalt, Concrete, and Calcium. The Aggregates segment provides crushed stones, sand and gravel, sand, and other aggregates; and related products and services that are applied in construction and maintenance of highways, streets, and other public works, as well as in the construction of housing and commercial, industrial, and other nonresidential facilities. The Asphalt Mix segment offers asphalt mix in Alabama, Arizona, California, New Mexico, Tennessee, and Texas, as well as engages in the asphalt construction paving activity in Alabama, Tennessee, and Texas. The Concrete segment provides ready-mixed concrete in California, Maryland, New Jersey, New York, Oklahoma, Pennsylvania, Texas and Virginia, and Washington D.C. The Calcium segment mines, produces, and sells calcium products for the animal feed, plastics, and water treatment industries. The company was formerly known as Virginia Holdco, Inc. and changed its name to Vulcan Materials Company. Vulcan Materials Company was founded in 1909 and is headquartered in Birmingham, Alabama.",
    "ceo": "Mr. James Thomas Hill",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "11974",
    "phone": "205 298 3000",
    "address": "1200 Urban Center Drive",
    "city": "Birmingham",
    "state": "AL",
    "zip": "35242-5014",
    "dcfDiff": 1.82367,
    "dcf": 180.324,
    "image": "https://financialmodelingprep.com/image-stock/VMC.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]