[
  {
    "symbol": "VMW",
    "price": 140.69,
    "beta": 0.830633,
    "volAvg": 1475161,
    "mktCap": 60546785640,
    "lastDiv": 54.209998999999996,
    "range": "103.55-143.91",
    "changes": -0.29,
    "companyName": "VMware, Inc.",
    "currency": "USD",
    "cik": "0001124610",
    "isin": "US9285634021",
    "cusip": "928563402",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.vmware.com",
    "description": "VMware, Inc. provides software solutions in the areas of modern applications, cloud management and infrastructure, networking, security, and digital workspaces in the United States and internationally. It offers VMware multi-cloud solutions, including VMware vSphere, a data center infrastructure that provides the fundamental compute layer; vSAN and VxRail, which offers holistic data storage and protection options to applications running on vSphere; and vRealize Cloud Management solutions that manages hybrid and multi-cloud environments running in virtual machines and containers, as well as VMware Cloud Foundation, a cloud platform that combines its vSphere, vSAN, and NSX with vRealize Cloud Management into an integrated stack and delivers enterprise-ready cloud infrastructure for private and public clouds. The company also provides networking solutions, such as VMware NSX, NSX Distributed and Gateway Firewalls, NSX Network Detection and Response Engine, NSX Advanced Load Balancer, Tanzu Service Mesh, and VMware SASE; security solutions consisting of VMware Carbon Black Endpoint, Workload, and Container; and digital workspace solutions comprising Workspace ONE Unified Endpoint Management, Access, Intelligent Hub, and Horizon. In addition, it offers application modernization solutions, such as Tanzu Application and Operations Platform, Tanzu Application Service Platform, Tanzu Observability, Tanzu Community Edition, and Tanzu Labs; and cloud management solutions, including vRealize Cloud Management, vCloud Suite, and CloudHealth by VMware Suite. The company sells its products through distributors, resellers, system vendors, and systems integrators. VMware, Inc. has a strategic alliance with Amazon Web Services to build and deliver an integrated hybrid solution. The company was incorporated in 1998 and is headquartered in Palo Alto, California.",
    "ceo": "Mr. Rangarajan  Raghuram",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "38300",
    "phone": "650 427 5000",
    "address": "3401 Hillview Avenue",
    "city": "Palo Alto",
    "state": "CA",
    "zip": "94304",
    "dcfDiff": 0.978021,
    "dcf": 125.378,
    "image": "https://financialmodelingprep.com/image-stock/VMW.png",
    "ipoDate": "2007-08-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]