[
  {
    "symbol": "VNT",
    "price": 31.37,
    "beta": 1.27809,
    "volAvg": 987017,
    "mktCap": 4881768281,
    "lastDiv": 0.1,
    "range": "16.55-31.96",
    "changes": 0.11,
    "companyName": "Vontier Corporation",
    "currency": "USD",
    "cik": "0001786842",
    "isin": "US9288811014",
    "cusip": "928881101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Scientific & Technical Instruments",
    "website": "https://www.vontier.com",
    "description": "Vontier Corporation engages in the research and development, manufacture, sale, and distribution of technical equipment, components, software, and services for manufacturing, repairing, and servicing in the mobility infrastructure industry worldwide. The company offers a range of solutions, including environmental sensors, fueling equipment, field payment hardware, point-of sale, workflow and monitoring software, vehicle tracking and fleet management, software solutions for traffic light control, and vehicle mechanics', and technicians' equipment. Its mobility technologies products include solutions and services in the areas of fuel dispensing, remote fuel management, point-of-sale and payment systems, environmental compliance, vehicle tracking and fleet management, and traffic management; and diagnostics and repair technologies products comprise vehicle repair tools, toolboxes, automotive diagnostic equipment, and software, as well as wheel-service equipment for automotive tire installation and repair shops, including brake lathes, tire changers, wheel balancers, and wheel weights under the Ammco and Coats brands. The company markets its products and services to retail and commercial fueling operators, convenience store and in-bay car wash operators, tunnel car wash and commercial vehicle repair businesses, municipal governments, and public safety entities and fleet owners/operators through a network of franchised mobile distributors, as well as direct sales personnel and independent distributors. It serves customers in North America, the Asia Pacific, Europe, and Latin America. The company was incorporated in 2019 and is headquartered in Raleigh, North Carolina.",
    "ceo": "Mr. Mark D. Morelli",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "8100",
    "phone": "984 247 8308",
    "address": "5438 Wade Park Boulevard",
    "city": "Raleigh",
    "state": "NC",
    "zip": "27607",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/VNT.png",
    "ipoDate": "2020-09-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]