[
  {
    "symbol": "VOD",
    "price": 9.35,
    "beta": 0.597318,
    "volAvg": 5624377,
    "mktCap": 25239669453,
    "lastDiv": 0.98,
    "range": "8.93-15.8",
    "changes": 0.02,
    "companyName": "Vodafone Group Public Limited Company",
    "currency": "USD",
    "cik": "0000839923",
    "isin": "US92857W3088",
    "cusip": "92857W308",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Telecom Services",
    "website": "https://www.vodafone.com",
    "description": "Vodafone Group Public Limited Company engages in telecommunication services in Europe and internationally. The company offers mobile services that enable customers to call, text, and access data; fixed line services, including broadband, television (TV) offerings, and voice; and convergence services under the GigaKombi and Vodafone One names to customers. It also provides value added services, such as Internet of Things (IoT) comprising logistics and fleet management, smart metering, insurance, cloud, and security services; and automotive and health solutions. In addition, the company offers M-Pesa, an African payment platform, which provides money transfer, financial, and business and merchant payment services; and various services to operators through its partner market agreements. Vodafone Group Public Limited Company has a strategic partnership with Open Fiber. As of March 31, 2022, it had approximately 323 million mobile customers, 28 million fixed broadband customers, and 22 million TV customers. The company was incorporated in 1984 and is based in Newbury, the United Kingdom.",
    "ceo": "Ms. Margherita  Della Valle",
    "sector": "Communication Services",
    "country": "GB",
    "fullTimeEmployees": "104000",
    "phone": "44 163 533251",
    "address": "Vodafone House",
    "city": "Newbury",
    "state": null,
    "zip": "RG14 2FN",
    "dcfDiff": 1.39631,
    "dcf": 13.0063,
    "image": "https://financialmodelingprep.com/image-stock/VOD.png",
    "ipoDate": "1988-11-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]