[
  {
    "symbol": "VONOY",
    "price": 9.65,
    "beta": 0.799233,
    "volAvg": 262932,
    "mktCap": 15722648346,
    "lastDiv": 0.46,
    "range": "8.234-16.63",
    "changes": 0.08,
    "companyName": "Vonovia SE",
    "currency": "USD",
    "cik": null,
    "isin": "US92887H1077",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Real Estate Services",
    "website": "https://www.vonovia.de",
    "description": "Vonovia SE operates as an integrated residential real estate company in Europe. It operates through five segments: Rental, Value-Add, Recurring Sales, Development, and Deutsche Wohnen. The company offers property management services; apartments and property-related services; and value-added services, including maintenance and modernization of properties, craftsmen and residential environment organization, residential environment organization, condominium administration, cable TV, metering, energy supply, and insurances services. It also engages in the sale of individual condominiums and single-family houses; and project development activities. As of December 31, 2021, the company had 565,334 residential units; 168,015 garages and parking spaces; and 9,289 commercial units, as well as managed 71,173 residential units for other owners in Germany, Austria, and Sweden. The company was formerly known as Deutsche Annington Immobilien SE and changed its name to Vonovia SE in August 2015. Vonovia SE was founded in 1998 and is headquartered in Bochum, Germany.",
    "ceo": "Mr. Rolf Eberhard Buch",
    "sector": "Real Estate",
    "country": "DE",
    "fullTimeEmployees": "15924",
    "phone": "49 234 314 0",
    "address": "Universitätsstrasse 133",
    "city": "Bochum",
    "state": null,
    "zip": "44803",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/VONOY.png",
    "ipoDate": "2015-11-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]