[
  {
    "symbol": "VRNS",
    "price": 25.8,
    "beta": 0.868661,
    "volAvg": 891683,
    "mktCap": 2832349800,
    "lastDiv": 0,
    "range": "15.61-32.82",
    "changes": 0.61,
    "companyName": "Varonis Systems, Inc.",
    "currency": "USD",
    "cik": "0001361113",
    "isin": "US9222801022",
    "cusip": "922280102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.varonis.com",
    "description": "Varonis Systems, Inc. provides software products and services that allow enterprises to manage, analyze, alert, and secure enterprise data in North America, Europe, the Middle East, Africa, and internationally. Its software enables enterprises to protect data stored on premises and in the cloud, including sensitive files and emails; confidential personal data belonging to customers, and patients and employees' data; financial records; strategic and product plans; and other intellectual property. The company offers DatAdvantage that captures, aggregates, normalizes, and analyzes every data access event for users on Windows and UNIX/Linux servers, storage devices, email systems, Intranet servers, cloud applications, and data stores; and DatAlert that profiles users, devices, and their behaviors related to systems and data, detects and alerts on deviations that indicate compromise, and provides a Web-based dashboard and investigative interface. It also provides Data Classification Engine that identifies and tags data based on criteria set in various metadata dimensions, as well as provides business and information technology (IT) personnel with actionable intelligence about data; and DataPrivilege, which offers a self-service Web portal that allows users to request access to data necessary for their business functions, and owners to grant access without IT intervention. In addition, the company provides Data Transport Engine, which provides an execution engine that unifies the manipulation of data and metadata, translating business decisions, and instructions into technical commands, such as data migration or archiving; and DatAnswers that offers search functionality for enterprise data. Varonis Systems, Inc. sells products and services through a network of distributors and resellers. The company serves IT, security, and business personnel. Varonis Systems, Inc. was incorporated in 2004 and is headquartered in New York, New York.",
    "ceo": "Mr. Yakov  Faitelson",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "2143",
    "phone": "877 292 8767",
    "address": "1250 Broadway",
    "city": "New York",
    "state": "NY",
    "zip": "10001",
    "dcfDiff": 1.91131,
    "dcf": 28.6413,
    "image": "https://financialmodelingprep.com/image-stock/VRNS.png",
    "ipoDate": "2014-02-28",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]