[
  {
    "symbol": "VRNT",
    "price": 34.58,
    "beta": 0.943309,
    "volAvg": 479216,
    "mktCap": 2223023712,
    "lastDiv": 0,
    "range": "31.63-51.01",
    "changes": -0.17,
    "companyName": "Verint Systems Inc.",
    "currency": "USD",
    "cik": "0001166388",
    "isin": "US92343X1000",
    "cusip": "92343X100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.verint.com",
    "description": "Verint Systems Inc. provides customer engagement solutions worldwide. It offers various applications for use in Forecasting and Scheduling, which understands the work needed to meet and exceed customer expectations; Quality and Compliance that uses automation and analytics for customer interactions for attended and self-service channels; Interaction Insights, which extracts insights from structured and unstructured customer interactions and activities; Real-Time Work that supports in-the-moment workforce activities; Engagement Channels, an application for messaging, social, chat, email, and interactive voice response; Conversational AI, an intelligent virtual assistant application to enable human-like conversations across every channel; Engagement Orchestration, an application that improves employee efficiency, time to resolution, compliance, and customer satisfaction with workflows; Knowledge Management, which help agents to deliver stellar service with tools. The company also provides Experience Management application which collect and analyze customer experience data, as well as customer engagement cloud platform services. Verint Systems Inc. was incorporated in 1994 and is headquartered in Melville, New York.",
    "ceo": "Mr. Dan  Bodner",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "4200",
    "phone": "631 962 9600",
    "address": "175 Broadhollow Road",
    "city": "Melville",
    "state": "NY",
    "zip": "11747",
    "dcfDiff": 5.95542,
    "dcf": 43.8454,
    "image": "https://financialmodelingprep.com/image-stock/VRNT.png",
    "ipoDate": "2002-05-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]