[
  {
    "symbol": "VRRM",
    "price": 19.13,
    "beta": 1.178752,
    "volAvg": 1296391,
    "mktCap": 2876998960,
    "lastDiv": 0,
    "range": "12.76-19.25",
    "changes": 0.09,
    "companyName": "Verra Mobility Corporation",
    "currency": "USD",
    "cik": "0001682745",
    "isin": "US92511U1025",
    "cusip": "92511U102",
    "exchange": "NASDAQ Capital Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Infrastructure Operations",
    "website": "https://www.verramobility.com",
    "description": "Verra Mobility Corporation provides smart mobility technology solutions and services in the United States, Australia, Canada, and Europe. It operates through three segments: Commercial Services; Government Solutions; and Parking Solutions. The Government Solutions segment offers automated safety solutions, including services and technologies that enable photo enforcement through road safety camera programs, which detects and process traffic violations related to red light, speed, school bus, and city bus lanes. This segment serves municipalities, counties, school districts, and law enforcement agencies. The Commercial Services segment provides automated toll and violations management, and title and registration services to rental car companies, fleet management companies, and other large fleet owners. The Parking Solutions segment provides an integrated suite of parking software and hardware solutions to universities, municipalities, parking operators, healthcare facilities, and transportation hubs. The company was incorporated in 2016 and is headquartered in Mesa, Arizona.",
    "ceo": "Mr. David Martin Roberts",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "1396",
    "phone": "480 443 7000",
    "address": "1150 North Alma School Road",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85201",
    "dcfDiff": 0.866628,
    "dcf": 16.2566,
    "image": "https://financialmodelingprep.com/image-stock/VRRM.png",
    "ipoDate": "2017-03-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]