[
  {
    "symbol": "VRT",
    "price": 23.35,
    "beta": 1.834155,
    "volAvg": 4923217,
    "mktCap": 8866835600,
    "lastDiv": 0.01,
    "range": "7.76-24.26",
    "changes": -0.45,
    "companyName": "Vertiv Holdings Co",
    "currency": "USD",
    "cik": "0001674101",
    "isin": "US92537N1081",
    "cusip": "92537N108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Electrical Equipment & Parts",
    "website": "https://www.vertiv.com",
    "description": "Vertiv Holdings Co, together with its subsidiaries, designs, manufactures, and services critical digital infrastructure technologies and life cycle services for data centers, communication networks, and commercial and industrial environments. It offers AC and DC power management products, thermal management products, integrated rack systems, modular solutions, and management systems for monitoring and controlling digital infrastructure that are integral to the technologies used for various services, including e-commerce, online banking, file sharing, video on-demand, energy storage, wireless communications, Internet of Things, and online gaming. The company also provides lifecycle management services, predictive analytics, and professional services for deploying, maintaining, and optimizing its products and their related systems; and preventative maintenance, acceptance testing, engineering and consulting, performance assessments, remote monitoring, training, spare parts, and critical digital infrastructure software services. It offers its products primarily under the Liebert, NetSure, Geist, E&I, Powerbar, and Avocent brands. The company serves social media, financial services, healthcare, transportation, retail, education, and government industries through a network of direct sales professionals, independent sales representatives, channel partners, and original equipment manufacturers in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. Vertiv Holdings Co is headquartered in Columbus, Ohio.",
    "ceo": "Mr. Giordano  Albertazzi",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "27000",
    "phone": "614 888 0246",
    "address": "1050 Dearborn Drive",
    "city": "Columbus",
    "state": "OH",
    "zip": "43085",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/VRT.png",
    "ipoDate": "2018-08-02",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]