[
  {
    "symbol": "VSAT",
    "price": 40.28,
    "beta": 1.269366,
    "volAvg": 434019,
    "mktCap": 4965557280,
    "lastDiv": 0,
    "range": "25.38-47.35",
    "changes": -0.26,
    "companyName": "Viasat, Inc.",
    "currency": "USD",
    "cik": "0000797721",
    "isin": "US92552V1008",
    "cusip": "92552V100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Communication Equipment",
    "website": "https://www.viasat.com",
    "description": "Viasat, Inc. provides broadband and communications products and services worldwide. The company's Satellite Services segment offers satellite-based fixed broadband services, including broadband internet access and voice over internet protocol services to consumers and businesses; in-flight entertainment and aviation software services to commercial airlines; community internet services; mobile broadband services, including satellite-based internet services to energy offshore vessels, cruise ships, consumer ferries, and yachts; and energy services, which include ultra-secure solutions IP connectivity, bandwidth-optimized over-the-top applications, industrial internet-of-things big data enablement, and industry-leading machine learning analytics. Its Commercial Networks segment offers fixed broadband satellite communication systems comprising satellite network infrastructure and ground terminals; mobile broadband satellite communication systems; antenna systems for terrestrial and satellite applications, such as earth imaging, remote sensing, mobile satellite communication, Ka-band earth stations, and other multi-band antennas; design and technology services comprising analysis, design, and development of satellites and ground systems; application specific integrated circuit and monolithic microwave integrated circuit chips; and network function virtualization, as well as space system design and development products and services include architectures for GEO, MEO, LEO satellites, and other satellite platforms.  The company was incorporated in 1986 and is headquartered in Carlsbad, California.",
    "ceo": "Mr. Mark D. Dankberg",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "6800",
    "phone": "760 476 2200",
    "address": "6155 El Camino Real",
    "city": "Carlsbad",
    "state": "CA",
    "zip": "92009-1699",
    "dcfDiff": 3.94217,
    "dcf": 38.1922,
    "image": "https://financialmodelingprep.com/image-stock/VSAT.png",
    "ipoDate": "1996-12-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]