[
  {
    "symbol": "VSH",
    "price": 28.48,
    "beta": 1.289436,
    "volAvg": 1044695,
    "mktCap": 3978143360,
    "lastDiv": 0.4,
    "range": "16.73-28.56",
    "changes": -0.02,
    "companyName": "Vishay Intertechnology, Inc.",
    "currency": "USD",
    "cik": "0000103730",
    "isin": "US9282981086",
    "cusip": "928298108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Semiconductors",
    "website": "https://www.vishay.com",
    "description": "Vishay Intertechnology, Inc. manufactures and supplies discrete semiconductors and passive electronic components in Asia, Europe, and the Americas. It operates through six segments: Metal Oxide Semiconductor Field Effect Transistors (MOSFETs), Diodes, Optoelectronic Components, Resistors, Inductors, and Capacitors. The MOSFETs segment offers low- and medium-voltage TrenchFET MOSFETs, high-voltage planar MOSFETs, high voltage Super Junction MOSFETs, power integrated circuits, and integrated function power devices. The Diodes segment provides rectifiers, small signal diodes, protection diodes, thyristors/silicon-controlled rectifiers, and power modules. The Optoelectronic Components segment contains standard and customer specific optoelectronic components, such as infrared (IR) emitters and detectors, IR remote control receivers, optocouplers, solid-state relays, optical sensors, light-emitting diodes, 7-segment displays, and IR data transceiver modules. The Resistors segment offers resistors, which are basic components used in various forms of electronic circuitry to adjust and regulate levels of voltage and current. The Inductors segment provides inductors for use as an internal magnetic field to change alternating current phase and resist alternating current. The Capacitors segment offers capacitors, which store energy and discharge it when needed. The company sells its products under Siliconix, Dale, Draloric, Beyschlag, Sfernice, MCB, UltraSource, Applied Thin-Film Products, IHLP, HiRel Systems, Sprague, Vitramon, Barry, Roederstein, ESTA, and BCcomponents brands. It serves industrial, computing, automotive, consumer, telecommunications, power supplies, military, aerospace, and medical end markets. Vishay Intertechnology, Inc. was incorporated in 1962 and is headquartered in Malvern, Pennsylvania.",
    "ceo": "Mr. Joel  Smejkal",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "23900",
    "phone": "610 644 1300",
    "address": "63 Lancaster Avenue",
    "city": "Malvern",
    "state": "PA",
    "zip": "19355-2143",
    "dcfDiff": 5.07029,
    "dcf": 27.8603,
    "image": "https://financialmodelingprep.com/image-stock/VSH.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]