[
  {
    "symbol": "VTRS",
    "price": 9.72,
    "beta": 1.175704,
    "volAvg": 9717154,
    "mktCap": 11654571756,
    "lastDiv": 0.48,
    "range": "8.42-12.4",
    "changes": -0.13,
    "companyName": "Viatris Inc.",
    "currency": "USD",
    "cik": "0001792044",
    "isin": "US92556V1061",
    "cusip": "92556V106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.viatris.com",
    "description": "Viatris Inc. operates as a healthcare company worldwide. The company operates in four segments: Developed Markets, Greater China, JANZ, and Emerging Markets. It offers prescription brand drugs, generic drugs, complex generic drugs, biosimilars, and active pharmaceutical ingredients (APIs). The company offers drugs in various therapeutic areas, including noncommunicable and infectious diseases; biosimilars in the areas of oncology, immunology, endocrinology, ophthalmology, and dermatology; and APIs for antibacterial, central nervous system agents, antihistamines/antiasthmatics, cardiovascular, antivirals, antidiabetics, antifungals, and proton pump inhibitor areas, as well as support services, such as diagnostic clinics, educational seminars, and digital tools to help patients better manage their health. It provides its medicines in the form of oral solid doses, injectables, complex dosage forms, and APIs to retail and pharmacy establishments, wholesalers and distributors, payers, insurers and governments, and institutions. The company distributes its products through pharmaceutical wholesalers/distributors, pharmaceutical retailers, institutional pharmacies, mail-order and e-commerce pharmacies, and specialty pharmacies. It sells its products under the Lyrica, Lipitor, Creon, Influvac, Wixela Inhub, EpiPen auto-injector, Fraxiparine, and Yupelri; Norvasc and Viagra; AMITIZA, Lipacreon, and Effexor; and Celebrex and ARV names, as well as offers biosimilars franchises, including Fulphila, Ogivri, Hulio, and SEMGLEE. The company has collaboration and licensing agreements with Revance Therapeutics, Inc.; Momenta Pharmaceuticals, Inc.; Theravance Biopharma, Inc.; Biocon Ltd.; and Fujifilm Kyowa Kirin Biologics Co. Ltd. Viatris Inc. was founded in 1961 and is headquartered in Canonsburg, Pennsylvania.",
    "ceo": "Mr. Scott Andrew Smith",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "38000",
    "phone": "724 514 1800",
    "address": "1000 Mylan Boulevard",
    "city": "Canonsburg",
    "state": "PA",
    "zip": "15317",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/VTRS.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]