[
  {
    "symbol": "VVV",
    "price": 36.07,
    "beta": 1.365492,
    "volAvg": 2472754,
    "mktCap": 5008500139,
    "lastDiv": 0.5,
    "range": "24.4-39.67",
    "changes": 0.07,
    "companyName": "Valvoline Inc.",
    "currency": "USD",
    "cik": "0001674910",
    "isin": "US92047W1018",
    "cusip": "92047W101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Refining & Marketing",
    "website": "https://www.valvoline.com",
    "description": "Valvoline Inc. manufactures, markets, and supplies, engine and automotive maintenance products and services. It operates through two segments, Retail Services and Global Products. The company offers lubricants for passenger car, light duty, and heavy duty; antifreeze/coolants for original equipment manufacturers; functional and maintenance chemicals, such as brake fluids and power steering fluids, as well as specialty coatings for automotive and industrial applications; and oil and air filters for light-duty vehicles. It also provides batteries, windshield wiper blades, light bulbs, serpentine belts, and drain plugs. In addition, the company operates Valvoline instant oil change service centers. As of September 30, 2021, it operated and franchised approximately 1,594 quick-lube locations under the Valvoline Instant Oil Change brand in the United States and the Great Canadian Oil Change brand in Canada. The company also serves car dealers, general repair shops, and third-party quick lube locations, as well as through distributors and licensees. It has operations in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The company was founded in 1866 and is headquartered in Lexington, Kentucky.",
    "ceo": "Mr. Samuel J. Mitchell Jr.",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "8900",
    "phone": "859 357 7777",
    "address": "100 Valvoline Way",
    "city": "Lexington",
    "state": "KY",
    "zip": "40509",
    "dcfDiff": 1.87317,
    "dcf": 33.9868,
    "image": "https://financialmodelingprep.com/image-stock/VVV.png",
    "ipoDate": "2016-09-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]