[
  {
    "symbol": "VZ",
    "price": 36.82,
    "beta": 0.344718,
    "volAvg": 19691880,
    "mktCap": 154790912389,
    "lastDiv": 2.61,
    "range": "33.72-51.89",
    "changes": 0.27,
    "companyName": "Verizon Communications Inc.",
    "currency": "USD",
    "cik": "0000732712",
    "isin": "US92343V1044",
    "cusip": "92343V104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.verizon.com",
    "description": "Verizon Communications Inc., through its subsidiaries, offers communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. Its Consumer segment provides postpaid and prepaid service plans; internet access on notebook computers and tablets; wireless equipment, including smartphones and other handsets; and wireless-enabled internet devices, such as tablets, and other wireless-enabled connected devices comprising smart watches. It also provides residential fixed connectivity solutions, such as internet, video, and voice services; and sells network access to mobile virtual network operators. As of December 31, 2021, it had approximately 115 million wireless retail connections, 7 million wireline broadband connections, and 4 million Fios video connections. The company's Business segment provides network connectivity products, including private networking, private cloud connectivity, virtual and software defined networking, and internet access services; and internet protocol-based voice and video services, unified communications and collaboration tools, and customer contact center solutions. This segment also offers a suite of management and data security services; domestic and global voice and data solutions, such as voice calling, messaging services, conferencing, contact center solutions, and private line and data access networks; customer premises equipment; installation, maintenance, and site services; and Internet of Things products and services. As of December 31, 2021, it had approximately 27 million wireless retail postpaid connections and 477 thousand wireline broadband connections. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.",
    "ceo": "Mr. Hans E. Vestberg",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "117100",
    "phone": "212 395 1000",
    "address": "1095 Avenue of the Americas",
    "city": "New York",
    "state": "NY",
    "zip": "10036",
    "dcfDiff": 1.31479,
    "dcf": 39.3252,
    "image": "https://financialmodelingprep.com/image-stock/VZ.png",
    "ipoDate": "1983-11-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]