[
  {
    "symbol": "WAT",
    "price": 257.44,
    "beta": 0.859859,
    "volAvg": 548103,
    "mktCap": 15197609984,
    "lastDiv": 0.04,
    "range": "248.18-369.0",
    "changes": -0.3,
    "companyName": "Waters Corporation",
    "currency": "USD",
    "cik": "0001000697",
    "isin": "US9418481035",
    "cusip": "941848103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Diagnostics & Research",
    "website": "https://www.waters.com",
    "description": "Waters Corporation, a specialty measurement company, provides analytical workflow solutions in Asia, the Americas, and Europe. It operates through two segments, Waters and TA. The company designs, manufactures, sells, and services high and ultra-performance liquid chromatography, as well as mass spectrometry (MS) technology systems and support products, including chromatography columns, other consumable products, and post-warranty service plans. It also designs, manufactures, sells, and services thermal analysis, rheometry, and calorimetry instruments; and develops and supplies software-based products that interface with its instruments, as well as other manufacturers' instruments. Its MS technology instruments are used in drug discovery and development comprising clinical trial testing, the analysis of proteins in disease processes, nutritional safety analysis, and environmental testing. The company offers thermal analysis, rheometry, and calorimetry instruments for use in predicting the suitability and stability of fine chemicals, pharmaceuticals, water, polymers, metals, and viscous liquids for various industrial, consumer good, and healthcare products, as well as for life science research. Its products are used by life science, pharmaceutical, biochemical, industrial, nutritional safety, environmental, academic, and governmental customers working in research and development, quality assurance, and other laboratory applications. Waters Corporation was founded in 1958 and is headquartered in Milford, Massachusetts.",
    "ceo": "Dr. Udit  Batra Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "8200",
    "phone": "508 478 2000",
    "address": "34 Maple Street",
    "city": "Milford",
    "state": "MA",
    "zip": "01757",
    "dcfDiff": 1.11889,
    "dcf": 332.011,
    "image": "https://financialmodelingprep.com/image-stock/WAT.png",
    "ipoDate": "1995-11-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]