[
  {
    "symbol": "WB",
    "price": 13.245,
    "beta": 0.524295,
    "volAvg": 1109895,
    "mktCap": 3116164501,
    "lastDiv": 0.85,
    "range": "10.02-25.57",
    "changes": -0.255,
    "companyName": "Weibo Corporation",
    "currency": "USD",
    "cik": "0001595761",
    "isin": "US9485961018",
    "cusip": "948596101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Content & Information",
    "website": "https://weibo.com",
    "description": "Weibo Corporation, through its subsidiaries, operates as a social media platform for people to create, distribute, and discover content in the People's Republic of China. It operates in two segments, Advertising and Marketing Services; and Value-Added Services. The company offers discovery products to help users discover content on its platform; self-expression products that enable its users to express themselves on its platform; and social products to promote social interaction between users on its platform. It also provides advertising and marketing solutions, such as social display advertisements; and promoted marketing offerings, such as Fans Headline and Weibo Express, as well as promoted trends and search products that appear alongside user's trends discovery and search behaviors. In addition, the company offers products, such as trends, search, video/live streaming, and editing tools; content customization, copyright contents pooling, and user interaction development; and search list recommendation, trends list recommendation, and Weibo app opening advertisements. Further, it provides back-end management, traffic support, and product solutions to MCNs, unions, and e-commerce partners; open application platform for other app developers that allows users to log into third-party applications with their Weibo account for sharing third-party content on its platform; and Weibo Wallet, a product that enables platform partners to conduct interest generation activities on Weibo, such as handing out red envelops and coupons. The company was formerly known as T.CN Corporation and changed its name to Weibo Corporation in 2012. The company was founded in 2009 and is headquartered in Beijing, China. Weibo Corporation is a subsidiary of Sina Corporation.",
    "ceo": "Mr. Gaofei  Wang",
    "sector": "Communication Services",
    "country": "CN",
    "fullTimeEmployees": "5935",
    "phone": "86 10 5898 3095",
    "address": "QIHAO Plaza",
    "city": "Beijing",
    "state": null,
    "zip": "100027",
    "dcfDiff": 0.157228,
    "dcf": 24.4672,
    "image": "https://financialmodelingprep.com/image-stock/WB.png",
    "ipoDate": "2014-04-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]