[
  {
    "symbol": "WBA",
    "price": 29.08,
    "beta": 0.719014,
    "volAvg": 7925043,
    "mktCap": 25090108611,
    "lastDiv": 1.92,
    "range": "28.14-42.29",
    "changes": 0.44,
    "companyName": "Walgreens Boots Alliance, Inc.",
    "currency": "USD",
    "cik": "0001618921",
    "isin": "US9314271084",
    "cusip": "931427108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Pharmaceutical Retailers",
    "website": "https://www.walgreensbootsalliance.com",
    "description": "Walgreens Boots Alliance, Inc. operates as a pharmacy-led health and beauty retail company. It operates through two segments, the United States and International. The United States segment sells prescription drugs and an assortment of retail products, including health, wellness, beauty, personal care, consumable, and general merchandise products through its retail drugstores. It also provides central specialty pharmacy services and mail services. As of August 31, 2021, this segment operated 8,965 retail stores under the Walgreens and Duane Reade brands in the United States; and five specialty pharmacies. The International segment sells prescription drugs; and health and wellness, beauty, personal care, and other consumer products through its pharmacy-led health and beauty retail stores and optical practices, as well as through boots.com and an integrated mobile application. It also engages in pharmaceutical wholesaling and distribution business in Germany. As of August 31, 2021, this segment operated 4,031 retail stores under the Boots, Benavides, and Ahumada in the United Kingdom, Thailand, Norway, the Republic of Ireland, the Netherlands, Mexico, and Chile; and 548 optical practices, including 160 on a franchise basis. Walgreens Boots Alliance, Inc. was founded in 1901 and is based in Deerfield, Illinois.",
    "ceo": "Ms. Rosalind Gates Brewer",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "200000",
    "phone": "847 315 3700",
    "address": "108 Wilmot Road",
    "city": "Deerfield",
    "state": "IL",
    "zip": "60015",
    "dcfDiff": 4.79696,
    "dcf": 41.967,
    "image": "https://financialmodelingprep.com/image-stock/WBA.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]