[
  {
    "symbol": "WBD",
    "price": 12.45,
    "beta": 1.492253,
    "volAvg": 22218096,
    "mktCap": 30329570496,
    "lastDiv": 0,
    "range": "8.82-17.65",
    "changes": 0.18,
    "companyName": "Warner Bros. Discovery, Inc.",
    "currency": "USD",
    "cik": "0001437107",
    "isin": "US9344231041",
    "cusip": "934423104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Entertainment",
    "website": "https://corporate.discovery.com",
    "description": "Warner Bros. Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It also produces, develops, and distributes feature films, television, gaming, and other content in various physical and digital formats through basic networks, direct-to-consumer or theatrical, TV content, and games licensing. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en Español, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, Magnolia Network, Cooking Channel, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. Warner Bros. Discovery, Inc.is headquartered in New York, New York.",
    "ceo": "Mr. David M. Zaslav",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "37500",
    "phone": "212 548 5555",
    "address": "230 Park Avenue South",
    "city": "New York",
    "state": "NY",
    "zip": "10003",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/WBD.png",
    "ipoDate": "2005-07-08",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]