[
  {
    "symbol": "WBS",
    "price": 37.42,
    "beta": 1.241197,
    "volAvg": 1361440,
    "mktCap": 6538957601,
    "lastDiv": 1.6,
    "range": "31.03-56.46",
    "changes": -0.36,
    "companyName": "Webster Financial Corporation",
    "currency": "USD",
    "cik": "0000801337",
    "isin": "US9478901096",
    "cusip": "947890109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://public.websteronline.com",
    "description": "Webster Financial Corporation operates as the bank holding company for Webster Bank, National Association that provides a range of banking, investment, and financial services to individuals, families, and businesses in the United States. It operates through three segments: Commercial Banking, HSA Bank, and Retail Banking. The Commercial Banking segment provides lending, deposit, and cash management services; commercial and industrial lending and leasing, commercial real estate lending, equipment financing, and asset-based lending, as well as treasury and payment services; wealth management solutions to business owners, operators, and consumers; and trust, asset management, financial planning, insurance, retirement, and investment products. The HSA Bank segment offers health savings accounts, health reimbursement arrangements, flexible spending accounts, and commuter services that are distributed directly to employers and individual consumers, as well as through national and regional insurance carriers, consultants, and financial advisors. The Retail Banking segment provides deposit and fee-based services, residential mortgages, home equity lines, secured and unsecured loans, and credit cards to consumers. The company also offers online and mobile banking services. As of December 31, 2021, it operated 130 banking centers and 251 ATMs. The company was founded in 1935 and is headquartered in Stamford, Connecticut.",
    "ceo": "Mr. John R. Ciulla",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "4065",
    "phone": "203 578 2202",
    "address": "200 Elm Street",
    "city": "Stamford",
    "state": "CT",
    "zip": "06902",
    "dcfDiff": 7.34996,
    "dcf": 58.19,
    "image": "https://financialmodelingprep.com/image-stock/WBS.png",
    "ipoDate": "1986-12-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]