[
  {
    "symbol": "WCC",
    "price": 176.21,
    "beta": 1.958098,
    "volAvg": 818516,
    "mktCap": 9034674362,
    "lastDiv": 1.5,
    "range": "99.0-176.36",
    "changes": 2.81,
    "companyName": "WESCO International, Inc.",
    "currency": "USD",
    "cik": "0000929008",
    "isin": "US95082P1057",
    "cusip": "95082P105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Industrial Distribution",
    "website": "https://www.wesco.com",
    "description": "WESCO International, Inc. provides business-to-business distribution, logistics services, and supply chain solutions in the United States, Canada, and internationally. It operates through three segments: Electrical & Electronic Solutions (EES), Communications & Security Solutions (CSS), and Utility and Broadband Solutions (UBS). The EES segment supplies products and supply chain solutions, including electrical equipment and supplies, automation and connected devices, security, lighting, wire and cable, and safety, as well as maintenance, repair, and operating (MRO) products. This segment also offers contractor solutions, direct and indirect manufacturing supply chain optimization programs, lighting and renewables advisory services, and digital and automation solutions. The CSS segment operates in the network infrastructure and security markets. This segment sells products directly to end-users or through various channels, including data communications contractors, security, network, professional audio/visual, and systems integrators. It also provides safety and energy management solutions. The UBS segment offers products and services to investor-owned utilities; public power companies; and service and wireless providers, broadband operators, and contractors. This segment's products include wire and cable, transformers, transmission and distribution hardware, switches, protective devices, connectors, conduits, pole line hardware, racks, cabinets, safety and MRO products, and point-to-point wireless devices. This segment also offers various service solutions, including fiber project management, high and medium voltage project design and support, pre-wired meters and capacitor banks, meter testing and metering infrastructure installation, personal protective equipment dielectric testing, and tool repair, as well as emergency response, storage yard, materials, and logistics management. The company was founded in 1922 and is headquartered in Pittsburgh, Pennsylvania.",
    "ceo": "Mr. John J. Engel",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "20000",
    "phone": "412 454 2200",
    "address": "225 West Station Square Drive",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15219",
    "dcfDiff": 15.6739,
    "dcf": 129.786,
    "image": "https://financialmodelingprep.com/image-stock/WCC.png",
    "ipoDate": "1999-05-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]