[
  {
    "symbol": "WD",
    "price": 79.2,
    "beta": 1.386267,
    "volAvg": 240537,
    "mktCap": 2640567600,
    "lastDiv": 2.52,
    "range": "61.06-115.19",
    "changes": 1.22,
    "companyName": "Walker & Dunlop, Inc.",
    "currency": "USD",
    "cik": "0001497770",
    "isin": "US93148P1021",
    "cusip": "93148P102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Mortgage Finance",
    "website": "https://www.walkerdunlop.com",
    "description": "Walker & Dunlop, Inc., through its subsidiaries, originates, sells, and services a range of multifamily and other commercial real estate financing products and services for owners and developers of real estate in the United States. The company offers first mortgage, second trust, supplemental, construction, mezzanine, preferred equity, small-balance, and bridge/interim loans. It also provides multifamily finance for manufactured housing communities, student housing, affordable housing, and senior housing properties under the Fannie Mae's DUS program; and construction and permanent loans to developers and owners of multifamily housing, affordable housing, senior housing, and healthcare facilities. In addition, the company acts as an intermediary in the placement of commercial real estate debt between institutional sources of capital, including life insurance companies, investment banks, commercial banks, pension funds, CMBS conduits, and other institutional investors, as well as owners of various types of commercial real estate. Further, it advises on capital structure; develops the financing package; facilitates negotiations between its client and institutional sources of capital; coordinates due diligence; and assists in closing the transaction. Additionally, the company offers property sales brokerage, underwriting and risk management, and servicing and asset management services. Walker & Dunlop, Inc. was founded in 1937 and is headquartered in Bethesda, Maryland.",
    "ceo": "Mr. William Mallory Walker",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "1451",
    "phone": "301 215 5500",
    "address": "7272 Wisconsin Avenue",
    "city": "Bethesda",
    "state": "MD",
    "zip": "20814",
    "dcfDiff": 3.21575,
    "dcf": 91.3042,
    "image": "https://financialmodelingprep.com/image-stock/WD.png",
    "ipoDate": "2010-12-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]