[
  {
    "symbol": "WDAY",
    "price": 222.96,
    "beta": 1.265492,
    "volAvg": 2100230,
    "mktCap": 58192560669,
    "lastDiv": 0,
    "range": "128.72-229.59",
    "changes": -1.26,
    "companyName": "Workday, Inc.",
    "currency": "USD",
    "cik": "0001327811",
    "isin": "US98138H1014",
    "cusip": "98138H101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.workday.com",
    "description": "Workday, Inc. provides enterprise cloud applications in the United States and internationally. The company's applications help its customers to plan, execute, analyze, and extend to other applications and environments, and to manage their business and operations. It offers a suite of financial management applications, which enable chief financial officers to maintain accounting information in the general ledger; manage financial processes; identify real-time financial, operational, and management insights; enhance financial consolidation; reduce time-to-close; promote internal control and auditability; and achieve consistency across finance operations. The company also provides cloud spend management solutions that helps organizations to streamline supplier selection and contracts, manage indirect spend, and build and execute sourcing events, such as requests for proposals; Human Capital Management (HCM) solution, a suite of human capital management applications that allows organizations to manage the entire employee lifecycle from recruitment to retirement, and enables HR teams to hire, onboard, pay, develop, reskill, and provide employee experiences; Workday applications for planning; and applications for analytics and reporting, including augmented analytics to surface insights to the line of business in simple-to-understand stories, machine learning to drive efficiency and automation, and benchmarks to compare performance against other companies. It serves professional and business services, financial services, healthcare, education, government, technology, media, retail, and hospitality industries. The company was formerly known as North Tahoe Power Tools, Inc. and changed its name to Workday, Inc. in July 2005. Workday, Inc. was incorporated in 2005 and is headquartered in Pleasanton, California.",
    "ceo": "Mr. Aneel  Bhusri",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "17866",
    "phone": "925 951 9000",
    "address": "6110 Stoneridge Mall Road",
    "city": "Pleasanton",
    "state": "CA",
    "zip": "94588",
    "dcfDiff": 28.4203,
    "dcf": 149.24,
    "image": "https://financialmodelingprep.com/image-stock/WDAY.png",
    "ipoDate": "2012-10-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]