[
  {
    "symbol": "WDC",
    "price": 37.85,
    "beta": 1.674295,
    "volAvg": 3922129,
    "mktCap": 12109615147,
    "lastDiv": 13.550000000000002,
    "range": "29.73-50.95",
    "changes": -0.36,
    "companyName": "Western Digital Corporation",
    "currency": "USD",
    "cik": "0000106040",
    "isin": "US9581021055",
    "cusip": "958102105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Computer Hardware",
    "website": "https://www.westerndigital.com",
    "description": "Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for computing devices, such as desktop and notebook personal computers (PCs), smart video systems, gaming consoles, and set top boxes; flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications; and flash-based memory wafers. The company also provides data center devices and solutions comprising enterprise helium hard drives; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, data analysis, and other enterprise applications; data center solutions for data storage systems and tiered storage models; and data storage platforms. In addition, it offers client solutions, such as external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field back up of created content, as well as wireless streaming of high-definition movies, photos, music, and documents to tablets, smartphones, and PCs. The company sells its products under the G-Technology, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.",
    "ceo": "Mr. David V. Goeckeler",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "65000",
    "phone": "408 717 6000",
    "address": "5601 Great Oaks Parkway",
    "city": "San Jose",
    "state": "CA",
    "zip": "95119",
    "dcfDiff": 1.88615,
    "dcf": 46.8561,
    "image": "https://financialmodelingprep.com/image-stock/WDC.png",
    "ipoDate": "1978-10-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]