[
  {
    "symbol": "WDFC",
    "price": 184.94,
    "beta": -0.167957,
    "volAvg": 101483,
    "mktCap": 2510153632,
    "lastDiv": 3.32,
    "range": "145.16-209.64",
    "changes": -1,
    "companyName": "WD-40 Company",
    "currency": "USD",
    "cik": "0000105132",
    "isin": "US9292361071",
    "cusip": "929236107",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Specialty Chemicals",
    "website": "https://www.wd40company.com",
    "description": "WD-40 Company develops and sells maintenance products, and homecare and cleaning products in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company provides multi-purpose maintenance products that include aerosol sprays, non-aerosol trigger sprays, and in liquid-bulk form products under the WD-40 Multi-Use brand name; and specialty maintenance products, such as penetrants, degreasers, corrosion inhibitors, greases, lubricants, and rust removers under the WD-40 Specialist brand, as well as various products under the WD-40 Bike brand name. It also offers multi-purpose and specialty drip oils, and spray lubricant products, as well as other specialty maintenance products under the 3-IN-ONE brand name; and professional spray maintenance products and lubricants for the bike market under the GT85 brand name. In addition, the company provides automatic toilet bowl cleaners under the 2000 Flushes brand name; aerosol and liquid trigger carpet stain and odor eliminators under the Spot Shot brand; room and rug deodorizers under the Carpet Fresh brand name; carpet and household cleaners, and rug and room deodorizers under the 1001 brand; heavy-duty hand cleaner products under the Lava brand name in the United States, as well as under the Solvol brand name in Australia; and automatic toilet bowl cleaners under the X-14 brand name. It sells its products primarily through warehouse club stores, hardware stores, automotive parts outlets, industrial distributors and suppliers, mass retail and home center stores, value retailers, grocery stores, online retailers, farm supply, sport retailers, and independent bike dealers. The company was founded in 1953 and is headquartered in San Diego, California.",
    "ceo": "Mr. Steven A. Brass",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "583",
    "phone": "619 275 1400",
    "address": "9715 Businesspark Avenue",
    "city": "San Diego",
    "state": "CA",
    "zip": "92131",
    "dcfDiff": 9.21944,
    "dcf": 182.179,
    "image": "https://financialmodelingprep.com/image-stock/WDFC.png",
    "ipoDate": "1973-05-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]