[
  {
    "symbol": "WEC",
    "price": 87.44,
    "beta": 0.407042,
    "volAvg": 1371450,
    "mktCap": 27581637100,
    "lastDiv": 3.12,
    "range": "80.82-108.2",
    "changes": -1.26,
    "companyName": "WEC Energy Group, Inc.",
    "currency": "USD",
    "cik": "0000783325",
    "isin": "US92939U1060",
    "cusip": "92939U106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.wecenergygroup.com",
    "description": "WEC Energy Group, Inc., through its subsidiaries, provides regulated natural gas and electricity, and renewable and nonregulated renewable energy services in the United States. The company operates through six segments: Wisconsin, Illinois, Other States, Electric Transmission, Non-Utility Energy Infrastructure, and Corporate and Other. It generates and distributes electricity from coal, natural gas, oil, hydroelectric, wind, solar, and biomass sources; provides electric transmission services; offers retail natural gas distribution services; transports natural gas; and generates, distributes, and sells steam. As of December 31, 2021, it operated approximately 35,800 miles of overhead distribution lines and 35,600 miles of underground distribution cables, as well as 440 electric distribution substations and 510,500 line transformers; 50,900 miles of natural gas distribution mains; 1,200 miles of natural gas transmission mains; 2.3 million natural gas lateral services; 500 natural gas distribution and transmission gate stations; and 68.2 billion cubic feet of working gas capacities in underground natural gas storage fields. The company was formerly known as Wisconsin Energy Corporation and changed its name to WEC Energy Group, Inc. in June 2015. WEC Energy Group, Inc. was incorporated in 1981 and is headquartered in Milwaukee, Wisconsin.",
    "ceo": "Mr. Scott J. Lauber",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "7022",
    "phone": "414 221 2345",
    "address": "231 West Michigan Street",
    "city": "Milwaukee",
    "state": "WI",
    "zip": "53201",
    "dcfDiff": 4.0115,
    "dcf": 96.7815,
    "image": "https://financialmodelingprep.com/image-stock/WEC.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]