[
  {
    "symbol": "WEICY",
    "price": 11.86,
    "beta": 1.147126,
    "volAvg": 31540,
    "mktCap": 15018318961,
    "lastDiv": 0.33,
    "range": "7.07-19.95",
    "changes": 0.1,
    "companyName": "Weichai Power Co., Ltd.",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.weichaipower.com",
    "description": "Weichai Power Co., Ltd. manufactures and sells diesel engines, automobiles, and other automobile components in China and internationally. It operates through Engines, Automobiles and Automobile Components, and Intelligent Logistics segments. The company provides design, development, production, sale, repair, and import and export of engines and auxiliary products, automobile axles and components, and gearboxes and components; hydraulic pumps and motors; hydraulic valves; gears and gear transmission devices; ancillary casting and casting products of hydraulic components; internal combustion engines, energy powertrain systems and ancillary products; technical consultation and technical services; leasing of self-owned houses; steel; business management services; forklift trucks; and warehousing technology and supply chain solution services. It offers its products under the Weichai Power Engine, Fast Gear, Hande Axle, Shacman Heavy Truck, and Linder Hydraulics brands. Weichai Power Co., Ltd. was incorporated in 2002 and is headquartered in Weifang, the People's Republic of China.",
    "ceo": "Mr. Xuguang  Tan",
    "sector": "Industrials",
    "country": "CN",
    "fullTimeEmployees": "87591",
    "phone": "86 53 6229 7072",
    "address": "197, Section A, Fu Shou East Street",
    "city": "Weifang",
    "state": null,
    "zip": "261061",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/WEICY.png",
    "ipoDate": "2010-10-08",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]