[
  {
    "symbol": "WERN",
    "price": 44.17,
    "beta": 0.865492,
    "volAvg": 582790,
    "mktCap": 2799357673,
    "lastDiv": 0.56,
    "range": "35.84-50.31",
    "changes": -0.45,
    "companyName": "Werner Enterprises, Inc.",
    "currency": "USD",
    "cik": "0000793074",
    "isin": "US9507551086",
    "cusip": "950755108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Trucking",
    "website": "https://www.werner.com",
    "description": "Werner Enterprises, Inc., a transportation and logistics company, engages in transporting truckload shipments of general commodities in interstate and intrastate commerce in the United States, Mexico, and internationally. It operates through Truckload Transportation Services and Werner Logistics segments. The Truckload Transportation Services segment operates medium-to-long-haul van fleet that transports various consumer nondurable products and other commodities in truckload quantities using dry van trailers; the expedited fleet, which offers time-sensitive truckload services using driver teams; regional short-haul fleet that provides comparable truckload van service in the United States; and temperature controlled fleet, which offers truckload services for temperature sensitive products using temperature-controlled trailers. It transports retail store merchandise, consumer products, food and beverage products, and manufactured products. The Werner Logistics segment provides non-asset-based transportation and logistics services, including truck brokerage; logistics management services and solutions; rail transportation through alliances with rail and drayage providers; and residential and commercial deliveries of large or heavy items using liftgate straight truck. As of December 31, 2021, the company had a fleet of 8,340 trucks, which included 8,050 company-operated, as well as 290 owned and operated by independent contractors;27,225 company-owned trailers that comprised dry vans, flatbeds, temperature-controlled, and other trailers; and 55 intermodal drayage trucks. Werner Enterprises, Inc. was founded in 1956 and is headquartered in Omaha, Nebraska.",
    "ceo": "Mr. Derek J. Leathers",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "14000",
    "phone": "402 895 6640",
    "address": "14507 Frontier Road",
    "city": "Omaha",
    "state": "NE",
    "zip": "68145-0308",
    "dcfDiff": 3.66938,
    "dcf": 43.7406,
    "image": "https://financialmodelingprep.com/image-stock/WERN.png",
    "ipoDate": "1986-06-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]