[
  {
    "symbol": "WEX",
    "price": 178.04,
    "beta": 1.597923,
    "volAvg": 312116,
    "mktCap": 7627358228,
    "lastDiv": 0,
    "range": "125.0-204.06",
    "changes": 0.47,
    "companyName": "WEX Inc.",
    "currency": "USD",
    "cik": "0001309108",
    "isin": "US96208T1043",
    "cusip": "96208T104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.wexinc.com",
    "description": "WEX Inc. provides financial technology services in the United States and internationally. It operates through three segments: Fleet Solutions, Travel and Corporate Solutions, and Health and Employee Benefit Solutions. The Fleet Solutions segment offers fleet vehicle payment processing services. Its services include customer, account activation, and account retention services; authorization and billing inquiries, and account maintenance services; credit and collections services; merchant services; analytics solutions with access to web-based data analytics platform that offers insights to fleet managers; and ancillary services and tools to fleets to manage expenses and capital requirements. This segment markets its products directly and indirectly to commercial and government vehicle fleet customers with small, medium, and large fleets, as well as with over-the-road and long haul fleets; and indirectly through co-branded and private label relationships. The Travel and Corporate Solutions segment provides payment solutions, including embedded payments; and accounts payable automation and spend management solutions. Its products include virtual cards that are used for transactions where no card is presented. This segment markets its products directly and indirectly to commercial and government organizations. The Health and Employee Benefit Solutions segment offers healthcare payment products and software-as-a-service consumer directed platforms for healthcare market, as well as payroll related and employee benefit products in Brazil. This segment markets its products through health plans, third-party administrators, financial institutions, payroll companies benefits consultants, software providers, and individuals. The company was formerly known as Wright Express Corporation and changed its name to WEX Inc. in October 2012. WEX Inc. was founded in 1983 and is based in Portland, Maine.",
    "ceo": "Ms. Melissa D. Smith",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "6100",
    "phone": "207 773 8171",
    "address": "1 Hancock Street",
    "city": "Portland",
    "state": "ME",
    "zip": "04101",
    "dcfDiff": 12.2071,
    "dcf": 169.663,
    "image": "https://financialmodelingprep.com/image-stock/WEX.png",
    "ipoDate": "2005-02-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]