[
  {
    "symbol": "WF",
    "price": 27.38,
    "beta": 0.643493,
    "volAvg": 43027,
    "mktCap": 6644742680,
    "lastDiv": 2.26,
    "range": "22.18-33.09",
    "changes": -0.39,
    "companyName": "Woori Financial Group Inc.",
    "currency": "USD",
    "cik": "0001264136",
    "isin": "US9810641087",
    "cusip": "981064108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Regional",
    "website": "https://www.woorifg.com",
    "description": "Woori Financial Group Inc., together with its subsidiaries, operates as a commercial bank that provides a range of financial services to individual, business, and institutional customers in Korea. It operates through Banking, Credit Card, Capital, Investment Banking, and Others segments. The company offers savings, demand, and installment deposits; time deposits and certificates of deposit; and working capital, facilities, general purpose household, mortgage, and home equity loans. It also offers debit and credit cards, cash services, card loans, and related services; lease financing; and securities operation, sale of financial instruments, project financing, and other related activities. In addition, the company provides credit purchase, cash advance, credit card loans, foreign exchange services and dealing, import and export-related services, offshore lending, syndicated loans and foreign currency securities investment, investment trust products, bancassurance, and private equity funds. Further, it is involved in the real estate, system software development and maintenance, financing, credit information, securities investment and trading, derivatives trading, asset securitization, investment and international banking, money transfer, and other service. The company also offers automated telephone, Internet, and mobile banking services. In addition, it offers trust management, trustee and custodian service, and repurchase instrument. As of December 31, 2021, it served customers through a network of 768 branches and 4,296 ATMs. The company was founded in 1899 and is headquartered in Seoul, South Korea.",
    "ceo": "Mr. Jong-Yong  Yim",
    "sector": "Financial Services",
    "country": "KR",
    "fullTimeEmployees": "117",
    "phone": "82 2 2125 2050",
    "address": "51, Sogong-ro",
    "city": "Seoul",
    "state": null,
    "zip": "04632",
    "dcfDiff": 31430.9,
    "dcf": 31463.8,
    "image": "https://financialmodelingprep.com/image-stock/WF.png",
    "ipoDate": "2003-10-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]