[
  {
    "symbol": "WFC",
    "price": 40.62,
    "beta": 1.122887,
    "volAvg": 22065600,
    "mktCap": 152415172500,
    "lastDiv": 1.2,
    "range": "35.25-48.84",
    "changes": -0.29,
    "companyName": "Wells Fargo & Company",
    "currency": "USD",
    "cik": "0000072971",
    "isin": "US9497461015",
    "cusip": "949746101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.wellsfargo.com",
    "description": "Wells Fargo & Company, a diversified financial services company, provides banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. It operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services to corporate, commercial real estate, government, and institutional clients. Its products and services comprise corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors. Wells Fargo & Company was founded in 1852 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Charles W. Scharf",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "235591",
    "phone": "866 249 3302",
    "address": "420 Montgomery Street",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94104",
    "dcfDiff": 57.3767,
    "dcf": 103.497,
    "image": "https://financialmodelingprep.com/image-stock/WFC.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]