[
  {
    "symbol": "WFRD",
    "price": 64.03,
    "beta": 2.052089,
    "volAvg": 648724,
    "mktCap": 4614277385,
    "lastDiv": 0,
    "range": "16.96-70.18",
    "changes": -1.74,
    "companyName": "Weatherford International plc",
    "currency": "USD",
    "cik": "0001603923",
    "isin": "IE00BLNN3691",
    "cusip": "G48833118",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Oil & Gas Equipment & Services",
    "website": "https://www.weatherford.com",
    "description": "Weatherford International plc, an energy services company, provides equipment and services for the drilling, evaluation, completion, production, and intervention of oil, geothermal, and natural gas wells worldwide. The company operates in two segments, Western Hemisphere and Eastern Hemisphere. It offers artificial lift systems, including reciprocating rod, progressing cavity pumping, gas, hydraulic, plunger, and hybrid lift systems, as well as related automation and control systems; pressure pumping and reservoir stimulation services, such as acidizing, fracturing, cementing, and coiled-tubing intervention; and drill stem test tools, surface well testing, and multiphase flow measurement services. The company also provides safety, downhole reservoir monitoring, flow control, and multistage fracturing systems, as well as sand-control technologies, and production and isolation packers; liner hangers to suspend a casing string in high-temperature and high-pressure wells; cementing products, including plugs, float and stage equipment, and torque-and-drag reduction technology for zonal isolation; and pre-job planning and installation services. In addition, it offers directional drilling services, and logging and measurement services while drilling; services related to rotary-steerable systems, high-temperature and high-pressure sensors, drilling reamers, and circulation subs; rotating control devices and advanced automated control systems, as well as closed-loop drilling, air drilling, managed-pressure drilling, and underbalanced drilling services; open hole and cased-hole logging services; and intervention and remediation services. Further, the company provides tubular handling, management, and connection services; and re-entry, fishing, wellbore cleaning, and well abandonment services, as well as patented bottom hole, tubularhandling equipment, pressure-control equipment, and drill pipe and collars. The company was incorporated in 1972 and is based in Houston, Texas.",
    "ceo": "Mr. Girishchandra K. Saligram",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "17700",
    "phone": "713 836 4000",
    "address": "2000 St. James Place",
    "city": "Houston",
    "state": "TX",
    "zip": "77056",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/WFRD.png",
    "ipoDate": "2021-01-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]