[
  {
    "symbol": "WIT",
    "price": 4.67,
    "beta": 0.665068,
    "volAvg": 1903841,
    "mktCap": 25586695977,
    "lastDiv": 0.08,
    "range": "4.32-5.54",
    "changes": 0.02,
    "companyName": "Wipro Limited",
    "currency": "USD",
    "cik": "0001123799",
    "isin": "US97651M1099",
    "cusip": "97651M109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.wipro.com",
    "description": "Wipro Limited operates as information technology (IT), consulting, and business process services company worldwide. It operates through three segments: IT Services, IT Products, and India State Run Enterprise Services (ISRE). The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology and IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, cloud and infrastructure, business process, cloud, mobility and analytics, research and development, and hardware and software design services to enterprises. It serves customers in various industry sectors, such as healthcare and medical devices, consumer goods and life sciences, retail, transportation and services, communications, media and information services, technology products and platforms, banking, financial services and insurance, manufacturing, hi-tech, energy, and utilities. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The ISRE segment offers IT services to entities and departments owned or controlled by the Government of India and/or various Indian State Governments. The company was incorporated in 1945 and is based in Bengaluru, India.",
    "ceo": "Mr. Thierry  Delaporte",
    "sector": "Technology",
    "country": "IN",
    "fullTimeEmployees": "250000",
    "phone": "91 80 2844 0011",
    "address": "Doddakannelli",
    "city": "Bengaluru",
    "state": null,
    "zip": "560035",
    "dcfDiff": 29.92,
    "dcf": 34.82,
    "image": "https://financialmodelingprep.com/image-stock/WIT.png",
    "ipoDate": "2000-10-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]