[
  {
    "symbol": "WIX",
    "price": 78.15,
    "beta": 1.234693,
    "volAvg": 1013274,
    "mktCap": 4436997510,
    "lastDiv": 0,
    "range": "56.17-101.55",
    "changes": 2.74,
    "companyName": "Wix.com Ltd.",
    "currency": "USD",
    "cik": "0001576789",
    "isin": "IL0011301780",
    "cusip": "M98068105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.wix.com",
    "description": "Wix.com Ltd., together with its subsidiaries, develops and markets a cloud-based platform that enables anyone to create a website or web application in North America, Europe, Latin America, Asia, and internationally. The company offers Wix Editor, a drag-and-drop visual development and website editing environment platform; Wix ADI that enables users to create a website for their specific needs; and Corvid by Wix to create websites and web applications. It also provides Ascend by Wix, which offers its users access to a suite of approximately 20 products or features enabling them to connect with their customers, automate their work, and grow their business; Wix Logo Maker that allows users to generate a logo using artificial intelligence; Wix Answers, a support infrastructure enabling its users to help their users across various channels; and Wix Payments, a payment platform, which helps its users receive payments from their users through their Wix Website. In addition, the company offers various vertical-specific applications that business owners use to operate various aspects of their business online. Further, it provides a range of complementary services, including App Market that offers its registered users the ability to install and uninstall a range of free and paid web applications; Wix Arena, an online marketplace that brings users seeking help in creating and managing a website, together with Web experts; and Wix App, a native mobile application, which enables users to manage their Websites and Wix operating systems. As of December 31, 2021, the company had approximately 222 million registered users and 6 million premium subscriptions. The company was formerly known as Wixpress Ltd. Wix.com Ltd. was incorporated in 2006 and is headquartered in Tel Aviv, Israel.",
    "ceo": "Mr. Avishai  Abrahami",
    "sector": "Technology",
    "country": "IL",
    "fullTimeEmployees": "4590",
    "phone": "972 3 545 4900",
    "address": "40 Namal Tel Aviv Street",
    "city": "Tel Aviv",
    "state": null,
    "zip": "6350671",
    "dcfDiff": 3.40793,
    "dcf": 91.6779,
    "image": "https://financialmodelingprep.com/image-stock/WIX.png",
    "ipoDate": "2013-11-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]