[
  {
    "symbol": "WLK",
    "price": 116.7,
    "beta": 1.242957,
    "volAvg": 492059,
    "mktCap": 14895704700,
    "lastDiv": 1.43,
    "range": "81.29-126.32",
    "changes": -0.02,
    "companyName": "Westlake Corporation",
    "currency": "USD",
    "cik": "0001262823",
    "isin": "US9604131022",
    "cusip": "960413102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Chemicals",
    "website": "https://www.westlake.com",
    "description": "Westlake Corporation manufactures and supplies petrochemicals, polymers, and building products worldwide. It operates through two segments, Performance and Essential Materials; and Housing and Infrastructure Products. The Performance and Essential Materials segment manufactures and markets polyethylene, styrene monomer, ethylene co-products, PVC, VCM, ethylene dichloride chlor-alkali, and chlorinated derivative products. The Housing and Infrastructure Products segment manufactures and sells residential PVC siding; PVC trim and moldings; roofing applications; decorative stone; windows; PVC decking; PVC films for various inflatables, wallcovering, tape, and roofing applications; polymer composite roof tiles; PVC pipe and fittings; PVC compounds; and various consumer and commercial products such as landscape edging; industrial, home and office matting; marine dock edging; and masonry joint controls. The company offers its products to a range of customers, including chemical processors, plastics fabricators, small construction contractors, municipalities, and supply warehouses for use in various consumer and industrial markets, including residential construction, flexible and rigid packaging, automotive products, healthcare products, water treatment, and coatings, as well as other durable and non-durable goods. The company was formerly known as Westlake Chemical Corporation and changed its name to Westlake Corporation in February 2022. The company was founded in 1986 and is headquartered in Houston, Texas. Westlake Corporation is a subsidiary of TTWF LP.",
    "ceo": "Mr. Albert Yuan Chao",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "15920",
    "phone": "713 960 9111",
    "address": "2801 Post Oak Boulevard",
    "city": "Houston",
    "state": "TX",
    "zip": "77056",
    "dcfDiff": 3.05855,
    "dcf": 117.631,
    "image": "https://financialmodelingprep.com/image-stock/WLK.png",
    "ipoDate": "2004-08-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]