[
  {
    "symbol": "WLMIY",
    "price": 28.16,
    "beta": 0.540613,
    "volAvg": 1190,
    "mktCap": 17579528356,
    "lastDiv": 1.25,
    "range": "24.13-32.42",
    "changes": -0.54,
    "companyName": "Wilmar International Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Farm Products",
    "website": "https://www.wilmar-international.com",
    "description": "Wilmar International Limited operates as an agribusiness company in Singapore, South East Asia, the People's Republic of China, India, Europe, Australia/New Zealand, Africa, and internationally. The company operates through four segments: Food Products, Feed and Industrial Products, Plantation and Sugar Milling, and Others. The Food Products segment engages in processing, branding, and distribution of a range of edible food products, including vegetable oil produced from palm and oilseeds, sugar, flour, rice, noodles, specialty fats, snacks, bakery, and dairy products. The Feed and Industrial Products segment is involved in the processing, merchandising, and distribution of products, such as animal feeds, non-edible palm and lauric products, agricultural commodities, oleochemicals, gas oil, and biodiesel. The Plantation and Sugar Milling segment engages in the cultivation and milling of palm oil and sugarcane. The Others segment provides logistics and jetty port services. As of December 31, 2021, Wilmar International Limited owned an oil palm plantation covering an area 230,480 hectares in Indonesia, Malaysia, and Africa. The company was formerly known as Ezyhealth Asia Pacific Ltd and changed its name to Wilmar International Limited in July 2006. Wilmar International Limited was founded in 1991 and is headquartered in Singapore.",
    "ceo": "Mr. Khoon Hong  Kuok",
    "sector": "Consumer Defensive",
    "country": "SG",
    "fullTimeEmployees": "100000",
    "phone": "65 6216 0244",
    "address": "Wilmar International",
    "city": "Singapore",
    "state": null,
    "zip": "138568",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/WLMIY.png",
    "ipoDate": "2010-01-20",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]