[
  {
    "symbol": "WMB",
    "price": 32.02,
    "beta": 1.188028,
    "volAvg": 6892253,
    "mktCap": 39006442263,
    "lastDiv": 1.79,
    "range": "27.8-35.79",
    "changes": 0.65,
    "companyName": "The Williams Companies, Inc.",
    "currency": "USD",
    "cik": "0000107263",
    "isin": "US9694571004",
    "cusip": "969457100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Midstream",
    "website": "https://www.williams.com",
    "description": "The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of Mexico, Northeast G&P, West, and Gas & NGL Marketing Services segments. The Transmission & Gulf of Mexico segment comprises Transco and Northwest natural gas pipelines; and natural gas gathering and processing, and crude oil production handling and transportation assets in the Gulf Coast region, as well as various petrochemical and feedstock pipelines. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment comprises gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, and the Mid-Continent region, which includes the Anadarko, Arkoma, and Permian basins; and operates natural gas liquid (NGL) fractionation and storage facilities in central Kansas near Conway. The Gas & NGL Marketing Services segment provides wholesale marketing, trading, storage, and transportation of natural gas for natural gas utilities, municipalities, power generators, and producers; risk and asset management; and NGL marketing services. The company owns and operates 30,000 miles of pipelines, 29 processing facilities, 7 fractionation facilities, and approximately 23 million barrels of NGL storage capacity. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.",
    "ceo": "Mr. Alan S. Armstrong",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "5043",
    "phone": "918 573 2000",
    "address": "One Williams Center",
    "city": "Tulsa",
    "state": "OK",
    "zip": "74172",
    "dcfDiff": 3.02253,
    "dcf": 34.5325,
    "image": "https://financialmodelingprep.com/image-stock/WMB.png",
    "ipoDate": "1981-12-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]