[
  {
    "symbol": "WMG",
    "price": 26.67,
    "beta": 1.595273,
    "volAvg": 1744870,
    "mktCap": 13761052850,
    "lastDiv": 0.64,
    "range": "21.57-38.755",
    "changes": 0.31,
    "companyName": "Warner Music Group Corp.",
    "currency": "USD",
    "cik": "0001319161",
    "isin": "US9345502036",
    "cusip": "934550203",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Entertainment",
    "website": "https://www.wmg.com",
    "description": "Warner Music Group Corp. operates as a music entertainment company in the United States, the United Kingdom, Germany, and internationally. The company operates through Recorded Music and Music Publishing segments. The Recorded Music segment is involved in the discovery and development of recording artists, as well as related marketing, promotion, distribution, sale, and licensing of music created by such recording artists; markets its music catalog through compilations and reissuances of previously released music and video titles, as well as previously unreleased materials; and conducts its operation primarily through a collection of record labels, such as Warner Records and Atlantic Records, as well as Asylum, Big Beat, Canvasback, East West, Erato, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Reprise, Roadrunner, Sire, Spinnin' Records, Warner Classics, and Warner Music Nashville. This segment markets, distributes, and sells music and video products to retailers and wholesale distributors; independent labels to retail and wholesale distributors; and various distribution centers and ventures, as well as retail outlets, online physical retailers, streaming services, and download services. The Music Publishing segment owns and acquires rights to approximately one million musical compositions comprising pop hits, American standards, folk songs, and motion picture and theatrical compositions. Its catalog includes approximately 100,000 songwriters and composers; and various genres, including pop, rock, jazz, classical, country, R&B, hip-hop, rap, reggae, Latin, folk, blues, symphonic, soul, Broadway, electronic, alternative, and gospel. This segment also administers the music and soundtracks of various third-party television and film producers and studios. The company was founded in 1929 and is headquartered in New York, New York.",
    "ceo": "Mr. Guy  Moot",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "6200",
    "phone": "212 275 2000",
    "address": "1633 Broadway",
    "city": "New York",
    "state": "NY",
    "zip": "10019",
    "dcfDiff": 7.83796,
    "dcf": 27.932,
    "image": "https://financialmodelingprep.com/image-stock/WMG.png",
    "ipoDate": "2020-06-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]