[
  {
    "symbol": "WMS",
    "price": 112.84,
    "beta": 1.385915,
    "volAvg": 634743,
    "mktCap": 8910726552,
    "lastDiv": 0.56,
    "range": "75.02-153.36",
    "changes": -2.65,
    "companyName": "Advanced Drainage Systems, Inc.",
    "currency": "USD",
    "cik": "0001604028",
    "isin": "US00790R1041",
    "cusip": "00790R104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Building Products & Equipment",
    "website": "https://www.adspipe.com",
    "description": "Advanced Drainage Systems, Inc. designs, manufactures, and markets thermoplastic corrugated pipes and related water management products, and drainage solutions for use in the underground construction and infrastructure marketplace in the United States, Canada, Mexico, and internationally. The company operates through Pipe, International, Infiltrator, and Allied Products & Other segments. It offers single, double, and triple wall corrugated polypropylene and polyethylene pipes; plastic leachfield chambers and systems, EZflow synthetic aggregate bundles, mechanical aeration wastewater solutions, septic tanks and accessories, and combined treatment and dispersal systems; and allied products, including storm retention/detention and septic chambers, polyvinyl chloride drainage structures, fittings, and water quality filters and separators. The company also purchases and distributes construction fabrics and other geosynthetic products for soil stabilization, reinforcement, filtration, separation, erosion control, and sub-surface drainage, as well as drainage grates and other products. It offers its products for non-residential, residential, agriculture, and infrastructure applications through a network of approximately 38 distribution centers. The company was incorporated in 1966 and is headquartered in Hilliard, Ohio.",
    "ceo": "Mr. Donald Scott Barbour",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "5870",
    "phone": "614 658 0050",
    "address": "4640 Trueman Boulevard",
    "city": "Hilliard",
    "state": "OH",
    "zip": "43026",
    "dcfDiff": 0.59512,
    "dcf": 95.0649,
    "image": "https://financialmodelingprep.com/image-stock/WMS.png",
    "ipoDate": "2014-07-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]