[
  {
    "symbol": "WMT",
    "price": 155.33,
    "beta": 0.496478,
    "volAvg": 5946846,
    "mktCap": 418278827259,
    "lastDiv": 2.28,
    "range": "119.89-158.23",
    "changes": 0.84,
    "companyName": "Walmart Inc.",
    "currency": "USD",
    "cik": "0000104169",
    "isin": "US9311421039",
    "cusip": "931142103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Discount Stores",
    "website": "https://www.stock.walmart.com",
    "description": "Walmart Inc. engages in the operation of retail, wholesale, and other units worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, hypermarkets, warehouse clubs, cash and carry stores, and discount stores; membership-only warehouse clubs; ecommerce websites, such as walmart.com, walmart.com.mx, walmart.ca, flipkart.com, and samsclub.com; and mobile commerce applications. The company offers grocery and consumables, which includes dairy, meat, bakery, deli, produce, dry, chilled or frozen packaged foods, alcoholic and nonalcoholic beverages, floral, snack foods, candy, other grocery items, health and beauty aids, paper goods, laundry and home care, baby care, pet supplies, and other consumable items; and health and wellness products covering pharmacy, over-the-counter drugs and other medical products, and optical and hearing services. It also provides gasoline stations and tobacco; home improvement, outdoor living, gardening, furniture, apparel, jewelry, tools and power equipment, housewares, toys, seasonal items, mattresses, and tire and battery centers; and consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. In addition, the company offers fuel and financial services and related products, including money orders, prepaid cards, money transfers, and check cashing and bill payment, as well as various types of installment lending. It operates approximately 10,500 stores and various e-commerce websites under 46 banners in 24 countries. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. The company was founded in 1945 and is based in Bentonville, Arkansas.",
    "ceo": "Mr. C. Douglas McMillon",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "2100000",
    "phone": "479 273 4000",
    "address": "702 South West 8th Street",
    "city": "Bentonville",
    "state": "AR",
    "zip": "72716",
    "dcfDiff": 13.112,
    "dcf": 156.412,
    "image": "https://financialmodelingprep.com/image-stock/WMT.png",
    "ipoDate": "1972-08-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]