[
  {
    "symbol": "WNS",
    "price": 71.56,
    "beta": 1.18345,
    "volAvg": 331269,
    "mktCap": 3460698848,
    "lastDiv": 0,
    "range": "67.42-94.96",
    "changes": 0.56,
    "companyName": "WNS (Holdings) Limited",
    "currency": "USD",
    "cik": "0001356570",
    "isin": "US92932M1018",
    "cusip": "92932M101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.wns.com",
    "description": "WNS (Holdings) Limited, a business process management (BPM) company, provides data, voice, analytical, and business transformation services worldwide. The company operates through two segments, WNS Global BPM and WNS Auto Claims BPM. It offers industry-specific services to clients primarily in insurance; diversified businesses, including manufacturing, retail, consumer packaged goods, media and entertainment, and telecommunication; travel and leisure; healthcare; utilities; shipping and logistics; consulting and professional services; and banking and financial services. It also provides a range of services, such as finance and accounting, customer experience, research and analytics, technology, legal, and human resources outsourcing services. In addition, the company offers transformation services designed to allow its clients to enhance productivity, manage changes in the business environment, and leverage business knowledge to increase market competitiveness. Further, it provides claims handling and repair management services for automobile repairs through a network of third-party repair centers; and a suite of accident management services comprising credit hire and repair. WNS (Holdings) Limited was founded in 1996 and is based in Mumbai, India.",
    "ceo": "Mr. Keshav R. Murugesh",
    "sector": "Technology",
    "country": "IN",
    "fullTimeEmployees": "59755",
    "phone": "91 22 4095 2100",
    "address": "Godrej & Boyce Complex",
    "city": "Mumbai",
    "state": null,
    "zip": "400079",
    "dcfDiff": 1.15823,
    "dcf": 86.5482,
    "image": "https://financialmodelingprep.com/image-stock/WNS.png",
    "ipoDate": "2006-07-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]