[
  {
    "symbol": "WOLF",
    "price": 54.23,
    "beta": 1.507394,
    "volAvg": 3095877,
    "mktCap": 6750225020,
    "lastDiv": 0.002,
    "range": "39.02-125.48",
    "changes": -1.99,
    "companyName": "Wolfspeed, Inc.",
    "currency": "USD",
    "cik": "0000895419",
    "isin": "US9778521024",
    "cusip": "977852102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Semiconductors",
    "website": "https://www.wolfspeed.com",
    "description": "Wolfspeed, Inc. provides silicon carbide and gallium nitride (GaN) materials, power devices, and radio frequency (RF) devices based on wide bandgap semiconductor materials and silicon. The company's silicon carbide and GaN materials comprise silicon carbide bare wafers, epitaxial wafers, and GaN epitaxial layers on silicon carbide wafers. It offers silicon carbide materials for customers to manufacture products for RF, power, and other applications. The company's power devices include silicon carbide Schottky diodes, metal oxide semiconductor field effect transistors (MOSFETs), power modules, and gate driver boards for customers and distributors to use in applications, such as electric vehicles comprising charging infrastructure, server power supplies, solar inverters, uninterruptible power supplies, industrial power supplies, and other applications. Its RF devices comprise GaN-based die, high-electron mobility transistors, monolithic microwave integrated circuits, and laterally diffused MOSFET power transistors for telecommunications infrastructure, military, and other commercial applications. The company's products are also used in transportation, fast charging, wireless systems, 5G, motor drives, renewable energy and storage, and aerospace and defense applications; and materials products and RF devices are used in military communications, radar, satellite, and telecommunication applications. It serves customers in North America, Asia, and Europe. The company was formerly known as Cree, Inc. and changed its name to Wolfspeed, Inc. in October 2021. Wolfspeed, Inc. was founded in 1987 and is headquartered in Durham, North Carolina.",
    "ceo": "Mr. Gregg A. Lowe",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "4017",
    "phone": "919 407 5300",
    "address": "4600 Silicon Drive",
    "city": "Durham",
    "state": "NC",
    "zip": "27703",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/WOLF.png",
    "ipoDate": "1993-02-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]