[
  {
    "symbol": "WOR",
    "price": 63.37,
    "beta": 1.261971,
    "volAvg": 143916,
    "mktCap": 3154153032,
    "lastDiv": 1.24,
    "range": "38.01-65.17",
    "changes": 0.9,
    "companyName": "Worthington Industries, Inc.",
    "currency": "USD",
    "cik": "0000108516",
    "isin": "US9818111026",
    "cusip": "981811102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Metal Fabrication",
    "website": "https://www.worthingtonindustries.com",
    "description": "Worthington Industries, Inc., an industrial manufacturing company, focuses on value-added steel processing, manufactured consumer, building, and sustainable mobility products in North America and internationally. It operates through Steel Processing, Consumer Products, Building Products, and Sustainable Energy Solutions segments. The Steel Processing segment processes flat-rolled steel for customers primarily in the automotive, aerospace, agricultural, appliance, construction, container, energy, hardware, heavy-truck, HVAC, lawn and garden, leisure and recreation, office furniture, and office equipment markets. It also toll processes steel for steel mills, large end-users, service centers, and other processors. The Consumer Products segment sells tools, outdoor living, and celebrations products under the Coleman, Bernzomatic, Balloon Time, Mag-Torch, General, Garden-Weasel, Pactool International, Hawkeye, Worthington Pro Grade, and Level5 brand names. The Building Products segment sells refrigerant and LPG cylinders, well water and expansion tanks, and other specialty products to gas producers and distributors. The Sustainable Energy Solutions segment offers on-board fueling systems and services, as well as gas containment solutions and services for the storage, transport, and distribution of industrial gases. The company was founded in 1955 and is headquartered in Columbus, Ohio.",
    "ceo": "Mr. B. Andrew Rose",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "9000",
    "phone": "614 438 3210",
    "address": "200 Old Wilson Bridge Road",
    "city": "Columbus",
    "state": "OH",
    "zip": "43085",
    "dcfDiff": 13.0459,
    "dcf": 68.7459,
    "image": "https://financialmodelingprep.com/image-stock/WOR.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]