[
  {
    "symbol": "WRK",
    "price": 28.23,
    "beta": 1.201056,
    "volAvg": 2443754,
    "mktCap": 7230549900,
    "lastDiv": 1.1,
    "range": "26.84-43.37",
    "changes": -0.47,
    "companyName": "WestRock Company",
    "currency": "USD",
    "cik": "0001732845",
    "isin": "US96145D1054",
    "cusip": "96145D105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Packaging & Containers",
    "website": "https://www.westrock.com",
    "description": "WestRock Company, together with its subsidiaries, provides fiber-based paper and packaging solutions in North America, South America, Europe, Asia, and Australia. It operates through two segments, Corrugated Packaging and Consumer Packaging. The Corrugated Packaging segment produces containerboards, corrugated sheets, corrugated packaging, and preprinted linerboards to consumer and industrial products manufacturers, and corrugated box manufacturers. It also provides structural and graphic design, engineering services and custom, and proprietary and standard automated packaging machines, as well as turn-key installation, automation, line integration, and packaging solutions; distributes corrugated packaging materials and other specialty packaging products, including stretch films, void fills, carton sealing tapes, and other specialty tapes; operates recycling facilities that collect, sort, grade, and bale recovered paper; and provides lithographic laminated packaging products, as well as contract packing services. The Consumer Packaging segment manufactures and sells folding cartons that are used to package food, paper, beverages, dairy products, tobacco, confectionery, health and beauty, other household consumer, and commercial and industrial products; and express mail packages for the overnight courier industry. It also offers inserts and labels, as well as rigid packaging and other printed packaging products, such as transaction cards, brochures, product literature, marketing materials, and grower tags and plant stakes for the horticultural market; and secondary packages and paperboard packaging for over-the-counter and prescription drugs. In addition, this segment manufactures and sells solid fiber and corrugated partitions, and die-cut paperboard components principally to glass container manufacturers and the automotive industry, as well as producers of beer, food, wine, spirits, cosmetics, and pharmaceuticals. WestRock Company is based in Atlanta, Georgia.",
    "ceo": "Mr. David B. Sewell",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "50500",
    "phone": "770 448 2193",
    "address": "1000 Abernathy Road NE",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30328",
    "dcfDiff": 0.0974774,
    "dcf": 38.1175,
    "image": "https://financialmodelingprep.com/image-stock/WRK.png",
    "ipoDate": "2015-06-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]