[
  {
    "symbol": "WSFS",
    "price": 37.7,
    "beta": 0.960563,
    "volAvg": 294325,
    "mktCap": 2316619760,
    "lastDiv": 0.6,
    "range": "29.59-51.77",
    "changes": -0.08,
    "companyName": "WSFS Financial Corporation",
    "currency": "USD",
    "cik": "0000828944",
    "isin": "US9293281021",
    "cusip": "929328102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Banks—Regional",
    "website": "https://www.wsfsbank.com",
    "description": "WSFS Financial Corporation operates as the savings and loan holding company for the Wilmington Savings Fund Society, FSB that provides various banking services in the United States. It operates through three segments: WSFS Bank, Cash Connect, and Wealth Management. It offers various deposit products, including savings accounts, demand deposits, interest-bearing demand deposits, money market deposit accounts, and certificates of deposit, as well as accepts jumbo certificates of deposit from individuals, businesses, and municipalities. The company also provides a range of loans, which comprise fixed and adjustable rate residential loans; commercial real estate mortgage loans; commercial construction loans to developers; commercial loans for working capital, financing equipment and real estate acquisitions, business expansion, and other business purposes; and consumer credit products, such as home improvement, automobile, and other secured and unsecured personal installment loans, as well as home equity lines and unsecured lines of credit, and government-insured reverse mortgages. In addition, it offers various third-party investment and insurance products, such as single-premium annuities, whole life policies, and securities; investment advisory services to high net worth individuals and institutions; mortgage and title services; and leases small equipment and fixed assets, as well as cash management, trust, and wealth management services. Further, the company provides ATM vault cash, smart safe, and other cash logistics services; and online reporting and ATM cash management, predictive cash ordering and reconcilement services, armored carrier management, loss protection, ATM processing equipment sales, and deposit safe cash logistics services. As of December 31, 2020, it operated 112 offices, including 52 in Pennsylvania, 42 in Delaware, 16 in New Jersey, 1 in Virginia, and 1 in Nevada. The company was founded in 1832 and is headquartered in Wilmington, Delaware.",
    "ceo": "Mr. Rodger  Levenson",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "2177",
    "phone": "302 792 6000",
    "address": "500 Delaware Avenue",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19801",
    "dcfDiff": 29.1301,
    "dcf": 77.0101,
    "image": "https://financialmodelingprep.com/image-stock/WSFS.png",
    "ipoDate": "1986-11-26",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]