[
  {
    "symbol": "WSM",
    "price": 125.39,
    "beta": 1.589084,
    "volAvg": 1054358,
    "mktCap": 8052846736,
    "lastDiv": 3.6,
    "range": "106.66-176.89",
    "changes": -0.98,
    "companyName": "Williams-Sonoma, Inc.",
    "currency": "USD",
    "cik": "0000719955",
    "isin": "US9699041011",
    "cusip": "969904101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Retail",
    "website": "https://www.williams-sonomainc.com",
    "description": "Williams-Sonoma, Inc. operates as an omni-channel specialty retailer of various products for home. It offers cooking, dining, and entertaining products, such as cookware, tools, electrics, cutlery, tabletop and bar, outdoor, furniture, and a library of cookbooks under the Williams Sonoma Home brand, as well as home furnishings and decorative accessories under the Williams Sonoma lifestyle brand; and furniture, bedding, lighting, rugs, table essentials, and decorative accessories under the Pottery Barn brand. The company also provides home decor products under the West Elm brand; kids accessories under the Pottery Barn Kids brand; and an organic bedding to multi-purpose furniture under the Pottery Barn Teen brand. In addition, it offers made-to-order lighting, hardware, furniture, and home decors inspired by history under the Rejuvenation brand; and women's and men's accessories, travel, entertaining and bar, home décor, and seasonal items under the Mark and Graham brand, as well as operates a 3-D imaging and augmented reality platform for the home furnishings and décor industry. The company markets its products through e-commerce websites, direct-mail catalogs, and retail stores. It operates 544 stores comprising 502 stores in 41states, Washington, D.C., and Puerto Rico; 20 stores in Canada; 19 stores in Australia; 3 stores in the United Kingdom; and 139 franchised stores, as well as e-commerce websites in various countries in the Middle East, the Philippines, Mexico, South Korea, and India. Williams-Sonoma, Inc. was founded in 1956 and is headquartered in San Francisco, California.",
    "ceo": "Ms. Laura J. Alber",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "12500",
    "phone": "415 421 7900",
    "address": "3250 Van Ness Avenue",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94109",
    "dcfDiff": 3.27629,
    "dcf": 129.946,
    "image": "https://financialmodelingprep.com/image-stock/WSM.png",
    "ipoDate": "1983-07-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]