[
  {
    "symbol": "WSO",
    "price": 376.67,
    "beta": 0.884859,
    "volAvg": 381072,
    "mktCap": 14670769539,
    "lastDiv": 9.8,
    "range": "228.61-379.96",
    "changes": 0.63,
    "companyName": "Watsco, Inc.",
    "currency": "USD",
    "cik": "0000105016",
    "isin": "US9426222009",
    "cusip": "942622200",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Industrial Distribution",
    "website": "https://www.watsco.com",
    "description": "Watsco, Inc., together with its subsidiaries, distributes air conditioning, heating, refrigeration equipment, and related parts and supplies. The company distributes equipment comprising residential ducted and ductless air conditioners, such as gas, electric, and oil furnaces; commercial air conditioning and heating equipment systems; and other specialized equipment. It also offers parts, including replacement compressors, evaporator coils, motors, and other component parts; and supplies, such as thermostats, insulation materials, refrigerants, ductworks, grills, registers, sheet metals, tools, copper tubing, concrete pads, tapes, adhesives, and other ancillary supplies, as well as plumbing and bathroom remodeling supplies. The company serves contractors and dealers that service the replacement and new construction markets for residential and light commercial central air conditioning, heating, and refrigeration systems. As of December 31, 2021, it operated from 671 locations in the United States, Canada, Mexico, and Puerto Rico, as well as exports its products to Latin America and the Caribbean Basin. Watsco, Inc. was founded in 1945 and is headquartered in Miami, Florida.",
    "ceo": "Mr. Albert H. Nahmad",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "7200",
    "phone": "305 714 4100",
    "address": "2665 South Bayshore Drive",
    "city": "Miami",
    "state": "FL",
    "zip": "33133",
    "dcfDiff": 2.80367,
    "dcf": 279.426,
    "image": "https://financialmodelingprep.com/image-stock/WSO.png",
    "ipoDate": "1984-06-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]