[
  {
    "symbol": "WTKWY",
    "price": 126.75,
    "beta": 0.314559,
    "volAvg": 23788,
    "mktCap": 31034991000,
    "lastDiv": 1.88,
    "range": "93.19-135.35",
    "changes": -0.2,
    "companyName": "Wolters Kluwer N.V.",
    "currency": "USD",
    "cik": null,
    "isin": "US9778742059",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Specialty Business Services",
    "website": "https://wolterskluwer.com",
    "description": "Wolters Kluwer N.V. provides professional information, software solutions, and services in the Netherlands, rest of Europe, the United States, Canada, the Asia Pacific, and internationally. The company operates through four segments: Health; Tax & Accounting; Governance, Risk & Compliance; and Legal & Regulatory. The Health segment offers clinical technology and evidence-based solutions that drive effective decision-making and improved outcomes across healthcare. It provides solutions for hospitals, clinics, other healthcare providers, individual clinicians and students, nursing and medical schools and libraries, retail pharmacies, payers, and life sciences organizations. The Tax & Accounting segment offers solutions that help tax, accounting, and audit professionals to drive productivity, navigate change, and deliver better outcomes. It provides solutions for accounting firms, corporate finance, tax and auditing departments, government agencies, libraries, and universities. The Governance, Risk & Compliance segment offers technology-enabled services and solutions for legal entity compliance, legal operations management, banking product compliance, and regulatory reporting. It serves legal, compliance, and risk professionals in corporations, small businesses, law firms, insurers, banks, non-bank lenders, credit unions, leasing companies, and securities firms. The Legal & Regulatory segment provides evidence-based information, actionable insights, and integrated workflow solutions that help customers to make the right decisions and streamline compliance. It enables legal and compliance professionals, and operational risk managers, as well as environmental, health, and safety managers to improve productivity and performance, mitigate risk, and solve complex problems with confidence in law firms, corporations, universities, and government agencies. Wolters Kluwer N.V. was founded in 1836 and is based in Alphen aan den Rijn, the Netherlands.",
    "ceo": "Ms. Nancy  McKinstry",
    "sector": "Industrials",
    "country": "NL",
    "fullTimeEmployees": "20056",
    "phone": "31 172 641 400",
    "address": "Zuidpoolsingel 2",
    "city": "Alphen aan den Rijn",
    "state": null,
    "zip": "2400 BA",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/WTKWY.png",
    "ipoDate": "1999-04-27",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]