[
  {
    "symbol": "WTM",
    "price": 1370,
    "beta": 0.404929,
    "volAvg": 9854,
    "mktCap": 3511830600,
    "lastDiv": 1,
    "range": "1172.0-1560.21",
    "changes": 8.03,
    "companyName": "White Mountains Insurance Group, Ltd.",
    "currency": "USD",
    "cik": "0000776867",
    "isin": "BMG9618E1075",
    "cusip": "G9618E107",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Insurance—Property & Casualty",
    "website": "https://www.whitemountains.com",
    "description": "White Mountains Insurance Group, Ltd., through its subsidiaries, provides insurance and other financial services in the United States. The company operates through five segments: HG Global/BAM, Ark, NSM, Kudu, and Other Operations. The HG Global/BAM segment provides insurance on municipal bonds issued to finance public purposes, such as schools, utilities, and transportation facilities, as well as reinsurance protection services. The Ark segment writes a portfolio of reinsurance and insurance, including property, marine and energy, accident and health, casualty, and specialty products. The NSM segment operates as a managing general agent and program administrator for specialty property and casualty insurance to various sectors comprising specialty transportation, real estate, social services, and pet. The Kudu segment provides capital solutions to boutique asset and wealth managers for generational ownership transfers, management buyouts, acquisitions and growth finances, and legacy partner liquidity, as well as strategic assistance to investees. The Other Operations segment offers insurance solutions to travel industry through broker channel and on a direct-to-consumer basis; and manages separate accounts and pooled investment vehicles for insurance-linked securities sectors, including catastrophe bonds, collateralized reinsurance investments, and industry loss warranties of third-party clients. White Mountains Insurance Group, Ltd. was incorporated in 1980 and is headquartered in Hamilton, Bermuda.",
    "ceo": "Mr. George Manning Rountree",
    "sector": "Financial Services",
    "country": "BM",
    "fullTimeEmployees": "803",
    "phone": "16036402200",
    "address": "A.S. Cooper Building",
    "city": "Hamilton",
    "state": null,
    "zip": "HM 11",
    "dcfDiff": 65.876,
    "dcf": 1433.12,
    "image": "https://financialmodelingprep.com/image-stock/WTM.png",
    "ipoDate": "1985-10-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]