[
  {
    "symbol": "WTRG",
    "price": 39.56,
    "beta": 0.787323,
    "volAvg": 1063359,
    "mktCap": 10458872800,
    "lastDiv": 1.15,
    "range": "38.5-52.43",
    "changes": -0.61,
    "companyName": "Essential Utilities, Inc.",
    "currency": "USD",
    "cik": "0000078128",
    "isin": "US29670G1022",
    "cusip": "29670G102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Water",
    "website": "https://www.essential.co",
    "description": "Essential Utilities, Inc., through its subsidiaries, operates regulated utilities that provide water, wastewater, or natural gas services in the United States. It offers water services through operating and maintenance contract with municipal authorities and other parties. The company also provides non-utility raw water supply services for firms in the natural gas drilling industry; and water and sewer line protection solutions, and repair services to households through a third-party. It serves approximately 7.5 million residential water, commercial water, fire protection, industrial water, wastewater, and other water and utility customers in Pennsylvania, Ohio, Texas, Illinois, North Carolina, New Jersey, Indiana, Virginia, West Virginia, and Kentucky under the Aqua and Peoples brands. The company was formerly known as Aqua America, Inc. and changed its name to Essential Utilities, Inc. in February 2020. Essential Utilities, Inc. was founded in 1886 and is headquartered in Bryn Mawr, Pennsylvania.",
    "ceo": "Mr. Christopher H. Franklin",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "3187",
    "phone": "610 527 8000",
    "address": "762 West Lancaster Avenue",
    "city": "Bryn Mawr",
    "state": "PA",
    "zip": "19010-3489",
    "dcfDiff": 0.239999,
    "dcf": 47.3,
    "image": "https://financialmodelingprep.com/image-stock/WTRG.png",
    "ipoDate": "1980-03-17",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]