[
  {
    "symbol": "WTS",
    "price": 178.29,
    "beta": 1.001408,
    "volAvg": 114038,
    "mktCap": 5948841969,
    "lastDiv": 1.44,
    "range": "118.48-181.4",
    "changes": -0.47,
    "companyName": "Watts Water Technologies, Inc.",
    "currency": "USD",
    "cik": "0000795403",
    "isin": "US9427491025",
    "cusip": "942749102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.watts.com",
    "description": "Watts Water Technologies, Inc. designs, manufactures, and sells products, solution, and systems that manage and conserve the flow of fluids and energy into, through and out of buildings in the commercial and residential markets in the Americas, Europe, the Asia-Pacific, the Middle East, and Africa. The company offers residential and commercial flow control products, including backflow preventers, water pressure regulators, temperature and pressure relief valves, and thermostatic mixing valves. It also provides heating, ventilation, and air conditioning and gas products, such as boilers, water heaters, custom heat, and hot water solutions; hydronic and electric heating systems for under-floor radiant applications; custom heat and hot water solutions; hydronic pump groups for boiler manufacturers and alternative energy control packages; and flexible stainless steel connectors for natural and liquid propane gas in commercial food service and residential applications. In addition, the company offers drainage and water re-use products comprising drainage products and engineered rain water harvesting solutions for commercial, industrial, marine, and residential applications; and water quality products that include point-of-use and point-of-entry water filtration, conditioning, and scale prevention systems for commercial and residential applications. Further, it provides smart mixing system under the IntelliStation name. The company sells its products to plumbing, heating, and mechanical wholesale distributors and dealers, as well as original equipment manufacturers, specialty product distributors, do-it-yourself chains, and retail chains; and directly to wholesalers and private label accounts. Watts Water Technologies, Inc. was founded in 1874 and is headquartered in North Andover, Massachusetts.",
    "ceo": "Mr. Robert J. Pagano Jr., C.M.A., CPA",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "4600",
    "phone": "978 688 1811",
    "address": "815 Chestnut Street",
    "city": "North Andover",
    "state": "MA",
    "zip": "01845-6098",
    "dcfDiff": 4.40765,
    "dcf": 163.688,
    "image": "https://financialmodelingprep.com/image-stock/WTS.png",
    "ipoDate": "1986-08-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]