[
  {
    "symbol": "WTW",
    "price": 232.71,
    "beta": 0.760563,
    "volAvg": 518122,
    "mktCap": 24763369230,
    "lastDiv": 3.36,
    "range": "188.99-258.93",
    "changes": -0.38,
    "companyName": "Willis Towers Watson Public Limited Company",
    "currency": "USD",
    "cik": "0001140536",
    "isin": "IE00BDB6Q211",
    "cusip": "98262P101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Insurance Brokers",
    "website": "https://www.willistowerswatson.com",
    "description": "Willis Towers Watson Public Limited Company operates as an advisory, broking, and solutions company worldwide. It operates through two segments, Health, Wealth and Career; and Risk and Broking. The company offers actuarial support, plan design, and administrative services for traditional pension and retirement savings plans; plan management consulting, broking, and administration services for health and group benefit programs; and benefits outsourcing services. It also provides advice, data, software, and products to address clients' total rewards and talent issues. In addition, the company offers risk advice, insurance brokerage, and consulting services in the areas of property and casualty, aerospace, construction, and marine. Further, it offers investment consulting and discretionary management services to insurance and reinsurance companies; insurance consulting and technology, risk and capital management, pricing and predictive modeling, financial and regulatory reporting, financial and capital modeling, merger and acquisition, outsourcing, and business management services; wholesale insurance broking services to retail and wholesale brokers; and underwriting and capital management, capital market, and advisory and brokerage services. Additionally, the company provides primary medical and ancillary benefit exchange, and outsourcing services to active employees and retirees in the group and individual markets, as well as delivers healthcare and reimbursement accounts, including health savings accounts, health reimbursement arrangements, flexible spending accounts, and other consumer-directed accounts. The company was formerly known as Willis Group Holdings Public Limited Company and changed its name to Willis Towers Watson Public Limited Company in January 2016. Willis Towers Watson Public Limited Company was founded in 1828 and is based in London, the United Kingdom.",
    "ceo": "Mr. Carl A. Hess CERA, F.S.A.",
    "sector": "Financial Services",
    "country": "GB",
    "fullTimeEmployees": "46000",
    "phone": "44 20 3124 6000",
    "address": "51 Lime Street",
    "city": "London",
    "state": null,
    "zip": "EC3M 7DQ",
    "dcfDiff": 22.3662,
    "dcf": 272.976,
    "image": "https://financialmodelingprep.com/image-stock/WTW.png",
    "ipoDate": "2001-06-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]