[
  {
    "symbol": "WW",
    "price": 7.145,
    "beta": 1.824,
    "volAvg": 4356112,
    "mktCap": 565033745,
    "lastDiv": 0,
    "range": "3.28-13.31",
    "changes": 0.265,
    "companyName": "WW International, Inc.",
    "currency": "USD",
    "cik": "0000105319",
    "isin": "US98262P1012",
    "cusip": "98262P101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Personal Services",
    "website": "https://corporate.ww.com",
    "description": "WW International, Inc. provides weight management products and services worldwide. The company operates in four segments: North America, Continental Europe, United Kingdom, and Other. It offers a range of nutritional, activity, behavioral, and lifestyle tools and approaches products and services. The company also provides various digital subscription products to wellness and weight management business, which provide interactive and personalized resources that allow users to follow its weight management program through its app and Web-based products, including personal coaching and digital products; and allows members to inspire and support each other by sharing their experiences with other people on weight management and wellness journeys. In addition, it offers various consumer products, including bars, snacks, cookbooks, kitchen tools, and other products. Further, the company licenses its trademarks and other intellectual property in food, beverages, and other relevant consumer products and services, as well as provides publishing services. It offers products through e-commerce platforms and through partners. The company was formerly known as Weight Watchers International, Inc. and changed its name to WW International, Inc. in September 2019. WW International, Inc. was founded in 1961 and is headquartered in New York, New York.",
    "ceo": "Ms. Sima D. Sistani",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "7100",
    "phone": "212 589 2700",
    "address": "675 Avenue of the Americas",
    "city": "New York",
    "state": "NY",
    "zip": "10010",
    "dcfDiff": 0.873951,
    "dcf": 5.80395,
    "image": "https://financialmodelingprep.com/image-stock/WW.png",
    "ipoDate": "2001-11-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]