[
  {
    "symbol": "WWD",
    "price": 116.87,
    "beta": 1.450704,
    "volAvg": 331175,
    "mktCap": 7016348885,
    "lastDiv": 0.88,
    "range": "79.26-117.23",
    "changes": 0.56,
    "companyName": "Woodward, Inc.",
    "currency": "USD",
    "cik": "0000108312",
    "isin": "US9807451037",
    "cusip": "980745103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Aerospace & Defense",
    "website": "https://www.woodward.com",
    "description": "Woodward, Inc. designs, manufactures, and services control solutions for the aerospace and industrial markets worldwide. The company operates through two segments: Aerospace and Industrial. The Aerospace segment provides fuel pumps, metering units, actuators, air valves, specialty valves, fuel nozzles, and thrust reverser actuation systems for turbine engines and nacelles, and flight deck controls, actuators, servocontrols, motors, and sensors for aircraft. These products are used on commercial and private aircraft and rotorcraft, as well as on military fixed-wing aircraft and rotorcraft, guided weapons, and other defense systems. It also provides aftermarket maintenance, repair and overhaul, and other services to commercial airlines, repair facilities, military depots, third party repair shops, and other end users. This segment sells its products to original equipment manufacturers (OEMs), tier-one suppliers, and various contractors, as well as through aftermarket sales of components, such as provisioning spares or replacements, and spare parts. The Industrial segment offers actuators, valves, pumps, fuel injection systems, solenoids, ignition systems, speed controls, electronics and software, and sensors. These products are used on industrial gas turbines, steam turbines, compressors, and reciprocating engines. This segment sells its aftermarket products, and other related services to OEMs through an independent network of distributors, as well as directly to end users. The company was founded in 1870 and is headquartered in Fort Collins, Colorado.",
    "ceo": "Mr. Charles P. Blankenship Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "8300",
    "phone": "970 482 5811",
    "address": "1081 Woodward Way",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80524",
    "dcfDiff": 5.37809,
    "dcf": 105.272,
    "image": "https://financialmodelingprep.com/image-stock/WWD.png",
    "ipoDate": "1994-04-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]