[
  {
    "symbol": "WWE",
    "price": 108.03,
    "beta": 1.160915,
    "volAvg": 1172666,
    "mktCap": 8048385918,
    "lastDiv": 0.48,
    "range": "60.01-110.24",
    "changes": 0.47,
    "companyName": "World Wrestling Entertainment, Inc.",
    "currency": "USD",
    "cik": "0001091907",
    "isin": "US98156Q1085",
    "cusip": "98156Q108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Entertainment",
    "website": "https://corporate.wwe.com",
    "description": "World Wrestling Entertainment, Inc., an integrated media and entertainment company, engages in the sports entertainment business in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. It operates through three segments: Media, Live Events, and Consumer Products. The Media segment engages in the production and monetization of long-form and short-form video content across various platforms, including WWE Network, broadcast and pay television, and digital and social media, as well as filmed entertainment. The Live Events segment is involved in the sale of tickets; provision of event services; and sale of travel packages related to its live events. The Consumer Products segment engages in merchandising of WWE branded products, such as video games, toys, apparel, and books through licensing arrangements and direct-to-consumer sales, as well as through e-commerce platforms. World Wrestling Entertainment, Inc. was founded in 1980 and is headquartered in Stamford, Connecticut.",
    "ceo": "Mr. Nick  Khan",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "890",
    "phone": "203 352 8600",
    "address": "1241 East Main Street",
    "city": "Stamford",
    "state": "CT",
    "zip": "06902",
    "dcfDiff": 4.21871,
    "dcf": 80.4113,
    "image": "https://financialmodelingprep.com/image-stock/WWE.png",
    "ipoDate": "1999-10-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]