[
  {
    "symbol": "WWNTY",
    "price": 31.62,
    "beta": 0.539846,
    "volAvg": 6,
    "mktCap": 7512532560,
    "lastDiv": 1.62,
    "range": "31.62-46.78",
    "changes": 0,
    "companyName": "Want Want China Holdings Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Packaged Foods",
    "website": "https://www.want-want.com",
    "description": "Want Want China Holdings Limited, an investment holding company, manufactures, distributes, and sells food and beverages. The company operates through four segments: Rice Crackers, Dairy Products and Beverages, Snack Foods, and Other Products. It offers sugar coated crackers, savoury crackers, fried crackers, and gift packs; flavored milk, room temperature yogurt, yogurt drinks, ready-to-drink coffee, juice and sports drinks, herbal tea, and milk powder; candies, popsicles, ball cakes and jellies, beans, nuts, and other snacks; and wine and other food products. The company also trades in food and beverages, and related activities online, as well as raw materials, machineries, etc.; sells chemical materials and plastic films/bags; manufactures and sells machineries and related services; manufactures dehydrating, deoxidating, preservative, and related products; manufactures and sells packaging materials, packing bags, carton boxes, and cans; provides consultancy, information, business, and network technology services; processes and sells rice and oil products; and manufactures and sells rice flour. It serves customers through a sales and distribution network primarily in the People's Republic of China. The company also exports its products to North America, East Asia, South East Asia, and Europe. Want Want China Holdings Limited was founded in 1962 and is headquartered in Kowloon Bay, Hong Kong.",
    "ceo": "Mr. Eng-Meng  Tsai",
    "sector": "Consumer Defensive",
    "country": "HK",
    "fullTimeEmployees": "41040",
    "phone": "852 2730 7780",
    "address": "FTLife Tower",
    "city": "Kowloon Bay",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/WWNTY.png",
    "ipoDate": "2010-08-03",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": false,
    "isAdr": false,
    "isFund": false
  }
]