[
  {
    "symbol": "WYNMF",
    "price": 0.9255,
    "beta": 1.51839,
    "volAvg": 4262,
    "mktCap": 4848167158,
    "lastDiv": 0.057,
    "range": "0.39-1.33",
    "changes": -0.0229,
    "companyName": "Wynn Macau, Limited",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Resorts & Casinos",
    "website": "https://www.wynnmacaulimited.com",
    "description": "Wynn Macau, Limited, together with its subsidiaries, develops, owns, and operates the Wynn Palace and Wynn Macau casino resorts in Macau. The company's Wynn Palace resort features approximately 424,000 square feet of casino space providing 24-hour gaming and various games comprising private gaming salons and sky casinos; a luxury hotel with a total of 1,706 guest rooms, suites, and villas; and 14 food and beverage outlets. Its Wynn Palace resort also consists of approximately 107,000 square feet of retail shopping; 37,000 square feet of meeting and convention space; recreation and leisure facilities consisting of a cable car ride, health club, spa, salon, and pool; and public entertainment attractions, including a lake, animated floral art displays, and fine art displays. In addition, the company's Wynn Macau resort features approximately 252,000 square feet of casino space offering 24-hour gaming and various games, including private gaming salons, sky casinos, and a poker pit; two hotel towers with 1,010 rooms and suites; 12 food and beverage outlets; and recreation and leisure facilities, such as two health clubs and spas, a salon, and a pool. Further, its Wynn Macau resort includes approximately 59,000 square feet of retail shopping and 31,000 square feet of meeting and convention space. The company was incorporated in 2009 and is headquartered in Macau. Wynn Macau, Limited is a subsidiary of WM Cayman Holdings Limited I.",
    "ceo": "Mr. Craig Scott Billings",
    "sector": "Consumer Cyclical",
    "country": "MO",
    "fullTimeEmployees": "11500",
    "phone": "853 2888 9966",
    "address": "Rua Cidade de Sintra",
    "city": "Macau",
    "state": null,
    "zip": null,
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/WYNMF.png",
    "ipoDate": "2010-01-05",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]