[
  {
    "symbol": "X",
    "price": 24.45,
    "beta": 2.138732,
    "volAvg": 6753833,
    "mktCap": 5536824946,
    "lastDiv": 0.2,
    "range": "16.41-31.55",
    "changes": -0.25,
    "companyName": "United States Steel Corporation",
    "currency": "USD",
    "cik": "0001163302",
    "isin": "US9129091081",
    "cusip": "912909108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Steel",
    "website": "https://www.ussteel.com",
    "description": "United States Steel Corporation produces and sells flat-rolled and tubular steel products primarily in North America and Europe. It operates through four segments: North American Flat-Rolled (Flat-Rolled), Mini Mill, U. S. Steel Europe (USSE), and Tubular Products (Tubular). The Flat-Rolled segment offers slabs, strip mill plates, sheets, and tin mill products, as well as iron ore and coke. This segment serves customers in the service center, conversion, transportation, automotive, construction, container, appliance, and electrical markets. The Mini Mill segment provides hot-rolled, cold-rolled, and coated sheets and electrical products. This segment serves customers in the automotive, appliance, construction, container, transportation, and service center markets. The USSE segment provides slabs, strip mill plates, sheets, tin mill products, and spiral welded pipes. This segment serves customers in the construction, container, appliance and electrical, service center, conversion, oil, gas, and petrochemical markets. The Tubular segment offers seamless and electric resistance welded steel casing and tubing products, as well as standard and line pipe and mechanical tubing products primarily to customers in the oil, gas, and petrochemical markets. The company also engages in the real estate business. United States Steel Corporation was founded in 1901 and is headquartered in Pittsburgh, Pennsylvania.",
    "ceo": "Mr. David Boyd Burritt",
    "sector": "Basic Materials",
    "country": "US",
    "fullTimeEmployees": "22740",
    "phone": "412 433 1121",
    "address": "600 Grant Street",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15219-2800",
    "dcfDiff": 8.45019,
    "dcf": 37.2802,
    "image": "https://financialmodelingprep.com/image-stock/X.png",
    "ipoDate": "1991-04-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]