[
  {
    "symbol": "XEL",
    "price": 61.24,
    "beta": 0.444366,
    "volAvg": 3123056,
    "mktCap": 33703799480,
    "lastDiv": 2.08,
    "range": "56.89-77.66",
    "changes": -1.2,
    "companyName": "Xcel Energy Inc.",
    "currency": "USD",
    "cik": "0000072903",
    "isin": "US98389B1008",
    "cusip": "98389B100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.xcelenergy.com",
    "description": "Xcel Energy Inc., through its subsidiaries, generates, purchases, transmits, distributes, and sells electricity. It operates through Regulated Electric Utility, Regulated Natural Gas Utility, and All Other segments. The company generates electricity through coal, nuclear, natural gas, hydroelectric, solar, biomass, oil, wood/refuse, and wind energy sources. It also purchases, transports, distributes, and sells natural gas to retail customers, as well as transports customer-owned natural gas. In addition, the company develops and leases natural gas pipelines, and storage and compression facilities; and invests in rental housing projects, as well as procures equipment for the construction of renewable generation facilities. It serves residential, commercial, and industrial customers in the portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas, and Wisconsin. The company sells electricity to approximately 3.7 million customers; and natural gas to approximately 2.1 million customers. Xcel Energy Inc. was incorporated in 1909 and is headquartered in Minneapolis, Minnesota.",
    "ceo": "Mr. Robert C. Frenzel",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "11982",
    "phone": "612 330 5500",
    "address": "414 Nicollet Mall",
    "city": "Minneapolis",
    "state": "MN",
    "zip": "55401",
    "dcfDiff": 0.564392,
    "dcf": 68.9944,
    "image": "https://financialmodelingprep.com/image-stock/XEL.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]