[
  {
    "symbol": "XENE",
    "price": 40.47,
    "beta": 1.424295,
    "volAvg": 380977,
    "mktCap": 2572366281,
    "lastDiv": 0,
    "range": "28.98-43.75",
    "changes": 0.36,
    "companyName": "Xenon Pharmaceuticals Inc.",
    "currency": "USD",
    "cik": "0001582313",
    "isin": "CA98420N1050",
    "cusip": "98420N105",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.xenon-pharma.com",
    "description": "Xenon Pharmaceuticals Inc., a clinical-stage biopharmaceutical company, engages in developing therapeutics to treat patients with neurological disorders in Canada. Its clinical development pipeline includes XEN496, A Kv7 potassium channel opener that is Phase III clinical trials for the treatment of KCNQ2 developmental and epilepsy encephalopathy; and XEN1101, A Kv7 potassium channel opener, which is in Phase II clinical trial for the treatment of epilepsy and other neurological disorders. The company's product candidates also comprise NBI-921352, a selective Nav1.6 sodium channel inhibitor that is in Phase II clinical trials for the treatment of SCN8A developmental and epileptic encephalopathy, and other potential indications, including adult focal epilepsy; and XEN007, A central nervous system-acting calcium channel modulator, which is in Phase II clinical trials. It has a license and collaboration agreement with the Neurocrine Biosciences, Inc. to develop treatments for epilepsy; and with Flexion Therapeutics, Inc. to develop PCRX301 (XEN402, a Nav1.7 inhibitor) for the treatment of post-operative pain. Xenon Pharmaceuticals Inc. was incorporated in 1996 and is headquartered in Burnaby, Canada.",
    "ceo": "Mr. Ian C. Mortimer C.M.A., CPA, CMA, CPA, M.B.A., MBA",
    "sector": "Healthcare",
    "country": "CA",
    "fullTimeEmployees": "203",
    "phone": "16044843300",
    "address": "3650 Gilmore Way",
    "city": "Burnaby",
    "state": "BC",
    "zip": "V5G 4W8",
    "dcfDiff": 0.377004,
    "dcf": 38.027,
    "image": "https://financialmodelingprep.com/image-stock/XENE.png",
    "ipoDate": "2014-11-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]