[
  {
    "symbol": "XNGSY",
    "price": 52.34,
    "beta": 0.794252,
    "volAvg": 16711,
    "mktCap": 14797616721,
    "lastDiv": 1.49,
    "range": "38.38-68.76",
    "changes": 0.74,
    "companyName": "ENN Energy Holdings Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US26876F1021",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Utilities—Regulated Gas",
    "website": "https://www.ennenergy.com",
    "description": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through five segments: Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing and sell of LNG, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2021, the company served approximately 25 million residential customers and 200,000 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
    "ceo": "Ms. Xiaojing  Wu",
    "sector": "Utilities",
    "country": "CN",
    "fullTimeEmployees": "35598",
    "phone": "86 31 6259 9518",
    "address": "Building A",
    "city": "Langfang",
    "state": null,
    "zip": "065001",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/XNGSY.png",
    "ipoDate": "2014-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]