[
  {
    "symbol": "XP",
    "price": 22.62,
    "beta": 1.52877,
    "volAvg": 6700198,
    "mktCap": 12251309449,
    "lastDiv": 0,
    "range": "10.3-25.3",
    "changes": 0.17,
    "companyName": "XP Inc.",
    "currency": "USD",
    "cik": "0001787425",
    "isin": "KYG982391099",
    "cusip": "G98239109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Capital Markets",
    "website": "https://www.xpinc.com",
    "description": "XP Inc. provides financial products and services in Brazil. It offers securities brokerage, private pension plans, commercial, and investment banking products, such as loan operations and transactions in the foreign exchange markets and deposits; product structuring and capital markets services for corporate clients and issuers of fixed income products; advisory services for mass-affluent and institutional clients; and wealth management services for high-net-worth customers and institutional clients. The company also offers Xpeed, an online financial education portal that offers seminars, classes, and learning tools to help teach individuals on topics, such as basics of investing, techniques, and investment strategies, as well as insurance brokerage services. In addition, it operates XP Platform, an open product platform that provides clients to access investment products in the market, including equity and fixed income securities, mutual and hedge funds, private equity, structured products, credit cards, loan operations, life insurance, pension plans, real-estate investment funds, and others. The company was founded in 2001 and is based in São Paulo, Brazil.",
    "ceo": "Mr. Guilherme Dias Fernandes Benchimol",
    "sector": "Financial Services",
    "country": "BR",
    "fullTimeEmployees": "6146",
    "phone": "55 11 3075 0429",
    "address": "Av. Chedid Jafet, 75",
    "city": "São Paulo",
    "state": "SP",
    "zip": "04551-065",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/XP.png",
    "ipoDate": "2019-12-11",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]