[
  {
    "symbol": "XPEL",
    "price": 83,
    "beta": 1.627112,
    "volAvg": 126148,
    "mktCap": 2292302300,
    "lastDiv": 0,
    "range": "43.89-87.01",
    "changes": 0.63,
    "companyName": "XPEL, Inc.",
    "currency": "USD",
    "cik": "0001767258",
    "isin": "US98379L1008",
    "cusip": "98379L100",
    "exchange": "NASDAQ Capital Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Auto Parts",
    "website": "https://www.xpel.com",
    "description": "XPEL, Inc. manufactures, sells, distributes, and installs after-market automotive products. The company offers automotive surface and paint protection films, headlight protection, and automotive and architectural window films, as well as proprietary software. It also provides merchandise and apparel; ceramic coatings; and tools and accessories, which includes squeegees and microfiber towels, application fluids, plotter cutters, knives, and other products. In addition, the company offers paint protection kits, car wash products, after-care products, and installation tools through its website. It sells its products to independent installers and new car dealerships, third-party distributors, and company-owned installation centers, as well as through franchisees and online sales channels. The company serves in the United States, China, Canada, Continental Europe, the United Kingdom, Asia Pacific, Latin America, the Middle East/Africa, and internationally. XPEL, Inc. was founded in 1997 and is headquartered in San Antonio, Texas.",
    "ceo": "Mr. Ryan L. Pape",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "818",
    "phone": "210 678 3700",
    "address": "618 West Sunset Road",
    "city": "San Antonio",
    "state": "TX",
    "zip": "78216",
    "dcfDiff": 10.4607,
    "dcf": 64.6993,
    "image": "https://financialmodelingprep.com/image-stock/XPEL.png",
    "ipoDate": "2019-07-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]