[
  {
    "symbol": "XPO",
    "price": 58.63,
    "beta": 2.003521,
    "volAvg": 2088716,
    "mktCap": 6792695910,
    "lastDiv": 0,
    "range": "24.759357-59.04",
    "changes": 2.14,
    "companyName": "XPO Logistics, Inc.",
    "currency": "USD",
    "cik": "0001166003",
    "isin": "US9837931008",
    "cusip": "983793100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Integrated Freight & Logistics",
    "website": "https://www.xpo.com",
    "description": "XPO Logistics, Inc. provides freight transportation services in the United States, rest of North America, France, the United Kingdom, rest of Europe, and internationally. The company operates in two segments, North American LTL and Brokerage and Other Services. The North American LTL segment provides customers with less-than-truckload (LTL) services, such as geographic density and day-definite regional, inter-regional, and transcontinental LTL freight services. This segment also offers cross-border U.S. service to and from Mexico and Canada, as well as intra-Canada service. The Brokerage and Other Services segment offers last mile logistics for heavy goods sold through e-commerce, omnichannel retail, and direct-to-consumer channels, as well as other non-core brokered freight transportation modes. It provides its services to customers in various industries, such as industrial and manufacturing, retail and e-commerce, food and beverage, logistics and transportation, and consumer goods. The company was incorporated in 2000 and is based in Greenwich, Connecticut.",
    "ceo": "Mr. Mario A. Harik",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "38000",
    "phone": "855 976 6951",
    "address": "Five American Lane",
    "city": "Greenwich",
    "state": "CT",
    "zip": "06831",
    "dcfDiff": 0.819019,
    "dcf": 40.209,
    "image": "https://financialmodelingprep.com/image-stock/XPO.png",
    "ipoDate": "2003-10-07",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]