[
  {
    "symbol": "XRAY",
    "price": 39.58,
    "beta": 0.93345,
    "volAvg": 1827991,
    "mktCap": 8409879240,
    "lastDiv": 0.56,
    "range": "26.48-43.24",
    "changes": -0.33,
    "companyName": "DENTSPLY SIRONA Inc.",
    "currency": "USD",
    "cik": "0000818479",
    "isin": "US24906P1093",
    "cusip": "24906P109",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Medical Instruments & Supplies",
    "website": "https://www.dentsplysirona.com",
    "description": "DENTSPLY SIRONA Inc. manufactures and sells various dental products and technologies for professional dental market worldwide. The company operates through two segments, Technologies & Equipment, and Consumables. The Technologies & Equipment segment provides dental equipment, such as treatment centers, imaging equipment, motorized dental handpieces, and other instruments for dental practitioners and specialists; dental CAD/CAM technologies for dental offices to support various digital dental procedures, including dental restorations; dentist-directed clear aligner solutions, SureSmile, and direct-to-consumer clear aligner solutions, as well as high frequency vibration technology device; implants; and urology catheters and other healthcare-related consumable products. The Consumables segment offers endodontic products comprising drills, filers, sealers, irrigation needles, and other tools or single-use solutions, which support root canal procedures; restorative products that include artificial teeth, dental ceramics, digital dentures, precious metal dental alloys, and crown and bridge porcelain products. It also provides small equipment products, which comprise intraoral curing light systems, dental diagnostic systems, and ultrasonic scalers and polishers, as well as dental anesthetics, prophylaxis paste, dental sealants, impression materials, teeth whiteners, and topical fluoride. The company was founded in 1877 and is headquartered in Charlotte, North Carolina.",
    "ceo": "Mr. Simon D. Campion",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "15000",
    "phone": "844-848-0137",
    "address": "13320 Ballantyne Corporate Place",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28277-3607",
    "dcfDiff": 4.85347,
    "dcf": 32.1465,
    "image": "https://financialmodelingprep.com/image-stock/XRAY.png",
    "ipoDate": "1987-08-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]