[
  {
    "symbol": "XRX",
    "price": 14.27,
    "beta": 1.713732,
    "volAvg": 1735543,
    "mktCap": 2239790660,
    "lastDiv": 1,
    "range": "11.8-19.4",
    "changes": -0.19,
    "companyName": "Xerox Holdings Corporation",
    "currency": "USD",
    "cik": "0001770450",
    "isin": "US98421M1062",
    "cusip": "98421M106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Information Technology Services",
    "website": "https://www.xerox.com",
    "description": "Xerox Holdings Corporation, a workplace technology company, designs, develops, and sells document management systems and solutions in the United States, Europe, Canada, and internationally. It offers workplace solutions, including desktop monochrome, and color and multifunction printers; digital printing presses and light production devices, and solutions; and digital services that leverage workflow automation, personalization and communication software, content management solutions, and digitization services. The company also provides graphic communications and production solutions; and IT services, end user computing devices, network infrastructure, communications technology, and a range of managed IT solutions, such as technology product support, professional engineering, and commercial robotic process automation. In addition, it provides FreeFlow a portfolio of software solutions for the automation and integration to the processing of print job comprises file preparation, final production, and electronic publishing; XMPie, a personalization and communication software that support the needs of omni-channel communications customers; DocuShare, a content management platform to capture, store, and share paper and digital content; and CareAR, an enterprise augmented reality business. Further, the company sells paper products and wide-format systems. The company sells its products and services directly to its customers through its direct sales force, as well as through independent agents, dealers, value-added resellers, systems integrators, and e-commerce marketplaces. Xerox Holdings Corporation was founded in 1906 and is headquartered in Norwalk, Connecticut.",
    "ceo": "Mr. Steven John Bandrowczak",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "20300",
    "phone": "203 849 5216",
    "address": "201 Merritt 7",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06851-1056",
    "dcfDiff": 7.21454,
    "dcf": 24.0345,
    "image": "https://financialmodelingprep.com/image-stock/XRX.png",
    "ipoDate": "1962-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]