[
  {
    "symbol": "XYL",
    "price": 110.54,
    "beta": 1.081338,
    "volAvg": 2265104,
    "mktCap": 26462833840,
    "lastDiv": 1.32,
    "range": "73.8-118.58",
    "changes": -1.07,
    "companyName": "Xylem Inc.",
    "currency": "USD",
    "cik": "0001524472",
    "isin": "US98419M1009",
    "cusip": "98419M100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.xylem.com",
    "description": "Xylem Inc., together with its subsidiaries, engages in the design, manufacture, and servicing of engineered products and solutions for the water and wastewater applications in the United States, Europe, the Asia Pacific, and internationally. It operates through three segments: Water Infrastructure, Applied Water, and Measurement & Control Solutions. The Water Infrastructure segment offers various products, including water, storm water, and wastewater pumps; controls and systems; filtration, disinfection, and biological treatment equipment; and mobile dewatering equipment under the Flygt, Godwin, Wedeco, Sanitaire, Leopold, Wedeco, and Xylem Vue brand names for the transportation and treatment of water. The Applied Water segment provides pumps, valves, heat exchangers, controls, and dispensing equipment systems under the Goulds Water Technology, Bell & Gossett, A-C Fire Pump, Standard Xchange, Lowara, Jabsco, Xylem Vue and Flojet brand names for residential and commercial building services, and industrial water applications. The Measurement & Control Solutions segment provides smart meters, networked communication devices, and measurement and control technologies, as well as critical infrastructure technologies. It also offers software and services, including cloud-based analytics, remote monitoring and data management, leak detection, condition assessment, asset management, and pressure monitoring solutions, as well as testing equipment and managed services. This segment sells its products under the Pure, Sensus, Smith Blair, WTW, Xylem Vue, and YSI brand names. The company markets and sells its products through a network of direct sales force, resellers, distributors, and value-added solution providers. Xylem Inc. was formerly known as ITT WCO, Inc. and changed its name to Xylem Inc. in May 2011. The company. was incorporated in 2011 and is headquartered in Rye Brook, New York.",
    "ceo": "Mr. Patrick K. Decker",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "17800",
    "phone": "914 323 5700",
    "address": "1 International Drive",
    "city": "Rye Brook",
    "state": "NY",
    "zip": "10573",
    "dcfDiff": 17.0189,
    "dcf": 119.439,
    "image": "https://financialmodelingprep.com/image-stock/XYL.png",
    "ipoDate": "2011-10-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]