[
  {
    "symbol": "YARIY",
    "price": 17.19,
    "beta": 0.427203,
    "volAvg": 37930,
    "mktCap": 8757462828,
    "lastDiv": 2.59,
    "range": "17.0-23.95",
    "changes": 0.11,
    "companyName": "Yara International ASA",
    "currency": "USD",
    "cik": null,
    "isin": "US9848512045",
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Agricultural Inputs",
    "website": "https://www.yara.com",
    "description": "Yara International ASA provides environmental and industrial solutions in Norway, European Union, Europe, Africa, Asia, North and Latin America, Australia, and New Zealand. The company offers nitrogen-based fertilizers, including urea, urea ammonium nitrate, calcium ammonium nitrate, ammonium nitrate, and ammonium sulfate; compound fertilizers that contain plant nutrients, such as nitrogen, phosphorus, and potassium; and blended products, as well as foliar and fertigation solutions through micronutrients. It also offers farmer centric solutions; solutions for farming, such as crop monitoring, variable rate fertilization, N-Tester BT, and Driving Mode, a mobile app; N-Sensor, a tractor-mounted tool that allows growers to measure a crop's nitrogen requirement; CheckIT, a smartphone app using a library of crop photographs to give a simple and fast identification of nutrient deficiencies; TankmixIT, an app used to check for the physical compatibility when tank mixing; and Tankmix.com, an online service providing advice on the physical mixing characteristics of Yara's foliar products with agrochemicals. The company sells its products under YaraBela, YaraLiva, YaraMila, YaraRega, YaraTera, YaraVera, and YaraVita brands name. Yara International ASA was founded in 1905 and is headquartered in Oslo, Norway.",
    "ceo": "Mr. Svein Tore  Holsether",
    "sector": "Basic Materials",
    "country": "NO",
    "fullTimeEmployees": "17500",
    "phone": "47 24 15 70 00",
    "address": "Drammensveien 131",
    "city": "Oslo",
    "state": null,
    "zip": "0277",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/YARIY.png",
    "ipoDate": "2006-03-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]