[
  {
    "symbol": "YELP",
    "price": 35.85,
    "beta": 1.45176,
    "volAvg": 678898,
    "mktCap": 2467849470,
    "lastDiv": 0,
    "range": "25.3-39.27",
    "changes": 0.42,
    "companyName": "Yelp Inc.",
    "currency": "USD",
    "cik": "0001345016",
    "isin": "US9858171054",
    "cusip": "985817105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Internet Content & Information",
    "website": "https://www.yelp.com",
    "description": "Yelp Inc. operates a platform that connects consumers with local businesses in the United States and internationally. The company's platform covers various local business categories, including restaurants, shopping, beauty and fitness, health, and other categories, as well as home, local, auto, professional, pets, events, real estate, and financial services. It provides free and paid advertising products to businesses, which include cost-per-click search advertising and multi-location Ad products, as well as enables businesses to deliver targeted search advertising to local audiences; and business listing page products. The company also offers other services comprising Yelp Reservations that provide online reservations for restaurants, nightlife, and other venues directly from their Yelp business pages; Yelp Waitlist, a subscription-based waitlist management solution that allows consumers to check wait times and join waitlists remotely, as well as businesses to manage seating and server rotation; Yelp Knowledge program that offers business owners local analytics and insights through access to its historical data and other proprietary content; and Yelp Fusion, which offers free and paid access to content and data for consumer-facing enterprise use through publicly available APIs. In addition, it provides content licensing, as well as allows third-party data providers to update and manage business listing information on behalf of businesses. Further, the company offers its products directly through its sales force; indirectly through partners; and online through its website, as well as non-advertising partner arrangements. It has strategic partnership with Grubhub for providing consumers with a service to place food orders for pickup and delivery. Yelp Inc. was incorporated in 2004 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Jeremy  Stoppelman",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "4900",
    "phone": "415 908 3801",
    "address": "10th Floor",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94105",
    "dcfDiff": 4.92192,
    "dcf": 36.0919,
    "image": "https://financialmodelingprep.com/image-stock/YELP.png",
    "ipoDate": "2012-03-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]