[
  {
    "symbol": "YNDX",
    "price": 18.94,
    "beta": 1.037323,
    "volAvg": 0,
    "mktCap": 6797281786,
    "lastDiv": 0,
    "range": "17.83-24.05",
    "changes": 0,
    "companyName": "Yandex N.V.",
    "currency": "USD",
    "cik": "0001513845",
    "isin": "NL0009805522",
    "cusip": "N97284108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Content & Information",
    "website": "https://yandex.com",
    "description": "Yandex N.V., a technology company, builds intelligent products and services powered by machine learning and other technologies to help consumers and businesses navigate the online and offline world. The company operates through Search and Portal, Taxi, Yandex.Market, Media Services, Classifieds, and Other Business Units and Initiatives segments. It provides locally relevant search and information services. The company also develops on-demand transportation, delivery, and navigation services and products, as well as operates in the e-commerce, online entertainment, and cloud computing markets to address the needs of customers in Russia and various international markets. In addition, it operates Yandex.Plus, a subscription loyalty program; offers fintech instruments, such as payment and financial services; and advertising services. Further, the company operates classifieds platforms for the sale of used and new cars, motorcycles, commercial vehicles, and spare parts; and sale and rental of apartments, houses, and commercial property for private individuals, developers, and realtors, as well as a long-term apartment rental platform to manage pre-contract rental processes and subsequent administration of the payments. Additionally, it operates Yandex Zen, a social infotainment platform that brings together content creators and users; and Yandex Cloud, a cloud platform that provides infrastructure, storage, machine learning, and development tools to build and enhance cutting-edge digital services and applications for B2B customers and individual developers. The company was founded in 1989 and is based in Schiphol, the Netherlands.",
    "ceo": "Ms. Elena  Kolmanovskaya",
    "sector": "Communication Services",
    "country": "RU",
    "fullTimeEmployees": "22721",
    "phone": "7 495 739 3777",
    "address": "16, Leo Tolstoy St.",
    "city": "Moscow",
    "state": null,
    "zip": "119021",
    "dcfDiff": 224.332,
    "dcf": 243.272,
    "image": "https://financialmodelingprep.com/image-stock/YNDX.png",
    "ipoDate": "2011-05-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]