[
  {
    "symbol": "YOU",
    "price": 23.15,
    "beta": 0,
    "volAvg": 1233611,
    "mktCap": 3551441662,
    "lastDiv": 0.45,
    "range": "18.94-35.0",
    "changes": 0.19,
    "companyName": "Clear Secure, Inc.",
    "currency": "USD",
    "cik": "0001856314",
    "isin": "US18467V1098",
    "cusip": "18467V109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.clearme.com",
    "description": "Clear Secure, Inc. provides a member-centric secure identity platform in the United States. The company's secure identity platform is a multi-layered infrastructure consisting of front-end, including enrollment, verification, and linking. It also offers CLEAR Plus, a consumer aviation subscription service, which enables access to predictable entry lanes in airport security checkpoints, as well as access to broader network; and CLEAR app, a consumer-facing digital product that facilitates new user enrollment and member engagement from their mobile device. In addition, the company provides Reserve powered by CLEAR, a virtual queuing technology that provides users with the choice of how they queue either at home or on the move; and Atlas Certified, an automated solution to verify professional licenses and certification data across industries by communicating with certifying organizations for on-demand, current, and trusted data. The company was founded in 2010 and is headquartered in New York, New York.",
    "ceo": "Ms. Caryn Gail Seidman-Becker",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "3056",
    "phone": "646 723 1404",
    "address": "65 East 55th Street",
    "city": "New York",
    "state": "NY",
    "zip": "10022",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/YOU.png",
    "ipoDate": "2021-06-30",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]