[
  {
    "symbol": "YPF",
    "price": 14.77,
    "beta": 1.725,
    "volAvg": 1967762,
    "mktCap": 11763316045,
    "lastDiv": 43.19800000000003,
    "range": "2.82-15.98",
    "changes": -0.22,
    "companyName": "YPF Sociedad Anónima",
    "currency": "USD",
    "cik": "0000904851",
    "isin": "US9842451000",
    "cusip": "984245100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.ypf.com",
    "description": "YPF Sociedad Anónima, an energy company, engages in the oil and gas upstream and downstream activities in Argentina. The company's upstream operations include the exploration, development, and production of crude oil, natural gas, and NGLs. Its downstream operations include the refining, marketing, transportation, and distribution of oil, petroleum products, petroleum derivatives, petrochemicals, LPG, and bio-fuels, as well as in gas separation, natural gas distribution operations, and power generation. As of December 31, 2021, it had interests in 119 oil and gas fields; approximately 643 million barrels (mmbbl) of oil; and approximately 2,447 billion cubic feet (bcf) of gas. It also had a retail distribution network of 1,654 YPF-branded service stations; and 18 exploration permits. In addition, the company owns and operates three refineries with combined annual refining capacity of approximately 120 mmbbl; approximately 2,800 kilometers of crude oil pipelines with approximately 640,000 barrels of aggregate daily transportation capacity of refined products; and crude oil tankage of approximately 7 mmbbl, as well as maintains terminal facilities at five Argentine ports. Further, it participates in 21 power generation plants with an aggregate installed capacity of 3,091 megawatts; offers diesel, fertilizers, lubricants, phytosanitary products, and ensiling bags; and supplies diesel, gasoline, fuel oil, coal, asphalts, paraffin, and sulfur, CO2, decanted oil, and aromatic extract. The company was founded in 1977 and is headquartered in Buenos Aires, Argentina.",
    "ceo": "Mr. Pablo Anibal Iuliano",
    "sector": "Energy",
    "country": "AR",
    "fullTimeEmployees": "20317",
    "phone": "54 11 5441 2000",
    "address": "Macacha GUeemes 515",
    "city": "Buenos Aires",
    "state": null,
    "zip": "C1106BKK",
    "dcfDiff": 155.5,
    "dcf": 167.04,
    "image": "https://financialmodelingprep.com/image-stock/YPF.png",
    "ipoDate": "1993-06-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]