[
  {
    "symbol": "YZCAY",
    "price": 28.14,
    "beta": 0.653256,
    "volAvg": 5132,
    "mktCap": 18200670713,
    "lastDiv": 4.34,
    "range": "25.213-44.98",
    "changes": 0.6,
    "companyName": "Yankuang Energy Group Company Limited",
    "currency": "USD",
    "cik": null,
    "isin": "US9848461052",
    "cusip": "984846105",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Thermal Coal",
    "website": "https://www.yanzhoucoal.com.cn",
    "description": "Yankuang Energy Group Company Limited engages in the mining, preparation, and sale of coal worldwide. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, as well as electricity and related heat supply services; explores for potash mineral; manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment; and sells construction materials and petroleum products. The company also provides railway, river, and lakes transportation; underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services, as well as operates as a trade broker and agent. In addition, it engages in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; production and processing of steel engineering components; processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was formerly known as Yanzhou Coal Mining Company Limited and changed its name to Yankuang Energy Group Company Limited in December 2021. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China.",
    "ceo": "Mr. Yaomeng  Xiao",
    "sector": "Energy",
    "country": "CN",
    "fullTimeEmployees": "64279",
    "phone": "86 53 7538 2319",
    "address": "949 Fushan South Road",
    "city": "Zoucheng",
    "state": null,
    "zip": "273500",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/YZCAY.png",
    "ipoDate": "1998-03-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]