[
  {
    "symbol": "ZBH",
    "price": 144,
    "beta": 1.010915,
    "volAvg": 1433875,
    "mktCap": 30065472000,
    "lastDiv": 0.96,
    "range": "100.39-149.25",
    "changes": -0.81,
    "companyName": "Zimmer Biomet Holdings, Inc.",
    "currency": "USD",
    "cik": "0001136869",
    "isin": "US98956P1021",
    "cusip": "98956P102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.zimmerbiomet.com",
    "description": "Zimmer Biomet Holdings, Inc., together with its subsidiaries, operates in the musculoskeletal healthcare business in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company designs, manufactures, and markets orthopaedic reconstructive products, such as knee and hip products; S.E.T. products, including sports medicine, biologics, foot and ankle, extremities, and trauma products; spine products comprising medical devices and surgical instruments; and face and skull reconstruction products, as well as products that fixate and stabilize the bones of the chest toss facilitate healing or reconstruction after open heart surgery, trauma, or for deformities of the chest. It also offers dental products that include dental reconstructive implants, and dental prosthetic and regenerative products, as well as robotic, surgical and bone cement products. The company's products and solutions are used to treat patients suffering from disorders of, or injuries to, bones, joints, or supporting soft tissues. It serves orthopedic surgeons, neurosurgeons, oral surgeons, dentists, hospitals, stocking distributors, healthcare dealers, and other specialists, as well as agents, healthcare purchasing organizations, or buying groups. The company was formerly known as Zimmer Holdings, Inc. and changed its name to Zimmer Biomet Holdings, Inc. in June 2015. Zimmer Biomet Holdings, Inc. was founded in 1927 and is headquartered in Warsaw, Indiana.",
    "ceo": "Mr. Bryan C. Hanson",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "18000",
    "phone": "574 267 6131",
    "address": "345 East Main Street",
    "city": "Warsaw",
    "state": "IN",
    "zip": "46580",
    "dcfDiff": 9.03841,
    "dcf": 116.842,
    "image": "https://financialmodelingprep.com/image-stock/ZBH.png",
    "ipoDate": "2001-07-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]