[
  {
    "symbol": "ZBRA",
    "price": 283.49,
    "beta": 1.662323,
    "volAvg": 340500,
    "mktCap": 14579975747,
    "lastDiv": 0,
    "range": "224.87-365.97",
    "changes": 0.68,
    "companyName": "Zebra Technologies Corporation",
    "currency": "USD",
    "cik": "0000877212",
    "isin": "US9892071054",
    "cusip": "989207105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Communication Equipment",
    "website": "https://www.zebra.com",
    "description": "Zebra Technologies Corporation, together with its subsidiaries, provides enterprise asset intelligence solutions in the automatic identification and data capture solutions industry worldwide. It operates in two segments, Asset Intelligence & Tracking and Enterprise Visibility & Mobility. The company designs, manufactures, and sells printers, which produce labels, wristbands, tickets, receipts, and plastic cards; dye-sublimination thermal card printers, which produce images which are used for personal identification, access control, and financial transactions; RFID printers that encode data into passive RFID transponders; accessories and options for our printers, including vehicle mounts and battery chargers; stock and customized thermal labels, receipts, ribbons, plastic cards, and RFID tags for printers; and temperature-monitoring labels primarily used in vaccine distribution. It also provides various maintenance, technical support, repair, and managed and professional services; real-time location systems and services; and tags, sensors, exciters, middleware software, and application software; as well as physical inventory management solutions, and rugged tablets and enterprise-grade mobile computing products and accessories. In addition, the company offers barcode scanners, image capture devices, and RFID readers; and workforce management solutions, workflow execution and task management solutions, and prescriptive analytics solutions, as well as communications and collaboration solutions. It also provides services, including maintenance, technical support, repair, managed and professional services; as well as cloud-based software subscriptions and robotics automation solutions. The company serves retail and e-commerce, manufacturing, transportation and logistics, healthcare, public sector, and other industries through direct sales force, and network of channel partners. The company was founded in 1969 and is headquartered in Lincolnshire, Illinois.",
    "ceo": "Mr. William J. Burns",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "10500",
    "phone": "847 634 6700",
    "address": "3 Overlook Point",
    "city": "Lincolnshire",
    "state": "IL",
    "zip": "60069",
    "dcfDiff": 53.9419,
    "dcf": 263.158,
    "image": "https://financialmodelingprep.com/image-stock/ZBRA.png",
    "ipoDate": "1991-08-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]