[
  {
    "symbol": "ZLAB",
    "price": 26.48,
    "beta": 1.140845,
    "volAvg": 620290,
    "mktCap": 2605332882,
    "lastDiv": 0,
    "range": "20.975-53.95",
    "changes": -0.2,
    "companyName": "Zai Lab Limited",
    "currency": "USD",
    "cik": "0001704292",
    "isin": "US98887Q1040",
    "cusip": "98887Q104",
    "exchange": "NASDAQ Global Market",
    "exchangeShortName": "NASDAQ",
    "industry": "Biotechnology",
    "website": "https://www.zailaboratory.com",
    "description": "Zai Lab Limited develops and commercializes therapies to treat oncology, autoimmune disorders, infectious diseases, and neuroscience primarily in Mainland China and Hong Kong. The company's commercial products include Zejula, a once-daily small-molecule poly polymerase 1/2 inhibitor; Optune, a device that delivers tumor treating fields; NUZYRA for acute bacterial skin and skin structure infections, and community acquired bacterial pneumonia; and Qinlock to treat gastrointestinal stromal tumors. It also develops Odronextamab to treat follicular lymphoma, diffuse large B-cell lymphoma, and other B-celllymphomas; Repotrectinib, a tyrosine kinase inhibitor (TKI) to target ROS1 and TRK A/B/C in TKI-naïve- or -pretreated cancer patients; Margetuximab for the treatment of breast and gastroesophageal cancers; Adagrasib for treating KRAS-G12C-mutated NSCLC, colorectal cancer, pancreatic cancer, and other solid tumors; and Bemarituzumab to treat gastric and gastroesophageal junction cancer. In addition, the company develops CLN-081 for the treatment of patients with EGFR exon 20 insertion NSCLC; Elzovantinib, an orally bioavailable multi-targeted kinase inhibitor; Tebotelimab, a tetravalent IgG4 monoclonal antibody; Retifanlimab that inhibits interactions between PD-1 and its ligands; ZL-2309, an orally active, selective, and ATP-competitive cell division cycle 7 (CDC7) kinase inhibitor; ZL-1201, a humanized IgG4 monoclonal antibody; Efgartigimod to reduce disease-causing immunoglobulin G antibodies; ZL-1102, a human nanobody targeting interleukin- 17A; KarXT for the treatment of psychiatric and neurological conditions; ZL-2313, an investigational inhibitor of triple-mutant EGFR harboring; ZL-2314, an investigational inhibitor of double-mutant EGFR harboring; and Sulbactam/durlobactam for the treatment of serious infections caused by Acinetobacter. Zai Lab Limited was incorporated in 2013 and is headquartered in Shanghai, China.",
    "ceo": "Dr. Ying  Du Ph.D.",
    "sector": "Healthcare",
    "country": "CN",
    "fullTimeEmployees": "2036",
    "phone": "86 21 6163 2588",
    "address": "Jinchuang Plaza",
    "city": "Shanghai",
    "state": null,
    "zip": "201210",
    "dcfDiff": 2.41313,
    "dcf": 47.2931,
    "image": "https://financialmodelingprep.com/image-stock/ZLAB.png",
    "ipoDate": "2017-09-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": true,
    "isFund": false
  }
]