[
  {
    "symbol": "ZLDPF",
    "price": 34.755,
    "beta": 0.870881,
    "volAvg": 230,
    "mktCap": 2028837027,
    "lastDiv": 0,
    "range": "11.83-41.75",
    "changes": -3.545,
    "companyName": "Zealand Pharma A/S",
    "currency": "USD",
    "cik": null,
    "isin": null,
    "cusip": null,
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Biotechnology",
    "website": "https://www.zealandpharma.com",
    "description": "Zealand Pharma A/S, a biotechnology company, engages in the discovery, development, and commercialization of peptide-based medicines in Denmark. It has a portfolio of medicines focusing on gastrointestinal and metabolic diseases, and other specialty disease areas with unmet medical needs. The company markets lixisenatide under the brand names of Adlyxin and Lyxumia; Dasiglucagon, a single use syringe or autoinjector for the treatment of severe hypoglycemia, congenital hyperinsulinism, and post bariatric surgery hypoglycemia; and Dasiglucagon dual-hormone artificial pancreas for automated diabetes management. The company's pipeline includes Dasiglucagon that is in Phase III clinical trials for congenital hyperinsulinism. The company is also developing glepaglutide, a long acting GLP-2 analog, which is in Phase III clinical trials for the treatment of short bowel syndrome. Zealand Pharma A/S has collaboration agreements with Sanofi-Aventis Deutschland GmbH; Boehringer Ingelheim International GmbH; Alexion Pharmaceuticals, Inc.; and Beta Bionics, Inc. The company was incorporated in 1998 and is headquartered in Copenhagen, Denmark.",
    "ceo": "Mr. Adam Sinding Steensberg M.D.",
    "sector": "Healthcare",
    "country": "DK",
    "fullTimeEmployees": "220",
    "phone": "45 88 77 36 00",
    "address": "Sydmarken 11",
    "city": "Copenhagen",
    "state": null,
    "zip": "2860",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ZLDPF.png",
    "ipoDate": "2013-02-25",
    "defaultImage": true,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]