[
  {
    "symbol": "ZM",
    "price": 68.69,
    "beta": -0.232698,
    "volAvg": 4313961,
    "mktCap": 20438365775,
    "lastDiv": 0,
    "range": "60.45-124.05",
    "changes": 0.64,
    "companyName": "Zoom Video Communications, Inc.",
    "currency": "USD",
    "cik": "0001585521",
    "isin": "US98980L1017",
    "cusip": "98980L101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Application",
    "website": "https://www.zoom.us",
    "description": "Zoom Video Communications, Inc. provides unified communications platform in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. The company offers Zoom Meetings that offers HD video, voice, chat, and content sharing through mobile devices, desktops, laptops, telephones, and conference room systems; Zoom Phone, an enterprise cloud phone system; and Zoom Chat enables users to share messages, images, audio files, and content in desktop, laptop, tablet, and mobile devices. It also provides Zoom Rooms, a software-based conference room system; Zoom Hardware-as-a-Service allows users to access video communication technology from third party equipment; Zoom Conference Room Connector, a gateway for SIP/H.323 endpoints to join Zoom meetings; Zoom Events, which enables users to manage and host internal and external virtual events; OnZoom, a prosumer-focused virtual event platform and marketplace for Zoom users to create, host, and monetize online events; and Zoom Webinars to provide video presentations to large audiences from many devices. In addition, the company offers Zoom Developer Platform that enables developers, platform integrators, service providers, and customers to build apps and integrations using Zoom's video-based communications solutions, as well as integrate Zoom's technology into their products and services; Zoom App Marketplace, which helps developers to publish their apps, as well as third-party integrations of Zoom; and Zoom Contact Center, an omnichannel contact center solution. It serves individuals; and education, entertainment/media, enterprise infrastructure, finance, government, healthcare, manufacturing, non-profit/not for profit and social impact, retail/consumer products, and software/Internet industries. The company was formerly known as Zoom Communications, Inc. and changed its name to Zoom Video Communications, Inc. in May 2012. The company was incorporated in 2011 and is headquartered in San Jose, California.",
    "ceo": "Mr. Eric S. Yuan",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "8484",
    "phone": "888 799 9666",
    "address": "55 Almaden Boulevard",
    "city": "San Jose",
    "state": "CA",
    "zip": "95113",
    "dcfDiff": 9.67498,
    "dcf": 83.825,
    "image": "https://financialmodelingprep.com/image-stock/ZM.png",
    "ipoDate": "2019-04-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]