[
  {
    "symbol": "ZS",
    "price": 144.11,
    "beta": 0.839084,
    "volAvg": 3044050,
    "mktCap": 21024353163,
    "lastDiv": 0,
    "range": "84.93-194.21",
    "changes": -0.55,
    "companyName": "Zscaler, Inc.",
    "currency": "USD",
    "cik": "0001713683",
    "isin": "US98980G1022",
    "cusip": "98980G102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.zscaler.com",
    "description": "Zscaler, Inc. operates as a cloud security company worldwide. The company provides Zscaler Internet Access solution that provides users, servers, operational technology, Internet of Things device secure access to externally managed applications, including software-as-a-service (SaaS) applications and Internet destinations; and Zscaler Private Access solution, which is designed to provide access to managed applications hosted internally in data centers, and private or public clouds. It also offers Zscaler Digital Experience that measures end-to-end user experience across business applications, as well as provides an easy to understand digital experience score for each user, application, and location within an enterprise. In addition, the company provides workload segmentation solutions comprising Zscaler Cloud Security Posture Management that identifies and remediates application misconfigurations in SaaS, infrastructure as a service, and platform as a service to reduce risk and ensure compliance with industry and organizational benchmarks; and Zscaler Cloud Workload Segmentation, which is designed to secure application-to-application communications inside public clouds and data centers to stop lateral threat movement, as well as prevents application compromise and reduces the risk of data breaches. Its platform modules include Zscaler Central Authority, Zscaler Enforcement Node, and Zscaler Log Servers. It serves customers in airlines and transportation, conglomerates, consumer goods and retail, financial services, healthcare, manufacturing, media and communications, public sector and education, technology, and telecommunications services industries. The company was formerly known as SafeChannel, Inc., and changed its name to Zscaler, Inc. in August 2008. Zscaler, Inc. was incorporated in 2007 and is headquartered in San Jose, California.",
    "ceo": "Mr. Jagtar Singh Chaudhry",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "4975",
    "phone": "408 533 0288",
    "address": "120 Holger Way",
    "city": "San Jose",
    "state": "CA",
    "zip": "95134",
    "dcfDiff": 10.4338,
    "dcf": 137.954,
    "image": "https://financialmodelingprep.com/image-stock/ZS.png",
    "ipoDate": "2018-03-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]