[
  {
    "symbol": "ZTS",
    "price": 169.1,
    "beta": 0.768661,
    "volAvg": 1939791,
    "mktCap": 78143139200,
    "lastDiv": 1.5,
    "range": "124.15-187.82",
    "changes": -1.57,
    "companyName": "Zoetis Inc.",
    "currency": "USD",
    "cik": "0001555280",
    "isin": "US98978V1035",
    "cusip": "98978V103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—Specialty & Generic",
    "website": "https://www.zoetis.com",
    "description": "Zoetis Inc. discovers, develops, manufactures, and commercializes animal health medicines, vaccines, and diagnostic products in the United States and internationally. It commercializes products primarily across species, including livestock, such as cattle, swine, poultry, fish, and sheep; and companion animals comprising dogs, cats, and horses. The company also offers vaccines, which are biological preparations to prevent diseases of the respiratory, gastrointestinal, and reproductive tracts or induce a specific immune response; anti-infectives that prevent, kill, or slow the growth of bacteria, fungi, or protozoa; and parasiticides that prevent or eliminate external and internal parasites, which include fleas, ticks, and worms. It also provides other pharmaceutical products that comprise pain and sedation, antiemetic, reproductive, and oncology products; dermatology products for itch associated with allergic conditions and atopic dermatitis; and medicated feed additives, which offer medicines to livestock. In addition, the company provides portable blood and urine analysis testing, including point-of-care diagnostic products, instruments and reagents, rapid immunoassay tests, reference laboratory kits and services, and blood glucose monitors; and other non-pharmaceutical products, including nutritionals and agribusiness services, as well as products and services in areas, such as biodevices, genetics tests, and precision animal health. It markets its products to veterinarians, livestock producers, and retail outlets, as well as third-party veterinary distributors through its sales representatives, and technical and veterinary operations specialists. The company was founded in 1952 and is headquartered in Parsippany, New Jersey.",
    "ceo": "Ms. Kristin C. Peck",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "13800",
    "phone": "973 822 7000",
    "address": "10 Sylvan Way",
    "city": "Parsippany",
    "state": "NJ",
    "zip": "07054",
    "dcfDiff": 10.5742,
    "dcf": 154.606,
    "image": "https://financialmodelingprep.com/image-stock/ZTS.png",
    "ipoDate": "2013-02-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]