[
  {
    "symbol": "ZURVY",
    "price": 47.12,
    "beta": 0.616475,
    "volAvg": 59711,
    "mktCap": 69517551862,
    "lastDiv": 2.68,
    "range": "38.33-50.96",
    "changes": -0.735,
    "companyName": "Zurich Insurance Group AG",
    "currency": "USD",
    "cik": null,
    "isin": "US9898251049",
    "cusip": "989825104",
    "exchange": "Other OTC",
    "exchangeShortName": "PNK",
    "industry": "Insurance—Diversified",
    "website": "https://www.zurich.com",
    "description": "Zurich Insurance Group AG, together with its subsidiaries, provides insurance products and related services in Europe, the Middle East, Africa, North America, Latin America, and the Asia Pacific. The company operates through Property & Casualty Regions, Life Regions, Farmers, Group Functions and Operations, and Non-Core Businesses segments. It offers car, home, travel, general liability, life and critical illness, worker injury, and other insurance products; and saving and investment, and pension and retirement planning products. The company also provides property, casualty, management or professional liability, trade credit, political risk, marine, cyber risk, and financial institution insurance products. In addition, it offers employee benefit insurance products; reinsurance services; and non-claims and ancillary services to the farmers' exchanges. It serves individuals, small businesses, and mid-sized and large companies, as well as multinational corporations. The company sells its products through agents, brokers, and bank distribution channels. Zurich Insurance Group AG was founded in 1872 and is based in Zurich, Switzerland.",
    "ceo": "Mr. Mario  Greco",
    "sector": "Financial Services",
    "country": "CH",
    "fullTimeEmployees": "60000",
    "phone": "41 44 625 25 25",
    "address": "Mythenquai 2",
    "city": "Zurich",
    "state": null,
    "zip": "8002",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ZURVY.png",
    "ipoDate": "2003-06-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]