[
  {
    "symbol": "ZWS",
    "price": 26.03,
    "beta": 1.063028,
    "volAvg": 1522843,
    "mktCap": 4542833898,
    "lastDiv": 0.28,
    "range": "19.29-32.86",
    "changes": -0.01,
    "companyName": "Zurn Elkay Water Solutions Corporation",
    "currency": "USD",
    "cik": "0001439288",
    "isin": "US98983L1089",
    "cusip": "98983L108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Pollution & Treatment Controls",
    "website": "https://zurnwatersolutions.com",
    "description": "Zurn Elkay Water Solutions Corporation designs, procures, manufactures, and markets water system solutions that provide and enhance water quality, safety, flow control, and conservation in and around non-residential buildings. It offers finish plumbing, drainage and interceptors, water control and backflow, fire protection, PEX pipe fittings and accessories, and repair parts under the Zurn brand name; and hand and hair dryers, and baby changing stations under the World Dryer brand name. The company also offers stainless steel products under the Just Manufacturing brand name, which include stainless steel sinks for classrooms and academic institutions; ADA commercial stainless-steel sinks and plumbing fixtures for assisted living; faucets, bubblers, drains, and accessories; and stainless steel fixtures and related products for food services, government, healthcare, hospitality, institutional, and residential markets. It serves higher education, healthcare, retail, restaurant, hospitality, education, government, and fire protection markets. The company was formerly known as Zurn Water Solutions Corporation. Zurn Elkay Water Solutions Corporation was incorporated in 2006 and is headquartered in Milwaukee, Wisconsin.",
    "ceo": "Mr. Todd A. Adams",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "2700",
    "phone": "855 480 5050",
    "address": "511 West Freshwater Way",
    "city": "Milwaukee",
    "state": "WI",
    "zip": "53204",
    "dcfDiff": null,
    "dcf": 0,
    "image": "https://financialmodelingprep.com/image-stock/ZWS.png",
    "ipoDate": "2012-03-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]